[
  {
    "user": "Nya Barton",
    "rating": 5.0,
    "message": "The straps are super easy to adjust the style isn’t set in stone which allows flexibility, offers great super, I’m really happy"
  },
  {
    "user": "Kristi Angle",
    "rating": 5.0,
    "message": "Love these shoes !!! I work in the medical field and have small feet so it's hard to find a pair of shoes that are comfortable all day and fit. Honestly I bought these because I thought they would be a cute summer tennis shoe but I thought they were so comfortable they are now my work shoes."
  },
  {
    "user": "Marcy1974",
    "rating": 5.0,
    "message": "Very Comfortable and Stylish! I use these sneakers for walking. The quality is very good. I highly recommend."
  },
  {
    "user": "CSLaw",
    "rating": 5.0,
    "message": "Thank you for this wonderful shoes!  :)"
  },
  {
    "user": "Gregory Brown",
    "rating": 4.0,
    "message": "They did not have my size so I bought one size smaller. It fits but it would Be more comfortable with my regular size."
  },
  {
    "user": "GINGER L. H.",
    "rating": 5.0,
    "message": "My teen daughter loves these! Has a nice arch and gives her a boost while walking that runway.. hahaha.  Well atleast while walking down those halls at school!  \"Hey\" be a star and work thoses red Fila!"
  },
  {
    "user": "Franita",
    "rating": 5.0,
    "message": "Very comfortable..fun color"
  },
  {
    "user": "Venessa Garcia",
    "rating": 4.0,
    "message": "I am a 10, 40, because I have a condition wear chows bigger than my actual size, I always size up to 10.5 and 40.5 but this shoes I ordered 11, 41 and they came too small so size up."
  },
  {
    "user": "Kevlar MadHatter",
    "rating": 4.0,
    "message": "My feet are wide and flat which are things I didn't think about when I bought these, so that's my fault. But I don't wear them often because they pinch my toes and there's no arch support, so generally speaking they're uncomfortable.  But! They're super cute and I love them so I will keep them and wear them sometimes 🤣🤣"
  },
  {
    "user": "cristina villacis",
    "rating": 4.0,
    "message": "They look good but definitely size up, I’m a size 7 and ordered a 7.5 because of the reviews I read but they were too tight.  I usually size up a whole number for sneakers and boots I should’ve gone with my gut feeling :("
  },
  {
    "user": "Daniel",
    "rating": 5.0,
    "message": "love it"
  },
  {
    "user": "AshBlue",
    "rating": 5.0,
    "message": "Honestly as of lately I have been obsessed with FILAS lol and I love these sneakers I did a half size up because my normal size didn’t fit me 😅"
  },
  {
    "user": "scooterb",
    "rating": 5.0,
    "message": "Look good and comfortable"
  },
  {
    "user": "Lorenzo Carpenter",
    "rating": 5.0,
    "message": "The product was what I expected"
  },
  {
    "user": "Jeanette",
    "rating": 5.0,
    "message": "Bought these for my daughter who is on her feet for long hours. She loves them!"
  },
  {
    "user": "Daniel Rhodes",
    "rating": 5.0,
    "message": "These shoes are so awesome I were them like almost every day. including to Disney world and they are so comfortable and definitely a thumbs up 👍🏻"
  },
  {
    "user": "Anon",
    "rating": 4.0,
    "message": "Pretty comfortable, lots of cushion and support, and I love the color. My only complaint is the toe area is quite narrow, so I don’t usually wear them for extended periods with a lot of walking."
  },
  {
    "user": "Mireya Cheung",
    "rating": 4.0,
    "message": "Cool shoes but fit me small. Get a 1/2 size larger perhaps. Had to return because it hurt my toes since it was a tad small. The shoes compliment lots of outfits and is ok for walking. Shoes are on the heavy side."
  },
  {
    "user": "Marzana I.",
    "rating": 4.0,
    "message": "I just received my pair. Overall I like it but the shoe is a bit dirty. It looks like it was kept somewhere for a long time and just packaged. Should’ve wiped off."
  },
  {
    "user": "Iris S Cox",
    "rating": 5.0,
    "message": "The color I wanted. Too small."
  },
  {
    "user": "kimkimble",
    "rating": 5.0,
    "message": "They are my daughters fave shoe. Well made."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These shoes are supportive and super comfortable. I was surprised I could wear them all day with no problem. I love the platform look, I could wear these with a variety of different styles. I will do ordering more"
  },
  {
    "user": "Roxy Flores",
    "rating": 5.0,
    "message": "Me encantaron el tamaño perfecto y son hermosas"
  },
  {
    "user": "Richard  V Govitz",
    "rating": 4.0,
    "message": "great pair of shoes"
  },
  {
    "user": "edson scotland",
    "rating": 5.0,
    "message": "The shoe fits as expected. The kids love it"
  },
  {
    "user": "Saodat Yarmuhamedova",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Ashley Barker",
    "rating": 5.0,
    "message": "We have tried many different brands of shoes for my daughter but she keeps coming back to these. She said they don't require being broken in, they are great from the start"
  },
  {
    "user": "Carlos Ulloa",
    "rating": 5.0,
    "message": "Simply perfect!!"
  },
  {
    "user": "Susana Rosello",
    "rating": 5.0,
    "message": "Soft, cushy insoles, great arch support, and very stylish!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They're exactly what I was looking for. They're heavy to walk in at first. (But that was what I was searching for, the added weight and sole structure on these makes you use muscles in the back of your thighs and glutes when walking). They're SLIGHTLY loose around the heal. Typically I wear thin socks, so I had to wear slightly thicker socks to keep shoes from sliding up and down on my heel as I walk (again they only slide EVER so SLIGHTLY and I am a bit finicky about shoes. Probably not a problem for most others. Also I tend to have really skinny ankles and feet so this problem may not be relevant if you're feet are normal width) I would not recommend for work that keeps you on your feet standing in place or lifting heavy items all day.  For normal daily use (running errands a few hours, some light gardening, and walking my dog) I found these very comfortable, supportive, and fashionable. Lacing up a little stiff at first but that will change with more use. They came in professional store bought packaging with stuffing in shoes to ensure they keep their shape, which is important to keeping shoes  for a longer period of time.  I am giving these a 4 only because I need to know how long they will actually last. I dont know if I'll have product quality problems with them. I dont think I will, seeing as they seem to be made well and are without visible flaws. Price was fair and shipping was actually faster than anticipated. Eta was this coming Friday, they arrived yesterday. Im So HAPPY with my purchase!"
  },
  {
    "user": "Samantha",
    "rating": 5.0,
    "message": "Like the fit. Came early"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Look like the picture, correct color and size. Heads up if you blister easily with new shoes like I do these rubbed the back of my ankles the first couple time I worse them. After breaking them in a bit they are pretty comfortable."
  },
  {
    "user": "Angelica banks",
    "rating": 5.0,
    "message": "I love them so freaking cute"
  },
  {
    "user": "Jason",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Barbara",
    "rating": 3.0,
    "message": "I loved the stylish look of these size 9 Fila tennis shoes with their substantial soles, but the toe box was very tight, which hurt my toes.  I have worn size 9 Fila tennis shoes for years, so I was very disappointed that these did not fit.  For that reason, I had to return them.  I am hesitant to reorder in a size 9 1/2."
  },
  {
    "user": "Denay T Scott",
    "rating": 5.0,
    "message": "Love them(: & a cute shade of pink"
  },
  {
    "user": "Joseph H charchar",
    "rating": 5.0,
    "message": "Order 0.5 bigger than normally"
  },
  {
    "user": "Tanya",
    "rating": 5.0,
    "message": "The fit her really well."
  },
  {
    "user": "spice",
    "rating": 5.0,
    "message": "I love the sneakers on of my best I will buy multiples"
  },
  {
    "user": "Maria718",
    "rating": 5.0,
    "message": "I love fila sneakers, they are very comfortable"
  },
  {
    "user": "jenna",
    "rating": 5.0,
    "message": "LOVE THE SHOES! they j run a lil big usually i’m a ten- ten 1/2 but this ten is j a lil bigger"
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "Shoes fit perfectly- arrived on time"
  },
  {
    "user": "Loved",
    "rating": 5.0,
    "message": "😘"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The shoe fit my daughter perfect. We got it a little bigger so she could grow into them and it'll last her more than just a couple of months.  She's absolutely loves them."
  },
  {
    "user": "EmilyRoxURsoX",
    "rating": 3.0,
    "message": "The photo looks like the sole and shoe are different shades and the whole shoe is peach/nude. I was intrigued by the multi colors. Also I was sent the wrong size so I am returning and not replacing. I was disappointed."
  },
  {
    "user": "ajamazon",
    "rating": 5.0,
    "message": "Cool color, and quality product"
  },
  {
    "user": "kyra :D",
    "rating": 5.0,
    "message": "i love these shoes so much. i'm bigger so sometimes finding long lasting tennis shoes is hard, but fila's always fit comfy and last awhile!"
  },
  {
    "user": "Melissa",
    "rating": 5.0,
    "message": "Love"
  },
  {
    "user": "Diora Massiel Taveras Plasencia",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Jenny Moreno",
    "rating": 4.0,
    "message": "The media could not be loaded. Love them vey commfy"
  },
  {
    "user": "Mymie Oakley",
    "rating": 4.0,
    "message": "I think good quality"
  },
  {
    "user": "Jay",
    "rating": 5.0,
    "message": "I have seen these shoes everywhere and wanted a pair. They look exactly how I pictured they would. Very comfortable."
  },
  {
    "user": "Tanonymous",
    "rating": 5.0,
    "message": "I love these sneakers! They are so cute and trendy and I have gotten so many compliments already. They are also way more comfortable than I expected. Spent all day on my feet at an amusement park and my feet didn’t hurt at all which they usually would have."
  },
  {
    "user": "Misty Gonzalez",
    "rating": 3.0,
    "message": "They could be comfortable however, they’re way too small. They should advertise that these shoes run small and you should order a full size or size and a half larger than normal."
  },
  {
    "user": "Mia F",
    "rating": 5.0,
    "message": "It's comfy, fashionable and fits perfectly."
  },
  {
    "user": "Vicki R",
    "rating": 5.0,
    "message": "I love this color! I normally wear a size 7.5 but I bought a size 8  and glad I did. They fit perfect. I got  compliments on them all day but I am a Fila fan and have them in several colors and these stand up to my normal Fila expectations."
  },
  {
    "user": "Moon baby",
    "rating": 5.0,
    "message": "This is her favorite shoe. Was a bit hard to find in her size to replace the ones she has worn out from a year of constant wear. She is thrilled, so am I."
  },
  {
    "user": "Therese M. Timm",
    "rating": 3.0,
    "message": "Not as perfect as other Fila's I've bought.  But, they fit, I was sent the right size, this time, and I'm happy with them.  My feet like them, too!"
  },
  {
    "user": "Aaliyah",
    "rating": 3.0,
    "message": "It runs small impossible to wear and very expensive"
  },
  {
    "user": "Jackie Benedek",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Retired teacher",
    "rating": 5.0,
    "message": "Love my Filas.  I probably have a wider foot and they fit great.  Had to buy a second pair!"
  },
  {
    "user": "Mabeli tejada",
    "rating": 5.0,
    "message": "They came in brand new, im a 8.5 and it fit perfectly!"
  },
  {
    "user": "Alyssa",
    "rating": 4.0,
    "message": "The shoe is  cute and fits great, but the “white/white/white” is all white and NOT the photo that shows up, the colored in logo, which I presume would actually be white/navy/red. The fila logo colored in was an extra $30 or so after looking again. I will keep the all white shoe but buyer be aware that if you’re looking for the color fila logo to buy the “white navy red”"
  },
  {
    "user": "Sara Hammer",
    "rating": 4.0,
    "message": "At first unboxing of these shoes they appear bulky and cumbersome, but much to my surprise when you put them on they appear dainty and sooo light!! After reading literally all of the other reviews, I decided to go ahead and purchase a half size up (I would normally wear an 8.5 W and bought a 9 W). For the record, I think I could have worn an 8.5 W but they were also all sold out of that size at the time. The 9 W feels slightly loose when you first put it on, but that is because the way the shoes are laced. Once I took the laces out and replaced them without going through the extra center loops they were much more snug. My favorite part of these shoes is the toe box width and height, there is so much room to ensure comfort after walking great distances. They feel super cushioned which leads me to believe they will have great shock absorption, I bought these shoes for my trip to Italy next week, so after I’ve put them to the test walking all over Rome I will update my review! Update: 11/1/19 These shoes far exceeded my expectations and I’m so happy with my purchase. In Italy I walked approximately 8 miles a day in these shoes and I attribute them to keeping me going. After walking so much I can officially say that the 9W is the appropriate size and I think any smaller would have been uncomfortable on such long walks. The fit is amazing and doesn’t rub or dig into your foot anywhere and the support is superb. Now with almost 70 miles on them they still look and feel amazing. These shoes will be my staple for future trips. Not to mention they are extremely fashionable and I saw several European girls wearing them while I was on my trip. Get these shoes, you won’t be disappointed."
  },
  {
    "user": "Tira",
    "rating": 3.0,
    "message": "The media could not be loaded. I love filas and they’re comfortable and all, the only problem is when I opened the box I immediately saw that the shoes were dirty and look as if one was worn before. I definitely paid for all white, clean shoes so this is kinda disappointing. For anyone that has problems with white shoes getting dirty, cream developer makes them super white and keeps them nice and fresh"
  },
  {
    "user": "Ronald Arroyo-Watson",
    "rating": 3.0,
    "message": "Shoes came with 2 marks on them that looked like blue ink. They are poppin otherwise. They are very heavy shoes and fit quite loosely compared to other shoes of the same size. The leaves don't stay tied well."
  },
  {
    "user": "Marilla Johnson",
    "rating": 5.0,
    "message": "Can't wait to wear them with my red and white clothes"
  },
  {
    "user": "Trish",
    "rating": 5.0,
    "message": "The media could not be loaded. Sneaker is very comfortable, lovely design, I usually wear a size 7 I went with a 7.5"
  },
  {
    "user": "Liliesinwhite99",
    "rating": 4.0,
    "message": "Look great but there's no support. I purchased Regular, but they were too small/narrow. I could not run in these without ankle burn and awkwardness. Like they were flat footed."
  },
  {
    "user": "Live Simply",
    "rating": 5.0,
    "message": "Great shoes. Got them as a gift. These look really nice. The ones we got are genuine."
  },
  {
    "user": "simplymesyba",
    "rating": 5.0,
    "message": "I am I read the prev reviews. I normally would like a 8.5 in sneakers as I normally wear a size 8. However they did not have the size available and got a 9. I am glad I went for a nine. An 8.5 would have been tight. Can’t wait to wear these! ✨"
  },
  {
    "user": "Esperanza",
    "rating": 5.0,
    "message": "The media could not be loaded. El modelo de los zapatos siempre me a gustado lo amo"
  },
  {
    "user": "Quinn McCartin",
    "rating": 3.0,
    "message": "Love these shoes! Fit true to size in my opinion. I bought a size 6. They do seem a little cheaply made, but I do love the style. The left one also came with a nick on the side… which I’m not too happy about. Not sure what I’m going to do yet."
  },
  {
    "user": "Chulayo",
    "rating": 5.0,
    "message": "Great fit"
  },
  {
    "user": "Yep, I bought it",
    "rating": 5.0,
    "message": "Bought these for the “dad’s shoes” look. They’re super cute and chunky. I would definitely buy again if I had too but these are amazing. I wear them often and they fit just right! The style/design is great, and the white pops!"
  },
  {
    "user": "Robin Moreno-Lucas",
    "rating": 3.0,
    "message": "I like the shoes, like the brand, but the fit is to narrow. Need 2 get wider shoes next time."
  },
  {
    "user": "Kell",
    "rating": 4.0,
    "message": "I love these shoes and this is my second pair of them. They are great for the rain because you’re high above the puddles and you don’t get your socks wet unless the puddles are like over an inch deep. I wear them as every day shoes to class. They are comfy and okay for walking. The one thing I don’t like about them is that the part where your ankle is inside the shoe wears out and the foam comes out so you have to replace them. It’s super annoying and it happened badly to my first pair and my boyfriend’s sisters pair and it’s slowly happening to my new pair. To avoid it the best thing to do is tie the laces tight and don’t slip them on; you have to untie the laces and take them off carefully every time or else the friction will build up on the back and the foam will rub off."
  },
  {
    "user": "キアラ",
    "rating": 3.0,
    "message": "I love the shoes, but they came with a chunk out of the sole, something that looks like a makeup stain on the laces, loose threads, and a crack (?) on the side of one of them."
  },
  {
    "user": "Lizette Javierre",
    "rating": 5.0,
    "message": "Order 1/2 size bigger than your regular size for best fit."
  },
  {
    "user": "Sunshine15__",
    "rating": 4.0,
    "message": "I got my regular shoe size but I wish I would of got it a half size bigge."
  },
  {
    "user": "stuffy",
    "rating": 5.0,
    "message": "nothing"
  },
  {
    "user": "H. Tam",
    "rating": 5.0,
    "message": "If you have a wider feet, order half size up. If you have wider feet and walk A LOT like me, order one full size up. I usually wear 7 in most flats, 7.5 in sneaker that have small toe box. I ordered 8 and it fits perfect with a pair with socks. I walk at least 6 miles a day so my feet swell up from walking during the day sometimes. Size 8 then became perfect for me. 7.5 will fit well too if I do not walk as much. If you have normal or narrow feet, follow your regular size, do not size up. It came in with an original shoes box, wrapped up with a plastic piece for extra protection. Took it right out of the box, the shoes are not as heavy as I thought. It is chunky which is my favorite style of shoes. It has mild to moderate arch support which I like. It is comfortable to wear for a long time, there was no break in period for me. The quality is pretty good. I work in an auto body shop, been running up and down to work on and check on cars. I do not see any sign of wearing after a month at least. The quality is not premium but in this price, I do not expect it to be excellent anyways. If you are looking for something casual and look good in both jeans and dresses, this is definitely the go-to 🤗"
  },
  {
    "user": "Dee Dee",
    "rating": 5.0,
    "message": "I liked the style and sturdiness of the shows will last a long while"
  },
  {
    "user": "sweekenn",
    "rating": 5.0,
    "message": "They fit well and look great!"
  },
  {
    "user": "Yvonne Salcido",
    "rating": 3.0,
    "message": "No what I was looking for"
  },
  {
    "user": "Blanca Moreno",
    "rating": 3.0,
    "message": "I am a bit sad that some glue on shoe was visible, but shoe does look good. 1st pic shows full shoe, 2nd pic shows where the glue is visible on shoe :/"
  },
  {
    "user": "Jeremy Ashcraft",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "EllieS",
    "rating": 4.0,
    "message": "I’m not understanding all the reviews saying “size up” and that even then they were tight. I definitely do not have a narrow foot. I believe it’s about average width and I have no problem with this shoe in my normal size (7 1/2). I ordered the 8 (based on the reviews) and it honestly was just too big. Definitely not narrow or “squished” by the toe. The shoe just kept slipping. I reordered the wedge version (from an actual retailer) in a 7 1/2 and it is a perfect fit. So, these reviews make me wonder... Also, some have mentioned that they received fakes. I contacted the seller prior asking about that but got no response. Amazon did say they would cover it if it was. So, since y’all got me super paranoid, I watched some YouTube vids on how to tell of their real or fake. I checked the tags,  Stitching, outer sole and inner. Everything seemed on point except for the red stitching of the foot bed (inside). Mine had red stitching whereas I’m the vids, they were white. On the wedges I replaced these with it is white also. Idk if that equals to fake. They seemed legit otherwise."
  },
  {
    "user": "Cheryl A Hurt",
    "rating": 5.0,
    "message": "Love the comfort, but one shoe was just a tad loose fitting."
  },
  {
    "user": "Henry Roman",
    "rating": 5.0,
    "message": "My daughter bought them and she loves them!! She wears them with casual outfits and also office clothes! (The shoes are true to size!)"
  },
  {
    "user": "charles",
    "rating": 5.0,
    "message": "Great fill, great look"
  },
  {
    "user": "Amanda",
    "rating": 4.0,
    "message": "These came in their original box and were completely new. I ordered white/white and they came as the first photo instead of the one with the white tag. I still like them though"
  },
  {
    "user": "Lizzy",
    "rating": 5.0,
    "message": "Beautiful… nice and light, sadly I listened to the reviews saying size up… I did and they’re too big,  my normal size would’ve fit “true to size”. I will give these away and reorder my normal size."
  },
  {
    "user": "STEPHANIE SMITH",
    "rating": 4.0,
    "message": "Runs big. Had to return. I would say it's a good street shoe. However not good to work out in."
  },
  {
    "user": "Melissa Baker",
    "rating": 4.0,
    "message": "I  disliked that they were the wrong color but liked the same shoe and fits perfect and is comphy"
  },
  {
    "user": "Lily Brown",
    "rating": 3.0,
    "message": "i was surprised to see some of the leather scraped and the soles with these markings on the left shoe. the right shoe was perfect though. since the packaging was unharmed, i believe it was a manufacturing issue. perhaps the quality check isn’t up to par"
  },
  {
    "user": "Robyn Groves",
    "rating": 5.0,
    "message": "Great sneaker, although I did not receive the right one--the customer service through bloom trading Inc was amazing. They got back to me right away and refunded my item. I will be dropping sneakers off to UPS for return today."
  },
  {
    "user": "Alyssa Vekas",
    "rating": 5.0,
    "message": "The media could not be loaded. I love how \"chunky\" the bottoms are, they look really nice even though I wear a size 9 which is bigger than the average women's foot size so sometimes alot of shoes fit me wear or don't look as I imagined, but these seem to flatter them very well in my opinion! They are a must have, you can tell how well they are made."
  },
  {
    "user": "Anna Yuan",
    "rating": 4.0,
    "message": "it is good, only concern is the show is too heavy"
  },
  {
    "user": "Les",
    "rating": 5.0,
    "message": "Got these last year for my daughter. Just bought another pair bc her old ones were starting to fall apart, but she used these shoes all the time."
  }
]