[
  {
    "user": "Sarah",
    "rating": 4.0,
    "message": "The shoes fit nicely in general. The wide sizes are a nice feature that most other companies don't offer. My only complaints are that the interior sole is not good for shock absorbtion when running. Also the exterior sole is very rigid and also not good for shock absorbtion."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I just rejoined Planet Fitness and needed some gym shoes.  I purchased these.  They fit good and after working on the treadmill and bicycle they are comfortable and don't cause any hot spots on my feet."
  },
  {
    "user": "Kyle",
    "rating": 5.0,
    "message": "These are a daily wear for me. I’ve lost count what number I’m on, I should have a subscription lol. They have actually improved it over the years (like a late model car vs a first run). With the last set, the tongues were a little short and uneven between the two. The top of the left one was only just above the laces. This set I just bought (8/22) the tongues are exactly how they should be. The only thing I would change is that they skipped having a ‘center lace loop’ - a single lace retainer at the base of the tongue between the bottom left and right rows that pulls the toe area up as laces are tightened. This certainly isn’t a dealbreaker at all, but just seems like it should have been there in the design of this model. Will buy again!!! Please don’t discontinue!!!"
  },
  {
    "user": "Carl Borden",
    "rating": 4.0,
    "message": "I buy these shoes about every 18 - 24 months. That's because they are very comfortable, snugly cushion my feet, look great, and are reasonably priced, but one heel is worn down by then from daily wear. They come pre-laced with 54\" shoelaces--way too long. I replace them with 40\" laces; perfect length for me."
  },
  {
    "user": "Robyn",
    "rating": 5.0,
    "message": "The shoe looks up to my expectation. I myself wears nothing but Sketches and love them. I purchased this item for a Christmas gift."
  },
  {
    "user": "Rick H.",
    "rating": 5.0,
    "message": "Shipping was slow but worth the wait. Quality as expected from sketchers. Very pleased. I would purchase again. 👍"
  },
  {
    "user": "EduG",
    "rating": 5.0,
    "message": "I like it. They are comfortable when walking"
  },
  {
    "user": "Kenneth P.  LEGER",
    "rating": 5.0,
    "message": "Love my new sneakers."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "the bottom sole comes lose ever time i have bought 12 pairs"
  },
  {
    "user": "Thomas K.",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Glen D. Sherman",
    "rating": 5.0,
    "message": "For me, there are Skechers and New Balance \"sneakers\". Everything else is a wanna-be. Even Nike shoes are not as well built as the aforementioned. In addition, Skechers are incredibly underpriced, compared to ALL other top brands. They also tend to wear better than any other brand, with the possible exception of New Balance. I love the new Skechers Stamina Nuovo Cutback shoes I just bought. It occurs to me, Skechers ought to make automobile tires, as the treads on my new shoes grip the surfaces like nothing I've ever experienced! Be careful! Don't \"shuffle\" when wearing a pair of these shoes. Will I buy again? Yes, Tony! Yes, Howie! Yes, Ringo!"
  },
  {
    "user": "Rascall Flatass",
    "rating": 5.0,
    "message": "Fantastic"
  },
  {
    "user": "Dean",
    "rating": 5.0,
    "message": "Sketches has always been a good quality and comfortable  shoe."
  },
  {
    "user": "Terri",
    "rating": 5.0,
    "message": "Very comfortable. Good support."
  },
  {
    "user": "Raymond McGlyn",
    "rating": 5.0,
    "message": "I like everything about this Sketchers  footwear. It was exactly what I needed. I am enjoying them every day."
  },
  {
    "user": "John Morris",
    "rating": 5.0,
    "message": "Fits well. Feels good."
  },
  {
    "user": "Paul Rono",
    "rating": 4.0,
    "message": "I had a prior pair of these that I wore out, the new pair fit exactly like the old ones!"
  },
  {
    "user": "Russell E. Marooney",
    "rating": 5.0,
    "message": "I went from a 13 R to a 14 wide. did not know it for some time. Turns out that not unusual for someone my age (78). The arch will collapse. Also, the well-ventilated feature helps a lot with sweaty feet."
  },
  {
    "user": "William Grandstaff",
    "rating": 4.0,
    "message": "support and cushioning"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought this shoe consistently for years now. Great for walking at work or home."
  },
  {
    "user": "melissa stallard",
    "rating": 5.0,
    "message": "Nice shoes"
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "The shoes fit perfect and are comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have several pairs of this show. It is comfortable, supportive, and takes a beating. I will continue to buy more of this shoe as they wear and tare normally."
  },
  {
    "user": "BECKY",
    "rating": 4.0,
    "message": "My husband wears these and they last around 6 months, he usually wears them into the ground as he wears them for work!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Nice shoe"
  },
  {
    "user": "jerry v.",
    "rating": 4.0,
    "message": "color is good but they are a little tight but have not worn but one time may get better"
  },
  {
    "user": "JUAN AVILA",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Olga s.",
    "rating": 5.0,
    "message": "Muy bueno"
  },
  {
    "user": "Michael K.  Loman Sr.",
    "rating": 5.0,
    "message": "perfect everyday shoe"
  },
  {
    "user": "Ray Mackey",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "Alvaro Calzada M",
    "rating": 4.0,
    "message": "Todo me agrado"
  },
  {
    "user": "Felipe G.",
    "rating": 4.0,
    "message": "Really good shoes."
  },
  {
    "user": "R. Romano",
    "rating": 5.0,
    "message": "nice and comfortable great for walking."
  },
  {
    "user": "bob vrabel",
    "rating": 5.0,
    "message": "Purchased before and purchased again. Comfortable, easy to navigate!"
  },
  {
    "user": "James Barrow",
    "rating": 5.0,
    "message": "They are great. I plan on getting them again"
  },
  {
    "user": "Greg Schmidt",
    "rating": 5.0,
    "message": "First off, let me just say that these shoes are awesome! PROS: - Well-built - Durable - Great support - Handles abuse quite well - All-around champ CONS: - Price I usually go through shoes pretty fast, because I work in manufacturing, and am constantly moving around for 12 hour shifts. When I'm not working, I am doing something outside, usually hiking or camping. These shoes handle it all, and even after a long day, my feet still aren't sore. I wanted a strong, durable shoe that would last, because I got tired of shelling out money literally every month for a new pair after the old ones bit the dust. So, I finally broke down, and bought a pair of Nuovos; I'm really glad I did! I originally bought these May 27th, and with Amazon Prime, they arrived fast as ever. Well, it's now September 10th, and they're still going strong, although starting to show their age in places. After 4 months, the are just now starting to have some frayed stitching in the front, loosing a slight bit of spring in the support, and the tongue tends to slide under the laces. But then again, that's 4 months of heavy use and abuse. I'm pretty hard on my shoes, and usually toss them in the washing machine and dryer at least every 2 weeks, if not more. Not your typical shoe-cleaning practice, I know. But they've taken it like champs. The only reason I am starting to think about getting another pair now is because they are (very) slowly starting to go out on me, and, it would just be nice to have another pair handy and already broke in when they do go. But for now, they're still in good condition to work. I really like the support these shoes offer, first and foremost. These are literally a shoe that is comfortable wearing all day long. My feet don't get super hot, like other shoes do (although more ventilation could be a plus). The traction and grip of these shoes is pretty good - a lot better than many of the shoes out there in retail-store-world, anyway. I also really like the amount of padding that went into the shoes, especially around the heel and sides of the foot - it gives a nice snug, secure feel. These things are also tanks! They take whatever you throw at them, and keep on trucking. When I go hiking, I'm usually wearing a 40-80 pound pack (depending on number of people and duration), and for that reason, usually switch to my good 'ol trusty Danners for ankle support. However, this summer, the Danners stayed in the closet, and I just went with these, and had no problems at all. In response to some of the reviews out there on the Internet saying that these shoes cause you to loose balance - I honestly can't confirm nor deny that. I will admit that, at times, I imagine it looks like I'm a drunken fool bumbling around, but I can't honestly tell if that's the shoes, or just me being my normal, uncoordinated self (after all, I trip over my own feet... soooo). As far as that aspect, I really can't weigh in with an honest answer, although I can say that I don't believe the shoes cause any unbalance issues. All in all, I would highly recommend these shoes. Sure, for my size (14M), they're a bit expensive, but when you consider the price of one pair over 4-5 months vs buying a new pair of shoes every month, I suppose it's all worth it in the long run. Honestly, these are great shoes, and stand up to whatever you need them for. And, with Amazon, you not only get them fast with Prime, but if you don't like them, Amazon's really good about returns, so there's honestly no reason not to at least try them!"
  },
  {
    "user": "just me",
    "rating": 5.0,
    "message": "Husband always looking for a wide width sneaker… he loves these… will order these again"
  },
  {
    "user": "John Lowe",
    "rating": 5.0,
    "message": "Finally found a pair of shoes that fit just right and they look great too"
  },
  {
    "user": "william s t mayhall",
    "rating": 5.0,
    "message": "These are a good value"
  },
  {
    "user": "Jackie Powierski",
    "rating": 5.0,
    "message": "Perfect in every way, will buy again"
  },
  {
    "user": "Al G",
    "rating": 5.0,
    "message": "Very comfortable and supportive, good looking."
  },
  {
    "user": "Carol S. Lininger",
    "rating": 5.0,
    "message": "Likes the width as I have a wide foot!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Good product and good fit"
  },
  {
    "user": "Gordie",
    "rating": 4.0,
    "message": "I love the Sketchers Sports Mens sneakers with the gel insert. I didn't realize this pair was without the gel insert, but I was giddy about the low price.  I regret not paying $10 more for the shoe with the gel insert, much more comfortable once it forms to your foot.  I'll get the better shoe next time."
  },
  {
    "user": "Randy L Holland",
    "rating": 5.0,
    "message": "My husband's favorite shoe. He loves them for every day use, in and out of the house. Very comfortable."
  },
  {
    "user": "loonlake",
    "rating": 5.0,
    "message": "ok"
  },
  {
    "user": "Duff Goodsell",
    "rating": 4.0,
    "message": "N/A"
  },
  {
    "user": "Arrr Matey",
    "rating": 5.0,
    "message": "Have to say that these are the BEST shoes I've had, EVER.  I have arch and foot problems, flat feet, arthritis, etc.  My Podiatrist (foot doctor) told me to wear tennis shoes at work if I possibly can, which I can, so I did.  I originally bought these shoes in grey, at a local store a few years ago, wore them for about 2 years, and now they are worn out (will use for mowing shoes now)...but I loved them so much in 2011 that I bought a 2nd pair a month after the 1st pair in 2011 just in case and kept them in the closet these last 2 years for when the old pair wore out. I have to say that I wore the first pair for 2+ years and they brought tons of comfort and needed support to my flat feet with no arches with arthritis.  Over the years I've also had a hard time finding sizes and anything that fits.  I wear Men's size 12/13 depending on the manufacturer, and these shoes actually come in a \"Wide\" version which is RARE! I not only have a hard time finding size 13 but rarely find WIDE in Size 13!!!!! BONUS! I thought I would never find any shoes that fit me PERFECTLY!  These are the best damn shoes I ever had the privilege of wearing plus I go through shoes a lot, wearing the soles down mostly, but not these! I haven't had any issues with these over the years but only one minor issue...the only issue I had was with the bottom rubber part of the heel came loose a litte but I bought some rubber cement (that professional shoe repair shops use) and I glued them back on perfectly.  Of course this was after 2 years of wear and tear so I expected something (very minor in IMO) especially after wearing them day in and out for over 2+ years. I don't think I ever had shoes this comfortable in all my life, EVER! Seriously, I'm not only impressed, but I purchased a new pair right now because I love these so much-just in case they don't make them again I'll be good for 4 years (current one is new and these will be stored away or worn in conjunction to my other new pair).  The other day I finally broke out my 2nd pair that I bought back in 2011 because those 1st pair took a major beating every day to work, weekends, etc. Now I'm on my 2nd pair I bought in 2011, grey color, but I searched and found these on Amazon and decided to order these in dark navy for a change, same thing; 13 Wide for about the same price I purchase them in 2011! I can only say that if you have general foot issues, arch problems, flat feet, arthritis in your feet, anything, just give these babies a try. Do your yourself a favor and seek relief from these shoes, I did and have been very happy over the past few years.  The extra bonus is they look nice too, unlike some ugly brands out there. I'm sure you will be impressed and overjoyed with the comfort and smooth stride in every step! Happy Travels"
  },
  {
    "user": "Jacquie T.",
    "rating": 5.0,
    "message": "Really Nice shoes"
  },
  {
    "user": "chevis allen",
    "rating": 5.0,
    "message": "I like these shoes. Im flatfooted so the width of this shoe works well for me. It does look a bit bulky but I wear a size 15 so that's really where the bulk comes from. This shoe has held up as sturdy so far but it's still new so we'll see. I recommend. I'm happy with this purchase."
  },
  {
    "user": "DAVID L CHRISTIAN",
    "rating": 5.0,
    "message": "Fourth pair I've purchased.  Love this shoe."
  },
  {
    "user": "Ima mawm",
    "rating": 3.0,
    "message": "I purchased these in July for my son but he didn't begin wearing them until school began mid August. Parts of the outside started coming off. Parts that are probably just glued on. I see no option for getting help with this defect. Buyer beware."
  },
  {
    "user": "Cliff",
    "rating": 5.0,
    "message": "I buy Sketchers because they have wide , which I need. They are comfortable. The prices are reasonable and I get long wear from them. I scraped one pair when I got these and changed another to yard work. I’ll be back in a few years."
  },
  {
    "user": "Alcibiades",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "James Grammer",
    "rating": 4.0,
    "message": "The reviews are correct. They are a little stiff and the the side pinky toe has small pinch. But it's nothing my shoe stretchers couldn't handle. Invest in a set, pays for themselves and last for years. The stretchers, not the sneakers. The sneakers are fine now. Love sketchers."
  },
  {
    "user": "Catherine in Indiana",
    "rating": 5.0,
    "message": "I have bought several pairs of these shoes for my husband and he’s hoping you never discontinue them. He loves them."
  },
  {
    "user": "avid shopper",
    "rating": 4.0,
    "message": "good shoe just not enough padding."
  },
  {
    "user": "Robert McLemore",
    "rating": 5.0,
    "message": "The shoes fit exactly as expected and the quality is impeccable! I'll definitely be purchasing more!"
  },
  {
    "user": "CB",
    "rating": 5.0,
    "message": "Needed to replace my 5yr old Sketchers and decided to try these ones.  Great sneaker but better hiker.  Wore these while hiking in the Adirondacks and had no problems.  May just buy another pair as backups."
  },
  {
    "user": "1",
    "rating": 5.0,
    "message": "Very nice shoes. Great fit!"
  },
  {
    "user": "David I Miller",
    "rating": 3.0,
    "message": "It looks like this may have been a factory second. The sewing on one shoe was off and this may cause a wear problem down the road. This was my second pair as I really like everything about the shoe. I kept it as a “dress version” of the pair I wear all the time, so I’ve probably worn this pair 3-4 times, but now 4 month later I noticed that one shoe wasn’t sewed right in one area. Too late to submit a claim."
  },
  {
    "user": "Bob",
    "rating": 4.0,
    "message": "Both shoes rub against the bottom of both my big toes."
  },
  {
    "user": "Vienna",
    "rating": 5.0,
    "message": "This is the 4th pair of Sketchers stamina I have owned. I am very satisfied with them. They are very attractive and stylish and seem to be very popular with older guys like me. I saw these shoes at a official Sketchers outlet store for about $66. I did not buy them. I later saw them on amazon for about $56. I bought them. I saved $10. It pays to shop at amazon."
  },
  {
    "user": "David Autrey",
    "rating": 3.0,
    "message": "I thought that they would be more comfortable but they’re really not."
  },
  {
    "user": "James Turnure",
    "rating": 5.0,
    "message": "I've worn the last pair of these grey Sketchers for 3 years almost everyday and they are still not completely worn out.  Never had a pair of sneakers last like these!  The grey does not show dirt so that's another benefit!"
  },
  {
    "user": "Terry Hix",
    "rating": 4.0,
    "message": "Comfortable shoe and just what I wanted."
  },
  {
    "user": "Julio Artache",
    "rating": 5.0,
    "message": "I'm on my feet all day and these are very comfortable and stylish."
  },
  {
    "user": "Frank",
    "rating": 5.0,
    "message": "The comfort level of this shoe is amazing , my second pair  ....  i still have the original after 2yrs  so i order this one as a back up  for when my original wears out. This shoe is so comfy  and great for my feet that even with a painful heel pain ,this is the only shoe that gives me relief. No inserts needed, im on my feet all day and it really takes its toll on my feet. Im going to order a 3rd pair because it took me forever to finally find a shoe that holds up and properly supports my feet , I am beyond happy"
  },
  {
    "user": "Deven Shannon",
    "rating": 4.0,
    "message": "I am on my feet all the time at work and these shoes make it so much nicer."
  },
  {
    "user": "Thomas Difiore",
    "rating": 3.0,
    "message": "They said they were wide but they were extra extra wide only wore them twice would like to get reimbursed"
  },
  {
    "user": "candy",
    "rating": 3.0,
    "message": "Skechers used to be a good shoe… not anymore.  Cheaper quality materials, soles have little support, overall I’m done with Skechers"
  },
  {
    "user": "Phil H.",
    "rating": 5.0,
    "message": "Great comfortable shoes at a reasonable price."
  },
  {
    "user": "stacy Sullivan",
    "rating": 5.0,
    "message": "Work"
  },
  {
    "user": "Lisa Byrom",
    "rating": 5.0,
    "message": "Most comfortable tennis shoes ever!"
  },
  {
    "user": "James Morgan",
    "rating": 4.0,
    "message": "I am disabled due to a stroke and with the weight of these it does make it difficult to lift up my right leg."
  },
  {
    "user": "Joshua Dodson",
    "rating": 5.0,
    "message": "I operate my own small construction business. Footwear makes all the difference in my day. When I look for shoes, I try to find something comfortable and well-built. These are not steel toe, or considered proper footwear for construction, but I am not someone who cares about that. I like comfort and durability.  I'm rough on shoes. That said, after 6 months of hard use, these shoes are holding up amazingly. They are light. They are tough. MY FEET NEVER FEEL A THING. Plenty of cushion and support. I'm writing this review because I am on Amazon ordering another pair, and I felt I owed it to Skechers for giving me such a great product at such a great price. Oh, I'm not ordering a new pair because I think the first pair is done, I just wanna make sure I have another pair on call when they are done."
  },
  {
    "user": "Joseph",
    "rating": 5.0,
    "message": "When you need comfortable shoes and you know Sketchers makes them so you buy them and wear all of the time even at work but your friends make fun of you because they say they are old man shoes which they are not but I am 44 so what do I know. Great shoes!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "The arch is good but the width is tight"
  },
  {
    "user": "D.L.",
    "rating": 4.0,
    "message": "Best fitting sneaker I’ve worn in a long time"
  },
  {
    "user": "Larry R.",
    "rating": 3.0,
    "message": "Tried these Skechers after years of wearing New Balance.  First off, the color description of Navy/Black is incorrect.  The sneaker is Silver and Black with NO Navy.  As for the Sneaker itself, it is heavier and much more stiff than the New Balance sneakers. I purchased the wide fit and the same size as the New Balance.  They are more snug but comfortable.  The memory foam is excellent.  Much more cushioned than the New Balance.  Overall, they are acceptable but i would look for a pair which are lighter and less stiff next go around.  The price of these is one third of the New Balance so that is a big plus."
  },
  {
    "user": "Amber",
    "rating": 5.0,
    "message": "Fits as expected and comfortable daily shoe"
  },
  {
    "user": "AES",
    "rating": 4.0,
    "message": "A very good shoe, the memory foam is great."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I ordered the same ones he had before because got paint the old ones. He wears them to death."
  },
  {
    "user": "JRM",
    "rating": 5.0,
    "message": "This is my 4th pair.  The most comfortable shoe I have found. Can be worn all day.  Not the  longest lasting sneaker but the comfort makes up for that."
  },
  {
    "user": "Bill Weaver",
    "rating": 5.0,
    "message": "the shoes are very comfortable and come in a variety of colors.  will most likely buy another pair. thanks"
  },
  {
    "user": "Ardvarkrebel",
    "rating": 5.0,
    "message": "Love these shoes. Second pair I’ve gotten if this style. Loved the first ones, love the second ones just as much."
  },
  {
    "user": "GF",
    "rating": 5.0,
    "message": "These are very comfortable with good support.  First pair of Skechers.  Not my last."
  },
  {
    "user": "Annette Blossom",
    "rating": 5.0,
    "message": "Didn't  dislike anything about product. Use for every day wear"
  },
  {
    "user": "M & M",
    "rating": 5.0,
    "message": "Es la segunda vez que ordenó este artículo. Cómodo y duradero."
  },
  {
    "user": "Dave Templeton",
    "rating": 5.0,
    "message": "Not happy at this time poor quality workmanship period of period and I went with them because they've always been good but this pdid but this pair just not so hot"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Replaced a previous pair. Same size same fit.❤️"
  },
  {
    "user": "lisa roach",
    "rating": 5.0,
    "message": "Husband loves the shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I’ve been buying Skechers for years because they have been high quality, very comfortable, thick soles, long lasting shoes…but this is not the case for this shoe and two other Skechers sports shoes I have purchased the past year: threads have been fraying and the soles have been separating from shoe at toe within weeks of wearing shoes. Is this a temporary quality issue due to pandemic? I have started searching for other quality brands."
  },
  {
    "user": "Tbs",
    "rating": 5.0,
    "message": "Fits great, very comfortable, true to size."
  },
  {
    "user": "Joe Powers",
    "rating": 5.0,
    "message": "love them , best sneaker there is"
  },
  {
    "user": "Faby Fabian",
    "rating": 5.0,
    "message": "This shoes are as expected. Very good buying I did."
  },
  {
    "user": "William S.",
    "rating": 5.0,
    "message": "These are the most comfortable pair of footwear I have ever owned. The problem is I never take them off - including wearing them while painting on a renovation project, with predictable results. Forgetting to take them off after gardening or change into something else before gardening. Perfect fit for my wide (& flat) feet. Great product."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great appearance and color scheme. Will go with any casual outfit!"
  },
  {
    "user": "Red",
    "rating": 4.0,
    "message": "Very comfortable initially and fit as described/expected. However, didn’t hold up well. within 4 to 6 weeks seams began coming apart. Cushion on inside compacted flat very quickly."
  },
  {
    "user": "alvin dumas",
    "rating": 4.0,
    "message": "Shoe is good"
  }
]