[
  {
    "user": "W0LFEN",
    "rating": 4.0,
    "message": "Great pair of shoes  for the price, the quality of the materials is not super high or anything, but they are comfy and do look great with any track suit!"
  },
  {
    "user": "Joanna Arache Guerrero",
    "rating": 5.0,
    "message": "La verdad es que a mi novio le quedó muy bien y se ven de buena calidad, la talla es como la esperamos y pedimos, la presentación muy buena. Así que recomiendo este producto.."
  },
  {
    "user": "Dan M",
    "rating": 4.0,
    "message": "Love Puma, but these are a bit too narrow for my feet. Hopefully the they will stretch out a bit over time."
  },
  {
    "user": "Sam",
    "rating": 4.0,
    "message": "The shoe fit my son perfectly and is durable."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Good thanks"
  },
  {
    "user": "Luis Esteban Jacome E",
    "rating": 5.0,
    "message": "Comidad, estilo. Lo usa mi hijo para ir al colegio"
  },
  {
    "user": "Jhon Quintero Alvarez",
    "rating": 5.0,
    "message": "Excellent product, exceed My expectation"
  },
  {
    "user": "Yvonne Kassler",
    "rating": 5.0,
    "message": "I’ve been on a wild goose chase looking for low profile white sneaker with a gum sole that can be used daily for walking, at the gym, and are super lightweight for overseas travel. I searched everywhere looking for a women's shoe fitting this description and was about to give up before I found these puma’s. It’s listed as a mens shoe but the mens 7.5 fit my women’s size 8.5/9 foot very well. They are exactly what I wanted!! Very lightweight, comfortable, and fashionable (in my opinion)."
  },
  {
    "user": "Dereck R.",
    "rating": 4.0,
    "message": "Nice looking shoe, good quality and shipping.  Sadly too narrow for my feet."
  },
  {
    "user": "Tigerlillian",
    "rating": 4.0,
    "message": "They run small -- go a half size up. I am typically a US women's 8 / men's 6.5 / Euro 39. I find that if I order shoes using Euro sizing which is determined by actual length (you can find charts that convert Euro size to centimeters) the fit is more accurate than going with US sizing. The Puma size chart shows Euro 39 corresponds with US men's 7 which is what I ordered and these fit me perfectly. I got the gum sole in white/gold and love the styling. These are more contemporary and sporty looking than most women's white sneakers which can sometimes look like bulky nursing shoes. The quality of leather is good and the construction is good. My only complaint is that after one wearing, the gold foil logo imprint on the foot bed inside one of the shoes started to peel, which is to be expected and not really an issue as this remains out of sight when wearing, however, a printed foot bed would have been appreciated for better esthetic wear. Also, there is a little glue residue around the toe where the gum sole meets the leather. The stitching is excellent. The first time I broke these in I wore them for a whole day while working on my feet and didn't experience any fatigue or aches. Comfort wise, they're not bad, no issues with rubbing and not stiff, however not as comfy and low profile as my favorite Onitsuka Tiger Mexico 66 (yep, the yellow Uma Thurman Kill Bill ones!), but these are half the price. I would say the Romas are moderate to very good and will get even more comfortable as the leather softens with wear. The arch support is good too.  The grip on the sole is great and the shoe has an average degree of flexibility. I love them and am glad to have the Roma Classic Gum in my rotation for a moderately low profile leather sneaker. Versatile and sporty and good for wearing with jeans, shorts, leggings, or casual dresses. I do wish that Puma would bring back the Aiki Cat slip ons (no laces), but these are a decent alternative within the brand."
  },
  {
    "user": "Monique",
    "rating": 5.0,
    "message": "Like every just as it is online"
  },
  {
    "user": "Luisfernando Gutierrez barreiro",
    "rating": 4.0,
    "message": "Excelente producto"
  },
  {
    "user": "Gregory's",
    "rating": 5.0,
    "message": "Style"
  },
  {
    "user": "Victoriano González",
    "rating": 4.0,
    "message": "Cumplió las expectativas"
  },
  {
    "user": "Joseph Malone",
    "rating": 5.0,
    "message": "I use these treadmill and lifting weights.  I use my Asics for squats and these for upper body workouts.  Theses are like my Nike Cortez's except they have a leather tongue instead of Nike's stupid nylon one.  The leather tongue is very luxurious and puts Nike to shame which makes me sad because I like Nike.  I wear these with Puma shirts as to match and so far okay but they need dark navy Puma logos instead of off blues and sissy girl colors like candy or windows 8 start menu. I used to like Puma Suede's but last pair hurt my feet after walking on sidewalks for long amounts of time.  I am not sure why that happened.  Seemed weird like they used to be more comfortable.  Maybe I got a bad pair. Had/have a pair of Puma Dallas I never wear because they are too loose in the width and about 1/2 or more too long.  They slip off the heel when running no matter how tight I lace them (which makes them look long and too skinny and just funny) and they wiggle when I squat which is dangerous and annoying.  The low heel is nice but who cares if it wiggles, how can I lift confidently with wiggle? Puma whirlwind had stupid nubby outsole which looked like dumb golf cleats and worse hurt my feet when I was walking to the mall and in the mall.  On hard surfaces the nubs make a funny noise and people stared at me obviously amused by my choice of footwear.  They click clacked on the hard tile so not good choice for out and about activities.  Maybe sprinting on clay track or grass turf.  Stay off concrete/asphalt/indoor surfaces. The G. Villas seem nice tennis shoe comparable to my Kswiss Classics so I might try them but I do not need tennis shoes right now.  If I did I would rather G Unit Reebox's. The speed cats piqued my interest some time ago but I was not sure if the sleek styling was suitable for casual wear, too European.  I could definitely see the value as sports trainers am I really liked when the outsole was good year rubber tire inspired.  Kind of like racing car slicker tires i.e. less tread more traction.  Now I am into working out more so these would be more appropriate for me as long as I did not combine the with no show socks as is a current trend.  I need coverage on my Achilles plus like wearing Nike quarter crews so you can SEE the logo.  No show's have logo on bottom of sock wear you can not see it, how stupid is that. All in all these are probably the best puma I have had not to low like the speed cats which would have to be purely sports trainers.  I can wear these with jeans and look cool like they are Adidas superstars or something.  Low shoes look bad with jeans unless you are bisexual and wear tight jeans or something.  I wear looser jeans so low shoes tend to be paired training shorts.  I can bench press with loose jeans and look normal. So these worked for the money , look good for casual, knocked off the Asics Corsair's/Nike Cortez but as least incorporated a leather tongue which should be almost mandatory, and are okay for sports and training.  Not hardcore running or atg squats but bench pressing, leg pressing, light track work etc. Update 8/9/2019: I just received a white with black stripe. They are not as good as the originals. They are lighter and cheap naugahyde. They had a scratch on one and the other was crushed. They are comfortable but not the quality I expect from a german brand. Very cheap chinese feel."
  },
  {
    "user": "evelyn de espinoza",
    "rating": 5.0,
    "message": "La talla exacta"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The speed of delivery awesome The way they look awesome 10 out of 10 for sure"
  },
  {
    "user": "Juan Carlos",
    "rating": 5.0,
    "message": "Es mi modelo preferido."
  },
  {
    "user": "Roxanne Madden",
    "rating": 4.0,
    "message": "I dislike that the shoes is not the same and fits more narrow."
  },
  {
    "user": "Esdras cruz",
    "rating": 5.0,
    "message": "Están muy bonitos"
  },
  {
    "user": "Zura Gabodze",
    "rating": 5.0,
    "message": "I always used to wear Puma sneakers, just regular ones and never tried this style before, Love it. Fit as excepted, stylish."
  },
  {
    "user": "Lisa Kelly",
    "rating": 5.0,
    "message": "I love these Pumas!  Great fit, Nice Look and very Comfortable"
  },
  {
    "user": "Wallace S. Henry",
    "rating": 5.0,
    "message": "A little bit tight, but once I wore them a few times they have loosened up a bit.  overall they are good for everyday wear."
  },
  {
    "user": "John C.",
    "rating": 4.0,
    "message": "Walking"
  },
  {
    "user": "Derek Kwesiga",
    "rating": 5.0,
    "message": "Great product."
  },
  {
    "user": "Larry Soto",
    "rating": 4.0,
    "message": "Idonio para combinarlo a diario. On cualquier tee shirt Puma"
  },
  {
    "user": "Veronica Ellerbee",
    "rating": 4.0,
    "message": "I love these sneakers. I wish they came in wide width."
  },
  {
    "user": "James L. Wurm",
    "rating": 4.0,
    "message": "I like tight black leather shoes for city cycling. Can look and feel like a bike shoe with clips, but I can walk around with a normal looking shoe. Also important is a stiff sole that my pedals can grip. Since going vegan, it’s been tough to find and these are great. I’d love it if a gum sole with black “leather” was an option. Note: depending on the shoe, I wear 9.5 or 10, but these are definitely tight and narrow, and I had to return the original 9.5 for a 10, which is still snug, but the fit I like for cycling."
  },
  {
    "user": "chase",
    "rating": 3.0,
    "message": "Order was a few days later than advertised, which would have been no real problem except that when the shoes arrived they were very narrow and the material seemed a bit cheap. I will make do, but would not buy this same product again. I have another pair of Puma sneakers and they are very nice looking and really comfortable. Will stick to that version in the future"
  },
  {
    "user": "Gryff",
    "rating": 5.0,
    "message": "I did too, but now they're ruined."
  },
  {
    "user": "Jessica",
    "rating": 5.0,
    "message": "The color n fit was great I love how the inside feels and it’s fits comfortably"
  },
  {
    "user": "DonRe Darden",
    "rating": 4.0,
    "message": "Shoes look great! You are going to need some cushy insoles to go with em. Just a heads up"
  },
  {
    "user": "TLWash0816",
    "rating": 4.0,
    "message": "They are perfect for what I use them for"
  },
  {
    "user": "Maria Luisa Perez",
    "rating": 5.0,
    "message": "A mi esposo le encantaron. Buena calidad y comodidad"
  },
  {
    "user": "Darryll",
    "rating": 4.0,
    "message": "First the positive,: These shoes fit amazing in fact one of the best I've purchased. And they look incredible. Style, class while being reasonably priced. The Amazon picture don't do it justice! Now the negative: This was my first Amazon purchase and I wanted nothing more than a awesome experience buying exactly what I wanted and doing that from home. Unfortunately the right shoe has two glaring marks on it. On the back heel and on the left side. As a person that is use to buying in store, trying my item on before purchasing, this was very disappointing. A brand new pair of shoes should always look like a new pair of shoes. I debated returning them but not sure how well that would work. Now I'm feeling a bit gun shy on making a second Amazon purchase."
  },
  {
    "user": "Waterspin",
    "rating": 4.0,
    "message": "Great looking shoes, but run narrow."
  },
  {
    "user": "Mattie Carver",
    "rating": 5.0,
    "message": "Not true to size. Need size bigger"
  },
  {
    "user": "Oswaldo",
    "rating": 5.0,
    "message": "Muy Bellas …"
  },
  {
    "user": "Shannon L. Houser",
    "rating": 5.0,
    "message": "These are listed as Men's shoes, but they are perfect for us ladies too.  Several reviews stated shoes seemed narrow.  I do have a wide foot (at least I always thought I did), but they fit perfect and are not narrow for me.  The tread on the bottom of the shoe is very \"grippy\" which is great for walking or trails.  They look so good while wearing them that I bought another pair in another color.  Had hesitated for months on whether to make this purchase and now I am so happy I did.  I think I have found my favorite tennis shoe!"
  },
  {
    "user": "Christine Reuscher",
    "rating": 3.0,
    "message": "Good quality...seams are sewn well. Fits narrow in the midfoot and toebox. May want to order 1/2 size up."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very smart looking and fit perfectly."
  },
  {
    "user": "chris roselle",
    "rating": 5.0,
    "message": "What can I say these are the perfect kicks"
  },
  {
    "user": "Carlos Martinez",
    "rating": 4.0,
    "message": "De la punta están muy angostos y eso lastima los dedos solo ese detalle de ahí todo muy bien"
  },
  {
    "user": "Alejandro Prieto",
    "rating": 4.0,
    "message": "La puntera es muy angosta"
  },
  {
    "user": "Kevin Luetkahans",
    "rating": 4.0,
    "message": "These run small. I did not remember Puma's running small like Nikes. My normal 12's are a full size too small."
  },
  {
    "user": "rebeca pedraza",
    "rating": 4.0,
    "message": "Estilo conservador, material fácil de mantener limpios y sobre todo la comodidad."
  },
  {
    "user": "Rodrigo",
    "rating": 4.0,
    "message": "Parecen en perfecto estado, buena compra espero su durabilidad sea igual"
  },
  {
    "user": "David Higgins",
    "rating": 5.0,
    "message": "It's nice"
  },
  {
    "user": "Jeff M.",
    "rating": 5.0,
    "message": "Tired of the jerk salesman in the shoe store telling you to just wear 2 pair of socks?! Then pick up a pair of these. They are marked a “D” with, but are more like a “B”. I wear between a 13A and 13B and they fit perfect. Length on these are true to size."
  },
  {
    "user": "Steven Paliswiat",
    "rating": 3.0,
    "message": "A little bit more narrow than I like."
  },
  {
    "user": "nf_able",
    "rating": 3.0,
    "message": "Item stated as leather - item is all synthetic.  Super tight width.  Concerned if I kept to try to break in the synthetic material would crack over time.  I guess Pumas are usually narrow judging by some online info I found, but if not leather, any breaking in would stress synthetic material to crack its surface over time."
  },
  {
    "user": "Victor",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Roosevelt green jr",
    "rating": 5.0,
    "message": "Very nice"
  },
  {
    "user": "Miles Flynn",
    "rating": 5.0,
    "message": "The whole show felt a little stiff at first but was fine once it got broken in."
  },
  {
    "user": "Stephen",
    "rating": 5.0,
    "message": "Roma's are classics, like a KSwiss in their time, a Nike air force, some Tims, Reeboks, etc.  An easy go to, they are getting harder to come by, so they're still popular and a go to shoe.  By coming in a multiple color array and patterns, you can't go wrong."
  },
  {
    "user": "Christopher Clark",
    "rating": 5.0,
    "message": "I like this shoe causeits made of real leather and my feet don't get wet in the damp morning grass"
  },
  {
    "user": "Jb Johnson",
    "rating": 3.0,
    "message": "I ordered them for work but they’re too tight I got a size 12 should of got a 12 1/2 or 13 it’s not true to size"
  },
  {
    "user": "Sugah",
    "rating": 4.0,
    "message": "This is my second pair I have the black ones as well, I had to size up I usually get a 7 in men but had to get the 8 because they do run small."
  },
  {
    "user": "carmen leyba",
    "rating": 5.0,
    "message": "El producto lleno las espectativas,  el size corresponde,  es de buena calidad y muy elegante"
  },
  {
    "user": "Jennifer Trotoux",
    "rating": 5.0,
    "message": "These shoes look great on my son’s outsized feet! Very stylish."
  },
  {
    "user": "Babs67",
    "rating": 5.0,
    "message": "Fit is smaller than US. Buy next size up then you normally do."
  },
  {
    "user": "Pammy",
    "rating": 4.0,
    "message": "GRANDSON LOVES HOW THESE SHOES FIT ON HIS FEET!  THEY ARE ONE OF HIS SCHOOL SHOES."
  },
  {
    "user": "David",
    "rating": 3.0,
    "message": "The show felt very small. I returned it with no issues"
  },
  {
    "user": "Mayra Nieves",
    "rating": 5.0,
    "message": "Bueno"
  },
  {
    "user": "bob",
    "rating": 3.0,
    "message": "The shoes look awesome. Wish sucks for me because they will never fit.  I usually wear a 12.5-13. I bought a 13.  The width isn't even close to other sneakers. Length was perfect but I can't even get my feet in without taking laces out. Very narrow feet only should buy these."
  },
  {
    "user": "The Investigator",
    "rating": 5.0,
    "message": "Comfortable, nice looking shoe."
  },
  {
    "user": "James and Ashlee",
    "rating": 5.0,
    "message": "They fit true to size and he loves them."
  },
  {
    "user": "Jenna",
    "rating": 3.0,
    "message": "So I bought these for myself using the \"try it before you buy it\" option. I'll start by saying that I normally wear women's size 10 and got the men's 8 which is my usual fit. Esthetically these shoes are super nice looking. I bought them because I have now learned how to properly care for a pair of white shoes (go me!) and they reminded me of the ones Freddy Mercury wore. Off the bat the material of these felt suuuuper cheap, like they're knock offs or something. I have a pair of white leather Pumas and you can just tell those are quality shoes. My feet are fairly thin and I have never had a problem with \"regular\" (non-wide) shoes being too small or needing wide shoes. These ones, however, were incredibly tight on my feet despite fitting size/length wise. I honestly don't think sizing up would've helped but the cheapness of the shoe made me not want to find out. I did not buy it after I tried it. But thanks for the option Amazon!"
  },
  {
    "user": "Sylvester Matthews Jr.",
    "rating": 5.0,
    "message": "I love the shoes came in time to wear with my outfit"
  },
  {
    "user": "joe",
    "rating": 3.0,
    "message": "I thought these would stretch out a little after I got them. I should have sent them back. The styling is that classic puma look but these just don't fit right. I'm wondering if they mislabeled these an 11 and they really are a 10. They are so narrow and tight at the toes. I have owned several pairs of pumas before. I don't know what the hell is wrong with these."
  },
  {
    "user": "Tee",
    "rating": 3.0,
    "message": "Runs small"
  },
  {
    "user": "Mike N.",
    "rating": 5.0,
    "message": "look great, but if you're looking for comfort, these aren't the shoes you're looking for."
  },
  {
    "user": "Mimi",
    "rating": 5.0,
    "message": "They were just what I wanted. Light weight shoe"
  },
  {
    "user": "Reaper",
    "rating": 5.0,
    "message": "Just as expected. Great comfort and style. Had the black so decided to get the white."
  },
  {
    "user": "Raziel",
    "rating": 2.0,
    "message": "Go a half size up. I ordered my size and the big toes hit the front when I stood up. Also, I must have a really narrow foot cause it was still a little wide. Just slightly. I didnt want to pull on the laces like if it was a horse in order to get the right width. Quite honestly, the only pair of shoes I had luck with were La Sportiva. Problem is, they are really freaking expensive but man, totally worth it. Not advertising for them, I have a pair. Also, I'm one of those ppl that wish ppl that comment on items give another recommendation for another product if they hate the one they are talking about. La Sportiva is the way to go."
  },
  {
    "user": "Rick Noble",
    "rating": 4.0,
    "message": "I bought these PUMAs based on their appearance and price point. I like the gum sole and wanted a white athletic shoe that had a subtle logo. I was not disappointed with any aspect of the shoes appearance. The fit however, for my feet, is not comfortable. I have a flat foot but can generally wear other popular name brand shoes in my size without difficulty. The second photo comparison is the black rubber sole of my New Balance 574s, which fit my feet great! The PUMA Roma’s fit very much like most of my Adidas tennis shoes (ie. very narrow insole and small toe box). I did not realize these Roma’s had that type of fit or I may have ordered up one size. I will still wear the new PUMAs because I like the way the look and wear them more for fashion than exercise. I’m hoping that with some wear, they stretch a little and better conform to my feet."
  },
  {
    "user": "Dustin",
    "rating": 3.0,
    "message": "I don't have exceptionally wide feet, or what I'd even call wide feet to be honest, but the shoes were super slim and tight on the sides.  It's too bad, because the design is very nice and clean and the quality is definitely there."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Not bad. My first time wearing these. Quality is decent"
  },
  {
    "user": "Alejandro Ventura",
    "rating": 5.0,
    "message": "Excellent"
  },
  {
    "user": "Robert Inguanzo",
    "rating": 5.0,
    "message": "You can really get a good kick on someone with these shoes."
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "More for an individual with narrow feet.  Looks good but cannot be worn with socks as it fits really close.  Shoes seem to be well made and looks good."
  },
  {
    "user": "Ankh",
    "rating": 3.0,
    "message": "Nice looking on my foot, 50steps and my baby toe was screaming my feet are not that wide but their not that narrow neither nicely made just to tight, back in the day (70’s)puma was my shoe ever was tight,  wore a 13 now I wear 14 companies be cutting cost on material these days make it hard to find good quality products."
  },
  {
    "user": "Remone simpson",
    "rating": 5.0,
    "message": "Toebox fits perfectly, could walk in “peach” without my toes burning me."
  },
  {
    "user": "De'Angelo Ferguson",
    "rating": 4.0,
    "message": "Every 5 mins when I walk they become untied so its kinda annoying otherwise the shoes are awesome"
  },
  {
    "user": "Porfirio V.",
    "rating": 5.0,
    "message": "excelent"
  },
  {
    "user": "manrique vargas",
    "rating": 4.0,
    "message": "Un poco mas angostas de lo esperado. Confío que con los días y el uso, el material se estire y permita mayor comodidad. No tenían talla W, por lo que tuve que comprar la que había. Tuve un problema con el envío, pero Amazon amablemente me hizo un reemplazo y todo en orden."
  },
  {
    "user": "FRFTF",
    "rating": 5.0,
    "message": "Received product as advertised.  Got it fast!"
  },
  {
    "user": "john digioia",
    "rating": 5.0,
    "message": "Fits well love them"
  },
  {
    "user": "William Haigh",
    "rating": 5.0,
    "message": "As usual with Puma needed a half size larger. I wear 11.5 in a lot of shoes but need 12 for Puma. Fantastic shoe wore very comfortably walking around Disney Magic Kingdom and Epcot all day."
  },
  {
    "user": "Holliday",
    "rating": 5.0,
    "message": "Love them."
  },
  {
    "user": "pinchofur",
    "rating": 5.0,
    "message": "Lo que recibí era lo que esperaba!  La calidad esta bien y el diseño muy lindo!"
  },
  {
    "user": "A. Walker",
    "rating": 5.0,
    "message": "I work at an auto parts store, we are required to wear black polishable shoes. every other shoe no matter the price has fallen apart quickly. Dress shoes are not made to be durable or comfortable, especially when you are on your feet, in all sorts of weather conditions , ice,snow.... so when I found these, I was willing to try them because from previous experience puma shoes have been super durable. I have worn the shoes for 2 and a half months at work, and they still look new (even after I spilled brake fluid all over them), and feel just as good as day one. on any other shoes, by the first week they would be all scuffed up ( not these).I look forward to getting a lot more use out of them. And I am curious to see how much better they work in ice, snow, slush compared to dress shoes ive had since they have a really good grip. I will most likely be buying these again when someday they do wear out. Update, 9 months later and these shoes are still going strong, the soles are getting a little wore out and my feet hurt if I do alot of walking, but for the most part still do the job.The rubber on the sides are detaching a little and the bottoms are loosing tread. They do not take water and snow well at all it soaks it right up. (nothing some water proof spray cant fix) Update 2 Well they made it 10 months, and I honestly think if I had not of accidentally put a hole in the side of them from a sharp object that almost cut my foot open at work ( not anything the materials could have prevented, phenomenal synthetic upper) I could have easily gotten another month or 2 out of them buy just putting $1 soles in them. I am still really impressed since most the shoes I wear after work fall apart much quicker and I don't even wear them as much. I estimate that I got about 1800 hours out of these shoes! Now onto pair number two."
  },
  {
    "user": "Ray Calderon",
    "rating": 4.0,
    "message": "The shoe is a lot narrower than expected, I have to use a shoe stretcher."
  },
  {
    "user": "Paul Bressi",
    "rating": 5.0,
    "message": "These fit beautifully, are a great casual shoe, and the price is incredible when you start comparison shopping for a decent shoe. The uppers are soft, the shoe is light, and the fit is comfortable. The first time I put them on, out of the box, was to try out how they felt around the house, and it was hard to tell I had shoes on my feet. That’s not an exaggeration and, yes, they were laced up. Arch support is good for me, but that's an individual thing. They are surprisingly quiet on hard floors compared to some of my other Pumas. I've only been wearing these for a couple of weeks, but I don't need more than that to tell if I like a shoe. In agreement with other reviewers you should go a half size larger when buying a Puma. I take a 10 ½ D (M) dress shoe, but my other Pumas are 11’s and they fit well. I’ve always gone with a Wilson tennis for work because sometimes I’m on hard floors for a number of hours and they’ve always given me good support and comfort. So I started out looking to replace my old Wilson Court Avengers, and after weeding out the hideous, those with few or no reviews, all the mesh uppers, and checking on brands I’ve worn before like Adidas, Etonic, and New Balance, I found myself looking at somewhere north of $70-$80 for a pair of kick around work shoes. I found nothing I liked that was reasonably priced (you notice how the price changes depending on your size) so I decided to check on Puma to see what they had and that worked out fine. The only nit I have is the tongue loop, the small twin cuts midway to 2/3 up the tongue that the laces run through to prevent the tongue from sliding into the shoe when you slip your foot in, is the Puma logo at the top of the tongue. I prefer the mid-tongue loop, but that’s an extremely small con to me compared to fit and look."
  },
  {
    "user": "Controlled Chaos",
    "rating": 5.0,
    "message": "These are comfortable overall but do tend to run a little narrow. I don't mind the snug fit for what I am using them for but they are more narrow than any other brand I have ever worn. They look nice and wear well. I like them."
  },
  {
    "user": "Shelley DeLeeuw",
    "rating": 4.0,
    "message": "Really nice looking shoe!  Kinda narrow though.  Didn't feel comfortable on my 16 year old son's foot.  Rubbed just a little on the top and sides of his feet."
  },
  {
    "user": "Menyone Crawford",
    "rating": 5.0,
    "message": "My son like everything about this shoe. He wore them for.the first time over the weekend and they look great"
  },
  {
    "user": "Naysin",
    "rating": 5.0,
    "message": "Everything was good"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The PUMA sneaker size 15 was too small for my husband who wears a size 15 which is somewhat hard to find so I was excited about finding the PUMA's in his size!"
  },
  {
    "user": "Cristian",
    "rating": 3.0,
    "message": "Mejorar la parte delantera q va con la suela porq está mui Cheo eso el zapato está bastante bien el único defecto q veo es ese q lo desluse esa parte delantera q no coincide con la suela..."
  }
]