[
  {
    "user": "David Underwood",
    "rating": 4.0,
    "message": "The insole and outer rubber sole are both extremely weak. The insole wore down within a month, with my heel tearing a pretty sizeable hole at the back of the inner lining. The rubber sole separated within just a couple of weeks and had to be glued back on. Once I replaced the insole with workman's inserts from Home Depot and took some Shoe Goo to the outer soles, they became some of the best shoes I've ever owned. Used some spray-on waterproofing and they're even good in the winter. Great grip even on ice and snow! If you don't mind some extra care, these can become some amazing work shoes.  Highly recommend... If you have some good glue and inserts for them!"
  },
  {
    "user": "J. Crawford",
    "rating": 5.0,
    "message": "First, I’m a 70+ year old male.  I’ve been wearing size 12 Skeckers sneakers for over 15 years.  Over the last few years, my foot width has changed from D width to a little wider.  I thought I would try a wider width sneaker, and am delighted that this Skechers 12-W fits my reshaped foot perfectly.  They were comfortable from the first time I put them on.  I’ve been wearing them daily, and am verily pleased  with fit, comfort, and style."
  },
  {
    "user": "L. Taylor",
    "rating": 5.0,
    "message": "I have wide feet and high arches which makes it a challenge to find a comfortable fit especially for a walking shoe. I was very pleased with these Skechers the minute I put them on. They felt like \"old friends\" that did not need breaking in. I have already put several walking miles on them and I am planning on getting a second pair for trading off. Highly recommended."
  },
  {
    "user": "sean barber",
    "rating": 5.0,
    "message": "I have very wide feet so I ordered these every few years. Excellent shoe. I do a lot of outdoor work as a landscaper and let me tell you these things will put up with a lot of abuse from me. I've even used in one. I've gone fishing so the rocks on the bottom of the river won't bother me and they still hold together. Great! I would recommend anybody would wide feet that want a big fitting shoe. This is it I would recommend. Anybody would wide feet that want a big fitting shoe. This is it"
  },
  {
    "user": "Lawrence...",
    "rating": 5.0,
    "message": "Great looking shoe-excellent fit-and memory foam gives great cushioning. I have bad feet from walking constantly on my job,bunion on big toe and occasional ball of feet pain on my other toes. This has been the most comfortable shoe for my issues.I recommend getting a half to one size larger than you normally wear if you have a wide foot and toe issues and get the extra wide width,it makes a huge difference. This is my second pair of the same shoe,Other shoe lasted 2years before wearing out.Price is fantastic.(under 50.00) and the quality of shoe is top notch.."
  },
  {
    "user": "Nicole",
    "rating": 5.0,
    "message": "My husband has wide feet so I ordered these as he had similiar ones & we can't find them in our area.  He does a lot of being on his feet & walking. I've even ordered an additional pair. He mentioned would recommend anybody would wide feet as they are roomy & he loves the memory support. Excellent shoe."
  },
  {
    "user": "Travis martz",
    "rating": 4.0,
    "message": "I work 11 hour days on concrete on my feet the entire time.  These shoes are very comfortable the all day long.  I've had them for a few weeks now and the only downside I have to them is they squeak with every step on polished concrete."
  },
  {
    "user": "tabby",
    "rating": 4.0,
    "message": "I have worn Skeches work shoes and decided to try these! I wear 11E but these seem over sized and slightly wider then other Skechers E style. Good looking shoe if I could I would just get 11 and hope there right sized!"
  },
  {
    "user": "Kung Fu Ken",
    "rating": 4.0,
    "message": "Very comfortable nice looking shoe and well made for the most part. I just recieved my “Buy Again” order in the color Charcoal. The only reason I reordered is because the front outside stitching on both shoes has worn through. It’s worse on the right shoe. I wear them to walk my dog and take him to the dog park. These are my all day walk-around shoes. I was able to get 6 good months from them prior to the seams opening. I’m used to going for a year or more with my sneakers/hiking/walkin around shoes. I liked these enough for my “Buy Again” order to be placed."
  },
  {
    "user": "Mark m.",
    "rating": 5.0,
    "message": "Started a new job at a dealership and I'm on my feet 8-11 hours a day and my feet were killing me within the first week of working. Looked up these shoes on Amazon and it had great reviews, purchased myself a pair and it was amazing, like walking on clouds!!! Ended up getting my dad a pair after he complained about his feet hurting also and he loved them. Definitely worth the buy..."
  },
  {
    "user": "WeasleyIsOurKing!",
    "rating": 5.0,
    "message": "These are the only shoes I wear. Started in white when I was in my 20s, and switched to taupe about 10 years ago. The only brand that makes a comfortable shoe that is wide enough for me. I usually buy multiple pairs when the price drops to around $35-40 a couple of times a year on Amazon, and swap out every 6-9 months. I was a teacher until the pandemic started, and easily walked a thousand miles in each pair I've owned, never once had a problem with any of them. I can't say enough how much I trust these shoes, and am so thankful that Skechers keeps making them."
  },
  {
    "user": "Dennis",
    "rating": 5.0,
    "message": "I started wearing this brand of shoe after trying several others. I think I’m on my 5th pair.  When I’m ready to replace them I just go online and place my order. I don’t need to shop anymore as this brand and style is always comfortable."
  },
  {
    "user": "james clifford",
    "rating": 5.0,
    "message": "Sketchers make some really great shoes.  I had a pair that I wore for everything and 3 years later, I can still use them.  This particular pair is very comfy."
  },
  {
    "user": "Jasper3404",
    "rating": 5.0,
    "message": "Shoes arrived timely.  Looked good out of the box, fit was comfortable and I saw no flaws in manufacturing. Wife hates to take me to shoe stores, this was a nice alternative."
  },
  {
    "user": "Mike Bravo Kilo",
    "rating": 5.0,
    "message": "Fit comfortably right out of the box, no break in needed. Excellent for those of us BLESSED with wide feet. No complaints."
  },
  {
    "user": "larry haugh",
    "rating": 4.0,
    "message": "Good price I use them for walking through not best for running comfortable through  the size is always right and  comes in wide width last at least a year or more"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Just about all of my casual wear shoes are sketchers.  I prefer the arch fit shoes as they provide excellent support but these sneakers are comfortable and do provide decent arch support"
  },
  {
    "user": "Rick F",
    "rating": 5.0,
    "message": "These shoes are actually true to size stated.  They fit very comfortably and are actually \"wide\"!!!  I'm impressed."
  },
  {
    "user": "Victor Portillo",
    "rating": 5.0,
    "message": "These shoes are pretty comfortable, I don't really have anything negative to say but then again I've only wore them for a couple of days now I may end up doing an update in a few months to see how well they hold up."
  },
  {
    "user": "MI",
    "rating": 4.0,
    "message": "I bought the same size as my other skechers but they were too small, so if you are on the edge of your size, go big."
  },
  {
    "user": "Pappy Lump",
    "rating": 4.0,
    "message": "I am on my feet everyday and in constantly changing conditions. I have purchased many pair of Skechers and even now have a shoe for summer and a  hiking style boot for the winter. I decided to try a new style that looked perfect for my job, yet, they have not stood up to the demands of my job. They are coming apart from the sole after only two months of wear. I am very disappointed with these."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I wanted to leave a review for these shoes specifically because Amazon has a habit of throwing old reviews at the buyer rather than more recent ones. There aren't many with a fair critique, or they resort to \"omg it sucks/rocks\". So, here we go. After years of using TredSafe shoes due to just not having the money to afford fancy-shmancy, I bit the bullet on these shoes figuring I could at least default to other shoes if they didn't work out. Also, a lot of reviews complained on durability and such, but they were recommended, so I went for it. Durability: Uhhhh, folks must have run over their pairs with a lawn mower to get them wrecked like they were, because wow have mine been accidentally kicked into and scraped by a LOT of old metal equipment and hardware with basically no damage. Really, the only damage was a screw I somehow stepped on, drilling a hole into the bottom. I mean, it didn't poke my foot, so no harm done. Comfort: Okay, so memory foam is a big \"your mileage may vary\" situation, but generally the foam is pretty okay in these shoes. Seeing as I run around a lot more at my new job than I did my old one, these do pretty good at cushioning my 13W feet. Then again, I am also a tall dude, so the memory foam cushioning may not be as effective for me. It hasn't been long enough to really wear it out either, but again, your mileage may vary. Also depends on whether you really understand memory foam, which I kind of don't. I might be totally off-base. But anyways. Even without that, the general feel and support of the shoe is good. The fact that my heels basically never hurt after eight-hour shifts when they would tend to hurt in the old, cheap TredSafe shoes is a pretty good testament to that fact. The fit: It fits...? I mean, 13W feet, I bought 13W. It fit pretty much as expected. The only minor complaint I can make is more a special case: there isn't a lot of room for inserts. See, I'm weird and have a tendency to put more pressure on the front of my feet than the heel, and not a shoe can be found at reasonable price for someone weird like me. I'd like to be able to fit some front support into the shoes to counter that, but there's just not enough room. Maybe once I wear out the memory foam, but otherwise... Well, that's a \"me\" thing. If you walk like a normal person rather than like I did as a kid to catch late-night TV without being caught, then you should be okay. Other stuff: One other minor complaint is just a typical sneaker issue but a bit worse. When the bottoms of the shoes get wet, walking on any kind of hard floor gives off an obnoxious squeaking sound. I don't mean like \"basketball court\" squeaking. I mean like \"twisting leather\" squeaking. To be fair... They're sneakers. They'll make noise like that, but it's usually not that annoying. They do dry out pretty quick so long as you don't keep getting them wet, so it doesn't last particularly long. So... Four stars? Yeah. They're pretty good overall, and they sure do take a beating. I keep expecting something I do to rip it open, but there isn't a single tear or crack anywhere (besides the hole from the screw). Main problem is just memory foam getting in the way of using inserts, lack of front foot support for those like yours truly, and the obnoxious wet squeak. Still a solid shoe, though. Worth the money."
  },
  {
    "user": "Mike",
    "rating": 4.0,
    "message": "Shoes arrived sooner than expected and packaging was in good shape.  Shoes fit as expected.  Would have given 5 stars if the sellers return policy was more customer friendly."
  },
  {
    "user": "Oscar L.",
    "rating": 4.0,
    "message": "These shoes do not pinch and accommodate my bone spurs and arthritic feet very well."
  },
  {
    "user": "Greg",
    "rating": 5.0,
    "message": "Switched to these skechers because I couldn't find the new balance country walkers in wide that I had been wearing for years. I am a grounds worker at a small college and wear these as my daily work shoes half the price of the new balance with equal quality"
  },
  {
    "user": "Javier Guanga",
    "rating": 5.0,
    "message": "Es ideal para el diario, la plantilla es comoda, muy suave"
  },
  {
    "user": "VegasGoat",
    "rating": 5.0,
    "message": "I've owned many pairs of athletic shoes over the years. This is a very good shoe, at least for casual wear, especially given the price I paid for it here on Amazon."
  },
  {
    "user": "Daniel Boberski",
    "rating": 5.0,
    "message": "This is not my daily walker. I reserve this for appointments and shopping."
  },
  {
    "user": "Ken R.",
    "rating": 4.0,
    "message": "Love the look of these shoes. This is my first shoe by Sketchers so didn’t know exactly how to judge sizing. This one runs a bit small but acceptable. (Ordered another pair of different style Sketchers at the same time on same size and these run about a half size smaller)"
  },
  {
    "user": "Jamar Davis",
    "rating": 5.0,
    "message": "The memory foam and the extra wide foot makes this shoe super comfortable! This is my second pair of Skechers I've ordered and I've been delighted both times!"
  },
  {
    "user": "Timothy S.",
    "rating": 4.0,
    "message": "A little difficult to tighten/loosen laces because of design."
  },
  {
    "user": "rtclark",
    "rating": 4.0,
    "message": "I reorder these shoes from Amazon by just selecting \"Buy Again\" so I always get the same thing. I'm on my sixth pair I believe. The last pair needed to be replaced after putting over 500 walking miles on them in six months. They do tend to start falling apart where the sole is attached to the toe. If not for that I could probably get another month out of them."
  },
  {
    "user": "Beezi Servington",
    "rating": 5.0,
    "message": "Im very picky with shoes when it comes down to workin in cuz I have flat feet but these are actually pretty good nd soft on the feet. I work 8 hours a day nd they keep my feet from hurtin."
  },
  {
    "user": "trot",
    "rating": 5.0,
    "message": "Best shoes in a very long time. Like so much I purchased a second pair"
  },
  {
    "user": "tom r.",
    "rating": 4.0,
    "message": "I like the memory foam but I know it will degrade over about a 6 month period because I've had several pairs of these. It is very comfortable and reasonably priced but in 8 months I will have to replace them."
  },
  {
    "user": "Darius",
    "rating": 5.0,
    "message": "The sole detached from the top in less then a month. I already had to return one pair, I totally regret that I give it another try. Don’t waist your money!!!"
  },
  {
    "user": "Juan R Lopez",
    "rating": 4.0,
    "message": "Great pair of shoes, this my second pair I have ordered and I like the comfort."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Nice and comfortable sneakers but slippery when it’s wet"
  },
  {
    "user": "Ed W.",
    "rating": 5.0,
    "message": "Fit perfect. Quality is good. Hopefully, they hold up over time"
  },
  {
    "user": "Erik in NJ",
    "rating": 5.0,
    "message": "Nice sneakers, good fit and wear"
  },
  {
    "user": "Daniel.B.",
    "rating": 5.0,
    "message": "These are the most comfortable shoes I have ever had for walking. Perfectly padded, and supportive. I will by buying other colors. Nice product. I am looking at more Afterburns because I am so pleased with these."
  },
  {
    "user": "Mark M Hayes",
    "rating": 5.0,
    "message": "Great sneakers great if you have bad feet ."
  },
  {
    "user": "Chunha",
    "rating": 5.0,
    "message": "My son liked them!!"
  },
  {
    "user": "William J.",
    "rating": 5.0,
    "message": "Wore these for a weekend of rugged hiking. My feet were pleased with the comfort of these shoes and I am impressed at how well they are holding up."
  },
  {
    "user": "Darlene M.",
    "rating": 5.0,
    "message": "Good value everyday shoes"
  },
  {
    "user": "Judson Chasey",
    "rating": 5.0,
    "message": "My third pair of similar style Skechers.  I wear older pairs for mowing and walking, newest pair in public.  Fit is perfect for my wide feet and memory foam is comfortable.  Stores don’t seem to have the size & style but Amazon does at great price."
  },
  {
    "user": "Dakota",
    "rating": 5.0,
    "message": "These shoes were a replacement for identical several year old shoes and were perfect."
  },
  {
    "user": "R. Eifler",
    "rating": 4.0,
    "message": "They’re OK.  A little better than other similar use shoes I ordered.  More comfortable than some others, but not quite as comfortable as I hoped for.  Maybe comfort will improve as I break them in - the insole cushion is good.  These are really for outdoor hiking / work and such.  Good grip until those lugs wear down which would probably happen kinda quickly if used as your daily hard surface or pavement walking shoes.  For me they’re specific purpose shoes where I don’t quite need a proper boot.  As they get older I’ll use them when I push the lawn mower that my wife won’t push after I do the dishes she rarely does."
  },
  {
    "user": "Barry Brim",
    "rating": 5.0,
    "message": "This is my second pair. I use them for lawn work. Love them. The second pair fit just like the first pair. Don't change a thing. B"
  },
  {
    "user": "Leann Rayburn",
    "rating": 5.0,
    "message": "I bought these shoes for work. They fit well, but are not comfortable to wear for 9 hours at a time."
  },
  {
    "user": "Texyjay",
    "rating": 5.0,
    "message": "My husband loves these.  He's never had Sketchers before, always went for Brooks but he loves these!  The memory foam has turned him into a huge fan!"
  },
  {
    "user": "Joe He",
    "rating": 5.0,
    "message": "I found exactly what I want."
  },
  {
    "user": "Daryl Stahly",
    "rating": 4.0,
    "message": "Great shoes"
  },
  {
    "user": "gw40",
    "rating": 5.0,
    "message": "Comfortable fit"
  },
  {
    "user": "buckwheat",
    "rating": 5.0,
    "message": "Good shoes like the fit"
  },
  {
    "user": "Buz",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "M_Eric",
    "rating": 4.0,
    "message": "Average shoe, but it works for me."
  },
  {
    "user": "david gutierrez",
    "rating": 5.0,
    "message": "saludos"
  },
  {
    "user": "Drew Love Taylor",
    "rating": 5.0,
    "message": "Bought these for work, on my feet all day and lifting heavy stuff. Great choice!"
  },
  {
    "user": "max",
    "rating": 4.0,
    "message": "I appreciate the extra width lanngth and girth"
  },
  {
    "user": "Carli",
    "rating": 5.0,
    "message": "This is our second pair of memory foam sneakers and he loves them. Very comfortable fit."
  },
  {
    "user": "Caroline",
    "rating": 4.0,
    "message": "2nd pair I have owned, comfortable, reasonably durable and priced."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have ordered a few pairs of these and they are what I expected"
  },
  {
    "user": "WTC",
    "rating": 5.0,
    "message": "I like these shoes. I have had five pairs of these Skechers. The last three I have purchased from Amazon and just re-order when they are time to be replaced. I walk a lot, at least 7 miles a day, and these shoes last. I replace shoes about every 8 months. Comfortable to wear, lightweight and stand up to weather. Cut wide so my wide lat feet fit in them nicely. I will be buying another pair when the time comes."
  },
  {
    "user": "D.Blevins",
    "rating": 4.0,
    "message": "The very first pair of Skecher shoes I purchased from Amazon fit well, but they didn't last as long as the pairs I'd bought from brick & mortar stores in the past.  I took a risk on these, especially since again I wasn't able to handle them or try them on first, but, to my surprise, these seem well made and fit good. The very first time I wore them though, the left shoe was a bit tight in the toe area. After wearing them for a few hours, they must have stretched out and now they are very comfortable. Hoping these last longer than my first online bought shoes. Would recommend buying."
  },
  {
    "user": "Michael Battaglia",
    "rating": 5.0,
    "message": "Work and casual"
  },
  {
    "user": "john d burdick",
    "rating": 5.0,
    "message": "I’m a professional cleaner and on my feet all day. These shoes at proven to be the best for comfort and longevity."
  },
  {
    "user": "TBear",
    "rating": 5.0,
    "message": "My husband has very wide foot.  This is the only shoe that fits him well."
  },
  {
    "user": "Roy C.",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love this very comfortable shoe"
  },
  {
    "user": "littlebitofsunshine",
    "rating": 5.0,
    "message": "This shoe has become my husband's favorite and #1 go-to. Whenever he wears out one pair, he purchases another. He says the best part about them is the comfort. The memory foam makes walking in them a dream, instead of a nightmare like some can be. My husband does a lot of walking so comfort is the main priority. We highly recommend!"
  },
  {
    "user": "jce",
    "rating": 5.0,
    "message": "couple these with spenco diabetic inserts and you'll have comfort for your sensitive/painful feet!"
  },
  {
    "user": "StopTheInternetMonitoring!",
    "rating": 5.0,
    "message": "I buy a lot of different shoes for many different purposes.  These shoes are one of the most comfortable to walk all day in that I have had on my feet for some time! They fit well, stay tied and seem to wear well.  Time will tell on the wear side but so far, so good!"
  },
  {
    "user": "J. Conway",
    "rating": 4.0,
    "message": "First time I'd ever tried a pair of these \"memory foam\" footbed type shoes.  Since I suffer from some nasty neuropathy in the foot I thought maybe these would allow me to walk more, and more often with my dog. At first the foam was breaking-in and was causing me significant foot pain, and then about the second week everything changed and I could actually walk again without too much pain.  The foam had broken-in to my foot and it was almost like walking on a pillow.  For about 3 to 4 months that is.  Running my hand inside the shoe I could feel the depression of my foot in this foam, and the foam was now so thin that this pillow experience was no longer there.  I wore these for an additional four months as there was still \"some\" cushioning left, but nothing like the beginning.  And since I'm on a fixed income I cannot afford to buy new shoes every four months or so.  So after a year I've bought a second pair.  If the foam in these breaks down after about the same amount of time I guess I'll start looking for something else, but at least I will get some relief from the foot pain.  I suppose if you don't wear these every day like I did then they may last you longer than they did for me.  You should know."
  },
  {
    "user": "Sheila Wolfe",
    "rating": 5.0,
    "message": "Quality as expected."
  },
  {
    "user": "BIG DAWG STL",
    "rating": 5.0,
    "message": "Good fit and comfortable to walk in."
  },
  {
    "user": "Noel Job",
    "rating": 5.0,
    "message": "Like wearing shoes."
  },
  {
    "user": "Micheal J. DiTomasso",
    "rating": 5.0,
    "message": "Comfortable, Looks good."
  },
  {
    "user": "Ovidiu G.",
    "rating": 5.0,
    "message": "The shoes look like a good quality shoe, but on long term they are not as durable as I thought they will be. Otherwise they are quite comfortable."
  },
  {
    "user": "John",
    "rating": 4.0,
    "message": "Fits like a shoe"
  },
  {
    "user": "W Little",
    "rating": 5.0,
    "message": "Great product!"
  },
  {
    "user": "Michael Dyer",
    "rating": 5.0,
    "message": "Great value"
  },
  {
    "user": "D. Trend",
    "rating": 4.0,
    "message": "This is my second pair of this model. The first pair lasted about two and a half years which is not very long considering how easy I was with them. I decided to try a second pair to see if they might be more durable. I also have a pair of Aviva (Walmart) shoes that have lasted about eight years through some very rough treatment and they were only about $20. I would have purchased a pair of those if I had found them in my size."
  },
  {
    "user": "Michael McCourry",
    "rating": 5.0,
    "message": "GREAT"
  },
  {
    "user": "DeBo",
    "rating": 5.0,
    "message": "All I wear is Skechers so it’s a win win"
  },
  {
    "user": "Rick Beauchamp",
    "rating": 5.0,
    "message": "Fantastic"
  },
  {
    "user": "Steve",
    "rating": 5.0,
    "message": "Like them a lot! Could have a little more arch support but my arches are real high."
  },
  {
    "user": "Allan Georgetti",
    "rating": 4.0,
    "message": "They Are exactly what I needed for my feet!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is the 3rd pair I have ordered."
  },
  {
    "user": "Kevin Green",
    "rating": 5.0,
    "message": "Perfect!"
  },
  {
    "user": "Rick",
    "rating": 5.0,
    "message": "I'm a big fan of Skechers and these did not disappoint. I have bad feet, but the souls of Skechers forms to my feet, making them as comfortable as I can hope for.  They're stylish and fit well. If there is any negative to Skechers, it is that they don't last as long as some other name brands, but that's any easy tradeoff for the comfort they provide."
  },
  {
    "user": "Dylan is not chillin",
    "rating": 5.0,
    "message": "Nothing really wrong with the shoe, the foot support is nice but I need more arch support and this shoe doesn’t have any. It’s kinda squishy but you do need a sole implant. The shoe is very nice and good to go hiking or everyday walking. Worth the buy in my opinion!"
  },
  {
    "user": "samg",
    "rating": 4.0,
    "message": "These are great shoes!! Miss the back loop to help pull on."
  },
  {
    "user": "MATTHEW J PRZYWARA",
    "rating": 5.0,
    "message": "Love this sneaker, love how they fit and definitely would buy again."
  },
  {
    "user": "Taya Davis",
    "rating": 5.0,
    "message": "I have several pairs. I have a left shoe on a pair I just started wearing and the sole has separated from the shoe. I the return window passed, but I feel since I  just started wearing this pair I should be able to return in exchange for new pair."
  },
  {
    "user": "Joe",
    "rating": 5.0,
    "message": "Looks great and very soft insoles"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My boyfriend really loves these shoes we only buy Sketchers brand they are comfortable shoes, myself included"
  },
  {
    "user": "Bill",
    "rating": 4.0,
    "message": "Product is good quality for peice"
  },
  {
    "user": "Stephen Bell",
    "rating": 3.0,
    "message": "At least on wide sizes, the memory foam cushion doesn't cover the entire area where your foot rests.  There is about a one-quarter inch gap between the foam and the edge of the sole, meaning the outside edge of your foot (where you place a lot of your weight) and the  tips of your smaller toes fall into this gap.  The result is quite uncomfortable.  Markedly worse than a shoe with no cushion at all. I do not know if this issue is present un the standard widths as well.  I do know that unless this design flaw is corrected, this will be my last pair."
  },
  {
    "user": "Sergio Alejandro Chitiva Cardona",
    "rating": 5.0,
    "message": "Me gustó mucho el producto, cumplió con todas las expectativas."
  }
]