[
  {
    "user": "Laura Jepsen",
    "rating": 4.0,
    "message": "Liked look of sneaker. Sorry it did not fit"
  },
  {
    "user": "Erica",
    "rating": 5.0,
    "message": "Moved from the same pair of tennis shoes in white to these navy blue ones for fall.  They fit great and have a very short \"breaking in\" time."
  },
  {
    "user": "Paulette",
    "rating": 4.0,
    "message": "The shoe that's always mentioned to be loved by the Duchess of Cambridge.  It is very well made, true description of the color, and fairly comfortable.  This is actually my second purchase of this shoe.  The first one, I ordered was a size 8 and it was way too loose and was way too big for me.  So, while reading the description, they do run a bit bigger than usual, so I try again.  I also changed it up and ordered the platform style.  I could always use an inch boost on my height. Anyways, today is the first day that I wore the shoe around the house.  First thing I noticed, WOW....very stiff sole.  As soon as I step to walk, my heel is sliding, not completely out, but you can feel and hear it sliding in and out.  Walked around some more to decipher if it is the shoe or my foot.  It's the shoe.  The sole is STIFF.  There is really no give to it.  I understand that I got the platform style, however, I would think it will bend some. I really would like to love this shoe.  I am still on the fence if I should return it.  Maybe I'll use it around the house a few more times and see how it feels."
  },
  {
    "user": "Deborah Russell",
    "rating": 5.0,
    "message": "I love this platform shoe"
  },
  {
    "user": "Jordan",
    "rating": 4.0,
    "message": "Super cute!! I just got these and I love the look already. I ordered a US 6.5, my true size…couple of notes about that: • Feel: These shoes are SOLID. Quite a bit of heft to them, mostly due to the platform. Good news is I can throw out my ankle weights now! The canvas is pretty inflexible at first, especially around the toe, so you’re definitely not getting Converse-level comfort right off the bat. • Fit: If you have a narrow heel, like me, you’re going to want thicker socks or tights. I second the reviewer’s suggestion to get some heel inserts. Because the platform is so solid, there isn’t much give and the back of the shoe will slide right off your foot with every step. I was able to adjust the rest of the shoe with the laces and they fit decently everywhere else! • Function: These are not walking shoes. Great for a stroll or photos but not much else. That’s all I needed them for, though. You won’t be able to bend your foot all the way because of the platform, you can kinda see that in my second photo. Overall, these are very cute but definitely not something you should wear everyday. I purchased mine with a gift card, but if $45 is too steep and you want them to last I’d keep that in mind. If I can break these in at all I will come back and update! :)"
  },
  {
    "user": "Erin S.",
    "rating": 5.0,
    "message": "Fit perfectly!"
  },
  {
    "user": "Brandyn",
    "rating": 3.0,
    "message": "I put heel stickers in the back but my feet still walk out of them unless I tie them super tight or don’t wear socks. I ordered a 6.5 but I got a 7 so def rec sizing a half size down"
  },
  {
    "user": "Ali",
    "rating": 3.0,
    "message": "Too big"
  },
  {
    "user": "Laurie  Smith",
    "rating": 3.0,
    "message": "Cute shoes correct size ordered and wrong size sent."
  },
  {
    "user": "Emilee",
    "rating": 4.0,
    "message": "I usually wear a 7.5 or a 7, and a 7 in this shoe was entirely too big. I ended up getting an entire size smaller, a size 6. Also good to know- they are very low on the ankle and require the no show type of socks."
  },
  {
    "user": "Cjsinger",
    "rating": 4.0,
    "message": "Ordered to wear with dresses or flared pants.  Purchased in 2 sizes, neither fit properly. Returned one pair to Amazon as always. Other pair had to be  returned to the UK via UPS. Very inconvenient."
  },
  {
    "user": "Brianna Griffin",
    "rating": 4.0,
    "message": "My foot completely slid out of the shoe and I bought my normal size . Would have loved if these fit correctly . Unfortunately had to return them. Size down !"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I read all the other reviews and sized down half a size. I’m usually a 7 and I ordered 6.5, and it was a perfect fit. Pros 1) I found it really comfortable. To my surprise, it didn’t need any breaking in. The material of the shoe keeps its shape yes is pretty pliable, there was no stiff part of the shoe. Yes, there is not much arch support but the platform provided so much cushioning from the hard ground. I wore it almost everyday on holiday and walked over 20,000 steps per day. 2) I love the look of it. Looks like an elevated basic shoe and somehow the cutting and design makes my wide feet look quite narrow. It also matches almost everything! Cons 1) Like everyone said, your heel does tend to slip out the back when you walk. I tied my laces in a cross pattern and pull it super tight at the end when I’m tying my laces, and that solved it. 2) It seems to get dirty quite easily. I personally like the worn in look for my sneakers but others might find it hard keeping it white! Overall, I would highly recommend it. I love my pair and wear it all the time!"
  },
  {
    "user": "CA",
    "rating": 4.0,
    "message": "These sneakers are so cute but sizing is off. I wear a size 6-6 & 1/2. I ordered the 6 & the were too big. It’s more like a size 7. I’m keeping & filling with tissues so they stay on because they are so cute."
  },
  {
    "user": "Marie",
    "rating": 3.0,
    "message": "So wanted to love them. I ordered my normal 6.5, they were too big, so I sized down to a 6. They fit ok,but the seam tongue of the shoe made it uncomfortable,  so I decided to try the 6.5 again but add a heel cushion to make it fit better. It didn't work, while the shoe sort of fit,  it was still to large and the weight from the soles kept pulling the show off my feet. Sadly I had to return. I love Superga, I just wish they either made them less unisex or some more tailored to a woman's narrower foot. I did find some lovely Kate Spade by Keds platforms and the Toms Platform Sneaker also fit well."
  },
  {
    "user": "Mai",
    "rating": 3.0,
    "message": "The sneakers themselves are super cute. They look great BUT they are hard to walk in because they don’t bend AT ALL. The entire sole is thick as you’d expect from a platform sneaker. But because it’s all one level, it feels like you have to lift your entire foot to clomp to the next step, like a wooden clog. If you don’t have to walk far or just want to take pictures of yourself looking cute, these might work for you."
  },
  {
    "user": "jamie poukish",
    "rating": 4.0,
    "message": "I’ve had these shoes in my “save for later” for months and I decided to just go for it! After reading the reviews I was a little worried about the sizing and rubbing on my heal. So far I’ve just worn them around my house and it is true about the rubbing but I think if you wear socks with them and wear them in they will be ok. I do not think these would be good walking shoes until you’ve worn them in for that reason because I was getting some rubbing on my heal that would had easily turned into a blister if I hadn’t taken them off. But with all that said I am very happy with my purchase! They are so cute! I am between sizes 8.5 and 9 and went with 8.5 and they fit perfect! 👌🏼 Love these shoes!"
  },
  {
    "user": "Brandy H.",
    "rating": 4.0,
    "message": "This actually fit perfect. I wear a 9 or 40 and fit was spot on. Nice chunky slightly platform sneaker that looks super clean, adds a bit of height and very cute. Added just the height I needed to make my legs look a bit longer and leaner."
  },
  {
    "user": "Tricia C",
    "rating": 4.0,
    "message": "These sneakers are very cute and fit as expected.  They did not rub in bad ways or cause blisters, which was a plus!  I get a lot of compliments!  The only reason I gave 4 stars instead of 5 is that, due to the platform thickness, they don't bend and so when you walk they will need to slip off the heel a bit.  I have gotten used to it, but would avoid wearing these shoes for super long walks.  For cuteness and relative comfort, I highly recommend!"
  },
  {
    "user": "Bause",
    "rating": 5.0,
    "message": "Had bought these shoes for my sister who had fractured her foot and had to wear a boot.  Unfortunately her regular shoes didn't not match the sole height difference for the boot and caused her to be uncomfortable while walking.  I had searched many shoes to look for the right size and ended up buying these. Given her changed mood she absolutely loves these!! although she is only currently wearing one shoe she mentions it to be one of the most comfortable shoes she has ever worn. She usually goes for a wider shoe width which was a main concern when purchasing this pair but it was an exact fit and comfortable for her needs. The sole height difference is a big difference in which she is able to have some normality in being able to walk/stand while she recovers. For those that wish to buy a shoe with a similar situation and shoe width is an issue, fear not as these could potentially help in keeping feet comfortable without putting unneeded pressure on either foot to maintain balance."
  },
  {
    "user": "Angie Cautillo",
    "rating": 4.0,
    "message": "I’m usually a 6.5 and I ordered a 6.5 it was wayyy too big. Although really cute shoe I’m going to order in smaller size."
  },
  {
    "user": "Larissan",
    "rating": 5.0,
    "message": "I LOVE these shoes! I have several pair of Superga platform tennis shoes. I have wide feet with a high arch, and I find these to be very comfortable for me. I can walk for miles in these shoes and my feet are fine.  I wish I could find more colors, but they are all sold out in my size. If you have normal to wide feet, the rounded toe will be very comfortable for you."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I have yet to try on the shoes so I will update this review once I've walked a mile in them. My initial opinion is that these are cute, weighted, good quality shoes. I believe I paid close to $80USD for these???..and they came slightly scuffed and needing a new box due to damage issues during transit. I'm disappointed to see multiple scuff marks on my brand new white shoes."
  },
  {
    "user": "Julia",
    "rating": 4.0,
    "message": "Love how cute these shoes are! I have been wanting to get some platforms like these for awhile and finally decided on these as an early birthday gift. I sized a half size DOWN from my normal size and they fit great. It Is true what previous reviews are stating about the shoes sole not being flexible causing the shoe to slide on the ankle when you walk. If you tie the shoe tightly it’s not that bad. You will definitely need to wear higher cut socks with these because of that. That being said- I have never tried on other platform shoes so Maybe they all have inflexible soles because of The platform thickness? Not sure , but regardless the shoes are cute enough it doesn’t bother me! You will need to keep a tide stick and a Magic eraser on hand. The scuff easily as any white shoe would. My only reason for 4 stars instead of 5 is because of the sole."
  },
  {
    "user": "Utente F.",
    "rating": 4.0,
    "message": "I want to say a couple of things about this product. First, the shoes are simply beautiful! They look perfect for spring /summer! Comfortable but also chic. Second, the sole is heavy, it is in rubber so don't think to buy light running shoes, that is not the case here. Third, they are a little bit large in the arch part, the socks slip sometimes. Fourth, I was confused about the numbers because numbers didn't match with  centimeters! I chose the correct number only because I know that I usually wear 38.5 (US W 8) which is around 25 cm! I bought the number 39 and it is perfect. So, don't look at the size chart (even in the superga web site is not correct!) The centimeters don't match with the numbers! Just take your usual number and I think would fit perfectly. I put the picture with the right size chart that you can find on the box! I hope this review can help you!"
  },
  {
    "user": "Sydney P.",
    "rating": 3.0,
    "message": "So these don't bend at all because of how the platforms are made. Walking in these are kind of hard and your feet will come out of the heel part while you are walking. I even put heel insole's in them like other's have said to do and the I still have the problem. I would just be weary if you want these and they are loose at the heel part."
  },
  {
    "user": "Madison",
    "rating": 4.0,
    "message": "I really like the look of these, but man do they kill my ankle. I walk around a lot and even with long socks on these rub me until my skin breaks. I've tried heel protectors under the socks and it still doesn't work. Not gonna lie though I still wear them since they match so much."
  },
  {
    "user": "SVR",
    "rating": 4.0,
    "message": "Based on reviews, I ordered a 6.5 (European 37) and normally wear a 7. They are definitely snug in the toe and my toe is right up at the front of the shoe but because they are canvas, I expect they will stretch and comform to my foot a bit with wear. As I also read, the laces really need to be tightened because even with the snugness in the toe, the heel still slips out a bit. The platform is so cute with so many clothes from shorts to dresses, skirts, jeans, etc. They are heavy so I will probably not be wearing them when I have to walk for any length of time, but they are definitely cute. I wore them without a sock to go shopping and run errands and so far, no rubbing. Although I do expect some to occur with additional wear until they wear-in. I tried a no-show sock and because the heel slips a bit, the socks ended up bunched up under my foot inside the shoe. But I am still happy with this purchase!"
  },
  {
    "user": "ashley michael",
    "rating": 4.0,
    "message": "They run a little large, but they are comfy and a wonderful statement shoe. I wasn’t sure about the platform look and I love these. They are comfy but do run a little big. I would recommend going down half a size."
  },
  {
    "user": "Maryum  Mateen",
    "rating": 2.0,
    "message": "If I could go back, I would not purchase these shoes again. In fact, when I get compliments, I make sure to let people know that these shoes are the worst way I have ever spent my money. Are they cute? Yes! Do I love the way they look with outfits? Yes! Do I wear them because I bought them? Yes! Did they make my feet bleed on countless occasions so much so now the inside is stained? Also yes!! Insoles didn't work. Sizing down didn't help, and these are so uncomfortable to walk in. I recommend spending the few extra bucks to get Air Forces instead. These are not worth the pain and discomfort. Though I won't lie, they are very cute."
  },
  {
    "user": "Candida Eittreim",
    "rating": 4.0,
    "message": "This is my second pair of Superga sneakers. The first I bought from a JJill store. That pair after breaking in, are very comfortable and attractive. I paid $89.00. In the shoe box was a tag I used to go online and verify this was a true Superga shoe. My pair bought here didn't have the tag verifier. The boxes are different. My first pair has 5 eyelets for shoe laces. This pair has 6. They fit well and are very comfortable, though very slightly loose  The platform soles give my 5\" frame a nice little lift. I am going to buy some coloured laces to switch off with different outfits. The body of the shoe is not smooth canvas. It is, like my first pair in navy blue, a rougher woven material. I like it because it is different and raises it above the average canvas sneakers. I doubt these are genuine Suoerga's. Still close enough for the lower price, to keep them. Casual enough to wear with chino's, jeans or shorts ad classic enough to wear with a skirt. A good buy."
  },
  {
    "user": "A. Purse",
    "rating": 3.0,
    "message": "Not good for too much walking.  Stiff and a little big.  Cute though."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "They're cute, but ended up returning because the sole is too stiff and my foot kept sliding out the back even though I sized down. Zero arch support as well. Have a feeling these would work if they weren't platform but alas, the height was was I really needed."
  },
  {
    "user": "Chanel Elizabeth Dootson",
    "rating": 5.0,
    "message": "These shoes are SO cute - I love the little rose gold accents on the eyelets. Adorable! I’ve purchased this brand before - white platform sneakers without the rose gold eyelets and loved them! Had to grab these when I saw the rose gold eyelets. These are durable and comfy! Awesome price too!"
  },
  {
    "user": "Angelica Silva",
    "rating": 5.0,
    "message": "absolutely LOVE how this shoe fits 200000%! I wish I read reviews first and sized down half or one whole size though. I ordered my true size and they literally slip off of my heel while walking. they definitely are not any type of comfy sneaker but more of a fashion statement shoe! I was worried because in a few reviews and even the product photos they have dirty spots but mine came in great condition. I bought mine at $30 and not they’re $80 on the same listing and that confused me a lot?? I’m just chalking it up to me being a few seasons late. :) 10/10 would recommend"
  },
  {
    "user": "Woogly",
    "rating": 3.0,
    "message": "I absolutely loved these so much so I bought multiple pair the down side is they are NOT  a long lasting durable shoe so cute fairly comfortable considering it kind of felt like you had a brick strapped to your feet before you got them broken in. Will also add there is NO bend to this sole lol its literally a brick. All that aside these were great I'm on my feet a lont and I had NO leg pain at all after buying these shoes I loved them. The only reason it's getting 3 stars instead of 5 is literally the durability it didn't take long for them to tear up which makes me so sad because they were great shoes 😢"
  },
  {
    "user": "KimmieK",
    "rating": 5.0,
    "message": "I love these shoes! They were a bit stiff at first, but once you break them in they’re soooo comfortable and versatile! I can wear them with jeans or a summer dress. They also clean easily!! Love these!"
  },
  {
    "user": "Maureen Farley",
    "rating": 4.0,
    "message": "I love the look of the sneaker. I even think they are very comfortable, especially since I am having a lot of issues with my feet, but I can’t walk in them because they are made so heavy they flip off the back of my feet. I have tried tightening the laces tighter, but still flip flopping. Sorry but if I can’t walk in them what’s the sense in having them. SORRY NO GOOD!! The shoe it self fits great if your sitting down. They are just too heavy."
  },
  {
    "user": "Tori",
    "rating": 4.0,
    "message": "Bit wider in the back and the ankle area."
  },
  {
    "user": "bobbysgirl",
    "rating": 5.0,
    "message": "I have had tendinitis in both feet so I am very picky about shoes. I admit I bought these because of how they look and not the comfort factor. These shoes were the most uncomfortable tennis shoes I have ever broken in..I had to use band aids on the top of my foot because they rubbed up against my skin so bad. I almost donated them, BUT, they are so darn cute I pressed on and carried band aids in my purse. I am so glad I did because now my superga's are the most comfortable shoes I own!!! I urge you to give these shoes a break in period before you judge them! The sole is so thick that they need time to get a little flexibility..but these shoes will perfectly conform to your foot...like a great pair of jeans, and you'll never want to take them off. Over the last few years, my husband and I will go the the amusement park for a few hours and I always end up in excruciating foot pain and can barely walk back to the car!! We went to the park a few days ago and I wore my Supergas. After 3 hours of straight walking my feet felt fantastic!!! Going to order 2 more pair!! Ladies, before you return these, break them in...it's a painful process but well worth it in the end!! BTW, I usually wear a 6 1/2-7 in tennis shoes and I ordered the 36/6 and they are perfect. I also have a  wide foot and there is plenty of room in the footbed."
  },
  {
    "user": "Carmela",
    "rating": 4.0,
    "message": "the back of the sneaker slipped off my heel even though I orderes 1/2 size smaller.  I wanted to love them, ugh"
  },
  {
    "user": "Jennifer Clark",
    "rating": 4.0,
    "message": "I have purchased Superga’s before and I love them. I am also always true to size (7). These were just too big and slipping off my heel. Otherwise they were super cute! I decided to return them for now and will reorder another time"
  },
  {
    "user": "Beth Chu",
    "rating": 4.0,
    "message": "Cute shoe but it’s far too big. I ordered my normal size 7.5 but I feel like I’m wearing an 8.5."
  },
  {
    "user": "Maria R.",
    "rating": 5.0,
    "message": "They are super cute and super comfortable. I’m regularly a size 7.5 and I did as other mentioned on the reviews to size down so I bought a 7 and they are perfect."
  },
  {
    "user": "Angela",
    "rating": 2.0,
    "message": "The media could not be loaded. So cute but I can't wear them. The first trime I wore they they straight RIPPED my heels off! Sucks because they're so cute! They were pretty spendy for them to be SO uncomfortable."
  },
  {
    "user": "Veronica M.",
    "rating": 5.0,
    "message": "All the other reviews are correct. It's a tricky fit. I'm a size 7 and purchased the 6.5 and they're still too big. But that's ok because I bought heel pads as I heard these are notorious for rubbing in that area. Even with the heel pads when I walk they off and on my heel as I step. I don't care though because I love them! I also bought the classic in a size 6 so that I wouldn't need to get heel pads but they were too small :( i'm returning them now and purchasing the 6.5 and hoping that they fit because they are so stinkin cute. They are not uncomfortable to walk in all day either. In fact, they are as comfortable as my Nike's I wear to the gym. Although the fit is tricky, I recommend these shoes if you don't care about the figuring out the right size thing or the rubbing on the heel thing, as they are super duper cute."
  },
  {
    "user": "kat",
    "rating": 3.0,
    "message": "I think these shoes are so cute, but I was disappointed when I couldn’t get them to fit well. I tried both a 6.5 and 7. The 6.5 was too short, and the 7 (my normal size) was correct in shoe length, but impossible to walk in without the heel slipping out, regardless of how tight I tied them. I wanted to love them, but the design is flawed!"
  },
  {
    "user": "Jackie Wade",
    "rating": 4.0,
    "message": "This was my first time purchasing a shoe like this. I purchased them for my trip to the Phillippines which was where I experienced my first wear and what a mistake. I had blisters on the back of my foot by the time I returned to my Airbnb. I purchased gel protectors to add inside for the second use, however, the bagginess of the shoe still made the wear very uncomfortable. I have not taken them out of the box since. You can view pictures of me wearing the shoes in Phillippines and see the heel of my foot coming completely out of the shoe as I pose on Instagram @iamjackiewade"
  },
  {
    "user": "Casandra Lopez",
    "rating": 5.0,
    "message": "This is kind of difficult to explain, but I'm a 7 1/2 US. I got two sizes smaller so 6 1/2. The shoes fit almost perfectly, but I will say that my toes (which are long) are about a millimeter away from being squished completely so yes, the shoes are tight-fitted and this is also with those skinny,half, no-show socks... so.... I know I have to break them in and when I do, I know it'll be fine. Walking is a bit of an adjustment since well, they are platforms and flat platforms too. It adds about 2 inches to height. My foot is narrow with a small heel and the shoe itself is very narrow. I'm flat footed and I can confirm that the shoe itself is flat too so it works fine for me! lol For really arched people this might be a problem. Think converse. The design of the shoe is beautiful! I can see myself wearing with shorts, pants, dresses, long coats, etc. The color is white and a very clean white too. I would definitely not wash these shoes like ever because I'm sure they shrink from the type of fabric it has."
  },
  {
    "user": "Annette",
    "rating": 5.0,
    "message": "I love these sneakers!! It fits a little loose but it is my fault because every review said to order your size or size down and I ordered my size instead of sizing down but other than that it’s a beautiful sneaker and comfortable.. a little on the heavy side but I don’t mind that. I’m in love!"
  },
  {
    "user": "Maria Cassetta",
    "rating": 3.0,
    "message": "I want to love these but they are just too big. I’ve tried adding leather heal pads and thick socks but still my foot slips out. I only wear them if I don’t have to walk much. They are so cute I’m thinking about ordering another pair but if I go it’ll be a full size smaller!!"
  },
  {
    "user": "tracy lazar",
    "rating": 4.0,
    "message": "They run in the big side. My heel slips up and down, even when putting in a heel gripper"
  },
  {
    "user": "Lawrence Barfield",
    "rating": 4.0,
    "message": "Love the shoes been looking all over for shoes like these and now I have them"
  },
  {
    "user": "Kim",
    "rating": 5.0,
    "message": "Superga are the people's shoe of Italy and the shoe of my choice!! I always go up a half size in Superga EXCEPT in this platform tennis show. the extra weight made the shoe seem a bit bigger and my regular size was the way to go. Keep in mide there are European sizes. And (oddly) a 38 is an 8 a 39 is a 9. There is no 38 1/2 option. There is a 37 1/2 which would be comparable to a size 7 USA."
  },
  {
    "user": "dina",
    "rating": 5.0,
    "message": "These shoes are incredibly cute! I was concerned about so many people having issues with sizing and being very uncomfortable. I have found the solution guys; Gel heel inserts!! I’m normally a size 7 and only went down half a size with theses (6.5 = 37) they seemed okay but still slightly roomy. On top of that I felt how stiff and flat they made my feet feel. The perfect solution is to get a gel arch insole. This way it takes up that little roomy feel you have at the back and are instantly more comfy! I think if I went down a full size I wouldn’t have had room for gel heel insoles and I’m telling you, you NEED foot support inserts for these babies, otherwise you are going to be uncomfortable. So in conclusion, go down only a half a size, leaving room for heel support inserts or full arch and heel supports insoles. Enjoy!"
  },
  {
    "user": "Hannah Hicks",
    "rating": 4.0,
    "message": "I love them but the label on the shoe isn’t black and red, it’s white and that’s not how it was pictured nor in any of the review photos where any of there’s white like mine. So that’s my only complaint which is why I gave 4 stars but they are so cute! Traded in my AF1 for these"
  },
  {
    "user": "Stephanie",
    "rating": 5.0,
    "message": "Love these shoes! I have one other pair that I bought directly from the Superga website, but when I saw these on sale for $50, I had to get them! I’m between an 8 - 8.5. I read the other reviews saying to go a half size down, but I wouldn’t recommend that. I went with an 8.5. The original pair I had (also went with an 8.5) have me blisters as I wore them in. I recommend going with your regular size & wear socks at first! Would 10/10 buy again these from Amazon again 😃"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I usually wear a size 7 and downsized to a size 6 based on reviews. It would have been better to not downsize at all or only go down to a 6.5 as they were entirely too tight! Even though they were very tight the heel was also slipping unless I tied them very tight so not sure if it would worsen if I went with the 7. Super cute shoe though, wished they fit."
  },
  {
    "user": "pfh8888",
    "rating": 2.0,
    "message": "The sides of this shoe come up too high to it is very uncomfortable.  I've had to return it."
  },
  {
    "user": "María Fierro",
    "rating": 3.0,
    "message": "Me llegó una talla mas grande de la que pedí! De resto todo ok."
  },
  {
    "user": "Samantha",
    "rating": 4.0,
    "message": "Love all the shoe so cute! I bought it a half size smaller because of the other reviews but they were too small so I got my normal size and they fit perfect. The only thing is my heel slides in them a little when walking but other then that love them!"
  },
  {
    "user": "Ashley Johnson",
    "rating": 4.0,
    "message": "I bought these for simple style not really comfort. These shoes are not comfortable enough to walk around in all day, but they are cute for making runs. The shoes does not bend with your foot very well due to the thick platform sole. I don't get much wear out of them as I did when I first purchased them. I wish I went for the slip on/backless version for easier wear, but this style was more than 50% off when I purchased and the other style was still full price."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These shoes are so cute! They do run a little on the larger side, so I have to make sure my laces are tied super tight so I don’t twist my ankle while walking. But other than that, comfy and trendy!"
  },
  {
    "user": "Leila",
    "rating": 3.0,
    "message": "Always wanted a pair but Clunky, heavy, heel comes out the back even though it’s the right size. Not comfy. Look is cute though"
  },
  {
    "user": "Araceli",
    "rating": 1.0,
    "message": "I’ve tried so much to get these shoes to work for me. From tying the laces tightly, wearing thick socks & even bought stick on heel inserts. These shoes are crazy heavy & they slip off my heel with every step. Super uncomfortable to wear & walk in. It’s not that they’re too big, they’re just heavy & won’t  stay on my foot when I step. Unwearable but it’s been too long for me to return. :("
  },
  {
    "user": "C. Moore",
    "rating": 2.0,
    "message": "I just sat down on a bench outside my office to write this review on the way in from the parking lot because these shoes are that terrible. The platform is adorable and very on trend. Don’t fall for it! The platform sole won’t flex when you walk, so the heel slips with every step. They’re the most maddening purchase I think I’ve ever made. Maybe they’ll loosen up, and I’ll definitely update my review if so. I just can’t see myself wearing them and walking like a weirdo long enough to find out."
  },
  {
    "user": "E",
    "rating": 4.0,
    "message": "Cute shoes. But a half size smaller."
  },
  {
    "user": "Jacqui Salandra",
    "rating": 5.0,
    "message": "I LOVE these shoes. They go with everything and I wear them all the time. The platform gives the perfect amount of height."
  },
  {
    "user": "No Name Please",
    "rating": 5.0,
    "message": "These black platform Superga sneakers are very comfortable, and are true to size. Definitely what I was looking for. The platform is just the right amount of height. Enough to give me the extra height I wanted without looking silly. (I am 5’4” for reference) These look perfect with my split hem flared leggings. The sneakers feel good on, feet are supported, and the width is true as well. They are well made, durable, and are on trend. I am super happy with this purchase."
  },
  {
    "user": "Lisbeth Ceballos",
    "rating": 4.0,
    "message": "Would definitely go down a size like recommend! I’m usually a 7 1/2-8 and the 7 was a good fit maybe a little big! Great shoes overall"
  },
  {
    "user": "Lauren Y.",
    "rating": 2.0,
    "message": "How anyone gives these shoes a positive rating is beyond me. I gave two stars for the look of the sneakers. They are very cute and go with pretty much everything but that is where the positives end. These are SO uncomfortable. They are like walking on cinder blocks. I’ve tried to wear them in to see if they will become more comfortable over time but they will not. I’ve never worn such an uncomfortable sneaker. Save yourself the pain and find a different white sneaker."
  },
  {
    "user": "E",
    "rating": 5.0,
    "message": "I have to lace these so tightly I feel like a dork but they literally won’t stay on your feet otherwise despite being the correct size. That being said, I got them for such a great price I don’t care"
  },
  {
    "user": "Andrea",
    "rating": 3.0,
    "message": "LOL my bf saw these and said they were UGLY. I still think platform is cute, but these are not very comfortable… the back slips off the shoe if you don’t tie it very tight. There’s no flexibility to the sole. I’m not walking normal in these shoes."
  },
  {
    "user": "G",
    "rating": 4.0,
    "message": "Great price and cute shoes but I wear a size 8.5 and had to size down to a 7.5!"
  },
  {
    "user": "Russiek",
    "rating": 4.0,
    "message": "I like the overall look of the shoe, it is a white canvas material.  The heel area was too shallow and my heel would pop out when walking. I wore low rise/cut socks and they showed more than I wanted them too also."
  },
  {
    "user": "Kindra jonas",
    "rating": 4.0,
    "message": "Worth it"
  },
  {
    "user": "marie",
    "rating": 4.0,
    "message": "Good quality. No blisters, even without socks. But, heel slips off so I have to tie the laces tight. I wouldn't recommend going 1/2 size down though because your toe may be squished. It's really a personal choice. I recommend these shoes."
  },
  {
    "user": "Samantha Edgerton",
    "rating": 4.0,
    "message": "Overall, I do like them. They match the picture. I ended up adding an insole to give some support since there is none. They are a bit longer and narrower than expected, but I do like that they give a bit of lift for my longer jeans."
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "i would get a half size down - if you can! i got a 7 which is pretty true to size for me with other shoes - i would have gotten a 6.5 in these! i do love them though i just wear a thicker sock with them when i wear."
  },
  {
    "user": "Dave Kimmel",
    "rating": 4.0,
    "message": "The picture of the item has the traditional red, white and blue Superga tag on each shoe. The shoes that arrived have a white and silver tag. This may not matter to some people, but labels matter to most teenagers. My daughter was unpleasantly surprised, and questioned the authenticity?"
  },
  {
    "user": "Galloway",
    "rating": 5.0,
    "message": "This is the 2nd pair of Superga sneakers I've purchased. The last pair was similar to this but slip ons and I loved them so much I bought this pair. The others (purchased in spring 2019) are still going strong but white tends to get dirty. They are washable but wanted a bright white pair to wear to work. This platform sneaker is perfect! Just as comfy and looks super cute with a casual cropped pants suit for work! Love my Superga sneakers!"
  },
  {
    "user": "Jersey",
    "rating": 5.0,
    "message": "I actually bought a half size 8.5 and a full size 8 down from  my usual shoe size. From previous reviews I knew the shoe ran large. I ended up with the 8 ( I am a size 9 usually). My heel kept coming out of the back of the 8.5 and the 8 fit much better. The shoe is seriously cute and will look great with pants, shorts and some dresses. Very comfortable and has great support."
  },
  {
    "user": "ella",
    "rating": 5.0,
    "message": "I am typically a size 8 in shoes. For these I ordered a US size 7.5/EU 38 and they fit perfectly. The shoes are platform so they do have a little weight to them. This is fine but causes the back to move a bit when waking (even if tied tight) which is why I imagine some reviewers reported discomfort/ankle pain. They do not feel totally flat inside but they do not have a great amount of support. These seem more fashion over function - I think they will be comfortable during daily activities but are not really for sports/hiking/etc. Great to catch them on sale!"
  },
  {
    "user": "Crystal",
    "rating": 3.0,
    "message": "It feels like you are walking on blocks. Not very comfortable"
  },
  {
    "user": "Rose",
    "rating": 4.0,
    "message": "I wanted to love these but they fit about a half size too big. I’m not sure if it’s something with the Amazon version or with Supergas overall. Not a bad shoe but size down a half size."
  },
  {
    "user": "carmax1423",
    "rating": 5.0,
    "message": "Súper cómodos, tallaje correcto, los amo y no puedo dejar de usarlos"
  },
  {
    "user": "Niraj prasai",
    "rating": 4.0,
    "message": "This one is a beaut. I just got them in the mail haven’t worn them out but did try them on and they are gorgeous. The perfect platform height for me. I don’t know how comfortable these are tho but can update later. p.s it’s true to size, whoever said buy size down...don’t. I usually wear 7 and I bought 6.5 because of all the reviews 🙄and it’s a little snug."
  },
  {
    "user": "DK Sullivan",
    "rating": 5.0,
    "message": "These shoes are super cute, however they take awhile to break in and fall apart easy. I love the height and look of these shoes however I end up needing a new pair every few months. The heel always rips, the shoelace brackets fall off, and i get holes by my toes. I love these shoes but keep in mind that they fall apart soon after buying…"
  },
  {
    "user": "Allison Johnson",
    "rating": 5.0,
    "message": "Love them but had to send back for exchange runs large"
  },
  {
    "user": "Mary Oster",
    "rating": 5.0,
    "message": "Cute shoes! I bought a half size down. No support and your heels tend to slip out when you walk but I expected that based of the shoe sole. Still overall a super cute shoe to wear running some quick errands or to dinner."
  },
  {
    "user": "Vickie O.",
    "rating": 3.0,
    "message": "The size was a little to big, so I had to send them back. Super Cute I wished they fit."
  },
  {
    "user": "Ke",
    "rating": 5.0,
    "message": "Okay, so my true size is a 7.5 US/ 38 EU, I read Superga reviews saying to take a full size down, (not half), so I bought an EU 37 (6.5 US), and it fits about right with thick socks, granted, with thin socks it's still a little loose, but nothing major. I love them, and think they're classic shoes, I also love that I paid a discounted amount for them."
  },
  {
    "user": "Stephanie",
    "rating": 5.0,
    "message": "I love the style of these shoes. Being 5’7” I am always looking for a couple extra inches where I can find them. This shoe is versatile and easy to clean. They not super comfortable but aren’t bad either. I bought these shoes a little over 2 years ago and still wear them often. I can’t wait to get these in another color!"
  },
  {
    "user": "Ansley Peurifoy",
    "rating": 4.0,
    "message": "I have not gotten wear these out and about yet, but I ordered these originally in a size 8 (my normal size) and they were definitely too big. Ordered a 7.5 and they fit much better but I have quite narrow/skinny feet so they're not hugging them or anything. Have to tie them a little tighter to get a good fit. Very flat soled shoe which I expected and don't mind. So far I like these shoes just walking around the house. Also please disregard my socks lol"
  },
  {
    "user": "Erin Mardis",
    "rating": 5.0,
    "message": "I have extremely narrow feet so these do seem fairly wide/loose but I absolutely love them! I bought these for $10 (open box return) and they were in brand new shape love them so much"
  },
  {
    "user": "Kevin Doyle",
    "rating": 5.0,
    "message": "Honestly very disappointed in Amazon. Usually love their customer service but they fell short today. I bought these shoes and absolutely loved them. I waited for them to go on sale and when they did I purchased. They were too large and I was looking for an even exchange and my only option was to return it. I was really looking forward to wearing these shoes, as my sister has bought 2 or 3 pairs of hers from Amazon."
  },
  {
    "user": "Buyer",
    "rating": 4.0,
    "message": "These are incredibly cute and trendy, but I can’t imagine wearing them without an insert. Since the thickness doesn’t let them bend, your heel will slip in and out a bit without thicker socks or an insert. You definitely need to break them in for a while before wearing them anywhere with even a little bit of walking involved."
  },
  {
    "user": "jamie nolte",
    "rating": 1.0,
    "message": "Unfortunately I missed the return window by 12 hours so I’m stuck with these shoes that I will not wear. I’m a little on the short side so I wanted to find a shoe to give me a little extra height. I’ve had the VANS high shoes before and I really liked them. These shoes were on sale with Amazon so I figured I would give them a shot. I tried them on yesterday and they fit fine, the problem is that you feel like your walking completely flat footed. If you try to walk like a normal person, your heal slips out of the back of the shoe. I am constantly on the move, so these shoes are a definite no for me."
  },
  {
    "user": "MERITAGE",
    "rating": 5.0,
    "message": "I had ordered similar Superga sneakers a yeaar ago which were too small. So, this time I ordered them larger and they were huge!  at least an inch too big. I ordered a full size smaller and they are perfect. Thanks to Amazon I didn't buy a chinese product, AND their customer care was very kind in helping me arrange a UPS pickup. Bravo."
  },
  {
    "user": "Shavelle Jones",
    "rating": 4.0,
    "message": "Loved them, they’re just not the color I ordered. They sent silver instead of gold like the item described. Other than that, no problem. Although the shoe doesn’t bend, but that’s fine. Forces trained me for this. Lol Don’t have to worry about crease!"
  }
]