[
  {
    "user": "Denise",
    "rating": 4.0,
    "message": "The shoes are super comfortable and roomy enough for my husband's wide feet. He has plenty of room across the ball of the foot and likes the roomy toe box. He has a very high arch, so the top strap just barely fastens. Also the shoe shape is slightly smaller across the instep. He does like them and felt they were really comfortable from the beginning, with no time needed to break them in. He would get them again but prefers the previous design of the shoes for their longer strap and roomier instep."
  },
  {
    "user": "AJSETT",
    "rating": 4.0,
    "message": "Easy on and off"
  },
  {
    "user": "Howard Hammons",
    "rating": 5.0,
    "message": "I was happy to submit my review until I came to the point where I wanted to submit everything, very pleased with the product and service, but it wouldn't take my review until I wrote a review. Next time don't expect any reply at all."
  },
  {
    "user": "DeepDragon2",
    "rating": 4.0,
    "message": "As it stands they fit they are comfortable and light. Now will they last? This review is still pending product er abuse. As I am very brutal with shoes. Updates to follow."
  },
  {
    "user": "W N Russell III",
    "rating": 5.0,
    "message": "Best lightweight strap-on sneaker !  I love the time it takes to tighten them. ❤️"
  },
  {
    "user": "Suzann Peterson",
    "rating": 5.0,
    "message": "Well made.  Great cushioning inside helps makes you feet feel wonderful.  Outstanding arch support to keep you walking. Would highly recommend this product."
  },
  {
    "user": "Anthony Romeo",
    "rating": 5.0,
    "message": "THE FIT"
  },
  {
    "user": "June Draper",
    "rating": 5.0,
    "message": "Just what we ordered"
  },
  {
    "user": "Moe123",
    "rating": 4.0,
    "message": "Best shoes for my feet. They are great"
  },
  {
    "user": "Ken in Arizona",
    "rating": 5.0,
    "message": "Just as expected. Great Shoe....third pair."
  },
  {
    "user": "Dave",
    "rating": 5.0,
    "message": "I will be ordering another pair. I have issues with my feet and these shoes help."
  },
  {
    "user": "Joel Snyder",
    "rating": 5.0,
    "message": "Work shoes, quality and fit are good"
  },
  {
    "user": "Buff",
    "rating": 5.0,
    "message": "This shoes fits well, is very comfortable. I have no complaints."
  },
  {
    "user": "Michael D Jordan",
    "rating": 5.0,
    "message": "Comfy on my feet and wallet."
  },
  {
    "user": "Joyful Heart",
    "rating": 4.0,
    "message": "As a stroke patient, they enable me to put my shoes on alone."
  },
  {
    "user": "abraham",
    "rating": 5.0,
    "message": "Para HIIT running workouts"
  },
  {
    "user": "K tadej",
    "rating": 5.0,
    "message": "I have a 41 year old handicapped son that has small motor skill issues, he absolutely loves them & he needs no help putting them on"
  },
  {
    "user": "Fred Spencer",
    "rating": 5.0,
    "message": "This shoe has been my shoe of choice and wear them daily for the last 10 years."
  },
  {
    "user": "James and Nikki",
    "rating": 4.0,
    "message": "Pull the strap but doesnt get as tight as i prefer. Besides thats its a good shoe  . Had to run out and get some inserts though"
  },
  {
    "user": "allan barnard",
    "rating": 5.0,
    "message": "Fits as it was written"
  },
  {
    "user": "william r bates",
    "rating": 5.0,
    "message": "Most comfortable shoe I have found so far"
  },
  {
    "user": "Geraldine Sowell",
    "rating": 5.0,
    "message": "My husband likes this shoe design to work outside"
  },
  {
    "user": "gerald hicks",
    "rating": 4.0,
    "message": "These are decent shoes, like that the size stays true.  They wear a little faster tha. I would like , but im hard on shoes"
  },
  {
    "user": "Wanda Cushing",
    "rating": 4.0,
    "message": "My fathers foot swells and we needed to find a shoe with a wide toe box and were hoping these would be the ones, but sadly not wide enough."
  },
  {
    "user": "Joseph Yee",
    "rating": 4.0,
    "message": "A- Ok"
  },
  {
    "user": "Maria",
    "rating": 4.0,
    "message": "Very lightweight as ai expected, insoles seem soft and the velcro straps will make it even easier to put on...above all I believe he will definitely like them."
  },
  {
    "user": "Tinwolf",
    "rating": 3.0,
    "message": "I walk a lot n these guys didn't stand up to my requirements. The bottom of the shoes wore down really fast. I can practically feel a pebble if I step on one."
  },
  {
    "user": "Roger Hansen",
    "rating": 4.0,
    "message": "NORMALLY i DO NOT BUY SHOES ON LINE  BUT THESE ARE FINE"
  },
  {
    "user": "Jimmy V",
    "rating": 5.0,
    "message": "Perfect replacement for a pair I had for years."
  },
  {
    "user": "Jwt",
    "rating": 3.0,
    "message": "Bought these shoes less than a year ago and as others mentioned the insole does eventually start coming out. Problem started on the left shoe but now its both. I've been going to glue the left in but I think it might not be worth it."
  },
  {
    "user": "Dorothy G. Yarbrough",
    "rating": 4.0,
    "message": "Great shoe and very comfortable.  Only negative is that the tongue keeps slipping to one side or the other."
  },
  {
    "user": "Doc Death",
    "rating": 5.0,
    "message": "Fit good, maybe a little looser than I thought. But feet feel much better."
  },
  {
    "user": "LC Sexton",
    "rating": 5.0,
    "message": "I hated bending over to tie my tennis shoes before heading out this shoe solves that problem."
  },
  {
    "user": "John",
    "rating": 5.0,
    "message": "Long-lasting wear with gel inserts."
  },
  {
    "user": "Pat",
    "rating": 4.0,
    "message": "The fastening Velcro works great."
  },
  {
    "user": "IRT",
    "rating": 5.0,
    "message": "After spinal surgery I am unable to lace shoes.  The Velcro closures are easy to use. In addition, there is swelling to my left foot so these shoes allow me to loosen the closures on that foot. These shoes provide an alternative to dress shoes as the dress shoes cannot adjust to the swollen foot. Overall very pleased with this solution."
  },
  {
    "user": "Richard R",
    "rating": 5.0,
    "message": "My brother never buys anything. I’m glad I got them these shoes for his 66th birthday."
  },
  {
    "user": "Jeannie",
    "rating": 5.0,
    "message": "Bought for elderly father. Easy for him to side on and off. Helps with balance and good quality material."
  },
  {
    "user": "NaiH-CM D",
    "rating": 5.0,
    "message": "Just love it."
  },
  {
    "user": "Andrew Tabery",
    "rating": 3.0,
    "message": "I've been wearing these to work for the past 3 months and the soles have already completely worn down. They're a weird type of foam I'm guessing, although they feel like rubber when they're new. Really disappointing because the shoes are nice but they've completely lost the grip they had which is important when you're washing cars all day."
  },
  {
    "user": "Lee S",
    "rating": 5.0,
    "message": "These are quality comfortable shoes!"
  },
  {
    "user": "Richard Barbour",
    "rating": 5.0,
    "message": "Good quality - happy"
  },
  {
    "user": "Kerry Myers",
    "rating": 3.0,
    "message": "These shoes are a little too small. Ordered a 9 wide, but I should have ordered a 9-1/2. I have never used a shoe larger than a 9. I'll just use them around the house and they'll eventually stretch to my foot."
  },
  {
    "user": "Dr. K",
    "rating": 5.0,
    "message": "Like velcro fasteners."
  },
  {
    "user": "Cathy",
    "rating": 3.0,
    "message": "Very disappointed to find the width is not as described, it's not wide at all.  Dr Scholl's should be better made than this!"
  },
  {
    "user": "Vee",
    "rating": 5.0,
    "message": "The comfort, my dad loved them."
  },
  {
    "user": "jeff serio",
    "rating": 4.0,
    "message": "Fit like I hoped and expected."
  },
  {
    "user": "Jeff F.",
    "rating": 5.0,
    "message": "Having a degenerative hip and arthritic knees, how shoes fit and support is imperative.  I just received my Dr. Scholl's sneakers and they are perfect right out of the box.  Being used to 9 1/2 extra wide size of another brand, the Dr. Scholl's 9 1/2 wide size fits fine.  One important feature of these shoes is that the soles are of proper width.  I've noticed over the years that some manufacturers may have wide sizes, however, the soles are too narrow.  It's nice to be able to walk across a room without the pain.  Thank you, Dr. Scholl's."
  },
  {
    "user": "Alan D.",
    "rating": 4.0,
    "message": "Great shoe."
  },
  {
    "user": "K",
    "rating": 3.0,
    "message": "I bought these about a MONTH ago  for my father who is in a nursing home. The sole is already peeling apart from the shoe part, on the front side- like where your pinkie toe is. Its not like hes hiking or anything."
  },
  {
    "user": "al martin",
    "rating": 2.0,
    "message": "I have to say I have never had a shoe quite like this one before. The fit was a little tight but it did give way over time. I do a lot of walking so I know that I can wear out a shoe pretty quickly. So to address the issue I alternate between pairs of New Balance and Rockforts. Dr. Scholls was the least comfortable but still acceptable. The others were more comfortable. I was able to make the Dr. Scholls' pair more comfortable by adding... you guessed it, a Dr. Scholl's pad!!! So walking outside was not so bad. My issue has to do with a completely unforseen problem. This shoe in a house with carpeting produces more static electricity than anything I have ever worn. I am literally shocked almost every time I wear it regardless of the weather. If this energy could be captured I could charge my cell phone and other small electronics. And yes it occurs with or without the insoles. So I relegated it to only outside use. But one more thing that I have to add is that the soles do appear to deteriorate far quicker than the other brands that I use. I have many shoes wear out from the bottom center but this shoe actually is showing a crack at the bottom center."
  },
  {
    "user": "Georgie",
    "rating": 3.0,
    "message": "Hurt my feet."
  },
  {
    "user": "George Goldner",
    "rating": 5.0,
    "message": "They fit well and are easy to get on and very comfortable. Great value!"
  },
  {
    "user": "Phil",
    "rating": 3.0,
    "message": "I bought these because of the velcro. I wore them around for several weeks and started noticing a pain in my right foot next to the little toe. Turns out, I had developed calluses (corns) from wearing these shoes. It was the first time I'd ever had calluses like these. I went to the podiatrist and she removed the calluses. I stopped wearing the shoes and my feet are fine. It's totally possible I got a bum pair."
  },
  {
    "user": "Carole DeRizzo",
    "rating": 5.0,
    "message": "Second pair my husband has had and are the best fit for his wide feet. Comfortable and easy to put on for an elderly person."
  },
  {
    "user": "Patricia wolf",
    "rating": 5.0,
    "message": "Great show for my father, easy to put on, very supportive and lasts"
  },
  {
    "user": "Tom Hample",
    "rating": 3.0,
    "message": "Did not fit they said they wide width but could barely get my foot in and could not get the straps to reach"
  },
  {
    "user": "Monica  Kankelfitz",
    "rating": 4.0,
    "message": "Product wore out after wearing only two months sole separated from shoe I have had these shoes in the past and never had this problem"
  },
  {
    "user": "Rysse-Romance Reader",
    "rating": 5.0,
    "message": "Replacement for older pair of shoes. Great product and price"
  },
  {
    "user": "Tim D.",
    "rating": 5.0,
    "message": "These shoes are wonderful. As someone who owns a white pair that I still wear, I was happy to see them available in black. After a operation recently I found tying shoes impossible. These black velcro shoes answered the call. With them being black you can wear them anywhere casual shoes are appropriate.  Highly recommend."
  },
  {
    "user": "Sheila Cassada",
    "rating": 5.0,
    "message": "This shoe is true to fit and comfortable"
  },
  {
    "user": "Laurie Dovey",
    "rating": 5.0,
    "message": "My husband had a stroke so putting on regular sneakers was a no go these Velcro sneakers were great the wide width accommodated the brace he has to wear"
  },
  {
    "user": "Renee Tollack",
    "rating": 5.0,
    "message": "Bought this sneaker for my elderly father. This sneaker is his favorite, and will not wear any other. Easy on and off Velcro makes for a simple task he can do alone. The wide with is great, as hard to find."
  },
  {
    "user": "The Chairman",
    "rating": 5.0,
    "message": "Comfortable walking shoe."
  },
  {
    "user": "Lorine Bacus",
    "rating": 5.0,
    "message": "But if you have a condition where you use your toe to have get up from floor when you get down the wearing out"
  },
  {
    "user": "brenda",
    "rating": 5.0,
    "message": "gift for someone who needs straps or slip on. comfort good"
  },
  {
    "user": "Harold Rooks",
    "rating": 5.0,
    "message": "They are good"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes were just what I was looking for."
  },
  {
    "user": "HEATHER",
    "rating": 5.0,
    "message": "Got these for my Dad.  He loves them so easy for him to get on and off.  So comfortable for him.  Great fit."
  },
  {
    "user": "John Roberts",
    "rating": 5.0,
    "message": "first shipment was defective. replacement arrived quickly and was very satisfactory. I'm happy with it."
  },
  {
    "user": "Steve Schake",
    "rating": 4.0,
    "message": "TO WALK WITH !!!!!!"
  },
  {
    "user": "Eve",
    "rating": 5.0,
    "message": "This is the third pair I've bought for my Dad. He loves these shoes. He has neuropathy in both feet and he can't compliment these shoes enough. They have good support, the velcro straps are long (we bought him wide size), and they are lightweight. He wears them every day, either the white or the black pair."
  },
  {
    "user": "david santana",
    "rating": 5.0,
    "message": "Not kidding.  I do a lot of walking at work and was tearing up my good shoes.  Bought these after comparing a lot.  Best decision ever, super soft..  I ordered a 10W men.  GL"
  },
  {
    "user": "Bill&Paula Poston",
    "rating": 5.0,
    "message": "I go to therapy learning how to walk after suffering a stroke, These shoes do not feel like lead weights!"
  },
  {
    "user": "Michelle C.",
    "rating": 5.0,
    "message": "I have been wearing this shoe for the last four years and find it very comfortable and light but sturdy and durable. I would recommend this brand and type of shoe."
  },
  {
    "user": "Gary Broughton",
    "rating": 5.0,
    "message": "Good shoes"
  },
  {
    "user": "OZZY",
    "rating": 4.0,
    "message": "It's a good shoe for the price . It's very light weight and with an extra shoe cushion very comfortable. I'm not a big fan for slip on shoes so this is the next best thing for non shoelace footwear."
  },
  {
    "user": "Mighty Mac",
    "rating": 3.0,
    "message": "The shoe is lightweight, but that apparently comes at a price both for the product and for having to quickly replace it. I usually wear less expensive shoes. Being in my 70's, I don't run or take extensive walks. The soles on these are a disappointment. Inside the heel cushions have quickly separated from the soles. If money is no object, keep buying these new several times a year and you will enjoy them. If money is of concern, you can do better with less expensive shoes even if they weigh another ounce, at least you will have longer lasting soles."
  },
  {
    "user": "joe",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "Tena",
    "rating": 5.0,
    "message": "Fit fine"
  },
  {
    "user": "R. A. Brown Jr.",
    "rating": 5.0,
    "message": "I like the overall comfort and fit of the velcro-fastened shoes; however on the first day of wearing them, I noticed a light squeaking sound while walking down a quiet stairwell.  Perhaps that sound will eventually go away; it's not distracting in settings where background noises typically occur."
  },
  {
    "user": "billrock",
    "rating": 5.0,
    "message": "Happy with these shoes. Have hip problems so they are much easier for me to put on."
  },
  {
    "user": "JAMIE PEAL",
    "rating": 2.0,
    "message": "this was my second pair of this exact shoe. i purchased first pair in january and had such good luck with them i ordered another pair in june, i normally do good to get 6 months out of my shoes walking on concrete all day everyday so if i get 6 months im really happy, so old set finally got bald on t he bottom and some of the side stitches were coming loose so ordered new ones, i have had them 6 weeks and the bottom is almost bald like the ones i had for 6 months, i litterally clicked buy again so i got the same shoe. not sure what changed but the difference is staggering."
  },
  {
    "user": "brinde2",
    "rating": 4.0,
    "message": "Overall the shoes are light weight and fit fine but there are some rough feeling materials in the toe box area that irritate the tops of my right two small toes. Hopefully this will wear in and go away quickly or I will return them."
  },
  {
    "user": "james l malone",
    "rating": 4.0,
    "message": "The shoes seemed very light and I suspect that the sole may not hold up as long as some previous DMX walkers from Reebok that I have been using for about the last 10 years...but I have found that I am able to move much quicker (age 74) while playing pickle ball, with a group of people.  I have only been using these shoes for a week now, so the jury is still out on durability, but, they are fairly comfortable with the gel pads and seem very light, if one needs to move fast. 3 MONTHS LATER.  I am still content with these shoes, but as I expected they do wear fast, but are also faster in getting to the pickle ball and seem to walk a lot quieter in the house, than my previous heavier Reebok DMX walkers. The Reebok will last longer, but are no longer available.  I will be ordering 2 more pairs of DR Scholl's velcro shoes, because of the softer, quieter walk, but mostly for getting around on the court.  I would like to see a 9.5 double E to triple E width, but that doesn't seem to be available, so I have to order a half size larger double E , for the right width, for me.  On the order form, it shows EE width..When the shoes were received, it shows size 10 W..is EE even available..?"
  },
  {
    "user": "lori scholtes",
    "rating": 5.0,
    "message": "my diabetic 85 y/o father loves these!  his diabetic shoes were so heavy he kept stumbling and tripping."
  },
  {
    "user": "Richard Gallagher",
    "rating": 5.0,
    "message": "Have bought these shoes before and was very satisfied, so bought another pair."
  },
  {
    "user": "Joe Peters",
    "rating": 5.0,
    "message": "Great shoe for a old man."
  },
  {
    "user": "Maxine S.",
    "rating": 5.0,
    "message": "The comfort is the # l reason for the purchase.  They may not last as long as the more expensive shoe, but at this price, comfort and ease of putting them on and taking them off, I don't mind buying them more often."
  },
  {
    "user": "Jeannie",
    "rating": 5.0,
    "message": "Great shoe, great service"
  },
  {
    "user": "Al D.",
    "rating": 5.0,
    "message": "These are really comfortable, light and easy to slip on. My feet are swollen most of the time and regular lace-up shoes can be a problem to put on. These have two Velcro straps that eliminate that problem completely!  I also think that when I pull the straps over  tightly it helps with the swelling, bit I'd check with your podiatrist about doing that. Buy 'um, you'll like 'um."
  },
  {
    "user": "Bruce Fraser",
    "rating": 5.0,
    "message": "these sneakers were a goo fit for comfort and walking. bending over and tying shoe laces was becoming harder with lumbar spinal stenosus. the velcro pull over was more convenient and quick. great shipping box and inserts. received in great condition."
  },
  {
    "user": "Donna J. Lutheran",
    "rating": 5.0,
    "message": "They fit just right and are comfortable."
  },
  {
    "user": "Ronald H.",
    "rating": 5.0,
    "message": "I used this product for walking on beach. Walk daily there and these seem to work well. Easy to put on."
  },
  {
    "user": "Adrien Thomas Sr",
    "rating": 5.0,
    "message": "I love these shoes"
  },
  {
    "user": "Karen S.",
    "rating": 5.0,
    "message": "Purchased for a stroke survivor. He has use of one hand/arm and says very easy to put on and very comfortable."
  },
  {
    "user": "Thomas H.",
    "rating": 5.0,
    "message": "This is my 3rd pair of Dr. Scholl's black Men's Brisk shoe. My last pair I bought over 6 years ago. I'm a 75 yr. old rice farmer. My last pair I had glued the sole back on many time with shoe-Goo and they kept going and going, until I finally wore a hole through the ball part of the sole and had to buy another. They are a great long lasting shoe, well made, and the most comfortable I've ever owned. You can't go wrong with these, they are made of quality materials, well put together, the jell inserts are amazing for anyone on their feet all day. And even when not well taken care of like working in the rice fields, shoveling levees, wading in the water, they still will last almost forever."
  },
  {
    "user": "Carlos Lloret Jr",
    "rating": 5.0,
    "message": "Awesome"
  },
  {
    "user": "Kevin M Eichenlaub",
    "rating": 4.0,
    "message": "The tread only lasts a few months of walking. I have 3 pairs and the tread only lasts a few months."
  },
  {
    "user": "kimNjoe",
    "rating": 5.0,
    "message": "I bought these for my father in law. He is diabetic and has swelling issues I. His feet and legs making it difficult to find shoes for him. These fit him perfectly and he said they are comfortable to walk in."
  }
]