[
  {
    "user": "Middle America",
    "rating": 4.0,
    "message": "I like the look of these shoes and I think they would work well for a HITT class.I sized up a half size based on other reviews. My feet are very average looking, pretty much medium, no extra wide parts or extra long toes. These were too tight for my liking."
  },
  {
    "user": "Eric P.",
    "rating": 4.0,
    "message": "Love these sneakers, very light weight and a nice color. My only small complaint is that I have to get the tongue in JUST the right place on my metatarsals or it rubs uncomfortably."
  },
  {
    "user": "Sally",
    "rating": 5.0,
    "message": "No heel rubbing!  First pair of shoes I've bought in a long time that don't make blisters on my heels.  They're very light weight and totally comfortable.  And I think the style and color is nice too."
  },
  {
    "user": "hunters widow",
    "rating": 4.0,
    "message": "I would never work out in the shoes but they’re super cute to run around town"
  },
  {
    "user": "Ken Tagney",
    "rating": 5.0,
    "message": "My daughter loves these and they fit well"
  },
  {
    "user": "Hiromi Takayama",
    "rating": 5.0,
    "message": "Good fit and color."
  },
  {
    "user": "Cloudguess",
    "rating": 4.0,
    "message": "I love these shoes. I got an 8 in womens and it was pretty accurate fit. Comfort wise I would give them a 3 out of 5 because the shoes lack support. Not the most comfortable shoes but they look great!"
  },
  {
    "user": "brady r sneath",
    "rating": 5.0,
    "message": "My daughter-in-law loved these garnet & gold shoes to wear with her FSU shirts! They are super comfy too!"
  },
  {
    "user": "Mercedes Alonso",
    "rating": 5.0,
    "message": "Que me quedo comodo"
  },
  {
    "user": "Lynne W Maynard",
    "rating": 5.0,
    "message": "These fit great and they are so light.? they also make my feet look small which is a nice bonus"
  },
  {
    "user": "Becky",
    "rating": 5.0,
    "message": "I get so much more movement on my lunges and things that requiremore flexibility in the foot. I was training in regular running shoes withthick comfy soles qnd it really hindered movements"
  },
  {
    "user": "Roberto Neris",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Laurie Hirshlag",
    "rating": 5.0,
    "message": "great product"
  },
  {
    "user": "Maria Hernandez",
    "rating": 5.0,
    "message": "Todo es un tenis bello ."
  },
  {
    "user": "Mike R.",
    "rating": 5.0,
    "message": "My favorite Nike!  I have a bit of neuropathy in my feet and these are the first running shoes I have found that I can walk long distances in without pain.  Will buy more."
  },
  {
    "user": "Jeni",
    "rating": 5.0,
    "message": "They feel, look, and function great. Love these shoes for the gym."
  },
  {
    "user": "Mr. S",
    "rating": 5.0,
    "message": "I wish this same style was available for men."
  },
  {
    "user": "Arch",
    "rating": 4.0,
    "message": "It’s rare to find a red shoe for a woman. This burgundy is the closest color to red that I have found"
  },
  {
    "user": "Nurse Wendy",
    "rating": 4.0,
    "message": "This shows are really cute! After reading the negative reviews regarding comfort, I just went ahead and also ordered some $13 Dr. Schoals shoe inserts to arrive in the mail at the same time as these shoes. The original Nike inserts easily came out and I popped the new inserts in. Definitely helped! Would I go on long hikes in these shoes? No definitely not.  But they will definitely be cute for going to work or the grocery store and such. Previous reviews mentioned an issue with the tongue sticking up in an odd way, and I did not find this to be true whatsoever. In other brands of shoes, I wear a size 9. But I also have to go up a half size with Nike so I ordered a 9.5"
  },
  {
    "user": "momarch",
    "rating": 4.0,
    "message": "i have been wearing nike for years.  I have some foot issues and was told to try a couple different brands.  After trying 3 or 4 and returning them because they were horrible i went back to nike.  Comfortable, fits as expected, decent support.  My only grief with it is that the tongue is rather fat...i am not used to that, previous nike shoes did not seem to be this fat.  Other than that is fine for me.  I wear a  9 1/2 and got that."
  },
  {
    "user": "DFBrown",
    "rating": 4.0,
    "message": "Replacing a previous pair of Nike flex, the new pair was comfortable from day one.  I wear these for walking about 3 miles daily"
  },
  {
    "user": "Terri",
    "rating": 4.0,
    "message": "Love the colors of the shoe and it will be a cute shoes for jeans and capris. Needs to be stretched out some as they are a little snug."
  },
  {
    "user": "Sisler",
    "rating": 5.0,
    "message": "I’m very “Nike Particular” and these are my new favorites! I’ve bought others online and had to send back but so happy with this purchase! I get a lot of compliments on them. They are more on the lighter side but overall comfortable. I’m a surgical assistant and wear them all day with no issues. Like every shoe, you need to break them in and they have been great!"
  },
  {
    "user": "Jenny Y.",
    "rating": 4.0,
    "message": "Size a runs a bit too small, other than that it’s cute and comfortable! i’m pleased with my purchase"
  },
  {
    "user": "Shaw",
    "rating": 3.0,
    "message": "I bought these for general gym weight training and everyday. They are comfortable enough but don’t feel like they are providing much support at all even just for arm day, the material is almost too soft and flexible for a sports shoe. I thought about trying a smaller size to get a little tighter, but then they’d be too short. I wore them outside the first day so I can’t return but I would have had I known they weren’t supportive and felt so flimsy I would have."
  },
  {
    "user": "Jennifer Ambrose",
    "rating": 3.0,
    "message": "These are cute, but if you are in need of arch support, or have trouble with your feet I would pass on these. If you don’t have trouble with your feet, they are great for leg day at the gym or home."
  },
  {
    "user": "Georgia Xuereb",
    "rating": 3.0,
    "message": "They’re light. But this is the only Nike pair I’ve ever bought that wasn’t comfortable. I can’t wait to usually get home and take them off. No support and enough cushion. Makes me feet ache."
  },
  {
    "user": "VAR51TX",
    "rating": 4.0,
    "message": "These are very cute sneakers with the pink accent.  Unfortunately, I found them to be narrow and had to return them.  Sad face.............."
  },
  {
    "user": "Margarita R Mckinney",
    "rating": 5.0,
    "message": "These are really comfortable. I love the look. I didn’t know Nike made shoes in red. Thanks!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have tried every brand and these Nike Flex shoes are the best if you are flat footed aka very small arches. They are extremely light weight, perfectly shaped with toe room, flexible, and the most comfortable shoe I have very worn. I have purchased 3 pairs over the last 4 years and will only wear these in the future. (I wear size 8, have low arches but not Fred Flintstone feet...just normal width)"
  },
  {
    "user": "Diana S. Daniels",
    "rating": 3.0,
    "message": "I usually buy New Balance and they’re a perfect fit but I liked the look of these. They run short, narrow and they were uncomfortable. I have narrow feet and these were tight on me so I can’t imagine they’d fit anyone well whose foot was not narrow. Back to New Balance!"
  },
  {
    "user": "Happy Shopper",
    "rating": 5.0,
    "message": "I always like Nike Flex for casual wear and light walking. These look and feel great. Quick shipping too. Thanks!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "style and color is good"
  },
  {
    "user": "Lucimary Silva",
    "rating": 5.0,
    "message": "Happy with the product ;)"
  },
  {
    "user": "M Thompson",
    "rating": 4.0,
    "message": "She really seemed to like them and she has a killer body! so they must work!!"
  },
  {
    "user": "Elayn D. Ward",
    "rating": 3.0,
    "message": "I normally wear a 6-1/2; the shoe would have fit better as a 7"
  },
  {
    "user": "Ivette Delgado",
    "rating": 5.0,
    "message": "Me FACINARON!!!"
  },
  {
    "user": "new yorker",
    "rating": 2.0,
    "message": "I’m really surprised by this shoe. Looks fabulous, but I wanted to walk and work out in these. Nope! Walked (not even jogged) maybe 2 miles in the concrete jungle and my feet were achy, especially in the heel area. Walked the 20 flights of stairs in my building for exercise and same thing. Heel and ball of feet were achy. Switched back to my $25 pair of sneakers from some no name brand from China through Amazon, and no problems. The padding in the soles is just poor. Thin and not cushioning. Would not run in these."
  },
  {
    "user": "Kalie",
    "rating": 5.0,
    "message": "Love these shoes, comfy, light, and sleek"
  },
  {
    "user": "Joel K.",
    "rating": 4.0,
    "message": "I normally wear a size 10 but these needed to be a 9.5 to fit right. They even look too big and make me feel like I have clown feet. If ur between sizes I'd size down. Also they are very light weight which is great but you can see the outline of toes. Not sure if thats just because the size wasnt right. Other than that they are a good light weight everyday shoe"
  },
  {
    "user": "His",
    "rating": 3.0,
    "message": "Smaller fit uncomfortable tongue ankle area"
  },
  {
    "user": "Jade",
    "rating": 3.0,
    "message": "They’re definitely nice shoes but they are a little uncomfortable and they fit a big snug if you have wide feet."
  },
  {
    "user": "LoriAnnR",
    "rating": 5.0,
    "message": "I wear a women's shoe size 12 so finding shoes that are comfortable and don't make my feet \"look\" larger than they are is very (very) challenging.  These look great.  They are very lightweight.  I wear them to the gym for weight training but do not think they are appropriate for running.  The bottom rubber sole seems a bit too soft and small rocks like to jam and get stuck.  Other than that, I really like this sneaker.  The color of the material is unique, sort of a blend between gray and silver with black trim.  I think they look great and they also look very nice to wear with jeans.  I've only been wearing them for a week so I cannot rate longevity yet.  I'll update the review if I experience any problems."
  },
  {
    "user": "KristaC",
    "rating": 4.0,
    "message": "I had the 8 to this previously and I am walk up to 4 miles in it. This is no different. I wore them for the first time today on a 4 mile walk and they were light  and flexible just like the 8. They fit as expected im a 9.5 and bought 9.5. However I do tend to wear thicker socks and the 8 was definitely a more of a snug fit than these. I don't like that the tongue is on the thicker end and is sewed to the base and not the sides, to get it flat after putting on takes a little finesse. However I do like that I can tighten around my ankles by tightening the lace due to the top lace looks are linked to the piece round the back of the shoe."
  },
  {
    "user": "Hiskid",
    "rating": 4.0,
    "message": "Nike has never disappointed me . . . I bought these specifically because my last pair had a tab at the tongue and heel that made them easy to put on.  These don't have as much stretch or give, not quite the same, but not a deal breaker.  They do seem room around the front part of my foot, and I'm not sure that will get better in time, because it is beyond the lacing (so even if I pull them tight, still roomy in the toe area.  But I wear them for work out classes and so far so good."
  },
  {
    "user": "Linda D. Salemo",
    "rating": 5.0,
    "message": "Love these sneakers. I have several pairs in different colors and they are all comfortable. I walk over 60 miles a week and my black pair are worn out.  I couldn't find a replacement so I ordered these and I am not disappointed"
  },
  {
    "user": "OptoLady",
    "rating": 3.0,
    "message": "I don't love the feel of these sneakers, the tongue has been quite uncomfortable on the top of my foot since day 1 of wear. I have to fiddle with the sneakers each day I wear them. I'm really only keeping them due to the price and absolute need to have a sneaker for work this week, otherwise would probably return for another sneaker. I'm guessing I'll be buying another sneaker in 6 months that is more comfortable for summer."
  },
  {
    "user": "BRUCE JONES",
    "rating": 5.0,
    "message": "Wife loves them very comfy looking for different colors"
  },
  {
    "user": "Islandcraft808",
    "rating": 5.0,
    "message": "Wear this to school and it feels like and comfortable! Love it"
  },
  {
    "user": "Snesk",
    "rating": 4.0,
    "message": "Running shoes can be very uncomfortable for people with tall arches or just tall feet in general. In my case, these shoes hurt the top of my right foot which has a taller arch than my left. I ended up lacing the shoes differently to accommodate for the extra space that I needed on top and then there was none of that uncomfortable pressure on the top of my foot. My only other problem was that the shoes are more narrow than I expected. Not uncomfortably narrow, just narrow enough that makes me think that the sides will wear quicker."
  },
  {
    "user": "Christine",
    "rating": 5.0,
    "message": "I do a lot of aerobic dancing and this shoe is perfect.  Very comfortable and light.  In the past,  I've had constant problems with my shoelaces untying; these shoelaces stay tied throughout my entire hour of jumping and moving about."
  },
  {
    "user": "becky V.",
    "rating": 5.0,
    "message": "Love these shows they have great support and are super cute"
  },
  {
    "user": "Jacqueline Farley",
    "rating": 4.0,
    "message": "I'm a size 8.5 and I ordered up to a 9 just in case. Thank goodness I did! They still fit pretty well, but they're smaller than I expected. If I had to do it again, I'd either go a whole size up rather than just the half. That or just go to the store. 🤷‍♀️"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "No adjustment period. Comfortable from day one. I hadn't tried working out in them as of yet. The shoes are pretty to the eyes and I want to keep them that way for as long as I can 🤣"
  },
  {
    "user": "Amanda",
    "rating": 2.0,
    "message": "Questionable if even made by Nike. Thin material, good for 3-4 daily uses then feel worn down"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I am wearing them at work . They are so comfortable."
  },
  {
    "user": "Kristi",
    "rating": 2.0,
    "message": "When I received my shoes the back strap was not connected and laying in the box and I had no idea what it was for.  After putting them on I realized the strap was part of the shoe and figured out how the other one was connected I realized I needed to maneuver it through the inside of the shoe from the outside.  The way the strings fit through and where the last eye-holes are the shoe doesn't feel like it is securely on and it hits the top of my foot very odd.  I wouldn't wear them for working out.  Unfortunately the box was taken out in the trash before I could wear them for long enough to know I would return them.  I'll keep them but will wear them minimally."
  },
  {
    "user": "Angela",
    "rating": 4.0,
    "message": "I’ve been wearing Nikes since high school, at work and for workouts. These are pretty good, comfortable, but the tongue on this shoe is big and doesn’t lay flat. The soles were also a little slick on the weight bench during my workout (hopefully will roughen up in time)."
  },
  {
    "user": "Viki",
    "rating": 4.0,
    "message": "I got these shoes to replace my old sneakers. They are lightweight and have good cushion. They are a bit tight across the top of my feet. . . maybe they will stretch."
  },
  {
    "user": "Holly",
    "rating": 4.0,
    "message": "I feel like I'm one of the few who likes these and I don't normally like Nike sneakers...they were light, cute and rather comfy for the roughly 100k steps I took over a long weekend vacation and a couple of bootcamp classes. They served their purpose. I wouldn't wear these for long runs or anything overly intense impact - but jacks, jumps, lunges, skaters, etc. - felt study and comfy for me."
  },
  {
    "user": "Virginia",
    "rating": 5.0,
    "message": "I bought this as an everyday walking shoe. I work a job where I'm constantly up and about, and these shoes have been very comfortable throughout the day. They also look great and are easy to match with any outfit. Nike shoes tend to run half a size smaller than my normal size. I'm usually a size 7. I got a size 7.5, which fits perfectly for me."
  },
  {
    "user": "Ashley N. Dunham",
    "rating": 5.0,
    "message": "I ONLY buy Nike. My last two pairs of Nike sneakers lasted me almost seven years! I have to say these ones are the most comfortable ones I have EVER bought. I'm not a runner, but I use these for long walks, lots of hills and some grassy areas (almost like hiking) and for the gym. I have plantar fasciitis, and one ankle that is weak due to a nasty sprain a few months ago. These sneakers have EXCELLENT support! I usually have to buy custom inserts for my shoes because I have really deep arches (when they aren't supported the plantar fasciitis is unbearably painful) but I did not need to. My feet don't cramp up and they don't rub and give me blisters. Breathable fabric too!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Gym"
  },
  {
    "user": "Brandon L.",
    "rating": 5.0,
    "message": "Great gift as expected"
  },
  {
    "user": "Asunción",
    "rating": 5.0,
    "message": "Muy cómodos y ligeros"
  },
  {
    "user": "A E",
    "rating": 5.0,
    "message": "Bought as a birthday gift for my teen daughter . They fit her comfortably and have held up well ."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was specifically looking for these colors so comfort wasn't an issue.  They ended up being very lightweight and comfortable which being Nike I knew they would be."
  },
  {
    "user": "Sherryl",
    "rating": 3.0,
    "message": "These aren't what I expected.  For some reason, it fits strange.  As a result, I am returning these."
  },
  {
    "user": "Sara D",
    "rating": 3.0,
    "message": "These are very good looking shoes. However, the fit is tight and there is absolutely no give or ability to stretch out. The material appears to be stretchy, but in actuality it feels more like canvas and doesn't stretch. I ordered a 6 1/2. My normal size is a 6 and these were still too tight.  I'm disappointed because I wore them outside (and they hurt my feet within the first hour )and so I can't return them. Big bummer."
  },
  {
    "user": "Jen",
    "rating": 2.0,
    "message": "Minimal and uneven arch support"
  },
  {
    "user": "Bonnie Laurent",
    "rating": 5.0,
    "message": "Love the fit"
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "Bought this shoe to try for cross training - speed, agility and plyometrics. Have had them for several months now and they have worked great. No slipping and they are comfortable. Good for jumping and speed work."
  },
  {
    "user": "Brooke Barney",
    "rating": 5.0,
    "message": "lightweight and so cute!!"
  },
  {
    "user": "Lagi ki",
    "rating": 5.0,
    "message": "I love the shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "nice for a gym workout, not for running. light-weight. fits snug in lace area."
  },
  {
    "user": "Debra C.",
    "rating": 3.0,
    "message": "Like style idea/look, but not so much on my feet. Might have given it a shot, but they were too small. Didn't seem to have much support. I usually like Nike, but had to return this pair."
  },
  {
    "user": "liz",
    "rating": 5.0,
    "message": "i have had 3 pairs before these, love them. i wear 3 hrs a day at work, even gardening at work. hold up super well, under harsh cond. water, mud, dirt. this flex is nice, like a flexible back heel part, easy to slip in out of. i like them unlike other posts say.  colors brite so nice. great shoe. i will cont. to buy yr after yr ."
  },
  {
    "user": "Dawn",
    "rating": 3.0,
    "message": "I bought it to workout at the gym. Was very disappointed on how the tongue fit. It appears that they forgot to include the tongue during the manufacture process and added it later. I would have return it but I wore it to the gym."
  },
  {
    "user": "joshua seth yeager",
    "rating": 3.0,
    "message": "The shoes are great but the package was in really bad shape this was a gift and looks terrible it was packaged very poorly for delivery."
  },
  {
    "user": "clb",
    "rating": 1.0,
    "message": "I wish I had taken a picture of them  but I was so frustrated that I just packed them up and ordered a return. 1. The opening where the laces are seems to be really wide 2. The tongue is really long 3. The lace holes are tight together and they sit around the middle of the top of your foot This combination makes the tongue stick straight up and it pushes the laces together into an overlapping clump on the top of your foot. Literally all the crossed laces are a clump of what looks like tangled laces. As soon as you take the shoe off everything looks normal again. Because the laces bunch up together into the middle of the top of your foot, nothing is holding the tongue down, so it sticks straight up and forward. You now have a funky looking shoe that has no support and it hurts because of this clump pressing into the top of the foot. I spent 3-5 minutes messing with it and trying to fix them with no luck. Hindsight, I should have taken a picture to show this weird set up."
  },
  {
    "user": "Kayla & $cooter",
    "rating": 3.0,
    "message": "To tight and not comfortable at all waste of my time and money"
  },
  {
    "user": "Lauren Tiehen",
    "rating": 5.0,
    "message": "I wear these shoes for HIIT workouts, weight lifting and workout classes.  They are so light and comfortable! I was pleasantly surprised for the cost! I usually wear heavier, running shoes and I'm so happy I tried something new.  I ordered 8 Wide, based off others reviews and I'm glad I did. I normally wear size 8 or 8.5 and the 8 fit perfect.  I would suggest playing with the shoe laces and shoe tongue to get your perfect fit.  I initialy thought the fit hurt the top of my foot, but after multiple adjustments, it fits like a glove, so don't get mad like I did when I first put them on."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "I’ve been wearing Nike’s for a long time!"
  },
  {
    "user": "Melanie",
    "rating": 5.0,
    "message": "Perfect for dance classes - soft soled and flexible with good support!"
  },
  {
    "user": "Gayathri",
    "rating": 4.0,
    "message": "Full white. Little small but order big size so fits. Love the design from Nike."
  },
  {
    "user": "ceej",
    "rating": 3.0,
    "message": "When I pulled the shoes out of the box I thought: these are fake. Quality is not what I expect from Nike. Cheap, no support, runs small, low in heal and narrow at the toe. The black Nike insignia across the top (bought light gray w/ aqua) is bad design. Did not notice this in pics. Will wear to walk dog around the block."
  },
  {
    "user": "thequeenrd",
    "rating": 5.0,
    "message": "Excelente calidad y muy cómodas"
  },
  {
    "user": "Teanna",
    "rating": 3.0,
    "message": "Not supportive at all. Very low on the ankles. They are super cute and comfortable but would not work out in them."
  },
  {
    "user": "KAM",
    "rating": 4.0,
    "message": "It's fine overall and they look nice. Just a little too tight at the arch and not as comfortable as I'd like for all day wear."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These were very comfortable and didn’t make my feet hurt I use them at work and they were perfectly fine and then I went to a golf tournament and they were soaked in water from being on the grass but nothing too bad"
  },
  {
    "user": "BRITTANY DEMIKE",
    "rating": 4.0,
    "message": "The tongue was kind of on the top of my foot and so it was a little skinnier than I thought I was going to return but then it got better I didn't feel it anymore because it was I wore the shoes out so broken so I give it one out of 10 I give it 6"
  },
  {
    "user": "Fabrici08",
    "rating": 4.0,
    "message": "The real deal, not much to say other than the sole's design does not look expensive, but the color and fabric is authentic nike material. Good purchase."
  },
  {
    "user": "Nancy  D",
    "rating": 1.0,
    "message": "I have been wearing Nike sneakers for years for tennis and gym.  I absolutely love Nike sneakers.  These sneakers are awful.  They have no support at all, they squish down as you are trying to put your foot into them, and the tongue is humongous and it sticks way up which looks ridiculous.  I can't believe Nike made this shoe.  I am so disappointed!  I have literally thrown them away and am buying another style."
  },
  {
    "user": "Catherine Scholl",
    "rating": 3.0,
    "message": "I’m going to keep the tennis shoes, though they still need a lot of work. They are extremely, extremely tight across the bridge underneath your toes. I even had three other people try them on and they both experienced the same thing. That said, they are very light, and the price point is good, so I’m going to just see if I can stretch them out."
  },
  {
    "user": "Clarissa Bachand",
    "rating": 4.0,
    "message": "A little small but matches everything and very lightweight"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They are great for dancers! Long rehearsals are hard on your feet. These shoes are sleek and comfortable perfect for musical rehearsals."
  },
  {
    "user": "MissAmy72",
    "rating": 2.0,
    "message": "Order a size down."
  },
  {
    "user": "Brenda B",
    "rating": 2.0,
    "message": "This is a very cute shoe. I so wanted to keep it but it’s just to narrow. Hurt tops of my feet and outside of foot."
  },
  {
    "user": "Sirena",
    "rating": 5.0,
    "message": "Todo me gustó"
  },
  {
    "user": "Maritza",
    "rating": 5.0,
    "message": "Muy bonito color."
  }
]