[
  {
    "user": "Anm",
    "rating": 5.0,
    "message": "Purchased these for the man. He said they were comfortable and we are going to keep them. He's and 11/12w so I ordered a 13 to allow for the foot width to be right. Pretty shoes."
  },
  {
    "user": "CPOSharkey",
    "rating": 5.0,
    "message": "Bought for the comfort and look. They are super comfortable and they look too good for shorts! I where them when we go out to dinner and functions!"
  },
  {
    "user": "Herman Porter jr",
    "rating": 4.0,
    "message": "The fit was very nice."
  },
  {
    "user": "Miguel",
    "rating": 5.0,
    "message": "Are very comfortable and they're good quality"
  },
  {
    "user": "juli",
    "rating": 4.0,
    "message": "Husband wore these shoes in size 16. Nice shoe but not all that supportive. Nice for casual wear but not for walking. Very hard to find large sized shoes so these are among the best we could find."
  },
  {
    "user": "Nicola Johnson",
    "rating": 5.0,
    "message": "My boyfriend loved itm fits well and is comfortable"
  },
  {
    "user": "Jersey",
    "rating": 5.0,
    "message": "I’ve never been the one to come back and write a positive review for an item, but this has to be my favorite pair of shoes ever. For it being a flat soled pair of shoes, it’s impressive how much support and comfort these provide. It’s been almost a month, I wear them regularly, and they are holding up nicely! No Dr. Scholl insoles required here. Great pair of shoes."
  },
  {
    "user": "Sam D.",
    "rating": 4.0,
    "message": "No problems at all with the shoe other than the lack of support. You don’t expect it by looking at it but it’s not a shoe you’d want to walk around all day in."
  },
  {
    "user": "mike",
    "rating": 4.0,
    "message": "This was from amazon personal shopper. This is not my type of style for shoes. They weren't that comfortable but I normally wear sneakers. My wife loved them but I decided not to get them."
  },
  {
    "user": "Peter Brothers",
    "rating": 4.0,
    "message": "Maybe this goes without saying, but it'sprobably  not a shoe to wear if you plan on traversing outdoor terrain. You'll feel every pebble. Still look nice and don't seem poorly made otherwise."
  },
  {
    "user": "Liza Wess",
    "rating": 5.0,
    "message": "My boyfriend loves these shoes..they are just right for the summer.."
  },
  {
    "user": "Andrea",
    "rating": 4.0,
    "message": "Dirties easily, but cleans up easily as well.  Comfortable, but no arch support, and very little structure.  Basically a dressy version of Vans, albeit less cushioned.  4 stars."
  },
  {
    "user": "JEFFREY JENKINS",
    "rating": 4.0,
    "message": "My only real disappointment is I thought they were supposed to be leather from the photo, but it is a good looking shoe and fits well. For the price no complaints."
  },
  {
    "user": "Mike Prince",
    "rating": 4.0,
    "message": "I feel that they look good with shorts or long pants."
  },
  {
    "user": "R. McNew",
    "rating": 4.0,
    "message": "These shoes look very nice and are comfortable enough for casual wear.  The quality could be better as they start to fall apart around the sole  after a few months of wear"
  },
  {
    "user": "Nicholas",
    "rating": 5.0,
    "message": "I love these shoes! They're comfortable, stylish, and versatile (great for nearly every occasion). I wear them around town, to work, and I've worn them dancing a few times. They haven't stretched after being caught in the rain and the gray is very resistant to stains. I wouldn't wear them in snow, ice, or heavy rain because the bottoms don't have much in the way of water-diverting treads. They'd probably be slippery in those conditions."
  },
  {
    "user": "Red Ocelot",
    "rating": 3.0,
    "message": "These shoes fit as expected however don’t expect to wear these comfortably as the insole padding is pretty much non existent. I had another pair of Madden’s and they had a similar problem. I guess the Madden brand isn’t for me."
  },
  {
    "user": "M. G. Groesbeck",
    "rating": 2.0,
    "message": "FOR SHOWIG NOT GOING I just purchased a pair of the light colored ( and most expensive) dress sneaker. After taking them out of the box and inspecting them I have decided I will only be able to wear them indoors a few hours at a time.  This shoe looks okay but is not practical for walking or everyday use. The width is narrow as pictured which is part of the sleek dress look. Unfortunately the materials used are poor quality and it is assembled badly as well. The insoles have a cheap and poorly cushioned foam and as stated in previous reviews: no arch support. My advice:  Don't be cheap! Go ahead & spend a few extra bucks for a quality dress sneaker. You get what you pay for."
  },
  {
    "user": "Michael and Mary Taylor",
    "rating": 5.0,
    "message": "My husband loves these shoes. They aren’t “dress shoes” like he would Wear to church but they’re dressy enough that he can wear them to work. He wears dress slacks and a button up or callar shirt. He says they’re  comfortable, not the best he’s ever had, but good. he’s on his feet walking hospital job sits a few hours at a time and comes home without needing a foot rub which is a win win for both of us. As the wife I think shoes look great. They don’t seem to collect dust or grim and have held up over the last few wears like new."
  },
  {
    "user": "G. Hollie",
    "rating": 5.0,
    "message": "Would purchase again. The only thing i did was replace the shoe liner with one with more padding."
  },
  {
    "user": "Kenny Prescott",
    "rating": 4.0,
    "message": "The shooed look nice. Seem to be made well. They fit a little big and the don’t have much padding. These together cause some rubbing. Perhaps if I put some cushioning in the shoe these issues will be fixed."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Way too small. Returned"
  },
  {
    "user": "DWC",
    "rating": 5.0,
    "message": "Nice , casual shoe.. comfortable"
  },
  {
    "user": "Meghan Morrison",
    "rating": 3.0,
    "message": "Runs a little small and narrow so we had to return it. Really cute show for my husband just not the right size and could order bigger. He is 6’5” so it can be hit or miss on shoes."
  },
  {
    "user": "Linda Sams",
    "rating": 5.0,
    "message": "Bought these shoes as a Birthday gift for my son. He really liked the shoes and said that they were comfortable. But the shoe size was off. I ordered his usual shoe size but much to my surprise the shoes were a lil too big."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "This review is for the Steve Madden Men's Fenta Fashion Sneaker - Grey Fabric. These shoes look good, but don't look quite as I expected.  The fabric is a slightly darker grey and the soles are much more of an aged white than depicted.  My pair didn't have any of the defects shown in other reviews. My first complaint is that these shoes are very stiff.  Sure, I haven't broken them in yet, but I have purchased plenty of shoes in my life and none were this rigid.  If this changes after they are broken in, I will update my review.  My second and biggest complaint is that these shoes are very slippery on tile flooring.  They are worse than socks!  Though they do have a normal amount of grip on carpet/sidewalks. Bought these shoes on Cyber Monday.  Looks like I saved $3 off the regular price. Update: After closer inspection, the soles are coated with a fibrous material causing them to be slippery. After about a mile of walking on pavement, enough of this material will wear off to increase the grip to an acceptable level.  Just be cautious about going to the grocery store in a brand new pair of these shoes."
  },
  {
    "user": "Felipe",
    "rating": 3.0,
    "message": "mala calidad, ya se despega la suela con una semana de uso"
  },
  {
    "user": "Chris",
    "rating": 5.0,
    "message": "A good sneaker for general wear. Love the look. The fit is comfortable with a bit of room, which I appreciate for wearing wool socks during the cold months. The sole is completely flat, which is not good for me. I always replace the insoles of my footwear for better arch support. However, the ones that came in these are glued down pretty aggressively. Hopefully, I can get them out if I find the lack of support unbearable."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "I have has the shoes about 2 months. The heal has separated from the body of the shoe and there is a hole where to two meet. i like the style and fit, just wish the quality was better for the price."
  },
  {
    "user": "Michael6296",
    "rating": 3.0,
    "message": "Good fit. Sharp looking. Absolutely no support. If you need to wear all day or walk a bunch of steps, try something like Hey Dudes. If you need to look sharp for an hour or two, these are a great value."
  },
  {
    "user": "saravanan Subramaniam",
    "rating": 5.0,
    "message": "Excellent…!"
  },
  {
    "user": "Danny Muskrat",
    "rating": 2.0,
    "message": "The look of the shoe is good, fit as expected, but barely got 5 months of use out of them before fabric became unglued from the rubber. Only used 2-3 days per week in office environment."
  },
  {
    "user": "craig nelson",
    "rating": 5.0,
    "message": "Looks just like the picture and looked great in my feet"
  },
  {
    "user": "jerry",
    "rating": 3.0,
    "message": "I like the shoes. They seem to be made of decent quality materials. Although they would have received a lot better review had they offered a wide option for the sizes. Most shoes work without me needing a wide in my size. However, with these I would definitely need a wide in order to wear for an extended period of time. The heel is of decent width. They area around the balls of my feet and toes was narrow compared to my expectations. I feel that the price is to high given that there isn’t a wide size option. If they were half the price I wouldn’t have any complaints because I would have expected the fitment to be a little off. As far as arch support. There was not hardly any to to mention. But in this style I wasn’t really expecting a ton anyway. The color is nice and pretty much exactly what I expected. But again my main complain is the toe box being to narrow. After the first full day of wearing them my toes were hurting once I took them off."
  },
  {
    "user": "Kary Donohoo",
    "rating": 4.0,
    "message": "Not exactly what I was expecting, but that's what you get ordering shoes online!"
  },
  {
    "user": "Colin R.",
    "rating": 3.0,
    "message": "These are pretty good, but my only complaint is that the rubber in the bottom has a white layer that comes off easily. It looks like it was sprayed on and reveals a yellowish underneath"
  },
  {
    "user": "Svetlana",
    "rating": 5.0,
    "message": "Nice shoes"
  },
  {
    "user": "Danielle",
    "rating": 5.0,
    "message": "Toe box too small. Not wide enough."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "The fit is OK just not as expected"
  },
  {
    "user": "Mrugesh Gharat",
    "rating": 4.0,
    "message": "Good material, just that these shoes should be little wider"
  },
  {
    "user": "Joni Gee",
    "rating": 3.0,
    "message": "Ordered 10.5. They were like boats on his feet.  Gave them to my son in law who is a size 12."
  },
  {
    "user": "SoCal Framer",
    "rating": 2.0,
    "message": "Nice looking pair of shoes and was looking forward to wearing them.  I'm a US 10.5/UK 9.5/EU 44 with moderately wide feet.  The shoes looked great out of the box, put them on immediately, and moved my right foot towards the front door, and the shoe decided to stay home; literally stepped right out of the shoe.  I was never a big fan of the style of footwear extending down the block five minutes in front of you but these shoes have what seems like (with very little exaggeration) 7.5cm / 3\" of toe room up front.  The toes were so long I couldn't walk in them, and I had to tie the shoelaces so tightly to keep the shoes on that they were uncomfortable to wear.  They're being dropped off at Whole Foods tomorrow for the return.  Oh, well, this is why I don't buy shoes and other clothing online."
  },
  {
    "user": "Robbie C. Jenkins",
    "rating": 3.0,
    "message": "Fits fine but low quality, lace eyelets are jagged and rip your laces. The 'Leather' on the back peels instantly. Not a lot of padding under foot. Don't recommend."
  },
  {
    "user": "Trey",
    "rating": 5.0,
    "message": "Awesome shoe but if you have wide feet they will bulge out the side of the shoe. I wish it was in a wider size. I've worn them a few times so I don't thinking can return them."
  },
  {
    "user": "scap",
    "rating": 2.0,
    "message": "this shoe looks nice but fit all wrong and needs better arch support"
  },
  {
    "user": "Kyle",
    "rating": 5.0,
    "message": "It fits amazing and looks good too"
  },
  {
    "user": "George Smart",
    "rating": 4.0,
    "message": "Shoes are very comfortable, only problem was one of the laces lasted a couple of weeks before breaking."
  },
  {
    "user": "Ashlee culver",
    "rating": 5.0,
    "message": "I bought these for my boyfriend and he loves the look and the material he just says he wishes they were easier to put on."
  },
  {
    "user": "TrooperChicago42",
    "rating": 5.0,
    "message": "These shoes are the most comfortable I own and they look great in every out fit I have and I’m very happy with them."
  },
  {
    "user": "shakeyeraz",
    "rating": 5.0,
    "message": "These are nice and a good value."
  },
  {
    "user": "Ryan",
    "rating": 3.0,
    "message": "They look great, but are very uncomfortable.  I had to add an insole just to be able to wear them."
  },
  {
    "user": "James Russell",
    "rating": 5.0,
    "message": "Shoes came in and got as expected as well as comfort. Going to order a different color"
  },
  {
    "user": "Sandra Donald",
    "rating": 4.0,
    "message": "Pretty good shoe. A little longer and narrower than sketchers"
  },
  {
    "user": "Stewart Orgain",
    "rating": 5.0,
    "message": "Good fitting shoe. More comfortable than expected.."
  },
  {
    "user": "Cooper Thoughts",
    "rating": 3.0,
    "message": ""
  },
  {
    "user": "Chen Wei",
    "rating": 4.0,
    "message": "I like the pair of shoes, look neat and smart, and comfortable to wear. The width is a little narrow for me at the beginning, but I guess became better later. Overall a happy choice."
  },
  {
    "user": "Jay",
    "rating": 5.0,
    "message": "These things fit great! Amazing shoes for the price. These things are super stylish and comfortable. Debating getting the other colors just because they are so cheap!"
  },
  {
    "user": "Smitty",
    "rating": 5.0,
    "message": "Looks great"
  },
  {
    "user": "omar",
    "rating": 5.0,
    "message": "I like them, they do the job, they are on my feet as expected."
  },
  {
    "user": "Hawk",
    "rating": 5.0,
    "message": "Great looking shoe and very comfortable!!"
  },
  {
    "user": "Austin Schultz",
    "rating": 3.0,
    "message": "These work.... as shoes... I got the black ones. You can tell the material is lower quality. They fit just a bit big for me. I wear a 10.5 and have wide feet.; the width is fine. Not worth the money if you ask me.... Dont feel like I got my moneys worth."
  },
  {
    "user": "davesdeadman",
    "rating": 3.0,
    "message": "I am size 10 1/2 and usually have room for my toes. I ordered size 11 1/2 and my toes almost touch the inside front of the shoe and feels cramped. Would not buy Again."
  },
  {
    "user": "Eli",
    "rating": 2.0,
    "message": "With no arch support, these shoes are not made for people who do a lot of walking. The plus is they look nice and are light."
  },
  {
    "user": "Jose",
    "rating": 3.0,
    "message": "Toe box feels tight and not comfortable. The quality of this product is not great"
  },
  {
    "user": "Mia'Liza Schnur-Garza",
    "rating": 4.0,
    "message": "Bought these as a gift for my boyfriend. Great daily’s. He runs through shoes like breathing air. They lasted about 6 months of hardcore everyday wear ( works as an auto technician). Fit perfect no rubbing issues. Only thing was that the price is steep for shoes that would probably last 9-12 months with moderate use."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This product is a steal for price & quality! Bought it for my bf for Christmas. They match with everything!"
  },
  {
    "user": "Cody Sams",
    "rating": 2.0,
    "message": "Ordered my typical size. Toes were  little tight, overall fit on my foot was alright, but the heel is so loose, it's one of those fits  that just constantly move up and down on your heel. If I got a size any smaller it would be uncomfortably small. Overall not great."
  },
  {
    "user": "Christian",
    "rating": 3.0,
    "message": "Aside from the cost of the shoe very much reflecting in the quality of the build, the materials feel a little cheap. It also is not sized precisely, so be prepared to use inserts to make them fit properly if needed. They are aesthetically appealing and work well for a more dressed down look or even a modern business look. I wouldn't advise wearing these for day to day wear as they are not very comfortable. Not a bad shoe if it's the style you're after but definitely leaves a lot to be desired."
  },
  {
    "user": "Elizabeth Morrison",
    "rating": 3.0,
    "message": "Hubby like it, however it does not support his flat foot."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "These look nice, but after about 3 months of wearing them, the top of the shoe ripped right off of the bottom. I've never had that happen before with a pair of shoes. Very poorly constructed."
  },
  {
    "user": "Michael Nagata",
    "rating": 5.0,
    "message": "For the price I excepted cheap quality but I was amazed at the fit and quality of the shoes."
  },
  {
    "user": "Guilherme",
    "rating": 4.0,
    "message": "Looks as good as in the pictures, happy with this purchase, plus it is good quality."
  },
  {
    "user": "CN",
    "rating": 5.0,
    "message": "They fit perfectly and went great with sons homecoming suite.  Rare to find causal shoes in his size.  These were exactly what we were looking for!"
  },
  {
    "user": "Jose",
    "rating": 4.0,
    "message": "I love it"
  },
  {
    "user": "James W. Saunders",
    "rating": 4.0,
    "message": "I love these shoes. They fit and look great."
  },
  {
    "user": "Jenna A Campbell",
    "rating": 4.0,
    "message": "I’m giving these a 4/5 because my husband has only worn them a few times and we don’t know how long they’ll hold up. This is a great casual shoe to wear with shorts. I would recommend wearing them if you plan to do a days worth or walking, as they offer little to no arch support."
  },
  {
    "user": "N. Lasure",
    "rating": 2.0,
    "message": "Overall dig the look, but reality is an oddly elongated shoe and tight toe box. My pinky toe hits the side where it narrows but my big toe feels too far away. I could live with this if the shoe was comfy but already on day one with only around 6,000 steps my feet hurt."
  },
  {
    "user": "Adrian Flores",
    "rating": 3.0,
    "message": "These shoes run WAY too large. Usually 11's fit quite well, and the size chart said 10.95\", which was fine, but these shoes are nearly a foot long measured from the bottom, and maybe half an inch shorter when measure inside. Needless to say they're too large for me. The shoes are actually really nice, good quality, but buy it at least one size smaller and, again, do NOT trust the size chart. It's wrong."
  },
  {
    "user": "J. Canipe",
    "rating": 4.0,
    "message": "Overall the shoe is pretty good. It is not made as well as Van's, but it will do the job for similar applications. Will consider buying another."
  },
  {
    "user": "Duke_Webb",
    "rating": 4.0,
    "message": "Pretty good shoes. I got tired of being an adult in my 30's and always wearing sports type shoes for daily use, so I got these as something more \"grown-up\" and they're pretty good for what you pay. I will recommend adding some Dr. Scholl's inserts though, as the insole pad is not great."
  },
  {
    "user": "eric",
    "rating": 1.0,
    "message": "I got this shoe thinking they would be good support and comfy. I wore these shoes 3 times and the heel ripped and broke! I do NOT recommended  getting these pairs of shoes. Steve madden is a good brand but i think these are a knock off that. They do not stay in tack!"
  },
  {
    "user": "nitin k shah",
    "rating": 5.0,
    "message": "Perfect as I was thinking. Can recommend others to try it."
  },
  {
    "user": "Luis A. Navarro",
    "rating": 1.0,
    "message": "B-day present on 2/22. Wear them ocassionally, and I mean OCASSIONALLY. shoes have become unglued, torn from the heel, horrendous quality, will request a refund or replacement for a better product"
  },
  {
    "user": "Gregory G.",
    "rating": 2.0,
    "message": "Shoes fit great but the stitching is surprisingly poor. After a few months being worn only once or twice a week, both backs completely ripped."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Shoes were what I paid for; however, the sole entirely separated from the rest of the shoe after less than ten uses. I was unable to request a refund via Amazon, but hope the manufacturer will provide a replacement."
  },
  {
    "user": "Curtis Winterfeld",
    "rating": 3.0,
    "message": "Shoes seemed OK, but didn't fit my foot at all.  The toe box was very wide and \"tall\", leaving the fit much too loose/sloppy.  I ordered a pair of Aldo's of the same size (9.5) which fit perfectly.  The style seemed good, but I can't comment on quality since I immediately returned them."
  },
  {
    "user": "Betsy Tyler",
    "rating": 5.0,
    "message": "My husband doesn't have many pairs of shoes, so I knew that whatever I got him would have to be durable, comfortable, and look good at most occasions. He loves them and wears them all the time!"
  },
  {
    "user": "Addam Carothers",
    "rating": 4.0,
    "message": "Nice clean design, I like the color, definitely not a shoe to wear in the rain"
  },
  {
    "user": "Logan Kellogg",
    "rating": 4.0,
    "message": "Nice shoe. Slightly large. I would recommend going one half size down (i.e. I wear 11.5, should have ordered 11). My only complaint is that the heel squeaks a bit after prolonged walking. Might just be my feet. Also, the shoe itself is thin, so I find them more comfortable with thicker socks. Other than that, I really like these shoes"
  },
  {
    "user": "Steven Allerkamp",
    "rating": 4.0,
    "message": "Overall, I like these shoes. No issues with the fit and the quality isn’t too shabby for the price point."
  },
  {
    "user": "Mctabor",
    "rating": 3.0,
    "message": "Run big"
  },
  {
    "user": "JaredArbuckle",
    "rating": 3.0,
    "message": "No support in the sole, feels like you're wearing socks. Looks nice enough though, you get what you pay for."
  },
  {
    "user": "Zachary Christian Younge",
    "rating": 5.0,
    "message": "Looks good with straight cut jeans."
  },
  {
    "user": "jawhk fan",
    "rating": 2.0,
    "message": "Returned, not very comfortable"
  },
  {
    "user": "Chris",
    "rating": 3.0,
    "message": "The shoe fits and looks nice, but after just 4 or 5 times wearing them around, they're beginning to fall apart. the rubber sole is coming unglued from the canvas. I haven't done anything but just walk around in them. It's pretty disappointing. If the quality were better, I would absolutely love them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My husband loves them!"
  },
  {
    "user": "Cesar Depaz",
    "rating": 2.0,
    "message": "They look all right and fit relatevily well, but they are not comfortable at all.  The cushion is almost non existent.  I would not recommend it.  I wish I could return them."
  },
  {
    "user": "Vinnie G.",
    "rating": 4.0,
    "message": "Nice looking shoes, pretty comfortable so far.  A little bigger than expected, maybe half a size but they fit well enough."
  },
  {
    "user": "Customer",
    "rating": 5.0,
    "message": "Los zapatos me quedaron muy bien. Estoy satisfecho con la compra"
  },
  {
    "user": "Trevor P",
    "rating": 4.0,
    "message": "These are some very nice classy shoes! Just a bit long in the toes, but overall great fit and look!"
  }
]