[
  {
    "user": "Louis A.",
    "rating": 4.0,
    "message": "The product came in packaged in the puma box. Brand new (not returned and then redistributed). The shoe looks great and the suede is nice. They spot a little if your caught out in the rain. The tow box is a little more narrow than I’m used to. Arch is ok. Over all they are a little tight. They are the correct size me.  One size up would be too big and one size down would’ve been tight and I would have returned them.  My suggestion, if you have a wide foot, this is really not for you. This is not their fault but had the toe box been a little wider, they would have gotten 5 stars."
  },
  {
    "user": "Frank wojcik",
    "rating": 5.0,
    "message": "Look and feel like the 80s pumas"
  },
  {
    "user": "Jason",
    "rating": 5.0,
    "message": "Fits great and looks great! Also very comfortable!"
  },
  {
    "user": "Paul DeConti",
    "rating": 5.0,
    "message": "Have been wearing these types of Puma's forever.  Always well made and always very comfortable.  Looking to get more colors in the future. Keep it up Puma!"
  },
  {
    "user": "Jay Pluimer",
    "rating": 5.0,
    "message": "Extremely comfortable and durable shoes that go with almost any casual outfit. My go-to travel shoe!"
  },
  {
    "user": "Sivio Sadath Sanjur",
    "rating": 5.0,
    "message": "Me agradan por clásicas conserven el estilo funcionan para diferentes ocasiones"
  },
  {
    "user": "dmann",
    "rating": 5.0,
    "message": "They ran a bit smaller than usual puma clydes.  The size 12 fit but it was a bit tight."
  },
  {
    "user": "Angel MERCADO",
    "rating": 5.0,
    "message": "Buying a pair of sneaker."
  },
  {
    "user": "Tasha S",
    "rating": 5.0,
    "message": "My husband had a red pair and so I got him the blue ones. He loves them. They are durable and comfortable."
  },
  {
    "user": "John Solorio",
    "rating": 5.0,
    "message": "I was looking for a casual shoe to wear with jeans and these were perfect."
  },
  {
    "user": "Mhizz Gorgeous",
    "rating": 5.0,
    "message": "Don’t think twice get it now fits as expected"
  },
  {
    "user": "Jacinta",
    "rating": 4.0,
    "message": "Todo. para trabajar"
  },
  {
    "user": "alesha clayton",
    "rating": 5.0,
    "message": "Brought for my daughter, she has wide feet and can’t wear certain sneakers, these were perfect. Wish these came in pink or purple I would definitely order more."
  },
  {
    "user": "GD Zimmerman",
    "rating": 5.0,
    "message": "I LOVE these shoes. They are beautiful and got well.  They are classic,  so don't expect great arch support."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Runs small so size up."
  },
  {
    "user": "Tiffany",
    "rating": 5.0,
    "message": "Perfect fit and fast delivery no complaints here"
  },
  {
    "user": "Jordan M",
    "rating": 5.0,
    "message": "Black Pumas With a brown sole are a bit rare. Sneaker heads know! I got these in 3 days!! NICE I've got this shoe in every color I can find. Do yourself a favor get 2 pair the black with white sole is sharp looking as well. I ride my HARLEY in these, work, workout you name it Puma is for the \"Big Cats\" If that's you...This your shoe. Or if your not impressed the return policy is top notch. No im not a paid spokesperson I give straight up reviews if its crap I make it more than known. If its quality as in this case ill let you know? Still can't believe they had the brown sole? AWESOME!!"
  },
  {
    "user": "Bams",
    "rating": 5.0,
    "message": "Comfortable, durable, looks great - you can literally wear it with anything. My 2nd purchase can’t really find anything to beat it."
  },
  {
    "user": "Issaic",
    "rating": 4.0,
    "message": "The shoe box is very tight, but after breaking them in, they fit decently. They don't hurt my feet, and they look absolutely beautiful, so I'm happy."
  },
  {
    "user": "Bruce Harala",
    "rating": 5.0,
    "message": "Shoes are a little tight, but hopefully will loosen up after they have been worn for a bit. I use the shoes to wear."
  },
  {
    "user": "Rafael Nunez",
    "rating": 4.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Robin Johnson",
    "rating": 5.0,
    "message": "What can I say I got some Pink jeans to rock these pink shoes pink shorts pink shirt can't touch it"
  },
  {
    "user": "mmontez",
    "rating": 4.0,
    "message": "Great shoe, good quality, but the shoe is a bit on the narrow side."
  },
  {
    "user": "Kempdaman",
    "rating": 3.0,
    "message": "Unisex wasn't in the description when I bought the shoes it said men's didn't want a unisex shoes"
  },
  {
    "user": "Atmore!",
    "rating": 5.0,
    "message": "Clasicc shoes.... Love the style"
  },
  {
    "user": "Isaiah D.",
    "rating": 5.0,
    "message": "I stand on my feet all day anywhere from 8-12hrs a day in a warehouse so comfortable shoes are a must and these fit the bill. Good for walking/exercising too. I don't like to write reviews too soon after getting stuff so they are a bit worn in the photo, the black dots are ink I spilled at work not a part of the design or flaws just fyi :-)"
  },
  {
    "user": "Matthias Sebastiun Garry",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Trob",
    "rating": 4.0,
    "message": "the shoes looked wonderful but had to return them because they were to big"
  },
  {
    "user": "Scott Irwin",
    "rating": 5.0,
    "message": "Fits well, comfortable and great traction. All the younger folks at work complment this shoe, for what that's worth. I wear a 13 and it is not too tight. I would buy these again."
  },
  {
    "user": "Jeremy P Sipes",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "henrry montero",
    "rating": 5.0,
    "message": "Bien"
  },
  {
    "user": "Lee Butler",
    "rating": 5.0,
    "message": "This shoe is a classic. I've loved it since childhood, it will meet all of your expectations."
  },
  {
    "user": "Vanessa P.",
    "rating": 5.0,
    "message": "Shoes fit and feel great even when on feet all day"
  },
  {
    "user": "Bill",
    "rating": 3.0,
    "message": "these shoes look cool.  they are like walking on the ground barefoot though, like paper thin bottoms.  Also, they seem to be narrow, but after wearing a day or so at work they stretched a little.  My advice is to wear these only when you do not plan on doing any extensive walking because they have no support or comfort.  But they do look good."
  },
  {
    "user": "AZFLHX",
    "rating": 3.0,
    "message": "I love Pumas, have for a long time. I’ve always worn size 11 (since 1990) and these are toothpick thin. I still gave it a 5 on value because if they fit they’d be great but common…."
  },
  {
    "user": "Robert Taylor",
    "rating": 4.0,
    "message": "The style and look. They look awesome. Love them...they'll last too!"
  },
  {
    "user": "Robert & Sherry Casey",
    "rating": 4.0,
    "message": "These shoes are not suede like I thought but some cotton/polyester blend which is ok. If  you have feet that are a little wide or a lot these are not the shoes for you. They are narrow in the toe and tight fitting. They look awesome on the shelf."
  },
  {
    "user": "Brian L",
    "rating": 5.0,
    "message": "Most comfortable pair of shoes I own. Love these Pumas even more than the last pair."
  },
  {
    "user": "Lenin A.",
    "rating": 4.0,
    "message": "todo muy bien.. super confortables"
  },
  {
    "user": "Anonymous customer",
    "rating": 5.0,
    "message": "A little heavy but very durable and comfortable"
  },
  {
    "user": "Wa",
    "rating": 3.0,
    "message": "I love the sneaker but I find the heavy for me."
  },
  {
    "user": "Scott Curtis",
    "rating": 2.0,
    "message": "I bought these in my size and tried to wear them just as anyone would.  They were far too tight and after a very short period of time I had to put on a different pair of sneakers.  I placed shoe stretchers into them and attempted to stretch them out a bit.  Even after a week with the stretchers still in place the sneakers were too uncomfortable to wear. I'm very sorry I ordered these and will probably just donate them or worse throw them out. Waste of my money and won't purchase this brand again."
  },
  {
    "user": "Julio Cesar Cruz",
    "rating": 5.0,
    "message": "Pareciera que no ha pasado la revisión de Control de Calidad y da un tamaño menor que el comprado."
  },
  {
    "user": "Meeyong & Louis",
    "rating": 2.0,
    "message": "I know Puma runs small,  ordered a size up and still a bit narrow,  but they'll probably break in OK.  Took almost two weeks to get here WITH prime and showed up WITHOUT A SHOEBOX. I purchased new sneakers and either the seller or Amazon is passing a returned item off as new.  I'm not a collector but I do like  to keep them in box so I know what to grab."
  },
  {
    "user": "Brian T. Haugen",
    "rating": 5.0,
    "message": "Fit great look great. Fits to size"
  },
  {
    "user": "Dreah",
    "rating": 5.0,
    "message": "My father loved his shoes for Father's Day"
  },
  {
    "user": "MBondy",
    "rating": 3.0,
    "message": "Always wear a 9.5 with Adidas and converse so I ordered these and they look right just way too tight in the front."
  },
  {
    "user": "Jeff",
    "rating": 3.0,
    "message": "I ordered the blue sneakers and while they look good, they are definitely a cheaper version of the classic and they are 100% NOT suede, hence -2 stars. I have a black pair from a couple years back and those are absolutely Suede and considerably more comfortable. These are a synthetic copy of the original. I don't know why the description indicates these are suede. If you look at the pictures of the blue, the 1st picture is what you will receive. You will notice in the other pictures, the shoes ARE suede as you can see the difference in the amount of furryness (lol) which is what they would look like if they were legit suede."
  },
  {
    "user": "Jeffery",
    "rating": 4.0,
    "message": "4 stars because of major price cut.  I would be pissed if I paid over $100."
  },
  {
    "user": "Ernie",
    "rating": 5.0,
    "message": "Very good quality."
  },
  {
    "user": "maria",
    "rating": 5.0,
    "message": "I love these Pumas! This is probably my 7 pair in 10 years. Its the only shoe I wear day in and day out. I live in NYC and walk everywhere. Unless it’s snowing or raining hard, this is the shoe I wear. Comfortable, supportive, stylish and reasonably priced. When I start to feel the insoles wearing  down, I get a pair of the Superfeet insoles and I get more mileage from the sneakers. The sneaker itself never rips or falls apart. The only reason I get a brand new pair is because sole gets some wear and tear. Totally normal for the amount of walking I do and the hell I put them through."
  },
  {
    "user": "irishoneild",
    "rating": 5.0,
    "message": "Fresh AF old school, always in style"
  },
  {
    "user": "Tyler J Mallory",
    "rating": 2.0,
    "message": "Thought they felt funny the first week of wearing but allowed them to break in once they got slightly dirty the uneven leather popped out. Obviously can’t return now as I’ve been wearing them. I did think I was buying nice new shoes, not the returns or faulty ones. Amazon is starting to bum me out with the quality of product that shoes up."
  },
  {
    "user": "S. Hammet",
    "rating": 2.0,
    "message": "I'm a regular size guy, who wears a regular size 10...not a wide, not a slim, but a regular size 10 like you find anywhere you look.  But these aren't those shoes.  These are made for small, thin feet, probably not unlike the person who made them.  One supposes the foot blanks used to size these shoes are modeled on thinner framed feet.  It's not that the leather won't eventually stretch (the one's I got are suede).  it's that the rubber sole is about 3/16ths of an inch too narrow, so I can feel the edges of my feet in the toe box resting on the rubber outsole walls.  I wore them for a few weeks to see if they would break in, but all that did is make things more pronounced.  As the insole molded to my foot, I could feel the outsole walls more and more. Great shoes if you have feet like skis and normally find shoes are too wide in the toe box."
  },
  {
    "user": "Kmetz007",
    "rating": 5.0,
    "message": "Good looking shoes. Worth it."
  },
  {
    "user": "Christina Ponce",
    "rating": 5.0,
    "message": "My boyfriend loved theses shoes"
  },
  {
    "user": "Vonnie",
    "rating": 5.0,
    "message": "My husband loves these sneakers for Fathers Day"
  },
  {
    "user": "Blanca Berlanga",
    "rating": 4.0,
    "message": "Me gusto por que me queda ala meduda pero un poco incomodo el sopor de la plantilla"
  },
  {
    "user": "Phil7845",
    "rating": 3.0,
    "message": "5 Star price, 5 star look/appeal, however, because of the left shoe and left shoe only (the same thing with my all white Puma Baskets, there is some sort of pressure that presses against my left 5th digit (pinky toe) and it is beyond uncomfortable. The right shoe does NOT do this (nor does it with the Baskets) and I don't know what is causing this? I do not have abnormal feet, my feet are not fat or too wide, I am 5'11.1/4\" exactly barefoot and weigh 155lbs. Does this sound like someone with too fat of a foot? What kills me is that they look/appear wider than my also beloved Gazelles that Adidas makes, however, they and I have four pair of them, do not do that at all??? So I can't quite figure it out, but as far as being able to style and profile with these, it hurts too much to look friggin awesome in these blue on blacks. So I wish someone from Puma could explain why they are screwing up design construction on their left shoes? My ever so ubiquitous black and whites, left shoe is fine, but these my Baskets, are anything but fine. It's tough having a beautiful shoe you are afraid to wear because of the pain they cause the left 5th digit. Buyer beware of these design flaws, because it may end up happening to you..."
  },
  {
    "user": "Montoya1347",
    "rating": 5.0,
    "message": "2nd time I purchased Puma's and am becoming enamored with them."
  },
  {
    "user": "ed v",
    "rating": 4.0,
    "message": "Fit good"
  },
  {
    "user": "Michael Miceli",
    "rating": 5.0,
    "message": "6’2, 200 lb Male Athlete.  Cool Shoe,  Goes awesome with white, grey, tan, light blue, and of course black jeans/pants. Super casual and comfy. Go with your normal size. Mine is a 11.5 and I decided to go with 11 and they are a bit snug around the width of the fore foot. Going w/ my regular size would have been better. With casual shoes, I like to keep the laces loose."
  },
  {
    "user": "Joseph s milito sr",
    "rating": 4.0,
    "message": "As soon as I bought them it went from 30 dollars to 60 I got a great bargain"
  },
  {
    "user": "jason grote",
    "rating": 3.0,
    "message": "I bought these to replace my adidas grand courts I wore out.  Compared to the adidas, these have a much more narrow toe box and feel cramped."
  },
  {
    "user": "B",
    "rating": 4.0,
    "message": "Still have to wear them in but they should be fine."
  },
  {
    "user": "Jonathan",
    "rating": 5.0,
    "message": "Cushioned and comfortable. Great price."
  },
  {
    "user": "Joseph A.",
    "rating": 5.0,
    "message": "Good buy. Will buy again."
  },
  {
    "user": "SML",
    "rating": 5.0,
    "message": "They are nice and fit well per my husband. Would recommend"
  },
  {
    "user": "Richard M.",
    "rating": 5.0,
    "message": "I like the sneaker. It fits perfectly. But in the future, please send me  size 10/10.5,the  size I ordered. Thank you...."
  },
  {
    "user": "kelvin",
    "rating": 5.0,
    "message": "I love the style and color."
  },
  {
    "user": "M.Rob",
    "rating": 4.0,
    "message": "New insole makes a difference"
  },
  {
    "user": "BestPersonYouKnow",
    "rating": 5.0,
    "message": "I had a pair of these when I was a kid and they were probably some of the most comfortable shoes I ever had.  I bought them out of nostalgia and was not disappointed when they arrived and I put them on!  It was like running into an old friend after not seeing each other for years.  Love them so much I ordered a pair and had them delivered to my best friend who used to loot my closet when we were kids.  It wasn't unusual for me to show up at school and spot him coming down the hall totally decked out in clothes that all belonged to me and which I had no idea were even missing from my closet.  His review was very similar to mine.  Highly recommended and will continue purchasing these until I am too old and crippled to rock sneakers any more!"
  },
  {
    "user": "Robert Hand",
    "rating": 3.0,
    "message": "To narrow"
  },
  {
    "user": "Elizabeth",
    "rating": 4.0,
    "message": "They arrived earlier then expected.  They are Softfoam which makes them comfortable,  They were good for the price."
  },
  {
    "user": "Michael M.",
    "rating": 3.0,
    "message": "I had a hard time keeping these shoes on. I guess if you drag your feet they won't fall off. They don't bend, and you definitely can't run in them"
  },
  {
    "user": "Jesus",
    "rating": 4.0,
    "message": "The shoes are beatuful but too small"
  },
  {
    "user": "Mr. On Time",
    "rating": 4.0,
    "message": "This is my first pair of Pumas that I have bought in a very long time, I usually buy Adidas or Nike shoes.  The look of the shoe is clean and classic looking, with the slate blue Puma stripe complimenting the darker blue of the rest of the shoe.  Having said that, the fit of the shoe (especially in the toe box) is really tight starting from the middle of the shoe.  I am hoping that the shoes will expand a little after breaking them in."
  },
  {
    "user": "Benrwells",
    "rating": 5.0,
    "message": "I'm wearing them right now.  They look and feel good."
  },
  {
    "user": "Brian Davitt",
    "rating": 4.0,
    "message": "the unisex \"smash run very small. I bought a half size larger and they still where to tight.i had to return then. There really nice otherwise"
  },
  {
    "user": "aj",
    "rating": 5.0,
    "message": "This is a great casual shoe. My 15 year old loves them."
  },
  {
    "user": "Tsvi",
    "rating": 3.0,
    "message": "I always order 12, for Puma, seems that 12.5 is needed."
  },
  {
    "user": "Javier Torres",
    "rating": 5.0,
    "message": "Love it!"
  },
  {
    "user": "jopi",
    "rating": 3.0,
    "message": "They look normal in smaller sizes, my wife likes her pair, but once you get to mens sizes they look wedge shape and pointed. They are incredibly tight in the toe box and relatively loose at the heel. I loosened the strings as much as they would go and it just isn't enough, my foot goes numb within minutes."
  },
  {
    "user": "jason w",
    "rating": 5.0,
    "message": "When you need to bust out some sick rhymes and some slick moves, you can’t go wrong with a German shoe. Personally, I like them because I can feel the pedals in my car better with skate shoes, so that’s why I buy them. But they offer little arch support."
  },
  {
    "user": "Evelyn Lugo",
    "rating": 5.0,
    "message": "I liked that they fit perfect and are very comfortable!"
  },
  {
    "user": "Frank",
    "rating": 5.0,
    "message": "everything good"
  },
  {
    "user": "Ginger Sanders",
    "rating": 3.0,
    "message": "These shoes run too narrow for my liking other than that they are ok"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these shoes"
  },
  {
    "user": "Dug",
    "rating": 3.0,
    "message": "I really like the looks of this shoe, very comfortable, but the quality is rubbish. I bought 2 pairs (different colors), and it's only been 5 months, I only wear each pair 50% of the time, and the insides on BOTH pairs are coming apart. I'm about as \"low impact\" as you can get. I sit in front of a computer screen all day for a job. Can you guys step it up and produce a better quality shoe?  Of course, how would I know, if I'm moving to a different brand?"
  },
  {
    "user": "NatalieBee",
    "rating": 4.0,
    "message": "Good shoes"
  },
  {
    "user": "Joel fox",
    "rating": 5.0,
    "message": "I liked the cushion"
  },
  {
    "user": "Steven P Gaunay",
    "rating": 4.0,
    "message": "Runs narrow"
  },
  {
    "user": "Joel Mieses",
    "rating": 4.0,
    "message": "El soft foam de adentro da una sensación de confort pero la suela es un poco dura y es un poco incomodo cuando llevas tiempo parado"
  },
  {
    "user": "Maurice Williams",
    "rating": 2.0,
    "message": "This is the first pair of shoes I felt compelled to return. These shoes are extremely narrow. I wore the shoes for all but 2 minutes and after I took them off, the middle of my foot felt extremely constricted. If you have even slightly wide feet, you should steer clear of this shoe."
  },
  {
    "user": "Barb T",
    "rating": 3.0,
    "message": "....but unfortunately it ran very narrow. Had to return  :-("
  },
  {
    "user": "Eugene Striffler",
    "rating": 5.0,
    "message": "Shoe is a bit small but I have wide feet. Wasn’t expecting a narrow shoe but other than that they fit fine."
  },
  {
    "user": "fikret safra",
    "rating": 4.0,
    "message": "Seller was on point, fast delivery and the right product. The shoes are really nice but unfortunately due to my flat feet they are very tight in the front. I will have to return these and start shopping for wide shoes. My mistake"
  },
  {
    "user": "Ich bin anonym",
    "rating": 2.0,
    "message": "I wanted to echo what other have said. The heel area of the internal sole disintegrated after a few weeks of casual wearing. I had to replace them with Dr. Schol's. Who know how long they will last. I will likely have to replace the pair of shoes entirely. Poor design, they don't last."
  },
  {
    "user": "Manozon",
    "rating": 4.0,
    "message": "I've always liked these Pumas, finally got a pair for myself and they look great.  I usually get a wider style for shoes but they are playable and the foam support is great."
  },
  {
    "user": "Dom",
    "rating": 5.0,
    "message": "great"
  }
]