[
  {
    "user": "Sarah",
    "rating": 4.0,
    "message": "I got the chalk/alabaster/blue Club C sneaker. I loved the way they looked not on my feet. But, once I put them on, I felt that they looked a little funny. The tongue of the shoe buldged out from behind the laces, making your foot look fat from the side view. If you have slightly wider feet, you are going to need to go up in either a half size or full size so your toes don't rub on the sides. The shoe itself made my feet look look small and large at the same time because of the slender design which made it look smaller on the sides and long in the toe box. The shape of the actual sneaker wasn't really attractive when put on. Don't really know how to describe the shape, other than a triangle from the side view. I returned and didn't repurchase a bigger size just because of the shape. Maybe it just wasn't my style. The shoe was comfortable, though."
  },
  {
    "user": "Allyssa Johnson",
    "rating": 5.0,
    "message": "Highly recommend! These are my second pair of white reeboks, my first time ordering from Amazon so I was skeptical ordering a pair online. They are real! Just like my other ones I got from the store many moons ago. Wear them with a dress or with some athletic wear or some cute jeans! We recently went to Texas Wine Country where we did a lot of walking and these shoes were perfect for a pregnant mama like me. They are comfortable and lightweight. They also do not seem to stain easily, having kids you get lots of things spilled on you, but I haven’t noticed any major stains - just your usual wear from walking around."
  },
  {
    "user": "Jason Matthew Williams",
    "rating": 4.0,
    "message": "Cute shoes but the shoes arrived laced with 2 different sized shoe strings so now I’m left to buy a new pair of shoelaces so that I don’t have mismatched laces!"
  },
  {
    "user": "jillian m.",
    "rating": 5.0,
    "message": "I LOVE these. They came on time and with both elastic shoelaces and classic shoelaces. Super comfortable, fit as expected. Not too bulky!"
  },
  {
    "user": "Huber",
    "rating": 4.0,
    "message": "they didn't ifit but thats cuz i chose wrong size. they're better now. mommy helped. i have ginormous feet. 10/10"
  },
  {
    "user": "Mrs. R",
    "rating": 5.0,
    "message": "No complaints with theses so far.  They look great and fit well."
  },
  {
    "user": "Erin",
    "rating": 5.0,
    "message": "I've worn every white sneaker (Vejas, Nike, Vans, etc) and these are the most comfortable AND cute all-in-one. I bring them on every trip with me now and even wear them out to dinner in the city with a dress (just like all the girls in Paris do, seriously. it's a walking city). Highly recommend. TTS"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "absolutely LOVE. everyone was telling me how reeboks are difficult and painful to break in, but honestly I haven’t had a problem after 2 months of wearing them. They’re so adorable and fit perfectly. They are great quality and i highly recommend- especially for the price. I had been looking for shoes like this for a while and they were all in the $100’s so these are worth the buy."
  },
  {
    "user": "Addelyn",
    "rating": 5.0,
    "message": "I am all for spending money; but when I put it on, it didn't feel like I was wearing $80 shoes. They make your feet look super narrow/long, but it is just in your head. They look great to other people and I guess that is all that matters right? I live in a place where it gets over 110 degrees each day, therefore, feet naturally sweat. These babies dont air out, at all. I dont wear these shoes if I am going to be outside doing stuff, they start squeaking from the sweat. Comfort is great though."
  },
  {
    "user": "Bassmasta911",
    "rating": 4.0,
    "message": "This is just a first impression, haven't worn them for months to test durability. I normally wear Adidas but wanted a pair of white shoes and found these. They are really fresh looking, the shoe is very soft on top of the foot and pretty firm on the sole."
  },
  {
    "user": "adelineliyang8",
    "rating": 4.0,
    "message": "I find this brand width is short for me. length is just right."
  },
  {
    "user": "Yoanna Sanchez",
    "rating": 5.0,
    "message": "Para mi comodidad"
  },
  {
    "user": "Cliente de Amazon",
    "rating": 5.0,
    "message": "Me quedo gratamente satisfecho por la compra, están super bien los tenis, me agradaron enormemente."
  },
  {
    "user": "Ola",
    "rating": 5.0,
    "message": "I don’t like how the material doesn’t look new but it’s still nice."
  },
  {
    "user": "Sergio",
    "rating": 4.0,
    "message": "Looks great but a little too stiff, beautiful classic but the whites don't match either, the white rubber sol has a different purplish hue to it and the rest of the shoe is a nice bright white. you would expect the whites to match."
  },
  {
    "user": "Charles Collins",
    "rating": 5.0,
    "message": "Everyday use, fits great, looks terrific !"
  },
  {
    "user": "KL",
    "rating": 5.0,
    "message": "I’ve worn Reebok and Vans shoes since my childhood days. I always enjoyed wearing Reebok’s in the 80’s. I wore what you would now call Classic / Vintage Reebok’s sneakers in High School — and a few years beyond. But, to kick around in when I wasn’t in school, my go to shoes were my Van’s. One day recently, I received a seriously discounted coupon for Reebok Stores. I took a look online and found these Reebok Club C85 Sneakers. I purchased a pair of the Club C Coast sneakers from the Reebok online store, and a few months later, I purchased another pair on Amazon. I now had two pairs of Reebok Club C Coast Sneakers and a pair of Old Skool Van’s, but I still purchased another pair of Reeboks — Club C85 sneakers because I liked them so much. I use my Van’s inside to workout, and my Reebok’s for going out. These Reebok Club C85’s are just as comfortable as my Vans. In fact, they are extremely comfortable, feel great to walk in and look great while doing so. As others have mentioned, these shoes run a bit narrow. I have high arches and narrow feet, so they are just the right fit for me."
  },
  {
    "user": "Beth",
    "rating": 4.0,
    "message": "Very cute. A little bulky. Nice but not me."
  },
  {
    "user": "Gloria",
    "rating": 5.0,
    "message": "10/10! I was worried bc the product picture changed after I'd ordered them, but I got the right ones. They're so comfy, fits as expected and look amazing!"
  },
  {
    "user": "devin kinsey",
    "rating": 5.0,
    "message": "These are great sneakers hence the five star. But I give the listing on Amazon no stars because these are listed in men's sizes even though the description says they're women's. I ended up with size 8 men's sneakers and they don't say men's until you already placed your order. So order accordingly and you'll get shoes that fit."
  },
  {
    "user": "B :)",
    "rating": 5.0,
    "message": "I literally love these sneakers. They are probably the best purchase that I have made in 2022. So comfortable and cute for any occasion. I could wear them all day."
  },
  {
    "user": "Phoebe",
    "rating": 5.0,
    "message": "I love these shoes. They're a great basic pair of sneakers that you can put on with any outfit"
  },
  {
    "user": "Jorge Chang",
    "rating": 4.0,
    "message": "Heel tends to slide up when walking. I would suggest to buy half number less than normally used . I love the classical style and the fact that real leather is used on most of the shoe. One piece sole is also a big advantage, it will last much longer than those made up of pieces glued on top of a base sole that fall off after few months of use. A bit more arc support would be nice."
  },
  {
    "user": "Sad Feet",
    "rating": 4.0,
    "message": "I bought these in anticipation of doing a lot of walking on vacation.  While I wore them a few times before I left to break them in, the first full day of walking, my toes were literally bleeding.  They felt fine, but apparently the sneakers did not fit properly.  Too late to send back, but a warning that continued use made it obvious they run small and are for narrow feet."
  },
  {
    "user": "Trey B.",
    "rating": 5.0,
    "message": "These are a nice option for maybe everyday use or if you want a nice neutral pair of shoes whenever you're going out. I am personally not a fan of high-top shoes so these are great, they are nice and comfortable and they look good whenever I go out somewhere."
  },
  {
    "user": "yolanda spears",
    "rating": 5.0,
    "message": "I like the color and I got they for a outfit"
  },
  {
    "user": "joseph adesanya",
    "rating": 5.0,
    "message": "This is the most comfortable sneakers ive ever worn. Ive bought this sneakers in white&color in the past at least twice. I plan to buy at least 100 pairs, i even plan to have a collection. Im 28 and i used to be mostly into nikes/jordans, but this shoes are so comfortable, i dont want to wear anything else. They are very stylist, i like the classic and very simple feel&design. The shoes usually look like a box/awkward straight out the box, but after you wear them for a few days, they start to look good! I highly recommend them!"
  },
  {
    "user": "PauGra",
    "rating": 5.0,
    "message": "Good quality, they are cute and comfortable."
  },
  {
    "user": "Mk",
    "rating": 5.0,
    "message": "I love these shoes but unfortunately they were too small. I ordered them for my daughter who is 10 years old and this was the first time I ordered womens size for her so I didn’t get the right size. I really wish we could keep them because they’re so cute."
  },
  {
    "user": "Joseph s milito sr",
    "rating": 4.0,
    "message": "Great shoe and price"
  },
  {
    "user": "Andil",
    "rating": 4.0,
    "message": "Received in a timely manner. Fit like a glove, I usually wear a 9-9.5 in athletic shoes, I ordered 9.5 & they fit perfectly. The only question I have is whether they are authentic reeboks, whereas the inside, or foot padding, does not have the Reebok logo as every other pair I’ve purchased from a store. Nonetheless, I’m keeping them because they are cute!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Nice and comfortable."
  },
  {
    "user": "Jeffrey",
    "rating": 5.0,
    "message": "These are such a staple piece"
  },
  {
    "user": "kristine castro",
    "rating": 4.0,
    "message": "I am a size 6.5 W in almost every shoe I own, when these shoes arrived the toe box was a bit large in my opinion! I would recommend ordering half a size down! The shoe is very comforting and goes with everything, very cute!"
  },
  {
    "user": "liljen",
    "rating": 5.0,
    "message": "After trying on a gazillion shoes, my daughter decided these were her favorite.  She liked the vintage look and wanted something different but still in style. She's super picky with shoes and found these very comfortable.  It is important to note that these shoes are slightly off-white and not bright white.  There are bright white reeboks in this exact style in men's sizes if that is more of what you are looking for.  These are considered unisex and say so on the box."
  },
  {
    "user": "Tim A.",
    "rating": 5.0,
    "message": "very swaggy"
  },
  {
    "user": "Kenneth Woods",
    "rating": 5.0,
    "message": "Perfect color, perfect fit"
  },
  {
    "user": "Susan",
    "rating": 4.0,
    "message": "The sneakers are great but the laces are too short. I ended up buying the VSUDO laces in 01- white but I should have bought 02- Snow White.  The 01- white was a little darker dirtier looking."
  },
  {
    "user": "forallweknow",
    "rating": 4.0,
    "message": "Happy to have found this sneaker as I already had one and wanted to replace it. Fits as expected and looks great under my summer skirts."
  },
  {
    "user": "Gary Brodsky",
    "rating": 4.0,
    "message": "Casual wear and they are comfortable also I can wear them with any casual close"
  },
  {
    "user": "Natalie",
    "rating": 5.0,
    "message": "I absolutely LOVE these shoes. This is my second pair, because I wore my other pair to the absolute end of its life, I loved them so much. They’re comfortable, just snug enough without being too narrow or too small. I’m a women’s 8.5 and the 8.5 I bought fits perfectly. If you’re a huge walker or runner they may not be the shoe for you, but I walk around the city, take the train, drive, whatever and they are just right for me. Plus they can be styled with practically anything. Highly recommend."
  },
  {
    "user": "C SOUSA",
    "rating": 4.0,
    "message": "GOOD ITEM"
  },
  {
    "user": "Vanessa Castro",
    "rating": 5.0,
    "message": "Muy buena calidad"
  },
  {
    "user": "Daniela Denrich",
    "rating": 5.0,
    "message": "I’ve been wanting these for a while and finally decided to buy them. They fit perfectly. I love walking in them and they didn’t hurt my feet in order to break them in. I love them they’re so cute!"
  },
  {
    "user": "X.J. Z.",
    "rating": 5.0,
    "message": "Comfortable and nicely fit my daughter! She loves it and wearing it right away. It is slim, stylish, clean and beautiful."
  },
  {
    "user": "Griffin Lee",
    "rating": 4.0,
    "message": "I had to convert to women’s US size but it fits perfectly like all my other shoes! They are super cute and arrived in good time! No damage to the box, I love them! The color is a dark navy, almost black, but that is fine with me cause I mostly wear blue, black, or true navy and they should pair well with all colors. I really like them and can’t wait to wear them!"
  },
  {
    "user": "Ava B",
    "rating": 5.0,
    "message": "The media could not be loaded. Fits perfectly like a glove. Pretty durable too, and it’s a good deal. I can already tell that the quality of these shoes are going to last for a long time. The only complaint I have is it came in a pretty flimsy bag where you could easily open it, other than that it’s perfect :) one more thing, I like that the soles of these are pretty thick, but I know some people that don’t like thick soles so just keep that in mind!"
  },
  {
    "user": "Marquitte",
    "rating": 4.0,
    "message": "I purchased 2 separate pairs days apart. These were my favorite shoes in the 80s/90s, the ones with the crest. The first pair that came in were snug, but I figured they needed to be broken in. That fact along with the fact it's a unisex size and not necessarily made for a woman's foot, I gave some leeway for the feel. The second pair that arrived was noticeably larger. Same exact size, model, etc... but I could tell from the numbering on the tongue they weren't from the same production line. Not sure if it was a different plant or just a different timeframe. Other than that, they're great. Love the style, love the material. Did have to buy inserts to allow for more of an arch, which made the snug pair even snugger... :( but....I love the old school crest logo for Reebok."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "No dislike use for every day walking."
  },
  {
    "user": "Boy64",
    "rating": 5.0,
    "message": "Will buy again"
  },
  {
    "user": "mike m",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Kessi Payne",
    "rating": 4.0,
    "message": "I usually wear an 8.5, but online I always order 9 just in case. A friend told me that these shoes were a little narrow so I sized up to a 9.5. I suppose my feet are a little wider than average, but I don’t generally wear wide shoes. These were tiny! I couldn’t even get them on. I returned and ordered an 11! 2.5 sizes bigger than my typical shoe size and they fit perfect! I could care less about what number is on my shoes but I would never have thought to order so much bigger than my shoe size. Love the shoes! Super cute. Love the off white-they look better the more I wear them! But I live 45 miles from a return hub. This was kind of a pain."
  },
  {
    "user": "Vivi",
    "rating": 5.0,
    "message": "I am so excited for this purchase, I tried them on and fit perfectly."
  },
  {
    "user": "KaBloom",
    "rating": 4.0,
    "message": "I wanna start by saying I love these sneakers. I think they’re very cute and comfortable. I wear them a few times a week. And I also just wore them on a trip to Las Vegas to where I walked about 6 miles a day and then with no issue. That being said I do not wear them for workouts. They are fine for moderate walks and hikes but I wouldn’t choose them for running. After wearing them quite a lot for about the last two months they are starting to show somewhere. Little threads are popping out by some of the seams but otherwise they look good. I expected a little bit better quality for the price but I am happy with the purchase."
  },
  {
    "user": "Virginia Knauff",
    "rating": 5.0,
    "message": "Love Reebok.  Love this classic look, and they’re comfortable."
  },
  {
    "user": "carlos",
    "rating": 4.0,
    "message": "Estos tenis los usaba el 1991"
  },
  {
    "user": "Sydney",
    "rating": 5.0,
    "message": "Match with every outfit and easy to dress up or down! Highly recommend!"
  },
  {
    "user": "Chance",
    "rating": 5.0,
    "message": "Good looking and fits well what else do i need. Its just a good shoe enough said."
  },
  {
    "user": "Jane Boyd",
    "rating": 5.0,
    "message": "These shoes fit me the way I would expect a sneaker to fit, very comfortable and lots of support."
  },
  {
    "user": "John F.Guth",
    "rating": 5.0,
    "message": "Had these sneakers before and were long lasting.  Good fit and comfortable."
  },
  {
    "user": "Riley Hammon",
    "rating": 4.0,
    "message": "I love these shoes but they run a little big. I usually wear an 8.5 but I think an 8 would have fit me perfectly."
  },
  {
    "user": "gwen",
    "rating": 4.0,
    "message": "i think theyre so cute and i love them"
  },
  {
    "user": "Ray and Amy",
    "rating": 5.0,
    "message": "I adore these, but they are listed in men’s sizes. I typically wear a women’s size 8 so I ordered a 6.5 and they fit perfectly!!"
  },
  {
    "user": "Larry sena",
    "rating": 4.0,
    "message": "I like them"
  },
  {
    "user": "Kaylie",
    "rating": 5.0,
    "message": "These are so cute and so perfect. I will definitely be buying another pair!!"
  },
  {
    "user": "Michael Mareel",
    "rating": 5.0,
    "message": "I have been wearing Reebok's Club C tennis shoe for over 30 years, I wear no other brand. I have 3 pair that I have in case Reebok decides to discontinue the shoe. I love this casual shoe and switch pairs from daily use to wearing them out doing, my outside the home work. Please continue this style."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This sneakers is amazing. I love the style and is super comfortable. I can walk all day and my feet will not hurt. I am very happy with my purchase! 😊"
  },
  {
    "user": "Loretta",
    "rating": 5.0,
    "message": "Like"
  },
  {
    "user": "E.k.",
    "rating": 5.0,
    "message": "I used to always buy size 11 1/2 puma Argentinas. No thinking about if a shoe was gonna fit, having to worry about return shipping, or trying on a bunch of shoes at the stores. Then they stopped making 'em, the suede, roma, smash and riga are too narrow in the toe box. So I was forced to go shoe shopping again... QQ. I was going from shoe to shoe, like a footwear vagabond. Walking a cobbled road, with the thought that my soles weren't really my own, and not knowing which direction to tread. finally I stumbled across the Reebok club c, which is a fine replacement for the Argentina, and very comfortable. I've already bought these and a pair in black and white. They are a decent business casual shoe with a lil character, not great for meetings where you need to look more professional. But perfect for working daty where you just need comfort without the flash of a running shoe."
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "good shoe"
  },
  {
    "user": "S. Johnson",
    "rating": 3.0,
    "message": "These shoes are very tight on the sides of my feet. I can’t size up because I already have a good inch of toe room. They are cute shoes but much longer and skinnier than expected. I’m hoping breaking them in will help but it is disappointing after hearing so many reviews about how comfortable these shoes are."
  },
  {
    "user": "Susan Conaty",
    "rating": 5.0,
    "message": "I love these but I have to return them. I first found them on Reebok's site (Men's/Unisex sizing) but they didn't have my size. Quick google found them on Amazon for $35!! But is listed as \"Reebok Women's Club C Revenge Sneaker.\" I ordered my size in Women's 9.5 but as soon as I clicked purchase, the screen said \"thank you for your purchase of Men's Club C etc\" So I quickly clicked back and saw yes, it does list these as Women's but I'll just order an 8 now in case it's really Men's sizing. Oh, the size 8 are $90! Didn't order and received the size 9.5 Mens today. they are so cute but not sure if $90 cute. oh well."
  },
  {
    "user": "Rashad Jackson",
    "rating": 5.0,
    "message": "Nice lady gift"
  },
  {
    "user": "Amanda M.",
    "rating": 5.0,
    "message": "After my 27 year old son told me that I needed some cool tennis shoes he found these for me on line. I wear a narrow shoe and was worried that they wouldn’t work, would be uncomfortable etc but they are really well made, perfect fit for my narrow foot and I now have some “cool” shoes. I added a better shoe liner from a running store for arch support and they are great! I ordered both an 8 1/2( my normal size) and. 9 but  I am glad I stuck with the 8 1/2. They run true to size!"
  },
  {
    "user": "Kay Pee",
    "rating": 5.0,
    "message": "My son loves them and they fit great"
  },
  {
    "user": "Alyssa",
    "rating": 4.0,
    "message": "These are nice light weight shoes but I listened to the comments and sized up a half size so now they’re half a size too big."
  },
  {
    "user": "Marla E.",
    "rating": 5.0,
    "message": "Was having trouble finding a good shoe to fit my 93 year old dad. He loves these shoes and they fit perfectly!  They look really nice."
  },
  {
    "user": "Miguel Arroyo",
    "rating": 5.0,
    "message": "Excelente producto y calidad"
  },
  {
    "user": "Cristina Orellana",
    "rating": 3.0,
    "message": "El zapatos es  precioso pero la orma es pequeña no me quedo :("
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Me quedo como esperaba"
  },
  {
    "user": "Jenny Lu",
    "rating": 4.0,
    "message": "i love reeboks and i usually get the classic club c but i decided to try something new. in this case, it's been a few months and it's already breaking down so i am a little disappointed"
  },
  {
    "user": "Davit Kharaishvili",
    "rating": 4.0,
    "message": "I ordered a White/Royal-gum color, which in the pic, looked more like a cream/oatmeal color and that's what I expected... But it's actually as white as snow."
  },
  {
    "user": "L . T",
    "rating": 5.0,
    "message": "👌 visual 👞7"
  },
  {
    "user": "K. Cline",
    "rating": 3.0,
    "message": "These shoes have a hard bottom that doesn't flex.  When I walk in them, my heels slip up and down with every step, making them uncomfortable.  Gave up on wearing them even though I thought they looked nice."
  },
  {
    "user": "Taylor B",
    "rating": 4.0,
    "message": "This is my second pair of these. I love them. Comfortable and go with just about any outfit. I saw where someone mentioned these not being as comfortable as the ones from Urban, I can somewhat agree in that they do feel a bit different but I’ve only had a few days to break them in so hopefully they last!"
  },
  {
    "user": "Kasia Nalepa",
    "rating": 5.0,
    "message": "Love these shoes. Definitely my fave pair."
  },
  {
    "user": "Samar Lee",
    "rating": 4.0,
    "message": "As mentioned by other reviewers, the shoes are in great quality. Being made of leather and benefiting from great workmanship, the shoes are durable and comfortable. They might be tight for someone who has a little bit wide feet. The only issue I am having with the shoes is the heel. My heels keep falling off, though the size and the overall configuration of the shoes are great fit for me. I have to return the shoes because I cannot stand with the falling off. It is worth to mention that this is the second Rebok shoes I've bought from Amazon, but the previous ones also have the similar issue with the heel. I have to return both of them, suspecting that Rebook shoes would not fit me."
  },
  {
    "user": "John MacIntyre",
    "rating": 5.0,
    "message": "I owned a pair of Reebok \"exactly\" like these many years ago and they lasted till  just about a year ago. They fit perfectly and are very comfortable.  I am truly glad I saw these still available. They may be considered \"classic\" ...but too me there new, stylish and perfect!!"
  },
  {
    "user": "Sonia Castaneda",
    "rating": 5.0,
    "message": "Exactly the kind of shoes my daughter wanted.  Price perfect. Other places were expensive. Iam happy with the purchase!"
  },
  {
    "user": "Jean Q",
    "rating": 5.0,
    "message": "I got these for very cheap, two different sole  (Ted and green), they don't have that much arch support so not the most comfortable shoes I own. Very stylish overall, oh one thing: the box came all torn apart"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "its a great shoe just make sure your nike shoe size. because i wear a size 9 in nike and i got a size nine and it fit amazing"
  },
  {
    "user": "Carolyn A. Lewis",
    "rating": 5.0,
    "message": "I love this shoe and will exchange it for a 1/2 size longer.  I normally wear a 7 but my toes hit the end of a 7 in this shoe.  Looking forward to the 7.5."
  },
  {
    "user": "J Hill",
    "rating": 5.0,
    "message": "Great shoe that can be worn with multiple styles.  Comfortable fit and a great weekend walking shoe."
  },
  {
    "user": "Santaijzai johnson",
    "rating": 5.0,
    "message": "But I love the shoe ❤️"
  },
  {
    "user": "Belinda R.",
    "rating": 5.0,
    "message": "Bonitas buena calidad"
  },
  {
    "user": "Calub Mckinley",
    "rating": 5.0,
    "message": "i like a lot"
  },
  {
    "user": "AWS",
    "rating": 3.0,
    "message": "I am not sure these are real leather.  If so not great leather like the older version(s).  I have 2 pair now ... loosing my love for them."
  },
  {
    "user": "Jennifer Tetreault",
    "rating": 4.0,
    "message": "I wear these with leggings or wide leg jeans… I’m almost 50 but I think they are fun. Very comfortable."
  },
  {
    "user": "Male acevedo",
    "rating": 5.0,
    "message": "Cómodos, hermosos, tal cual como me los imaginé"
  },
  {
    "user": "TATIANA CARREÑO",
    "rating": 5.0,
    "message": "Son cómodos y ligeros."
  }
]