[
  {
    "user": "Still Alive",
    "rating": 4.0,
    "message": "I have a ridiculously hard time finding shoes that fit. I have had zero luck with Propet and some other brands. This one does at least fit, though the extra wide a size up is still snug, but that's typical. It's not the most comfortable shoe ever, but it's better than a lot out there. For the price, aka under $50, it's a good shoe. My only complaint is that it is the most slippery shoe I own. I bought them because they seemed reasonably water resistant. I got these shoes to wear on my evening walks when it's rainy out, and I don't want to wear rain boots but don't want mesh shoes. Unfortunately, I slipped three separate times the one time I wore them. I have not slipped wearing any of my other walking shoes. If they made a non-slip version, I would definitely consider buying it, especially in an xx wide."
  },
  {
    "user": "Bacrabb",
    "rating": 5.0,
    "message": "They feel like I am walking barefoot. I have a pair of size 10W, and wanted a second pair. I tried to order a second pair but could only get 10W-extra W, to see if they would work. The order was cancelled by the seller. I think they ran out of that size too. I was not able to  try them on to answer the \"how does it fit?\" I am very happy with the ones I have."
  },
  {
    "user": "Priscilla Ballou",
    "rating": 5.0,
    "message": "I have bought this shoe now in two shades of blue.  If I were rich I'd buy pretty much all the colors they offer.  I've been wearing New Balance walking shoes with the SL2 last for decades, and those have been very good to my feet, but I need a little more zing for my spirit sometimes, so being able to buy a comfortable supportive walking shoe in 10 Wide in colors other than white, black, grey, and taupe thrills me."
  },
  {
    "user": "Malkeeyah",
    "rating": 5.0,
    "message": "I didn't know that there was a summer version of the Romy sneaker. I am happy that I found it and at a fair price on Amazon. Romy sneakers by easy spirit are the only ones that have worked the best on my feet for my warehouse job where I stand for long hours on the same position. I usually insert the timberland anti fatigue insole and my life becomes bearable."
  },
  {
    "user": "Lesley Spanheimer",
    "rating": 5.0,
    "message": "Found this brand quite recently. Drawn to them by the xtra wide width. These are my second pair, the first being a different style and color. They were so good that i decided to try the Romy in black (usually do not buy shoes online) and am so pleased i took a chance with both pairs. They are very comfortable right away and look good.They are made of leather so i don't think they will 'crack' apart. Got them at a good price too."
  },
  {
    "user": "Alexandra de Moya",
    "rating": 4.0,
    "message": "I gave these shoes away because it was not a true wide shoe. Yes I need a wide, never needed a double wide, however these were  tight and narrow. Overall it's well constructed. very good support and padded ,but this is not a wide.  if it's available get a double wide if you're a normal wide. Because they were a good shoe overall . my friend took them and she's very happy with them. I bought the Skechers wide sport tennis shoe and that was a perfect fit."
  },
  {
    "user": "Mimi",
    "rating": 5.0,
    "message": "These shoes are so very comfortable, I wear size 8 wide, they fit perfectly, love the blue color but think I will get another pair in the tan.  No break in time, put them on and wore them right away."
  },
  {
    "user": "Just Jacqui",
    "rating": 4.0,
    "message": "Actually wide enough for comfort. Plenty of room in the toe box, good for fall and winter wear . Yes, I would purchase them again"
  },
  {
    "user": "Dwight F. Brown",
    "rating": 5.0,
    "message": "I have bought East Spirit shoes in the past and have loved them. The arch support that I need is perfect. White athletic shoes are getting harder to find so was grateful I found these."
  },
  {
    "user": "Page H. Gifford",
    "rating": 5.0,
    "message": "Fit great and are very comfortable. I'm a person who pays attention to how my feet feel and I didn't even know these shoes were on, that it how comfortable they are."
  },
  {
    "user": "linda e. williams",
    "rating": 5.0,
    "message": "I have been wearing this brand shoes for a long time. This time I got a wide width and they fit very good. I had noticed my little toe was rubbing on the medium width that I always wore. I guess my feet have the ‘old age’ spread. I have other brands of shoes, but I always tend to grab these when I’m going to be walking a lot."
  },
  {
    "user": "Denise D",
    "rating": 5.0,
    "message": "I always go back to this shoe for comfort and support. I walk 4-5 miles a day. I’ve tried other walking shoes but they just don’t work like these do. 8 years and counting…."
  },
  {
    "user": "Judy Mallio",
    "rating": 4.0,
    "message": "When I put them on they were great... do not have to be broken in. The one thing that does bother me is that I keep stumbling on  the toe"
  },
  {
    "user": "janet jones",
    "rating": 5.0,
    "message": "I HAVE FIVE PAIR THEY ARE THE BEST SHOES YOU DON'T HAVE TO BREAK THEM IN"
  },
  {
    "user": "Charlotte McGaughey",
    "rating": 5.0,
    "message": "When I added an insert for arch support, these are perfect. Comfortable, sole isn't too wide, easy to move about on pickleball court and when walking. Color is subdued and very attractive - goes with everything."
  },
  {
    "user": "Deb Freeman",
    "rating": 5.0,
    "message": "The structure was important because so many are thin and with no support while walking. It’s nice not to feel the rocks under the soles !"
  },
  {
    "user": "wendy g hinz",
    "rating": 5.0,
    "message": "i have  5 pairs of these  they are great  my daughter has brought them also"
  },
  {
    "user": "Macs Message",
    "rating": 5.0,
    "message": "Love easy spirit. Have been buying for years. Wide width at affordable price and last for years."
  },
  {
    "user": "Laura",
    "rating": 5.0,
    "message": "I love these shoes. Provide great support for my high arches. I love the look and color too. Worth the buy"
  },
  {
    "user": "Sharris",
    "rating": 5.0,
    "message": "Good shoes for walking and other outdoor activities. Very comfortable. Not for running or heavy duty hiking."
  },
  {
    "user": "MJ",
    "rating": 5.0,
    "message": "I have feet like a duck... short and wide. I usually have to buy a bigger size bcuz wide widths are hard to find. These fit perfect. No breaking-in period. Wore them all day and no achy feet. They're soft, light weight, and breathable. I will come back and change this review if they should fall apart, which I doubt bcuz they seem well made."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Extremely comfy.  Nice arch support.  Good quality."
  },
  {
    "user": "granite",
    "rating": 5.0,
    "message": "The person who it was bought for likes it"
  },
  {
    "user": "Susan Jeffrey",
    "rating": 4.0,
    "message": "I bought this shoe thinking it was a dark blue with gray sole and the one I received was pale blue with white soles.  I kept it because it fit and I do like Romy sneakers."
  },
  {
    "user": "Catherine MacDonald",
    "rating": 5.0,
    "message": "They are comfortable and I’m going to be using them to go to the gym in"
  },
  {
    "user": "D. Quack",
    "rating": 4.0,
    "message": "It ran 1/2 smaller than expected. I suggest ordering 1/2 size larger than your regular size"
  },
  {
    "user": "Mary Miller",
    "rating": 5.0,
    "message": "I have only worn easy spirit for years because of comfort and fit. I have worn same size forever so easy  to find. I miss the stores."
  },
  {
    "user": "Leiber Octavio Gómez Nieves",
    "rating": 5.0,
    "message": "Muy bonita presentación, mi esposa los usa y dice muy comodos"
  },
  {
    "user": "Leslie",
    "rating": 4.0,
    "message": "I buy these shoes frequently. Only problem is the inside area near the heel and the exterior sole wear out a bit fast. I walk my dog several times a day and I find I need to replace my shoes often. But they are lightweight and provide stability. Good choice."
  },
  {
    "user": "Ant",
    "rating": 5.0,
    "message": "Sneakers are very comfortable. Im on my feet all day and they feel great. Even when new they needed no breaking in. They accurately fit to size. Not narrow or wide. Just right. Btw. I have corns and bounions."
  },
  {
    "user": "reebz",
    "rating": 5.0,
    "message": "The shoes are good quality and well made.  Narrows are difficult to find, so I am grateful these come in that width.  They seem a little shorter than my other shoes, but I sized up and they are fine.  I've worn them to work 2 days now, and they have been comfortable with a lot of walking around the building.  No need to break them in, comfortable from the start.  Happy with the purchase."
  },
  {
    "user": "M. Smith",
    "rating": 5.0,
    "message": "I purchase this shoe often.  It’s a great walking shoe."
  },
  {
    "user": "jsue2U",
    "rating": 5.0,
    "message": "My foot is a bit narrow in the heel area and medium width overall.  At first I felt these shoes were a bit too wide, but actually find the fit perfect for me.  They are so darn comfortable and good looking too!  A good buy!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "snowbirdy",
    "rating": 5.0,
    "message": "Light weight, fits my orthotic without needing to remove the insole and doesn't slip off my heal. So many sip with the orthotic in. I wear a 7 in most shoes. Fits true."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I have order these sneakers multiple times.  The sneakers always fit the same way."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I have very long and narrow feet and these were way too wide for me"
  },
  {
    "user": "Jessica",
    "rating": 4.0,
    "message": "So I bought the shoes wayyyy too big. At work I’m standing and walking around all day. So they feel just fine to me. So idk if it’s because I bought them to big or not… I didn’t feel any arch support. I had to buy a Dr.Scholes arch support bottom. Now they feel perfect!"
  },
  {
    "user": "Annie",
    "rating": 5.0,
    "message": "These shoes fit well, though I removed the provided insole to use my own orthotic. The shoes look good and are comfortable."
  },
  {
    "user": "Teresa Y",
    "rating": 5.0,
    "message": "Very comfortable, a worthwhile purchase"
  },
  {
    "user": "Joan Gordon",
    "rating": 5.0,
    "message": "I Love these sneakers they fit perfectly,  I’m so glad I can get them through Amazon."
  },
  {
    "user": "Barbara",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Terrie Smith",
    "rating": 5.0,
    "message": "The Romy by Easy Spirit are the only walking shoe I wear.  I have a high instep and always get lace ups. I also get 1/2 size larger for toe room. I love these shoes."
  },
  {
    "user": "John Varyan",
    "rating": 5.0,
    "message": "My wife has tried a number of different brands and this is the only one that she loves. The price was excellent."
  },
  {
    "user": "U. Kizhakekara",
    "rating": 5.0,
    "message": "Only shoes that my mom will wear. She loves the fit and comfort."
  },
  {
    "user": "Cheese maker",
    "rating": 5.0,
    "message": "My wife goes through sneakers. Holds up as well as top brand name and half the price."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I have found this shoe to be very well made and comfortable.  Very nice looking shoe."
  },
  {
    "user": "h. d.",
    "rating": 5.0,
    "message": "These shoes are very comfortable to wear."
  },
  {
    "user": "caroline",
    "rating": 4.0,
    "message": "AA size still not narrow enough for my feet."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Everyday  wear"
  },
  {
    "user": "EloisaDO80Q118752N",
    "rating": 5.0,
    "message": "Bellos, excelente soporte, muy cómodos, la talla fue la esperada."
  },
  {
    "user": "Martina kisner",
    "rating": 5.0,
    "message": "This is my favorite work shoe. I bought this show now x times and have never been disappointed. As long as this shoe is available I will be a customer for it."
  },
  {
    "user": "emmy",
    "rating": 5.0,
    "message": "I've been wlaking in these shoes for a number of years now and regardless of the material, color etc.  they all fit perfectly!  Very happy with them. My normal szie is between an 8-8.5 and I have been getting the 8.5 which is perfect!"
  },
  {
    "user": "iLuvTech",
    "rating": 5.0,
    "message": "I bought several pair of these Romy sneakers on the try before you buy. I had never done that before, but I recommend it. I got six pair in different colors. I was quite delighted at the variety and that they come in wides with a good size to box. I did have to go up half a size.They were comfortable from the moment I put them on, the padded areas around the heel and tongue are wonderful. I took this pair with me to Europe, and they made my feet very comfortable walking around on cobblestone streets. Cobblestones are very uneven an hour to test of a good sneaker. Plus these were a cool color and made me blend in and not look like an American tourist in white tennis! I got six pair through the try before you buy a plan, and loved and kept four of them!"
  },
  {
    "user": "Christine",
    "rating": 5.0,
    "message": "Love this sneaker!  Fits perfectly with pillow softness.  I’m a substitute PE Teacher and I’m “hard” on my poor feet - but this sneaker takes everything I give it......and still cradles my feet.  I’m very impressed with this product!  Fabulous price as well."
  },
  {
    "user": "Rose",
    "rating": 5.0,
    "message": "Comfortable, easy to walk in and look nice."
  },
  {
    "user": "chuck",
    "rating": 5.0,
    "message": "These are actually easy spirit! Sometimes you have to watch for knock offs. So nice to be able to get near her wits on Amazon. My new place to shop for shoes."
  },
  {
    "user": "Jk",
    "rating": 5.0,
    "message": "I have had so many problems buying shoes.  I have wide ass feet so i have to wear orthodics.  Finding a shoe that feels comfortable and fits my feet with the orthodic in it is so difficult.  I bought 8 other pairs of shoes prior to this one and none of them fit well or were comfortable.  Totally worth it for the price.  I could not be more satisfied with this item."
  },
  {
    "user": "Kathy Blake",
    "rating": 5.0,
    "message": "Very satisfied.  Thank you."
  },
  {
    "user": "PB",
    "rating": 5.0,
    "message": "very comfortable, great value, have in various colors"
  },
  {
    "user": "kitty katt",
    "rating": 5.0,
    "message": "Keep my feet comfortable through the entire 12 hr nursing shift. Just enough support. Fit is great and they don't have an all mesh top. I looked everywhere to find a tennis shoe to wear this summer that would protect my feet from getting wet in the rain. Everything is mesh now days. These are perfect. Lightweight and they keep my feet dry!!!"
  },
  {
    "user": "rhonda",
    "rating": 5.0,
    "message": "Walking on air"
  },
  {
    "user": "Lori",
    "rating": 4.0,
    "message": "Like these shoes. Had to remember to order 2x wide for comfort. Wish it came with different shoelaces as these are round ones and do not stay tied well."
  },
  {
    "user": "Terry",
    "rating": 5.0,
    "message": "Love the shoes"
  },
  {
    "user": "pualilia",
    "rating": 5.0,
    "message": "I needed comfortable shoes for our 10 day trip through DC, Philly and NYC and these were perfect! I have no idea how many miles we walked but we were out and about for 14+ hours almost every day and these shoes got me through! I have nerve damage from previous ankle surgery so support and comfort are critical. My legs were sore from being out of shape, but my feet survived. Definitely recommend!"
  },
  {
    "user": "Janice F",
    "rating": 5.0,
    "message": "I wear these to work out everyday.  They are so comfortable.  Can walk for miles in them."
  },
  {
    "user": "Priscilla Allen",
    "rating": 5.0,
    "message": "I love the look of this shoe!  It fits as expected.  It's just right."
  },
  {
    "user": "Jane M. Barrow, Jane Barrow",
    "rating": 5.0,
    "message": "They were comfortable, nothing to say about disliking them. I amhapp with the fir and comfort."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great shoes,love them"
  },
  {
    "user": "MGB",
    "rating": 5.0,
    "message": "Very comfortable.  Great value.  Variety in color of stripe...works great for me."
  },
  {
    "user": "Kathy",
    "rating": 5.0,
    "message": "Worn these before - on my feet a lot as a nurse, my feet never bother me."
  },
  {
    "user": "Gigi",
    "rating": 5.0,
    "message": "I wear them all the time. At 88, they’re essential for helping with my balance , or lack there of."
  },
  {
    "user": "Linda",
    "rating": 5.0,
    "message": "Not same arch support as the true easy spirit shoe."
  },
  {
    "user": "julia dake",
    "rating": 5.0,
    "message": "Even so the toe box is a little small the shoe overall is pretty good. I'll buy a second pair. Well priced."
  },
  {
    "user": "Marilyn Stack/GVSU",
    "rating": 5.0,
    "message": "these shoes are comfortable and it is about my 5th pair.  Love them!"
  },
  {
    "user": "bonnieAlfano",
    "rating": 5.0,
    "message": "I have a lot of trouble finding shoes that are comfortable these are the first shoes that I was able to buy in a wide size they fit me perfect 😍"
  },
  {
    "user": "Deborah Coney",
    "rating": 5.0,
    "message": "Very comfortable."
  },
  {
    "user": "Ruth",
    "rating": 5.0,
    "message": "Well made shoe that fits perfect."
  },
  {
    "user": "Gadabout",
    "rating": 5.0,
    "message": "I'm saving them for winter as they will be warm. Too hot for summer as they are suede"
  },
  {
    "user": "Jacqueline Schmidt",
    "rating": 5.0,
    "message": "love these all I order for me. Support and fit are perfect for me"
  },
  {
    "user": "Lala",
    "rating": 4.0,
    "message": "Third pair, fit perfectly"
  },
  {
    "user": "B Rose",
    "rating": 5.0,
    "message": "This shoe is exactly what I wanted and at a good price.  I have hard feet to fit and my local store quit carrying this brand and this style. Found exactly what I wanted in the size and color from this vendor. Will definitely shop here again."
  },
  {
    "user": "Deborah F.",
    "rating": 5.0,
    "message": "Was  and still am pleased with the choice I made.  It's been a real trial to find the extra wide shoes for me.  I am more than pleased!"
  },
  {
    "user": "Raquel Martinez",
    "rating": 5.0,
    "message": "Most comfortable walking shoe. This will be the 4th pair I purchase. So many choices in colors. My favorite are the white and also the burgundy."
  },
  {
    "user": "Dawn M.",
    "rating": 4.0,
    "message": "I love this shoe but for some reason they are not as wide in the toe area as my last pair so when my feet swell they are too tight to wear. I got a 10 wide red white and blue pair."
  },
  {
    "user": "Lucy",
    "rating": 4.0,
    "message": "I find these rather comfortable for walking, more than many other speakers I have! I managed to get them at a reasonable price but if I got a slightly different color the price was even more expensive so I only got the one pair. It would be great if they came in other colors beside white but that’s OK they’re good for walking around the city and I don’t get any pain in my feet so I guess they’re good and I would buy them again."
  },
  {
    "user": "Diane McAlister",
    "rating": 5.0,
    "message": "Love the color and fit is perfect."
  },
  {
    "user": "Bonnie",
    "rating": 5.0,
    "message": "I always buy Easy Spirit for the fit and comfort.  These did not disappoint."
  },
  {
    "user": "Kathleen A. Mulvihill",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Daisy Kiely",
    "rating": 5.0,
    "message": "I love Eve about it especially the with & great cushioning & support have them in many colors!!! Keep up the great work for us!!!"
  },
  {
    "user": "Jane M Fogg",
    "rating": 5.0,
    "message": "These are the best fit for me. Nice and wide, I own many of them in the same colors. Hope they come out with more colors to choose from."
  },
  {
    "user": "JO from ILLINOIS",
    "rating": 5.0,
    "message": "Liked fit"
  },
  {
    "user": "Don",
    "rating": 5.0,
    "message": "Every year I try on different brands and every year I buy these again! Have never found such a comfortable shoe in any other brand! I see alot of these at the gym!!"
  },
  {
    "user": "Seaside",
    "rating": 5.0,
    "message": "Great fit very good support.  Makes walking fun.  Ordered a second pair with blue trimming."
  },
  {
    "user": "Boxer",
    "rating": 5.0,
    "message": "Was a little septic getting the fit I did. However, they fit good. My old one I still like but I’ve worn then out-had for years. I would purchase again."
  },
  {
    "user": "Richmond",
    "rating": 5.0,
    "message": "The shoe fits perfectly.I love the color and support it give my feet."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Thank you Easy Spirit for such comfortable and good quality sneakers.  Thank you Amazon and Shoe Mall for great shipping and delivery."
  },
  {
    "user": "BWG",
    "rating": 4.0,
    "message": "Shoes are fine.  Sketchers usually are. 2nd.only to Easy Spirit.  Wish all mfgs would figure out that big feet are harder to fit and make them in better sizes, you know like wide and extra wide in half sizes.  I had to search everywhere for months to find shoes that I could afford on sale and right size. Last thing a big person with wide feet wants is to buy larger size, already sensitive about having big feet.  Maybe with trans movement bigger and better shoes that fit will come out."
  },
  {
    "user": "Tanya M.",
    "rating": 4.0,
    "message": "I suppose you can't expect a whole lot for a reduced price I mean you get what you pay for....I'm reluctant in buying shoes because I have a hard time finding a comfortable shoe and I don't believe in paying a lot of money I just wish they were more comfortable now I'm trying to find insoles to fix that. They are loose in the heel. There is extra eyelets to tighten them but that hurts the upper portion of my foot. So I tried to use the extra eyelets again and there's something about how the heel fits or is manufactured because it pulls my socks down which makes it really uncomfortable so everything that I tried to do to make these fit right is not working other than that it's a good shoe"
  },
  {
    "user": "Drema Farris",
    "rating": 5.0,
    "message": "I don't wear any other athletic shoes, I love these shoes and they do not hurt my feet. That is why I order online. I can't get them near me. All of the others hurt my feet, including Nike."
  }
]