[
  {
    "user": "Rhonda Nolan-Bryant",
    "rating": 4.0,
    "message": "Very comfortable. They are lightweight and breathable. They offer enough support for outdoor walking, errands or shopping. Everything on want in a shoe for days off of work. Inexpensive and my husband says they look nice on me. At first I was skeptical about the accent color. I rock these eith just about any casual outfit."
  },
  {
    "user": "CChavez1324",
    "rating": 5.0,
    "message": "I wasn't expecting much of these inexpensive shoes, but I was pleasantly surprised when they arrived. These are my new gym shoes. They look exactly like the photo. Very soft and comfortable inside and the grip is decent. The toes aren't stiff and allowed me to move with ease from burpees, to jump rope and lifting. I've only used them a week and I'm very happy with this purchase."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are very comfortable. Fit true to size. I ordered these based on other reviewers saying how supportive they were, even after lots of wear hours. I would disagree with that. I bought these to wear at Youth Camp doing kitchen duty on concrete flooring for more than 12-hour days. By day two my feet hurt like crazy. So I switched between these tennis shoes and another pair for half of each day starting on day 3. That worked much better for my feet. Otherwise, these are very comfortable and nice-looking shoes."
  },
  {
    "user": "NiRam.",
    "rating": 4.0,
    "message": "Buenos tenis a bajo precio"
  },
  {
    "user": "pug",
    "rating": 5.0,
    "message": "Shoes are a great fit. Ive washed them once and put them in the dryer once, after coming out of the dryer they did not shrink like most other sneakers do which is great. They may be cheaper then the name brand sneakers but my feet don't hurt when I wear them. I love the way these feel so much on my feet that I just purchased a second pair in black because my name brand black sneakers are hurting my feet plus I have to wear black shoes to work and the cost for the pair isn't gonna break my budget."
  },
  {
    "user": "Kenzie Heller",
    "rating": 4.0,
    "message": "I work at a doggy daycare and the floors can be super slippery from mopping and the rain. These shoes are non-slip and they are super light weight, there isn’t a lot of support but it’s better then flat shoes. I bought them in the winter of 2021 and they are now just getting a small a hole by the toe, however for twenty something dollars they will give you your moneys worth! I would 10/10 buy again :)"
  },
  {
    "user": "April R Dixon",
    "rating": 5.0,
    "message": "I absolutely love these! They are so light and comfortable!!!! I'm definitely getting another pair!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are super comfortable and nice looking sneakers!  Highly recommend."
  },
  {
    "user": "Michael Hiser",
    "rating": 5.0,
    "message": "My wife was surprised by the way they are so light weight yet supportive"
  },
  {
    "user": "Cheryl",
    "rating": 4.0,
    "message": "I love these sneakers!  I use them for walking the dog (several times a day).  They are lightweight and very comfortable.  However, after a year they are completely worn out.  The inner lining has holes and the soles are worn smooth.  I have washed them in the washing machine and air dried several times.  While they don't hold up, I like them well enough to replace them every year.  For this price, I can afford to."
  },
  {
    "user": "Sarah B.",
    "rating": 5.0,
    "message": "These have been a perfect cheer shoe for my daughter. She has not complained about them at all. So far, they have held up really well for the season!"
  },
  {
    "user": "Cheryl Baker",
    "rating": 5.0,
    "message": "Wore well"
  },
  {
    "user": "Jacquelyn",
    "rating": 5.0,
    "message": "Thank you!!!"
  },
  {
    "user": "William B.",
    "rating": 4.0,
    "message": "Daughter likes them very much."
  },
  {
    "user": "Samantha Bowen",
    "rating": 4.0,
    "message": "They absolutely fit the purpose that I bought them for - to mow the grass. Great stability and the price was right. A bit stiff so I don't think i'd enjoy them for long walks."
  },
  {
    "user": "JC",
    "rating": 5.0,
    "message": "My feet are ridiculously flat and even with sole supports I felt like I was walking barefoot, back in the day I would’ve loved them, their light and comfortable fitting. I had to return them because I would not have been able to wear like I need to."
  },
  {
    "user": "Kelly Klaumenzer",
    "rating": 4.0,
    "message": "I only walk in these shoes. No running no hikes. Inside liner  bunches up under my foot. I have to keep taking shoe off to fix it. No support, ripping the sides, sole super thin and I can feel every thing I step on. Lases too long, substandard material."
  },
  {
    "user": "Julesinme",
    "rating": 5.0,
    "message": "Good value. Fit is perfect."
  },
  {
    "user": "ML",
    "rating": 5.0,
    "message": "I love these shoes. This is my second pair. They are extremely comfortable and great for walking. They are lightweight but well-made."
  },
  {
    "user": "Shirley",
    "rating": 4.0,
    "message": "When I opened the bag, I immediately decided I was sending them back.  I let them sit on my shoe rack for a week while I wore their replacement, a pair of new ASICS.  Well, my feet were killing me so I decided to try these shoes and was so surprised that I actually love them.  12 hour shifts and 6 miles avg walking and ny feet don't hurt.  They are lite and comfy."
  },
  {
    "user": "Lourdes Ramirez",
    "rating": 5.0,
    "message": "Para trabajar muy cómodos"
  },
  {
    "user": "Gabbyroc",
    "rating": 5.0,
    "message": "Love these sneakers. They are very comfortable and cushions my feet when I go jogging."
  },
  {
    "user": "LP",
    "rating": 5.0,
    "message": "Shoes have a good width in the toe area."
  },
  {
    "user": "Mary Kath",
    "rating": 4.0,
    "message": "The shoes are lightweight and comfortable. After 8 hours, my feet don't feel tired."
  },
  {
    "user": "Jesus Valentin",
    "rating": 4.0,
    "message": "the support is good comfort if you get it the right fit."
  },
  {
    "user": "Charlotte",
    "rating": 4.0,
    "message": "Good looking shoe.  Only downside, shoe needs more giveway."
  },
  {
    "user": "Patricia Appelquist",
    "rating": 4.0,
    "message": "I walk about an average of 10 to 12 miles a week depending on my time and energy or other exercise I am actually doing. I can't spend $50 plus dollars on shoes that don't hold up after a month or two ( talking to you New Balance). Also, I have feet that are like 9 3/4's and with this walking they start out at say 9 1/2 but after a few days or a nice meal or even a king tide my feet will swell add in thick or thin socks I am wearing and you see why I get a size 10 or 9.5 Wide. Honestly, after walking in the metropolitan jungle these shoes work. I do RUN through them but I recycle as much as possible or patch up what I can."
  },
  {
    "user": "Luisa Otero Pimentel",
    "rating": 5.0,
    "message": "Son las tenis más comodas y livianas que he comprado. Se ven super bien puestas.  Tengo tenis bastante caras y ninguna es tan cómoda como esta. Soy enfermera y con el uniforme blanco se ven bellas. En fin me encantan."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have had a problem with plantar fasciitis and was looking for a comfortable, affordable sneaker for every day use. I am usually a size 8 but I ordered an 8.5 thinking I would add an additional insole for support. It wasn’t needed! These sneakers look good, they are light, comfortable, and have the support I need. The price is unbeatable. My suggestion is order true to size."
  },
  {
    "user": "Rosered",
    "rating": 3.0,
    "message": "These are well made and seem comfortable but they were tight on my feet and I believe they run narrow . My toes were at the very edge . I wear a regular size 9 in most shoes."
  },
  {
    "user": "Char",
    "rating": 4.0,
    "message": "Only worn once so far"
  },
  {
    "user": "Gayle Laughon-Caddell",
    "rating": 5.0,
    "message": "I had not purchased tennis shoes in a while. I saw these and thought they looked good as well as substantial.  Glad I got them and would buy this brand again.  Cute “tenny pumps!!”"
  },
  {
    "user": "Alfredo",
    "rating": 3.0,
    "message": "Me llegaron con falla"
  },
  {
    "user": "Connie",
    "rating": 4.0,
    "message": "The shoes fit exactly as I needed them. I wore them to work. I work standing up for 21/2 - 3 hours. My feet didn't hurt at the end of the day. Praying that will be the case everyday I wear them for work."
  },
  {
    "user": "Dylewski",
    "rating": 5.0,
    "message": "I absolutely LOVE these sneakers! They did say that the color is green...but it is turquoise and gray just like the photo on Amazon website. I wanted and hoped it was indeed turquoise, so I was pleased when I opened the package, and it was. Once I tried them on, they were a comfortable fantastic fit and walking in them is like having nothing on my feet! The price is right actually better than right...so I really lucked out!"
  },
  {
    "user": "Cdume",
    "rating": 4.0,
    "message": "The color is great for summer. They are light and airy. I'm enjoying these sneakers."
  },
  {
    "user": "NY",
    "rating": 3.0,
    "message": "If i recall correctly footwear was comfortable great insole. Immediately I did not like the style. As soon as i tried them on i took them off and place in the back in the box. Looked like plastic sneakers. Not sure of the support"
  },
  {
    "user": "Victor",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Susan Rosmus",
    "rating": 5.0,
    "message": "These sneakers are so comfortable. The first I wore them was to work all day and by the end of my shift my feet felt wonderful. I would recommend the sneakers to anyone."
  },
  {
    "user": "Sherraine Williams",
    "rating": 3.0,
    "message": "i ran in these so much a hole wore thru the bottom of it"
  },
  {
    "user": "Boots",
    "rating": 4.0,
    "message": "nice comfortable shoes"
  },
  {
    "user": "Michelle Lantz",
    "rating": 4.0,
    "message": "Looks nice, but the inside of the shoe is hard to walk in without thick socks."
  },
  {
    "user": "Jean Rickard",
    "rating": 5.0,
    "message": "Great fit& comfort"
  },
  {
    "user": "Angélica María Del Mar diaz Molina",
    "rating": 5.0,
    "message": "Son buenos baratos y cómodos para lo que los compre"
  },
  {
    "user": "Marta Donnelly",
    "rating": 5.0,
    "message": "Ver comfortable and cute"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Took a risk in ordering shoes online and they fit like a glove."
  },
  {
    "user": "Amazon Jax",
    "rating": 4.0,
    "message": "I saw that I was supposed to order my right size because sizing runs true, according to the ad, but they sent me shoes 2 sizes above what I ordered. I am a size 7, and I ordered a size 7, and the shoes arrived in size 9. I don't know if they are men's sizes, and I should have ordered a 5, or if they just mistakenly sent me the wrong ones. It is a shame because the shoes are really cute! I ordered the pink and gray, and they looked fabulous. However, because I don't know whether they just sent the wrong size or if I was supposed to order 2 sizes smaller, I am not reordering. I retunred these and went with Saucony and a sizing I know will work. They are not as cute, and more expensive, but I think they will fit."
  },
  {
    "user": "DTR Grandma",
    "rating": 4.0,
    "message": "These shoes are really cute and comfortable. I've only worn them a couple of times, so I don't know how well they will hold up. They don't feel as sturdy as more expensive brands, but that's to be expected. I do like that I didn't feel like I needed to break them in... They were comfortable from the start!"
  },
  {
    "user": "SHARON",
    "rating": 5.0,
    "message": "Liked everything. Good walking shoe."
  },
  {
    "user": "so happy",
    "rating": 5.0,
    "message": "great walking and runnight shoes. Light feel great support."
  },
  {
    "user": "Jacquelyn",
    "rating": 3.0,
    "message": "Very cute and clean, no funny smell. Very lightweight, but very flimsy. If I were to run in these they would fall apart real quick. They're better for if you'll be standing for long periods of time. Lounge shoes I suppose."
  },
  {
    "user": "DeeJae",
    "rating": 5.0,
    "message": "I am 64 years old so buying shoes is not fun anymore,,,,I need shoes that don't hurt yet I want them to be stylish I don't want to wear granny shoes and these shoes broke the mold they are fashionable as well as so comfortable. They are so lightweight and oh yes they are tread safe haven't slipped on anyhthing. Great shoe ....great  price equals one HAPPY OLD LADY! Better grab a pair before I buy them all up!!!!!"
  },
  {
    "user": "Debbie Herring",
    "rating": 4.0,
    "message": "Liked"
  },
  {
    "user": "Jerry V.",
    "rating": 4.0,
    "message": "very good product"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love the sneakers but received wrong size in the mail. I’m have purchase two pairs this summer and think they are great"
  },
  {
    "user": "Marsha K",
    "rating": 4.0,
    "message": "I wanted ROYAL blue and these were more teal colored"
  },
  {
    "user": "barbara bautista",
    "rating": 4.0,
    "message": "This was supposed to be a 13.50 wide width, it is tighter that my 13 w"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Light weight, comfortable and true to size"
  },
  {
    "user": "Milagros Suero",
    "rating": 5.0,
    "message": "The media could not be loaded. Cómodo ligero y práctico, no pesan"
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "I know the reviews say this shoe is light but I was surprised by how light it really is. I am able to use my orthopedic insert without removing the insert that comes with the shoe, giving me appropriate support but still cushion.  I would recommend these as a good price/value buy if you aren’t concerned with the status of a name brand.  In summary,  comfortable, lightweight, good price/value."
  },
  {
    "user": "L. Harris",
    "rating": 4.0,
    "message": "Very comfortable, able to wear all day."
  },
  {
    "user": "Airmid",
    "rating": 5.0,
    "message": "I put a lot of miles on these per week just from work alone and haven't had an issue since I ordered my first pair for about five months. They have held up well and don't seem to fall apart. They are comfortable to wear and don't cause issues and are extremely lightweight. I do frequently wear them out also just to run to the store and whatnot. I am someone with narrow feet and a small frame and wear a shoe insert in all my shoes [from higher-end running shoes to dress shoes to these] for heel strike and arch support and have had no issues putting one in these. I would suspect, given the nature of what these are made out of, that if one was frequently on rough, hard surfaces, these shoes would wear out much more quickly or if there was frequent friction with the sides. As for me, I'm happy there's a cheap option that comfortable, works well, holds up [most wear occurring indoors] and is cheap. Ordering more."
  },
  {
    "user": "Holly moore",
    "rating": 5.0,
    "message": "Fits perfectly. Very comfortable. Lightweight."
  },
  {
    "user": "Stephanie Teta",
    "rating": 3.0,
    "message": "No arch and padding"
  },
  {
    "user": "Tina",
    "rating": 5.0,
    "message": "Great fit, light weight, love them, I’m on my feet walking for 12-16 hours a day for work in a hospital."
  },
  {
    "user": "Lynne Cahill",
    "rating": 5.0,
    "message": "it came early ...they were for my granddaughter, and she is so glad they did too. very nice-looking shoe"
  },
  {
    "user": "Susan Wood",
    "rating": 5.0,
    "message": "So nice, I ordered a pair for my bestie..she loves them"
  },
  {
    "user": "Eclipse1966",
    "rating": 4.0,
    "message": "Fit as expected; very comfortable.  Great value for the price without looking or feeling cheap."
  },
  {
    "user": "Michelle Daniel",
    "rating": 4.0,
    "message": "A little skinny through the toe area."
  },
  {
    "user": "Joy Abrahamsen",
    "rating": 5.0,
    "message": "I used these as my \"around  the house\" sneakers.  Very Comfy!!"
  },
  {
    "user": "CAMarie",
    "rating": 5.0,
    "message": "These sneakers are so comfortable and such a great price. I purchased an expensive namebrand sneaker six months ago that did not hold up and I wish I would’ve found these first. I will definitely be a repeat shopper!"
  },
  {
    "user": "Dennis M.",
    "rating": 5.0,
    "message": "Good fit!"
  },
  {
    "user": "Yui",
    "rating": 5.0,
    "message": "Reasonable price good sneakers"
  },
  {
    "user": "Rosalyn McDuffie",
    "rating": 5.0,
    "message": "I actually purchased these sneakers twice because I use the mess dancing sneakers I’d like to go line dancing and they are perfect on the floor plus I like the fact that they glow in the dark. Even when it’s not dark the lighting that they have in the Dancehall always make the sneakers glue. They fit fine they feel great they were great purchase that’s why I bought two pair great purchase"
  },
  {
    "user": "Debra Moran",
    "rating": 5.0,
    "message": "Comfortable to walk in"
  },
  {
    "user": "booklover 142024",
    "rating": 4.0,
    "message": "Great fit, like walking on clouds"
  },
  {
    "user": "Linda F. Smith",
    "rating": 2.0,
    "message": "The shoes are not what I had expected. They were too light and are not supporting."
  },
  {
    "user": "Sissykins",
    "rating": 2.0,
    "message": "I bought these shoes during Prime Days.  They fit great and are comfortable to wear.  However, after a month and a half, the shoes started fraying on the sides.  I had to replace with higher quality shoes"
  },
  {
    "user": "Stephanie Culmer",
    "rating": 5.0,
    "message": "I could've used a wide. I will not be able to wear a thick sock with these shoes.  But I was amazed at how light weight they are!! My wide feet now has a slimmer look. Thank You!"
  },
  {
    "user": "Jan",
    "rating": 5.0,
    "message": "I love my new shoes.  They didn't come in a wide width, but the mesh works with my toes.  I put inserts in the shoes for added support and I couldn't be happier."
  },
  {
    "user": "chemy_03",
    "rating": 4.0,
    "message": "El color es agradable y el material muy resistente"
  },
  {
    "user": "Tammy",
    "rating": 5.0,
    "message": "Very comfortable. Like walking on air"
  },
  {
    "user": "Kristina",
    "rating": 4.0,
    "message": "good shoes they are comfy just npt best quilty were a little small at first but fit fine after a few wears"
  },
  {
    "user": "Yunilsa",
    "rating": 5.0,
    "message": "I’m Medical Assistant, and these sneakers are everything I need at work."
  },
  {
    "user": "Reptar",
    "rating": 4.0,
    "message": "Shoes run about a half size small. Order up 1/2 size than what you wear."
  },
  {
    "user": "Rachel G",
    "rating": 3.0,
    "message": "They fit well and is light weight.  My feet hurt at the end of the day.  Where is my other shoes my feet don't hurt at the end of work.  I'm on my feet all day. I've worn them for now a week or so."
  },
  {
    "user": "Grace Walker",
    "rating": 2.0,
    "message": "I like the color.  The shoes did meet my expectations."
  },
  {
    "user": "Gena Surratt",
    "rating": 5.0,
    "message": "I like that they're cute and comfortable.  I usually spend more money on workout shoes but these are such a great value,  I oedered another pair. Thank you"
  },
  {
    "user": "linda steele",
    "rating": 4.0,
    "message": "Just fine"
  },
  {
    "user": "Speed Queen",
    "rating": 4.0,
    "message": "These are definitely the lightest weight tennis shoes I have ever worn. They are pretty comfortable, but give no support whatsoever. I would recommend buying a 1/2 size larger and buying your preferred insole to use because there is some odd feeling support like cushion on the inside bottom of these & it will wear on your feet if worn for a long time or if you wear thick socks."
  },
  {
    "user": "Leia",
    "rating": 4.0,
    "message": "size 7 is big & long i prefer size 6.5 i returned the item but will order smaller size"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "These are not at all what I was looking for. I can’t step in water a half inch high without my hole shoes wet. I wanted water resistant."
  },
  {
    "user": "Deb",
    "rating": 5.0,
    "message": "Very comfortable shoes .Will not wear anything but these tennis shoes"
  },
  {
    "user": "SF Wilson",
    "rating": 5.0,
    "message": "This shoe fits true to size, I wear a 6.5 and it is perfect.  I play tennis and Pickleball and it gives me plenty of support.  Very happy with this shoe, so much so that I just bought another color."
  },
  {
    "user": "Linda S",
    "rating": 5.0,
    "message": "Bought these for vacation walking/shopping.  Even with the orthotic insoles I added they weigh almost nothing.  Drive in them, too.  Very comfy & would buy again. Mine are \"customized\" with gold perm marker."
  },
  {
    "user": "Kathleen",
    "rating": 5.0,
    "message": "Light weight ,so comfortable"
  },
  {
    "user": "Norma Peña",
    "rating": 5.0,
    "message": "The media could not be loaded. Las recomiendo por su suavidad interior y peso ligero y el color es muy lindo"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "I haven't worn them after the initial 30 minutes to try them on when the arrived, they smell and when I took them off my socks and feet smelled.  I will let them air out a few days if the smell is still there they will be going back.  I will say for the short time I had them on they were comfortable..."
  },
  {
    "user": "Katherine Phillipa Michael",
    "rating": 5.0,
    "message": "Wow, after years of struggle to find the right pair of shoes, one fits me in one shot as opposed to having to buy a bunch of size 4s with my fingers' crossed. I found.the right.pair.of.shoes baby.  I can't tell you how awesome this is. Today I feel a bit woozy like I shouldn't be out walking. But tomorrow you bet I'm headed out."
  },
  {
    "user": "The Cpt",
    "rating": 5.0,
    "message": "The comforter meter is right up there. Light weight, good support and they breath very well."
  }
]