[
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "This is the third pair of this model/style. Lightweight, adequate arch, doesn't look to sneakerish. Two complaints- 1st set of shoe  lace eyelets have torn out on all three pairs. In spite of that I love these shoes. They should use metal eyelets not just a hole cut in shoe material. Other complaint this model has been discontinued with nothing similar replacing it."
  },
  {
    "user": "Kerry",
    "rating": 5.0,
    "message": "At first I thought these were tight but after you wear them a couple times it forms to your foot.  I wear at least 4 days a week for work. 2 months old now and they're still in like new condition. Great light weight sneaker that is great for walks, at the gym, at work, or just everyday sneaker. Easy to get on and off. Highly recommend!"
  },
  {
    "user": "Freda Wesley",
    "rating": 4.0,
    "message": "There comfortable on my feet."
  },
  {
    "user": "Rafael Cardona",
    "rating": 5.0,
    "message": "Suaves, comodos y muy bonitos"
  },
  {
    "user": "fayfay",
    "rating": 5.0,
    "message": "I bought these sneakers for my daughter and it's true to size and comfortable for walking and jogging"
  },
  {
    "user": "BevB",
    "rating": 4.0,
    "message": "Walking"
  },
  {
    "user": "E.V.",
    "rating": 4.0,
    "message": "I needed new shoes for walking with my kids, but at a few weeks didn’t want to spend a ton if my feet were going to shrink much more. These are great, and look amazing! I did a two mile round trip walk to a playground in them immediately, and my feet were comfortable the whole time. Only downsides: I may get inserts for arch support, they aren’t uncomfortable but not perfect either. And getting the shoes on was a slight hassle, the opening doesn’t adjust so I had to really wiggle my foot in all the way, and that took an extra bit of time when I wanted to just put them on and get out of the door. They may stretch with time but that could backfire also."
  },
  {
    "user": "Bonita Gay Duarte",
    "rating": 5.0,
    "message": "Like the way it fits and looks. Bought for walking"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "I purchased the \"Lace Up Jogger\" shoe in both the Olive and the Black with Pink trim, size 6.  I bought them confidently, fully expecting that they would be of the same quality and similar to the Nautica jogger/walking shoes I had twice purchased and loved in the past.  I had put miles and miles and stood for hours and hours on my feet in my Nautica shoes, almost always on cement, and my feet never felt tired.  I was very disappointed when these two new pair arrived.  I have a fairly wide foot, including bunions, and had no trouble wearing the old Nauticas.  I was surprised when I couldn't even get my foot in the black/pink shoes; they don't have the typical lace design that you can loosen all the way to the top of the shoe to fit your foot.  Instead of having a tongue, the part you insert your foot into (the mouth? :)) is a solid circle of elastic!  You are supposed to slip your foot into it like a tight sock, and the laces are apparently just for looks!  The shoe is very narrow.  So the black one immediately went back into the box and I moved on to the Olive pair. While the Olive pair does have a tongue and laces, the shoe material has very little give. The tongue sticks way up, and the lace holes are spread so far apart that my foot looks like it's bursting out of the shoe.  Like the black shoe, the Olive is too narrow for my foot.  (Note:  I wear a size 6, but I do not need to buy my shoes in Wide.) For anyone who had and loved Nauticas like the old ones I hoped to duplicate with this order, I am attaching a photo of my feet in both my old shoe (right) and the Olive shoe that just arrived.  You can see the ridiculously long, too narrow tongue on the Olive one.  A big difference in comfort styling between the old and new design is this: the old one has elastic \"eyelets\" for the laces to go through, which gives much more flexibility than the stiff holes in the plastic through which the laces pass on the Olive shoe.  I personally need the flexibility that the elastic eyelets offer. As for visual styling, I think the Olive shoe looks like an old lady's shoe, while I had many compliments from young and old on my old Nauticas.  No one of any age should walk on a slick surface in these new Nauticas, however; as other reviewers commented (and I ignored, due to my past experience with Nautica): The bottom of these shoes is a slick plastic.  I wore them for an hour in my home to see if I could grow to like them, and found myself slipping on my wood floor. I thought Nautica was supposed to be a decent brand, but these shoes seem no better than cheap shoes I always pass up at places like Payless Shoes.  I am returning both, and will go to a local shoe store to try on shoes to try to find something like my old, comfy Nauticas.  These certainly don't qualify."
  },
  {
    "user": "Valeria Ortega",
    "rating": 5.0,
    "message": "Es un buen modelo de zapatos livianos cómodos"
  },
  {
    "user": "Kris D",
    "rating": 3.0,
    "message": "These shoes are a great price, but they looked better on Amazon than they did in person.  Very light, but on an almost cheap way. Seems more like a off brand shoe you would get at a big box store, and not Nautica quality."
  },
  {
    "user": "Melanie H.S.",
    "rating": 4.0,
    "message": "These were super cute, but ended up being a tad small with an athletic footie on with them. Might work if I went without socks. They also weren't very cushiony. at least not as much as I expected from the look."
  },
  {
    "user": "Jiana Daywalt",
    "rating": 5.0,
    "message": "Super light shoes and great design!"
  },
  {
    "user": "James H",
    "rating": 5.0,
    "message": "A very beautiful pair"
  },
  {
    "user": "Mario",
    "rating": 5.0,
    "message": "I bought these as a gift for my girlfriend and she loved them. I was a bit worried about the size, but they fit her extremely well."
  },
  {
    "user": "Alookinglass",
    "rating": 4.0,
    "message": "I always wear a size 7 but my toes rubbed so I ordered a 7.5 but they actually dont carry half sizes so they sent another size 7"
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Minerva",
    "rating": 5.0,
    "message": "Son lindos y no pesan"
  },
  {
    "user": "Chandra",
    "rating": 5.0,
    "message": "Bought for my daughter’s Sonic the hedgehog themed party. I intend to hot glue on white elastic across the náutica label for the day but she loves the shoe as is and it fit true to size. Vibrant red and great price!"
  },
  {
    "user": "elvistf",
    "rating": 4.0,
    "message": "I am giving them 4 stars because they are very comfortable, I love the color and quality, they are super comfortable, but I am going to return them because they are very elastic and I have bunions that show them a lot"
  },
  {
    "user": "Phyllis williams",
    "rating": 5.0,
    "message": "Love the color."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Corren muy pequeños y nada que ver con los de.la foto"
  },
  {
    "user": "TJ",
    "rating": 5.0,
    "message": "Love these!! Shoes always hurt my feet. It doesn’t take much for me to get a blister on the bottom or back of my foot. Until now! I love a white shoe! They’re cute and go with everything, but most importantly they fit great, feel amazing in my feet and I never really had to go through the “breaking in the new shoes” phase because I was able to put these on and live my life. Best money I’ve spent on shoes in a long time. BUY THESE!"
  },
  {
    "user": "Dej",
    "rating": 4.0,
    "message": "The media could not be loaded. Comfort in all aspects. Work out or just daily casual use. Lightweight and very cute. The blush colour is beautiful. Would buy in other colours."
  },
  {
    "user": "Lorraine MacQueen",
    "rating": 5.0,
    "message": "I have 4 pair of these sneakers now ..the fit is not to narrow  regular width ..great arch support..all day comfort Dont hesitate..I have 4 pair now!!"
  },
  {
    "user": "FR",
    "rating": 5.0,
    "message": "Feels like you’re wearing socks!!! (No need for socks)  I get so many compliments:-)"
  },
  {
    "user": "Michele",
    "rating": 4.0,
    "message": "Really cute sneakers but they run small. I’m a true size 7 in every shoe I buy and on these my toes barely fit in the sneaker. I returned the 7, bought a 7.5 and those were STILL too small at the toe. I’m going to be returning those to buy a size 8. I’ll update my post once the 8 arrives. They are comfy and I love the olive green color, but buy a full size up!"
  },
  {
    "user": "Jay/Jae",
    "rating": 3.0,
    "message": "Regrettably had to send them back. Look better than the pics, beautiful original packaging just waaay too big. Unfortunately unable to keep them."
  },
  {
    "user": "Michelle L Elliott",
    "rating": 4.0,
    "message": "Lightweight and comfortable I purchased these for walking and they are perfect"
  },
  {
    "user": "Luz E.",
    "rating": 3.0,
    "message": "Bonitos colores… pero algo apretado"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I like it feel"
  },
  {
    "user": "MK",
    "rating": 5.0,
    "message": "Can’t expect much from inexpensive shoes but these look good and are comfortable. Not a lot of walking support and the materials are thin so these are good for low-activity. I’ll ware through them fast so only for leisure days."
  },
  {
    "user": "Jeanelly Cristellot",
    "rating": 5.0,
    "message": "They are very prettys!!"
  },
  {
    "user": "Stephanie Regatto",
    "rating": 5.0,
    "message": "The media could not be loaded. Me encantan son super ligeros"
  },
  {
    "user": "Carol Kitteral",
    "rating": 5.0,
    "message": "I normally wear 9/5 but these were too narrow to get my feet into, was going to send them back, but my daughter love them, and bought them from me."
  },
  {
    "user": "N. S.",
    "rating": 5.0,
    "message": "This is the first pair of Nautica shoes I have ever purchased.  I loved the look so I ordered them.  Not only do they look great they are truly comfortable.  And I got the navy/gray... Go great with jeans.  May even order another pair in a different color.  If any questions about them, give them a try.  I think you will be pleased!!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Talla ok calidad 👎🏻 Parecen que se hubieran despegado y fueron arregladas con goma fría 🙄😕"
  },
  {
    "user": "mama",
    "rating": 5.0,
    "message": "Like it"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very nice shoes and comfy"
  },
  {
    "user": "KL",
    "rating": 5.0,
    "message": "It’s been years since having surgery to remove bone spurs on the top of my feet but I still have a lot of pain when wearing closed shoes. These shoes are flexible and don’t put pressure on my feet. Now I don’t have to wear flip flops all the time."
  },
  {
    "user": "Deborah Sanders",
    "rating": 5.0,
    "message": "Can't wait to ware them for vacation in one week"
  },
  {
    "user": "PAT",
    "rating": 3.0,
    "message": "Love the shoe. But was sent used ones. When I opened i looked at them but didnt really look at good. Then today wore them to my dr office visit. An as I put on n good light, seen dirt all around the toe tip band seam , inside the seam it was so easy to spot . I didnt take out of box when recieved them just glanced. They cleaned them but not good enough... Nothing wrong with them as far as torn or anything. BUT I DO EXPECT BRAND NEW NOT DIRTY USED ONES. I WOULD OF ASK FOR REFUND BUT IM SURE ID GOT SAME ONES BACK, JUST WASHED...BUYERS BEWARE OF EVER PURCHASE..I SAY THAT TO MYSELF!!"
  },
  {
    "user": "Squatty Potty",
    "rating": 5.0,
    "message": "They are comfortable and a perfect size"
  },
  {
    "user": "Ana mihailov",
    "rating": 4.0,
    "message": "usually i wear size 8, but this runs smaller"
  },
  {
    "user": "Leticia García ceja",
    "rating": 2.0,
    "message": "Totalmente desechables es plástico no de tela no son para hacer ejercicio solo para caminar non duraderos"
  },
  {
    "user": "Bobbi Davenport",
    "rating": 5.0,
    "message": "Love these, buying another pair soon. Perfect for work and my work out routine."
  },
  {
    "user": "Olivia",
    "rating": 5.0,
    "message": "I love the design and how they look. They are really cute"
  },
  {
    "user": "NikkiJo",
    "rating": 5.0,
    "message": "Superb comfortable! Fits true to size and really cute!"
  },
  {
    "user": "keyama cherry",
    "rating": 4.0,
    "message": "The product fits well. They are very very light sneakers. I really like them alot the only downside is I don't wear them alot because I don't want the pleather material to start peeling. Other than that great design and comfortable."
  },
  {
    "user": "Cricket",
    "rating": 4.0,
    "message": "These are super cute shoes and so far I haven't had any problems with them tearing up or anything.  Mine seem to be made well enough and they are fairly easy to slip on and off.  The only reason for 4 stars instead of 5 is they aren't as comfortable as I had hoped.  I recently went on vacation and did a lot of walking and by the time we were done, my feet were hurting.  I also took a pair of skechers gowalk lites which were easier on my feet.  As far as size, I can wear a 6 or 6.5 depending on how they are made.  These are 6.5 and fit just fine.  Overall, these are nice looking shoes and decent for light walking, but not great for all day walking."
  },
  {
    "user": "MiaAthena",
    "rating": 3.0,
    "message": "These sneakers run small. I'm a size 8M, I ordered an 8.5 and I could really use a size 9, my toes do not have much room. I do not recommend these sneakers for long walks or working out, they do not have a lot of support in them. These sneakers are only good for running some errands or a short walk."
  },
  {
    "user": "Rebekah Landers",
    "rating": 5.0,
    "message": "Love them.. very comfortable and perfect fit."
  },
  {
    "user": "Olivia Cárdenas",
    "rating": 3.0,
    "message": "Calzado Mal Pegado, Poca Calidad del Producto. Ni que decir de la caja en donde venía: Rota y Vieja. No vale la pena comprar un calzado pegado con Goma"
  },
  {
    "user": "De los santos Vannessa",
    "rating": 5.0,
    "message": "There cute anf comfy!"
  },
  {
    "user": "Arro",
    "rating": 5.0,
    "message": "Cute shoes! They're extremely lightweight which is nice for running. I like that the tongue is attached to the rest of the shoe so you can slip these on pretty quickly without it bunching up. These felt pretty good when I was running, I definitely noticed some cushioning as opposed to my old pair of shoes. They do feel kind of slippery when on smooth surfaces, so be very careful if you're wearing on tile or hardwood. My gym has a more textured floor so I didn't slip, but I feel like that's a legitimate possibility in these. Maybe they get better as you wear them, I'm not sure. I noticed these were a bit roomy, so if you have wide feet you'll like these. I got my usual size 8.5 and they fit just fine, but again, they definitely have a little extra room at the sides of your feet. My only gripe is that they're very smooth inside which kind of made my foot shift around easier as I ran."
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "message": "I wear an 8. Had to return and get an 8.5. I should've returned for a 9 . Run very small"
  },
  {
    "user": "tyson1947",
    "rating": 3.0,
    "message": "It is very difficult to pass up the back of foot . But ones is on , it is comfortable. Will not buy it again though."
  },
  {
    "user": "Heriberto G. Villena",
    "rating": 5.0,
    "message": "Porque son bonitos prácticos y elegantes"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Tenis Náutica muy ligeros, cómodos y bonitos , buen servicio y rapidez en la entrega 😀"
  },
  {
    "user": "Heavenly",
    "rating": 3.0,
    "message": "I have trouble donning slip-ons"
  },
  {
    "user": "Mary E.",
    "rating": 5.0,
    "message": "Great Sneakers"
  },
  {
    "user": "Paloma Sterling",
    "rating": 5.0,
    "message": "Soy 8 1/2 y compré 9, me quedó súper bien."
  },
  {
    "user": "Jeni",
    "rating": 2.0,
    "message": "Not what I expected from Nautica. Thought it would be better quality."
  },
  {
    "user": "Mayi Sanchez",
    "rating": 3.0,
    "message": "No me gusto porque es muy transparente, quizás el material es muy sencillo."
  },
  {
    "user": "Yei",
    "rating": 5.0,
    "message": "Lindos"
  },
  {
    "user": "AMA LALA",
    "rating": 5.0,
    "message": "Soft and comfy"
  },
  {
    "user": "GFW",
    "rating": 5.0,
    "message": "This is my third pair of these — they are so comfortable and really cute!"
  },
  {
    "user": "Linda Jennings",
    "rating": 4.0,
    "message": "Loves these shoes, very lightweight, stylish and cute, now my only con is getting them on, perfect fit afterwards, must buy 😀"
  },
  {
    "user": "Adam Zierden",
    "rating": 2.0,
    "message": "I'm a nurse and had these on for 4 hours and noticed they were leaving behind a red fuzz everywhere I walked. Found out there is some kind of cloth on the bottoms."
  },
  {
    "user": "Testing testing",
    "rating": 3.0,
    "message": "Let me be clear: these are not running shoes. I don’t know why anyone orders $35 sneakers, expecting them to perform like $140 high end running shoes. These are lifestyle shoes. They are fine for doing errands, shopping, being out and about, etc., but they are not appropriate for exercise. They aren’t super comfortable, just okay. Nothing to write home about. But if you want just a pair of shoes for going out to do things, these are fine."
  },
  {
    "user": "elizabeth concepcion rosado",
    "rating": 5.0,
    "message": "Excellent"
  },
  {
    "user": "Myrna J. Dennis",
    "rating": 5.0,
    "message": "Very pleased with these casual sneakers. They are easy to put on and are well-padded for comfort."
  },
  {
    "user": "Abril Ramirez",
    "rating": 5.0,
    "message": "Love the color and model"
  },
  {
    "user": "Lizzie Brown",
    "rating": 2.0,
    "message": "Los tenis son comodos y vienen de talla exacta!"
  },
  {
    "user": "Jofl",
    "rating": 1.0,
    "message": "Pedí estos tenis y según las descripciones venia en talla correcta soy sizes 7.5 usa y los pedí talla 8 como acostumbro y al recibirlo que decepción vinieron súper pequeños vendrían siendo unos talla 6 de verdad que por mala descripción del producto y las reseñas perdi mi dinero. Así que toma esto en cuenta de que si eres una talla x debes pedir dos tallas más grande."
  },
  {
    "user": "DWade Fan",
    "rating": 2.0,
    "message": "These shoes weren’t very well made. Cheap materials that I could tell wouldn’t last more than a few months with normal wear. The soles were glued to the shoe haphazardly and uneven. The fit was true to size, but I sent them back. I needed a comfortable well made shoe to stand up to daily wear and tear. These were not the ones."
  },
  {
    "user": "William Sarmiento",
    "rating": 5.0,
    "message": "Muy bueno"
  },
  {
    "user": "Allison",
    "rating": 1.0,
    "message": "Too small in length and very tight on foot"
  },
  {
    "user": "Esther E.",
    "rating": 5.0,
    "message": "Comfy, light, and strut worthy.  Looks great any day."
  },
  {
    "user": "Alex",
    "rating": 4.0,
    "message": "These are sooooo cute. I get compliments from so many people. They are meant to be tied once and then slipped on and off from then after. I figured this out because from re-tying every day one of the laces tore one of the holes in the leather-like material. It’s easy to just not use that hole now but just an fwi."
  },
  {
    "user": "C. Porras",
    "rating": 1.0,
    "message": "The seems started falling apart after the second day =( too bad as they are really cute. I wouldn't recommend them"
  },
  {
    "user": "Duvi Caballero",
    "rating": 1.0,
    "message": "Son una buena imitación en apariencia pero no en comfort las tallas son pequeñas, el material es de mala calidad, definitivamente no son para realizar ningún tipo de actividad o entrenamiento."
  },
  {
    "user": "Mimi",
    "rating": 4.0,
    "message": "I love these shoes, I have bought them twice. They are so comfy, great for wearing on a trip, comfy and not really sweat inducing. They aren't the best shoes to wear for heavy labor, but as cute shoes to wear around town, perfect"
  },
  {
    "user": "MJ Amede",
    "rating": 5.0,
    "message": "Arrived in a timely manner, as appears in advertisement, comfortable for walking or exercise class. The shoe does wrap high or very close to the ankle."
  },
  {
    "user": "Ms. C",
    "rating": 1.0,
    "message": "These are super cute and fit well but there is zero support in this shoe. Not long after wearing them, my feet are screaming!"
  },
  {
    "user": "A r i a n n a™️",
    "rating": 5.0,
    "message": "Bought these as extra sneakers to wear casually & at work. I like the style & I like the color but the they were NOT comfortable at first. I had to break them in & they were slipping & sliding all over the place. Eventually the grip got better overtime somehow & I put Dr.Scholls insoles in them & they were perfect."
  },
  {
    "user": "GAIL THOMPSON",
    "rating": 5.0,
    "message": "I don't like the tongue of the sneakers. But otherwise the sneaker fit perfectly."
  },
  {
    "user": "Pj",
    "rating": 4.0,
    "message": "Have a hard time getting on, need a shoe spoon, no stretching"
  },
  {
    "user": "Sil",
    "rating": 5.0,
    "message": "I wear a size10,  this 10 look so cute on my feet. I love it.👌"
  },
  {
    "user": "Nitza Mejias",
    "rating": 5.0,
    "message": "Nautica, sneakers. Love that they're lightweight. The style is very nice. The price is great."
  },
  {
    "user": "Theresia cramer",
    "rating": 5.0,
    "message": "They are very comfortable but the bottom is cheap"
  },
  {
    "user": "Michelle Howze",
    "rating": 1.0,
    "message": "That they ran way to small"
  },
  {
    "user": "luz hierro",
    "rating": 5.0,
    "message": "Es un poco estrecho pero en general muy bonito. Sugiero pedir 1/2 número más"
  },
  {
    "user": "KC",
    "rating": 3.0,
    "message": "They are light shoes. Good for yoga. They do run small so I would get the next size up from what your regular size would be."
  },
  {
    "user": "K.",
    "rating": 1.0,
    "message": "These shoes hurt the balls of my feet, they make them burn.  I am not sure if they are too big and that is the reason.  I wear a 8.5 - 9 size shoe.  I ordered a 9.  I like the style and look, but can not handle the pain.  I read someones elses review and they ordered Dr. Scholls foot inserts.  I am hoping that will make a difference.  I had a pink pair on order and just cancelled them.  :o("
  },
  {
    "user": "Deirdre",
    "rating": 3.0,
    "message": "Cute, but cheap feeling.  The sole is hard, and is not non slip."
  },
  {
    "user": "Asheville",
    "rating": 5.0,
    "message": "This is my third pair of Nautica sneakers. This sneaker is true to size and it is very light weight. It is also extremely comfortable on my feet. I highly recommend this shoe."
  },
  {
    "user": "Maria",
    "rating": 5.0,
    "message": "Muy cómodos pero debí comprar un número más Soy 7 y compre 7 1/2 Por ser tenis y aun así me quedaron justos debí haber comprado 8"
  },
  {
    "user": "Jessica Martínez",
    "rating": 1.0,
    "message": "Se me rompieron la tela malla q tiene muy fina"
  },
  {
    "user": "Kristina",
    "rating": 5.0,
    "message": "Ima need to buy 5 pairs because I want this shoe always. Best show I have ever found and so happy I decided to see if amazon carried it and they do so I bought some extra colors and styles !"
  }
]