[
  {
    "user": "nixehan",
    "rating": 5.0,
    "message": "bought for my boyfriend and it was so chic on him. He said it’s comfortable and he liked it a lot and start wearing it right away. My boyfriend has wide feet and usual shoes are narrow for him so I ordered wide and it fit him perfectly."
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "This is my 4th pair of Rockports. These are solid. Much more comfortable than other sneakers type shoes. My experience with Rockports is that they run big. I suggest get a size smaller than you usually get."
  },
  {
    "user": "Anthony",
    "rating": 4.0,
    "message": "Overall ok shoe, sole makes a popping noise sometimes"
  },
  {
    "user": "Dean Berry",
    "rating": 5.0,
    "message": "Rock ports are always so comfortable, we’ll made, nice looking shoes."
  },
  {
    "user": "Heo sung hyuk",
    "rating": 5.0,
    "message": "good"
  },
  {
    "user": "Jeremy McDougall",
    "rating": 5.0,
    "message": "Because I have wide feet it has always been a struggle to find comfortable yet still fashionable shoes.  These shoes were absolutely perfect upon first wear.  Would highly recommend to anyone looking for a stylish wide shoe."
  },
  {
    "user": "RAM",
    "rating": 5.0,
    "message": "This is my 4th purchase of this shoe (in 2 colors)... that pretty much says it all.  We are headed to Europe next week and the 2 pairs should be all I need."
  },
  {
    "user": "Charles Ferr",
    "rating": 4.0,
    "message": "I bought this product in February 2022 and was wearing these shoes almost daily. It is August 2022 and the shoes are worn to holes in the soles. The soles are comfortable. And soft. And that's what made them wear off so quickly. I really expected them to last at least a year"
  },
  {
    "user": "Murand",
    "rating": 5.0,
    "message": "I always by Rockport shoes, same size and the always a perfect fit"
  },
  {
    "user": "Philip Adeyemi ADENIYI",
    "rating": 4.0,
    "message": "Nice product and very light."
  },
  {
    "user": "N. Kettle",
    "rating": 5.0,
    "message": "These shoes fit comfortably for long walks. The look nice with pants or shorts."
  },
  {
    "user": "Jeff Graves",
    "rating": 3.0,
    "message": "I usually have good luck with ordering shoes online, but this size 10 was way too big."
  },
  {
    "user": "harry burk heroman",
    "rating": 5.0,
    "message": "the black shoe was fine, fit perfect and comfortable.  the gray shoe i ordered was too wide, very wide. looks terrible when tie up."
  },
  {
    "user": "Shelly L",
    "rating": 5.0,
    "message": "My husband wears a size 14 wide so it is hard to find nice shoes that he likes to wear.  I got these and they arrived quickly.  He loves them and has worn them for a few months now.  They are perfect for going out when dress shoes are too dressy."
  },
  {
    "user": "Hussein Deeb",
    "rating": 5.0,
    "message": "Nice sneakers, comfortable and fits well"
  },
  {
    "user": "Bass_Fish",
    "rating": 5.0,
    "message": "Wasn't sure what to expect when purchasing these online, but we were pleasantly surprised. Comfy and a nice medium brown color. Shoes look good with casual office wear. Comfortable with good arch support. We bought these on sale so the price was right too!"
  },
  {
    "user": "Wayman",
    "rating": 5.0,
    "message": "These are very comfortable to wear all day. They are light and come in a variety of colors. I think my wife has bought me most of them. Time will tell on longevity and wear. So far I’m very pleased with these. I have some other expensive brands and these are the ones I choose most often. I will say the SAS are a tad more comfortable, but they are more than double the price."
  },
  {
    "user": "Bonnie Kaschak",
    "rating": 5.0,
    "message": "My husband loves them. It is so hard to find a casual shoe in a wide with that looks great. This fits the bill!"
  },
  {
    "user": "jwhitSJ",
    "rating": 5.0,
    "message": "I have tried many of the same type of shoe and this was the most comfortable for me.  Rockports seem to run 1/2 size larger for me then most other manufacturers.  I wear wide and this is a wide footbed.  I found this model to be more comfortable then even the similar looking Ecco's which is saying a lot.  The cushioning was superior and the leather breaks in quickly and is very soft.  The only thing that needs cushioning is the colar as there is no rim cushion however i added a heel cushion so problem solved.  This an ideal shoe as a smart casual shoe for a trip or anytime something nicer than a running shoe is needed.  For $79 they are a steal in my opinion. Update after 1 month.  Super Comfy almost slipper like!  One of the best shoes i own!"
  },
  {
    "user": "Joshua P. Akonom",
    "rating": 4.0,
    "message": "I wear a 12 in most shoes.  Sometimes I can squeeze into 11 1/2.  Reading the reviews and this being shipped to Korea I decided to go with the 11 1/2 risking them being too small and just trusting reviews.  Well, it was a good choice.  I might even fit into an 11 on these.  They definitely come big.  Don't have any worries going down a half size, at all.  They may be narrow, that's my only caveat.  I figure my feet are average width, and these fit width wise a little loose, but not that far off.  The shoe is definitely roomy on me. This is my first time going back to leather after doing mostly canvas for the last 6 years (Sketcher slip ons).  Compared to Sketchers these are a little less padded in the footbed, but still comfortable.  I'm just not use to having scratched leather so easily, but I imagine that's unavoidable.  Eventually they'll just look worn I assume.  All in all pretty satisfied with them.  They are light, comfortable enough, and really nicely constructed.  Love the suede patches adorning them.  I remember Rockports being super comfortable, feel like these may be a step down from that, but not uncomfortable by any means."
  },
  {
    "user": "Buddy",
    "rating": 5.0,
    "message": "Bought these and fitted with super feet carbon insoles for at home wear.  Best house shoes eva.  Love these.  I only wear them in the house.  They are smooth looking and fit well.  Curing my pf."
  },
  {
    "user": "Carola, CCS",
    "rating": 4.0,
    "message": "Given the reviews, I order half a size less. Too small. Besides, those shoes are beautiful, high quality. It is a pity I had to return them."
  },
  {
    "user": "jerry sears",
    "rating": 4.0,
    "message": "I was moderately disappointed in quality of the shoes. It fit large, I mean BIG! Returned for a full refund. No problem with that. I hate giving bad reviews. Rockport is slipping. B grade"
  },
  {
    "user": "Heather",
    "rating": 5.0,
    "message": "My husband loves these shoes. These are his 3rd pair of Rockports. He prefers them over all others."
  },
  {
    "user": "Nick Bailey",
    "rating": 4.0,
    "message": "I'm flat footed, so I gave this shoe a try and it's worked out pretty well. The quality of the materials isn't the best, but at the price point, that's kind of expected. By biggest frustrations are the length of the laces — they're short — and the fit at the ankle. I assume that because it's a wider shoe they expect a larger person to wear it, but it's a bit frustrating to have them feel loose all the time."
  },
  {
    "user": "Oldman",
    "rating": 3.0,
    "message": "I buy a lot of Rockport's when I can get 12 W. These just don't fit the same and are uncomfortable after three days of breaking in."
  },
  {
    "user": "Bernard w.",
    "rating": 4.0,
    "message": "Casul use"
  },
  {
    "user": "Ryan M. Roberts",
    "rating": 3.0,
    "message": "The finish on these scuffs extremely easily. Too easily. Otherwise it's a nice shoe but I took two stars for it"
  },
  {
    "user": "Reed",
    "rating": 5.0,
    "message": "I wear these shoes almost every day, let me tell you, they are comfortable. Now, with my heel all the way touching, it is about a half size larger than I expected, so my feet slide forward. These shoes are VERY light, at first I was taken back, they are lighter than any of my other leather shoes. The sole in these shoes feel like memory foam and are comfortable to walk in but I think over time it will wear out and I'll need to replace them. There is a rubberized strip on the heal of the shoe for grip, wearing socks to absorb the rubbing from this is a must or your heel will be raw. There also is a strip inside the toe of the shoe that supports under your toes, at first it was a weird feeling but feels normal now. My only real gripe is that I frequently sit in my chair with my ankles crossed with toes on the floor bending the toes of the shoes. So now there are some really mean creases in the toes of the shoes that do not heal, they are there forever now. Overall a great shoe, next time, a half size smaller and less toe bending and I'll be golden. I recommend them."
  },
  {
    "user": "SUL CHUL",
    "rating": 4.0,
    "message": "I like the price of my shoes and fast delivery time."
  },
  {
    "user": "Dana Olsen",
    "rating": 5.0,
    "message": "Very cool shoes, very comfortable. I'm a musician, I often stand and lay guitar for 2-4 hours at a time. They're very comfortable with good arch support, and they look GREAT - I get lots of compliments!"
  },
  {
    "user": "Diamondguy",
    "rating": 5.0,
    "message": "This is my third pair of these shoes. I wear a wide shoe and these fit me perfectly. I have walked all over Europe in them as well to the gym and out and about in my hometown. I've had guys stop me and ask where I got them. They are light as a feather but sturdy and long wearing."
  },
  {
    "user": "Martin Zalcberg",
    "rating": 5.0,
    "message": "Todo fue como esperaba y precio calidad fue muy bueno"
  },
  {
    "user": "Richard Faber",
    "rating": 4.0,
    "message": "Walked inside the house. Shoe is half to one full size too large.  I request a return process."
  },
  {
    "user": "John Alex",
    "rating": 5.0,
    "message": "With the gel foam sole and soft, light leather material, arch support and wide toe box I can walk comfortably all day long. I’ve owned different  Rockport shoe styles for many years and always been pleased with the quality materials and construction to satisfy my hard to fit wide feet and fallen arches. Gotten lots of compliments and style works great as an all around smart looking casual shoe for active lifestyle Highly recommended."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I've had these for a little less than 5 months as my everyday shoe, and the bottoms are already worn out. Basically every other part of it is still in good shape. They seriously are a half size bigger than you'd expect - I wear a size 15, so I ignored this, and I had so much extra toe room. So, please keep this in mind if you want to order them. I think the mid-sole is supposed to be memory foam? Whatever it is, it didn't do much for me. It felt about the same as walking in some chucks. They're not uncomfortable. I guess I can only recommend them to someone who doesn't do a lot of walking."
  },
  {
    "user": "P.retty B.oy T.actix",
    "rating": 4.0,
    "message": "So I never buy sneakers or shoes on line unless I know the company. So when I saw RP on here I had to get a few. Ok yes I love this company and wish I was wearing these growing up. (Rockport) I came across this brand at \"the coat factory\" years back and have been hooked since either shoes, boots & sneakers. Love these because they are comfy to walk in on the city sidewalks or the country roads even on campus while looking stylish and the leather will comform as any leather sneaker would. I hope u enjoy the brand as I do. Sorry for the slow drive but I wanted to make sure the reader understood how much I love these."
  },
  {
    "user": "kenna mililli",
    "rating": 5.0,
    "message": "My husband liked them so much we are ordering another pair."
  },
  {
    "user": "Kocica",
    "rating": 5.0,
    "message": "My husband who always complains about shoes swears these are the best one. He loves them so much he bought different colors."
  },
  {
    "user": "Michael Roberto",
    "rating": 5.0,
    "message": "Very sharp at reasonable price."
  },
  {
    "user": "Don M.",
    "rating": 4.0,
    "message": "Over sized."
  },
  {
    "user": "Samuel M.",
    "rating": 4.0,
    "message": "Shoe fits very comfortably! Nice lite shoe , looks good as well"
  },
  {
    "user": "RC",
    "rating": 3.0,
    "message": "The shoe looks decent, it is stylish and the color is appealing. My complaint about it is that the sole wore out pretty quickly. I've had the shoe for about a year and a half but only wear it occasionally. Now that the rain has come, I find myself sliding around because the sole is worn and has little traction."
  },
  {
    "user": "cthopkins",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Shaun Bradshaw",
    "rating": 5.0,
    "message": "I love these shoes. I originally bought a white pair and loved them so much I bought them in brown and black too. I wear them all the time and they've held up very well. Great looking casual shoe and very comfortable. UPDATE: After 2 years of almost daily wear, it was time for a new pair. The old ones are just as comfortable as the first day I put them on, but they were starting to show they’re age. The new ones are just as comfortable as the old ones, just not as dingy. :) I wholeheartedly recommend these shoes!!"
  },
  {
    "user": "Marvel GAYLE",
    "rating": 3.0,
    "message": "This is actually For my dear friend ❤ and he actually told me he loved it."
  },
  {
    "user": "IsidaAfc",
    "rating": 3.0,
    "message": "I bought it one size smaller and it is still a size larger. Otherwise, fits good just extra inch in the front."
  },
  {
    "user": "Ezyn",
    "rating": 5.0,
    "message": "Bought the 13W. Fits like a glove. Also light as hell. At first I picked up the them up thinking they would be much heavier. But they are about a pound each. Love the weight. Love the feel. First time buying Rockport shoes. Definitely going to be buying more in the future. Was trying to get away from Sketchers, memory foam everything (soles, insoles). They just don't last me more than 2 months at a time before they go flat. So far these have not failed me at all."
  },
  {
    "user": "Scott J",
    "rating": 5.0,
    "message": "Literally the best.  I never liked the style of Rockports, so I never tried them before.  I understood that they are supposed to be good walking shoes, but my god, I had no idea.  They are incredibly light and when I put them on, it's like walking on air.  And I'm a huge guy, 6\"6' 220lbs, and I put a lot of strain on my feet, stomping around all the time.  I love these shoes, I can even run in them, which I haven't done in years.  Try them!"
  },
  {
    "user": "Bob Friesen",
    "rating": 3.0,
    "message": "I enjoy Rockports for work since I am always standing or walking, and this brand is usually durable but also very comfortable. The only problem with these is the size and the sound it makes when I am walking, and I think the two problems are related. I have worn size 13 for the last 35 years, but these size 13’s are too big. I would exchange them but size 12 would probably be too small, and they don’t make 12.5. Which brings me to the noise they make. When I walk down the halls everyone can hear this loud popping noise. I assume it’s because they are too big, but they are light and comfortable so I will wear them at work until they wear out."
  },
  {
    "user": "Dania Griffin",
    "rating": 5.0,
    "message": "First, they’re footwear. Great fit. Very comfortable.  Feels almost like wearing nothing.  Yet, my feet feel protected and secure. I ordered a second pair (different color) and will likely order more.  Also, good price. Great shoe."
  },
  {
    "user": "Pat 819 didn't buy",
    "rating": 5.0,
    "message": "looks like a bowling shoe with great feel"
  },
  {
    "user": "Foosette",
    "rating": 5.0,
    "message": "Toe Box seems a touch long but very comfortable"
  },
  {
    "user": "Lord William",
    "rating": 2.0,
    "message": "These are great looking shoes and I get a lot of positive comments on them when I wear them. The issues I have are twofold: -these are hot shoes. I generally don't feel overheated in shoes, but after a day at work I can't wait to get these off. -the interior sole feels like I'm walking on very stiff egg crate or honeycomb material. It feels sharp and uncomfortable. After wearing for the first day I thought I'd left new shoe cardboard inserts in the shoes, took out the inner \"cushion\" and found that they are definitely part of the shoe and should be left in. I rarely wear these now because of these two short-comings and am reluctant to buy another pair of Rockports now."
  },
  {
    "user": "WB",
    "rating": 4.0,
    "message": "Good style and comfort, regular width gets a little too narrow to the toe box. Cole Haan is my standard shoe, not used to current gen Rockport yet. CH and Nike size 10, needed a size 9 for these shoes. Size 10 was huge. I saw a couple of other Rockports I'd like to try. I like the look and the sole."
  },
  {
    "user": "Dundeehoward",
    "rating": 3.0,
    "message": "Thought they  were  going to be green but they were grey"
  },
  {
    "user": "Patrick M Moynihan",
    "rating": 5.0,
    "message": "Runs a 1/2 size large.  But a got it 1/2 smaller fit perfect."
  },
  {
    "user": "Charles",
    "rating": 3.0,
    "message": "The color was really bad washed out.. the fit was too big too wide and looked worn right out of box.  Sent back"
  },
  {
    "user": "jon w jones",
    "rating": 3.0,
    "message": "Nice but not as comfortable as I had hoped. I actually contacted Rockport. I was told that these would be as comfortable as Rockport Men's Rock Cove Walking Sneaker They weren't"
  },
  {
    "user": "Vijay Nanda",
    "rating": 5.0,
    "message": "Love the style and design. Very comfortable and lightweight. It fits well and true to the mentioned size. returned the similar styled 3 times more expensive Bruno Magli as it was not as good fit as this one on my feet."
  },
  {
    "user": "Jimmy McDonald",
    "rating": 5.0,
    "message": "I liked the look of these shoes and Rockport is of an above average quality. They’re really nice shoes. I was most impressed with the weight. They’re very light,"
  },
  {
    "user": "Donald Nicholas",
    "rating": 3.0,
    "message": "I'm not too impressed with these shoes.  For the price the quality of them should be a little better than what they are.  Not to say that I've had problems with them, I have had none.  It's just that they feel and look a little on the cheap side once you actually get to touch them and put them on.  Still not a bad shoe, just could be a tad bit better imo."
  },
  {
    "user": "Danielle LaRosa",
    "rating": 5.0,
    "message": "They’re classy and stylish and I get many compliments. You can wear them with a suit too."
  },
  {
    "user": "Jessica Taylor",
    "rating": 5.0,
    "message": "He said they fit perfectly right."
  },
  {
    "user": "Jana",
    "rating": 4.0,
    "message": "Usually wears a 10.5 but this shoe was much too small."
  },
  {
    "user": "Mario N.",
    "rating": 5.0,
    "message": "These shoes look great with so many outgits and are the most comfortable shoe I own"
  },
  {
    "user": "RHC",
    "rating": 5.0,
    "message": "Shoe was very comfortable. Width perfect. We went down a size as recommended by our customers. Hubby normally wears 14W. The 13 wide was perfect. He stayed in them all night. He wants another pair in different color. Will definitely buy again."
  },
  {
    "user": "Mattchu",
    "rating": 5.0,
    "message": "SO comfy and they fit great! From reading around comments and another site called zappos, I had been reading that these shoes run larger than the said size. So normally I would've ordered a pair of 14's, but chanced it and ordered 13 Wide (I have wide feet). Felt like Cinderella sliding these beauties onto my ogre feet.  Still have a comfortable amount of space to wiggle my toes, but the shoe feels no where close from sliding off when i flick/kick my feet.  Love the style and the orthopedic padding inside makes me want to go to bed with these on all night. Just so happy if you couldn't tell from this review, haven't had an amazing pair of shoes like these in many many years. TLDR: They run large, so order a size down. Fit wide feet perfectly (if you order Wide). Stylish and OH so comfy."
  },
  {
    "user": "Tom posner",
    "rating": 4.0,
    "message": "Good look, fits well not perfect. But good."
  },
  {
    "user": "Carlo",
    "rating": 3.0,
    "message": "I work a fairly active job that admittedly can be harsh on sneakers. These things have worn out after about 200 miles. Pretty much just the soles being terrible is my issue with them."
  },
  {
    "user": "Michael M",
    "rating": 4.0,
    "message": "Perfect fit in my normal 8.5 size.  Great quality. These felt great right out of the box."
  },
  {
    "user": "Virnalisa Soares",
    "rating": 4.0,
    "message": "Very comfortable. I wear them with slacks, jeans and khakis. They feel great!"
  },
  {
    "user": "Maurice Parisien",
    "rating": 5.0,
    "message": "Pleased with my purchase of Rockport Men's Colle Tie sneakers. I find the shoe to be very comfortable with a fashion look that I was wanting to achieve."
  },
  {
    "user": "Amazonian",
    "rating": 4.0,
    "message": "This shoe is pretty narrow for a size \"W\". I have some Rockport sneakers the same size in wide, that fit great...these not so much. They are closer to a dress shoe style, but I had to return them...too tight width-wise."
  },
  {
    "user": "Sergio D'oliveira",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Liz Funk",
    "rating": 5.0,
    "message": "I was looking for a lightweight shoe for casual summer office wear. Fits the bill. Lightweight and decent style. Boys, toss your athletic shoes and try these out."
  },
  {
    "user": "Shanaseeya",
    "rating": 5.0,
    "message": "My son loves these shoes and finds them very comfortable. Finding the right shoes can be difficult, he needs good arch support and a wide width. These don't disappoint."
  },
  {
    "user": "SDCharger123",
    "rating": 5.0,
    "message": "They fit is great and they look very stylish.  A little high priced compared to others so hopefully they last long."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "I have never written a review but this experience has prompted me to do so.  When the shoes arrived I opened the box and there was a leaflet stating that worn shoes cannot be returned.  Obviously, stipulations about returns are always indicated when buying a product but I've never received a leaflet that looks like a 1 sentence \"word document\" that someone had just typed out.  It should be obvious that worn shoes can't be returned unless there was a defect.  THE PROBLEM IS THAT THE SHOES LOOK LIKE THEY HAD BEEN WORN.  I don't see how that could have been missed when the shoes were shipped.  The right shoe was double-knotted and as the pictures indicate, several scuff marks are readily visible and the soles of both shoes are dirty.  I like the shoes but this seller had to have know they had been worn.  The paper covering the shoes was crumpled.  On top of this, I have to pay a $5 restocking fee.  Basically, it appears as though they intentionally shipped a worn pair of shoes with a note saying that worn shoes cannot be returned.  Again, most people understand that worn shoes can't be returned.  Bad business practice!  Otherwise, they are nice shoes and fit well.  I just placed an order from the Rockport Store."
  },
  {
    "user": "Repsand",
    "rating": 3.0,
    "message": "I returned these shoes so it is hard to give an honest review as to fit and quality. I have decided that I am no longer going to buy or wear shoes that weigh less than a few ounces. They are sold as being better because they are lightweight. But I have found that these ultra-lightweight shoes do not last very long at all. I found these to be super light, so back they went."
  },
  {
    "user": "Silver",
    "rating": 5.0,
    "message": "So happy with this purchase. This shoe is comfortable and looks great on. Thank you."
  },
  {
    "user": "Steven B.",
    "rating": 5.0,
    "message": "This is a very comfortable shoe - and definitely \"not your Dad's hush puppy\" - the comfort of a sneaker, but much more attractive - works well on casual dress days at the office or for any other situation where you want something more than a typical sneaker but not as \"fancy\" as a typical dress shoe."
  },
  {
    "user": "SK",
    "rating": 3.0,
    "message": "They look pretty good for the beginning but you get what you pay for. As time goes on they crease and don't look that great, but then again they weren't too expensive."
  },
  {
    "user": "Baci&Cappu",
    "rating": 5.0,
    "message": "I love the style of this \"sneaker/golf looking shoe\" that I bought in 2 colors. The fit is perfect because they offer wide width. This is very comfortable footwear and you can be dressed \"Casual Chic\" by wearing these."
  },
  {
    "user": "Guillermo Cardin",
    "rating": 5.0,
    "message": "Me agrada lo cómodo y ajustable que queda en el pies e insuperable cuando se camina."
  },
  {
    "user": "Darlyn Caldon",
    "rating": 3.0,
    "message": "Didn’t fit; too big"
  },
  {
    "user": "David K. Jackson",
    "rating": 5.0,
    "message": "Bought these shoes to wear at the office. I love them already! They are stylish, comfortable and surprising light weight. Looks great with a pair of jeans. And the fit was great too."
  },
  {
    "user": "Lucrecia Hernandez",
    "rating": 5.0,
    "message": "My son absolutely loved these shoes"
  },
  {
    "user": "eddie",
    "rating": 1.0,
    "message": "The shoe was not what was shown.  It was all the texture/fabric of the rear of shoe advertised. It is velvet or suade feel all over, not close to the $^#% picture. Shameful."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Def listen to the reviews on these and get them a full size smaller. I wear a 9 but got these in an 8 and they are perfect. Toe box good, not cramped. Nice arch support and they look good."
  },
  {
    "user": "Tsuki",
    "rating": 5.0,
    "message": "I'm always slightly skeptical about purchasing shoes, sneakers, etc. on Amazon since I've had a few fails for sure. But I have to say, these were definitely worth it. Light weight, very comfortable, definitely going to be good for the upcoming summer months."
  },
  {
    "user": "mj smith",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Lisa O'Keefe",
    "rating": 5.0,
    "message": "I ordered these shoes for my husband and he loves them!  They are super comfortable and very stylish.  Also, ordering them through Amazon, I saved about 50% on the price.  Win, win!"
  },
  {
    "user": "M L.",
    "rating": 4.0,
    "message": "These shoes are very comfortable and lightweight, so they are good for all day use. Great shoe for the price."
  },
  {
    "user": "myk brunette",
    "rating": 5.0,
    "message": "Super comfortable! I walk about 8 miles a day at work and these shoes have greatly reduced my foot and back pain. If you have a wide foot, the wide is a little too wide. Other than that, fantastic shoe."
  },
  {
    "user": "Another customer",
    "rating": 5.0,
    "message": "Shoes are pretty comfortable, it Fits almost true to size, maybe a slightly larger. They're very stylish, have regular height and width, light weight and so far I've received a lot of compliments. Plus They're Rockport, never disappointed. Highly recommend."
  },
  {
    "user": "ishawa s.",
    "rating": 5.0,
    "message": "I have wide feet and it’s hard to find a shoe that doesn’t cause pain some place. These shoes are the best. Own several pair."
  },
  {
    "user": "Mila",
    "rating": 5.0,
    "message": "My husband said that these shoes are very comfortable and he is very happy with them."
  },
  {
    "user": "Frank J. Koerner",
    "rating": 4.0,
    "message": "Great looking hip shoe not as comfortable as other Rockport shoes I have owned"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love the fit. It’s light in weight; an unexpected benefit. Really very good. The only issues I have are its somewhat ‘old persons’ look and shiny color. My choice is that it would have a black matted surface and be less pointy."
  }
]