[
  {
    "user": "Danielle McLemore",
    "rating": 4.0,
    "message": "As a florist, I'm on my feet all day and I needed new shoes with good support and a good arch. I figured I would give these a try so I bought the purple and black ones. At first I felt like they made me 3 inches taller lol but they supported my feet all day at work, and were comfortable. I will probably buy another pair soon so I can have a back up. The price is reasonable as well. I go through shoes so it's great to find a deal. I recommend them for standing on your feet all day!!!"
  },
  {
    "user": "timberview",
    "rating": 5.0,
    "message": "Originally they were delivered to the wrong address but have received them now.  I ordered the purple black ones.  Love them!  Really cute and comfortable"
  },
  {
    "user": "rebbecca setty",
    "rating": 3.0,
    "message": "I bought these shoes 9/2020. They were fantastically comfortable and very lightweight. I wore them to throw on to run errands (daily for about 1-3 hours) which means mostly used on concrete surfaces. The sole started to degrade after 12 months with a couple cracks along the ball of the foot. 7 more months of the same amount of use and the sole appears to be made of foam under the thinnest rubber coating. My feet now get wet from dew on the sidewalk. If you are going to use them often, don't expect them to last long. I wasn't in them 8+ hours a day and they still started to degrade after 1 year. Maybe that's the normal shoe life now but I used to get 4 years out of my \"errand\" shoes before I would wear theough the top fabric...never the sole."
  },
  {
    "user": "Janice E. Bailey",
    "rating": 5.0,
    "message": "Like walking on cushions.  Good value and the product looks very good."
  },
  {
    "user": "Alphie",
    "rating": 5.0,
    "message": "Super comfortable and I really love the look. The shoes have a lot of padding in the heal and a wider than average toe box. They are supportive and lightweight without being overly restrictive on my ankle and foot movement, which is a plus. The size is to be expected. I usually wear a size or two larger in running shoes, so I have plenty of room in the toe box for long runs and I ordered these two sizes up and they fit me, as expected with plenty of room for my toes and tight enough to give me support and not slide around. 5 stars! I recommend!"
  },
  {
    "user": "CC",
    "rating": 3.0,
    "message": "Shoe was great but it had no grip on the bottom."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Dear all, I send bad comment regarding this program by mistake. Regards"
  },
  {
    "user": "the gaming is soooooooooooo fun",
    "rating": 5.0,
    "message": "I usually exclusively buy Nike sneakers. I mostly need sneakers for walking or playing pickleball.  But I find that Nike's will only last me about a year-18 months before they have a hole, worn out looking, etc. and cost around $75. So this time I decided to buy a \"no name\" brand of sneaker for $40 and see how that goes.  I really like these sneakers. They are light weight, with lots of support and very comfortable.  I'm curious to see how long they last - but for now I'm happy with them!"
  },
  {
    "user": "Kotta",
    "rating": 5.0,
    "message": "Fit perfectly"
  },
  {
    "user": "Katteann",
    "rating": 3.0,
    "message": "Ordered 7.5. When they arrived they are marked 7.5-8. Were too big as I like my shoes a little snug. Returned."
  },
  {
    "user": "Zealy14366",
    "rating": 5.0,
    "message": "Very comfortable, they don’t bend out of shape and keep their true form. Even when most sneakers get a bend by the foot area these haven’t. Overall worth it for the price. I’m a MA in the medical field and I walk around all day they definitely comfortable and supports the foot well, which is what you look for when you run around all day."
  },
  {
    "user": "wendy",
    "rating": 4.0,
    "message": "I wear for work, comfortable overall.  We will see how long that lasts though as I am on my feet for 8+ hours daily. UPDATE:  The left sole of the shoe has cracked all the way across rendering them useless to me.  Discovered when my entire left foot was soaked on a rainy day.  Wonder if they will offer new ones up."
  },
  {
    "user": "Misty B",
    "rating": 5.0,
    "message": "Oh wow I so love these shoes this is my favorite pair. .. Ps...I just realized that the pair I ordered are like a light peach color on the bottom and the inside of the shoe (the inner lining) is very dark. like apricot color...doesn't match... Not like the picture(08-17-2020)...the bottom and the inner lining are both suppose to be the same colorrrrr!!!!! Wow....like really!??? But dont get me wrong I love the shoes they are my favorite pair.....BUT!!! The colors are not as advertised."
  },
  {
    "user": "Carolina",
    "rating": 5.0,
    "message": "Muy cómodas súper recomendables"
  },
  {
    "user": "KP",
    "rating": 4.0,
    "message": "I'd like these shoes to last a bit longer than they do. The sole material breaks down sooner than it should."
  },
  {
    "user": "Beanie",
    "rating": 4.0,
    "message": "These are pretty comfortable, I wish there was a little more arch support."
  },
  {
    "user": "sweetytweety",
    "rating": 5.0,
    "message": "Love these shoes.......have hip and knee issues so I need a light shoe....this one is perfect !!!  Feels like you are walking on air !!!  Husband noticed how much more I was walking and he had me order him a pair.....we are both enjoying them on our walks together."
  },
  {
    "user": "ALICIA G.",
    "rating": 3.0,
    "message": "Sizes run at least 2 sizes too small. The shoe's tongue label  says 9 to 9.5 but it fit a 7 to 7.5 foot snugly. Guess I add 2 sizes and try again. Will gift this pair to another to avoid the hassles of a return. There's no way the shoes can fit as they're marked."
  },
  {
    "user": "Marie Zisoff",
    "rating": 5.0,
    "message": "I work in a warehouse so I walk 7 miles a day and these are the most comfortable shoes I have ever had for work."
  },
  {
    "user": "Sandra Alexander",
    "rating": 5.0,
    "message": "I was nervous about buy shoes online but the fit is very good. The shoe is light and looks good. They are comfortable for all day wear but I wouldn't say they are a workout or running shoe. I work in an office and may walk after work and my feet felt fine. If I worked on my feet all day I think my feet would hurt. The bottoms seem to squeak a bit on some surfaces. (See picture). I like them and it was a good buy. So far I would recommend them. Although not as good or comfortable as Nike air max but the look similar (see picture)"
  },
  {
    "user": "Anne",
    "rating": 5.0,
    "message": "These are very comfortable shoes. I'm a 7.5 U.S women size and ordering a 7.5 fit perfectly. Not too big. Not too small. It is just as it's shown on the picture and the material of the shoes is a cloth-like material that is very comfortable. However, I wouldn't recommend wearing this after like a rainy day or in places that can get your feet wet cus it will soak through. Other than that, It's great for the gym or at home exercises. i didn't have any problem with it at all so if you can splurge a little on great shoes. I would recommend these for anyone."
  },
  {
    "user": "Christel",
    "rating": 4.0,
    "message": "The product is very Comfortable"
  },
  {
    "user": "Consuelo moran",
    "rating": 4.0,
    "message": "Awesome for the price"
  },
  {
    "user": "Alexandria",
    "rating": 4.0,
    "message": "Material is a good quality. Ran in them this morning and there was no discomfort at all :) The insole steamed like it was put in incorrect and it left behind a small bubble that I had to mess with and really rub out to get in correctly but overall shoe is great for it's price and feels like decent quality!"
  },
  {
    "user": "Francisca Ruiz",
    "rating": 2.0,
    "message": "No me agrado es diferente a la foto"
  },
  {
    "user": "Denise J. Dion",
    "rating": 5.0,
    "message": "I’ve been buying these for two years now for my daughter and she absolutely loves them. They fit her perfectly and they last a long time."
  },
  {
    "user": "mary",
    "rating": 5.0,
    "message": "i love the shoe it fix good"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect for the Price...."
  },
  {
    "user": "Samantha Murphy",
    "rating": 4.0,
    "message": "Very comfortable"
  },
  {
    "user": "Felicia",
    "rating": 4.0,
    "message": "The shoe itself is fine, comfortable and nice, the problem I had is with the packaging it like someone poured a batch of chemicals on the shoes and shipped them out.  I won't buy this product again due to just that. Other than that its a great shoe so far after I have washed it."
  },
  {
    "user": "Genuine",
    "rating": 5.0,
    "message": "I am very pleased with this product.  The look alone is fantastic because the definition of the design.  Good comfort and durability.  Being a bit skeptical when ordering but upon arrival, I clearly would recommend this shoe to anyone looking for not only a fantastic feel but for look also."
  },
  {
    "user": "Daniel",
    "rating": 3.0,
    "message": "I like the shoe but umm I don’t like that it’s I’m not sure if it’s foam or plastic on the bottom either way I’m not a fan of the bottom I feel like I can slip."
  },
  {
    "user": "Dana Davis",
    "rating": 4.0,
    "message": "Good shoe for everyday use! The material was a little bit more thin near the toes than I thought it would be, but other than that they are a good shoe that lasted me a while."
  },
  {
    "user": "Daniel",
    "rating": 4.0,
    "message": "Pleased"
  },
  {
    "user": "Cleopatra Miley",
    "rating": 5.0,
    "message": "I like the fact that I work on my feet, and at the end of the day. My feet don't hurt"
  },
  {
    "user": "Brnbeautie",
    "rating": 5.0,
    "message": "I truly enjoy this shoe. Was not too tight around the toes and they look good. I received alot of compliments on them. I have flat feet and the sturdiness of them eases the pain that I usually feel in shows. I hope they plan to make some white ones and I plan to order them in blue. I will give an update to let you know how they do with me running in them.  So far I am happy with them."
  },
  {
    "user": "Helen Ingersoll",
    "rating": 3.0,
    "message": "I love these shoes when I first got them but in less than a year the whole bottom split crossed the toe areaWould not recommend these shoes"
  },
  {
    "user": "Angela H.",
    "rating": 5.0,
    "message": "I thought I was ordering a pair of Nike Air tennis shoes So when I got these I was surprised and realized I had made a mistake, however, I thought I’d give them a try and I love them! No need to spend a ton of money on Nike air when these work just as good"
  },
  {
    "user": "carolyn ellison",
    "rating": 4.0,
    "message": "The product was great and I  like them but to small I  need a size 7"
  },
  {
    "user": "Joe Liistro",
    "rating": 5.0,
    "message": "Great product, good price."
  },
  {
    "user": "M. Brown",
    "rating": 5.0,
    "message": "I have spent thousands of dollars for \"sneakers\" over my lifetime----buying the pricier brands thinking they would give me true comfort while walking or jogging.  As an active 82 year old woman, I decided to give this shoe a \"try\" for walking my treadmill daily.  These shoes were like walking on air---literally that comfortable!!  They are far more comfortable than any athletic shoe I have ever worn.  I will recommend them to all my friends and family."
  },
  {
    "user": "Darkestblue",
    "rating": 4.0,
    "message": "I really like these shoes they are breathable and elevate my heel like I needed but I wish I order half a size up because after awhile they start to pinch my toes."
  },
  {
    "user": "patricia diane marzett",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Giulz",
    "rating": 4.0,
    "message": "Noticed it was slightly I mean slightly larger than other pairs I’ve ordered but for the dollar to use to go to mall or walk on treadmill fine... I wouldn’t recommend running in them by any means but like I was saying walking to park or around the neighborhood they are perfect"
  },
  {
    "user": "Marla Camara",
    "rating": 3.0,
    "message": "What I like the most about the shoe is the design and it came in a bunch of colors. What I like the least is the sizes run very small I wear a 9 and 1/2 when I got the shoes didn't fit my toes touch the very top so I had to send it back and get the 10 it's okay but I think if I could got a 10 and a half and it probably been perfect so it's a good shoe they just run small."
  },
  {
    "user": "Shenilla M. Pellicano",
    "rating": 5.0,
    "message": "(After three walks for a total of 9 miles) Shoes were perfect!! two walks I wore compression socks and on the 3rd walk I noticed me shin pain disappeared. I would recommend. Just make sure you know you may have to wear a few time before its a perfect fit."
  },
  {
    "user": "Cathy Fostet",
    "rating": 4.0,
    "message": "Fit as expected and very comfortable. Like walking on clouds would purchase again."
  },
  {
    "user": "Jamila",
    "rating": 4.0,
    "message": "Got them today love the look can't wait to see what they feel like for work hope there comfortable they felt comfortable when I tried them on though"
  },
  {
    "user": "Virginia hamilton",
    "rating": 3.0,
    "message": "Not bad but what do you expect for the money"
  },
  {
    "user": "Tracey",
    "rating": 5.0,
    "message": "These are the best sneakers I have ever wore!! I purchased them for work, I bartend and am on my feet 10-12 hours a day - they are non slip and it feels like your foot is sitting in a cloud. For the first time my feet, ankles and back don’t ache after a hard day at work!!"
  },
  {
    "user": "shearon forrest",
    "rating": 5.0,
    "message": "This is an excellent buy. The price is good and  it fits perfectly. I tend to have more issues with shoes as I ruined my feet over the years with high heels. This is my second pair. I bought a pair last year and my sister came from the UK to visit without her gym shoes. She fell in love with these shoes and they went home with her."
  },
  {
    "user": "YO.",
    "rating": 3.0,
    "message": "These are pretty sturdy and light.  They are comfortable, soft, and supportive.  I wish the shoe came up a little higher on the foot (more support for ankles) - during some exercises the foot moves in the shoe a bit and doesn't feel as secure.  No rubbing of the heel.  Holds up to vigorous exercise. Update: the tongue of the shoe is very narrow so it bunches up and can get annoying / slightly rub."
  },
  {
    "user": "Ashley Mendoza",
    "rating": 5.0,
    "message": "They are so comfortable and feel so good especially if u have a job where you stand all day long one of the best pairs I orded"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Very nice looking shoe, but runs a little small."
  },
  {
    "user": "Loretta Jackson",
    "rating": 5.0,
    "message": "Work in Resident Living Complex have to walk to middle of building. I have feet problems but I can stretch my toes out comfortably when walking. Plenty of room at toe area."
  },
  {
    "user": "Chrissamom",
    "rating": 5.0,
    "message": "LOVE this sneaker!  I had never heard of this brand before but I am glad I gave it a try.  I walk a couple of miles back and forth to work and this sneaker has been extremely comfortable for me.  I am not a runner so I don't need the support that would come with that type of sneaker, and the support that this sneaker has is perfect for walking.  I am very happy with it."
  },
  {
    "user": "Barbie clark",
    "rating": 4.0,
    "message": "Brought these gym shoes and love them. Have no problem with the fit and they are very comfortable."
  },
  {
    "user": "Ebony Blue",
    "rating": 2.0,
    "message": "Was looking for a Nike shoe and mistook the name Jarlif as a style not a brand.  The fashion shoe came in a cute case but it wasn't what I wanted.  Haven't tried them on but probably if they don't fit or are not comfortable I will probably donate them. Don't let the AIR on the side fool you.  Also they were delayed in arrival.  Gave 3 stars as average didn't look close at quality of construction because I had to leave. UPDATE Right fit. If you buy make sure to go a half size up. Word them to run errands. Were not comfortable for extended wear. Changed to 2 stars. Very deceptive. Nike should sue but I guess since the word AIR cannot be trade marked this company can get away with it. Not a good way to build a brand."
  },
  {
    "user": "Sereana",
    "rating": 4.0,
    "message": "They are comfortable"
  },
  {
    "user": "Marsan",
    "rating": 2.0,
    "message": "The most comfortable ever…great material except the sole won’t last."
  },
  {
    "user": "Ioana P.",
    "rating": 3.0,
    "message": "I gave it 3 stars, because of how the soles are. They seem like the orange color on the soles is just painted on and it makes them look cheap. Other than that they were ok, for the price, but I will be returning them mostly because of the painted soles and they are also running a little small."
  },
  {
    "user": "Lizzy",
    "rating": 4.0,
    "message": "I love the feel of these shoes... feels like walking on a cloud"
  },
  {
    "user": "LeAnn Lockhart",
    "rating": 4.0,
    "message": "Very comfy"
  },
  {
    "user": "CrystalAngel7770",
    "rating": 4.0,
    "message": "The media could not be loaded. Great buy, comfortable, and because they are knit your feet don’t get hot. Taken many long walks and the insoles are still holding up. I recommend this shoes."
  },
  {
    "user": "Sasha Riveros",
    "rating": 5.0,
    "message": "Love these shoes. Feels like walking on a cloud. Extremely comfortable and worth the cost."
  },
  {
    "user": "Tanesha",
    "rating": 4.0,
    "message": "Love them"
  },
  {
    "user": "Amy South",
    "rating": 4.0,
    "message": "I really like the looks and comfort but they did run a  bit snug....should of ordered a full size bigger ..I only ordered a half size..all in all..nice product"
  },
  {
    "user": "M.L.Wilson",
    "rating": 4.0,
    "message": "Would have gave a 5 but the heels were smashed in due to the packaging. Took a few days for them to get in shape & fit correctly and comfortably."
  },
  {
    "user": "Dimond69south",
    "rating": 4.0,
    "message": "I ordered a size 6.5 fits perfect very comfortable but the bottom is plastic like and slippery when running and not good on a rainy day u will slip walking ok but running and water not ok"
  },
  {
    "user": "Gisel Gonzalez",
    "rating": 4.0,
    "message": "Great for work standing and moving those extra hours not bad at all"
  },
  {
    "user": "Q. Martin",
    "rating": 5.0,
    "message": "Awesome shoes. Very light and comfy. Good for running, HIIT, and exercise bike!"
  },
  {
    "user": "Sherri Charles",
    "rating": 3.0,
    "message": "It is a good shoe and seems quite strong however it is only for casual outings. I do not advise this sneakers for any active sport as I twisted my ankle twice with this shoe. It feels wobbly from time to time and does not adjust to your foot if you lose your balance . On the contrary it serves for other casual purposes."
  },
  {
    "user": "Marcella A. Johnson",
    "rating": 4.0,
    "message": "I did wear them all day and my big toe hurt. Not sure if it is the shoes or not. I have flat feet and these actually fit well"
  },
  {
    "user": "Heather P",
    "rating": 4.0,
    "message": "Fit great! Super light weight. I am on my feet at work for 10-12 hours a day and these really helped with my feet not hurting by the end of my shift. Fit was true to size."
  },
  {
    "user": "Celtic Moon8201",
    "rating": 4.0,
    "message": "I like how they feel on my feet. But I don’t like the fact they are getting black marks on the white part of the shoes. They are not easy to remove."
  },
  {
    "user": "David Romero",
    "rating": 5.0,
    "message": "I am happy with it Thank you they fit perfect me and my wife are so happy it came right before her birthday"
  },
  {
    "user": "Xenia",
    "rating": 5.0,
    "message": "My 2nd purchase. Very happy with price/quality. Good for running, working out, long walks. It is made from mesh (sort of) fabric, so my feet do not get hot in the summer. I got size 8. True to size."
  },
  {
    "user": "German Arias",
    "rating": 4.0,
    "message": "El tamaño tal cuál como fue sugerido por Amazon."
  },
  {
    "user": "april littenecker",
    "rating": 4.0,
    "message": "bought for work,on my feet all day."
  },
  {
    "user": "Kim",
    "rating": 1.0,
    "message": "I have been running for several years.  I was in need of a new pair of shoes and thought I would give something other than Brooks a shot.  What a mistake!!!  Worse pair of running shoes I have ever purchased.  They fit but slid a lot because there is no real support for the foot so feet would slide.  I got a blister on day 3 of running, in all my years of running, including 1/2 marathons, etc., I have only twice gotten a blister and that was after a very hot day and my feet started sweating a lot.  I would never recommend these shoes for anyone to run or even exercise in.  I tried exercising in them and my feet and legs hurt, finally had to take shoes off during the workout.  I am giving up on them and going to be removing from my closet.  Too bad I gave them my $$ to throw away.  I am back on a search for Brooks and pulling out my old shoes until the new ones come in."
  },
  {
    "user": "Children Of Parent Incarcerated Needing Guidance",
    "rating": 3.0,
    "message": "I have to say. When I took these out of the box. I was like WOW! I have worn them for a couple of months. They haven't worn as well as even cheaper shoes. My last pair I wore a year. This pair is maybe a couple months and they need replacing. Not a bad buy. But not a great one either."
  },
  {
    "user": "Glenda H.",
    "rating": 5.0,
    "message": "AS ADVERTISED!!! Quality exceeded my expectations...products are 100% quality..I will use Jarlif for every purchase on Amazon. What is pictured is EXACTLY what you would get! It really is an incredible buy...Fast Shipping! Good price! Great product! Package was secured against potential damage in the mail.  Seller's description of Item is nothing short of...Accurate. I am thoroughly satisfied and confident that I will shop there again. Thank you, My best"
  },
  {
    "user": "K. Abbott",
    "rating": 2.0,
    "message": "Bought these about a month ago.  I have tried to wear them several times but they cause me knee pain within about 15 minutes of walking in them and I have never had knee problems before.  As soon as I take them off and begin to walk around flat footed, the pain in my knees goes away after awhile.  The shoe itself seems well constructed though the insole in very flat.  I have never had an athletic shoe do this before.  The heel is quite high so maybe that is what is causing me to stand differently.  Other than my knee pain, they are comfortable on the foot and true to size.  Sadly, they are going to get donated to the thrift store."
  },
  {
    "user": "Rose De George",
    "rating": 5.0,
    "message": "Omg I have had them for a month and wear them for work. The white trim is still white and they are nonslip! I will be buy another pair for everyday not working"
  },
  {
    "user": "Sharon K.",
    "rating": 1.0,
    "message": "Great shoe I just need a ww width."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoes aren’t high quality shoes. And if you tighten them with the laces they scrunch up. I also don’t think these should come up in a search for Nike shoes."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Love the sneak itself....very comfortable and breathable...however, I asked for Black on pink....received blue and pink...not too happy butI had to have sneaks"
  },
  {
    "user": "Chandra Green",
    "rating": 5.0,
    "message": "My husband loved these. He is a basketball coach and wears threes to go running. He says they are very comfortable the most comfortable of his running shoes. I plan to order a pair."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "the sneakers are nice"
  },
  {
    "user": "Abby",
    "rating": 5.0,
    "message": "I was so very impressed by the packaging of these black running shoes, the mfg took special care in packaging them and I want to thank you so much, they arrived on time and fit great, my feet feel so good and I'm balanced much better, thank you again, I would definitely buy another pair from this mfg!"
  },
  {
    "user": "BETTYJANE OJEDA",
    "rating": 5.0,
    "message": "my feet feel just as rested going in as they feel coming out my arches are cradle in the sneaker no pressure anywhere on my feet that is a wonderful feeling . thank you"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Nice shoes probably if they would have fit. Look good. Are  at least 1 size too small  I misplaced papers for return so stuck with them. Can't wear them and  i ordered according to size (8) that was suggested to me for usual medium 8 in women's. Which I wear  in most shoes."
  },
  {
    "user": "Marie jacob",
    "rating": 3.0,
    "message": "Shoe is to small and to tight."
  },
  {
    "user": "Chap 43",
    "rating": 5.0,
    "message": "I already write my opinion,, feel like walking on the sky"
  },
  {
    "user": "M. Sharpe",
    "rating": 4.0,
    "message": "Fits great and wears well.  Wish the insole was a little bit softer.  Would buy again"
  },
  {
    "user": "Lexy",
    "rating": 5.0,
    "message": "I purchased the size 9 for myself and it is the perfect fit! Plenty of room , the back and sides of your feet do not rub against the sneaker. Prefect support for waliking."
  },
  {
    "user": "karen s iser",
    "rating": 5.0,
    "message": "Very nice sneakers they fit just like a Nike. They are well worth the money"
  },
  {
    "user": "Lorraine",
    "rating": 4.0,
    "message": "The color is great and the fit is comfortable"
  },
  {
    "user": "Kareem and Samantha Wiggins",
    "rating": 3.0,
    "message": "Definitely not as comfortable or true to size as the others I bought from this company. Same sneakers, just different colors, yet they don't fit the same. Won't be able to use these much for walking and things, as they flop off my feet a little"
  },
  {
    "user": "Niterider",
    "rating": 5.0,
    "message": "Loved them I ordered  4 pairs of these for Christmas  gifts 🎁  and they loved them."
  }
]