[
  {
    "user": "R",
    "rating": 5.0,
    "message": "Puma socks and sneakers have long been my favorite, but I can't always find them...and if I do, they aren't in my size or in the color/style I want. So when I saw these on Amazon, I just ordered my usual sneaker size and hoped for the best. Well, they not look great & fit perfectly, they are SO comfortable right out of the box. They arrived quickly and were boxed up very nicely in a PUMA shoebox. I'm extremely satisfied! 🙂"
  },
  {
    "user": "Stacey Repko",
    "rating": 5.0,
    "message": "I am IN LOVE with these shoes! Subtle pop of color on the black makes these sneakers are attention grabbers, for sure. The breathable material of the shoe keep your feet cool. I would buy them in another color…. I may even buy a second pair. ☺️ I also have a wider foot and I still fit comfortably in these shoes."
  },
  {
    "user": "Nathaly Medina",
    "rating": 4.0,
    "message": "Me gusto, era lo que esperaba, tomen en cuenta que es de horma grande si lo piden muy grande al momento de amarrar se arruchara por los lados"
  },
  {
    "user": "michelle prince",
    "rating": 5.0,
    "message": "These are good shoes and for the price one can't ask for more in my opinion. They are attractive and very comfortable and cushy under the feet. They fit snug enough that my foot don't wiggle around in the shoe (I have a long narrow foot), but my toes still have plenty of room so they don't feel cramped up. I am a 7.5 normally and I ordered the 7.5 so they are true to size in my case. The shoe laces stay tied and never come undone on their own and the soles are very rubbery and slip resistant. I have wore them for about 2 weeks and they are made well and are durable as far as I can tell so far. I am happy with my purchase!"
  },
  {
    "user": "Ty",
    "rating": 5.0,
    "message": "I was a bit skeptical because my back is a bit messed up and I need really good supporting shows def since I’m starting to train to run again. These shows were very comfortable and really helped with back pain I get while jogging. I’m actually about to I’ll order a second pair. I’m very picky on shoes and with my first time wearing them working out I def approve"
  },
  {
    "user": "Jennifer pauksta",
    "rating": 5.0,
    "message": "I picked the shoes because of their appearance but didn’t expect how comfortable they would be! It feels like gel/memory foam inside. They are my new fave sneakers!"
  },
  {
    "user": "Drea",
    "rating": 4.0,
    "message": "This sneakers is very comfortable and the fit is true to size."
  },
  {
    "user": "Leroy wertz",
    "rating": 4.0,
    "message": "Wife loves them"
  },
  {
    "user": "Billiejean",
    "rating": 5.0,
    "message": "Takes only Hours to break in when you walk a lot working but not too good in slippery shower rooms but doable!!"
  },
  {
    "user": "Pedro",
    "rating": 4.0,
    "message": "Los Tennis venían manchados y eso no me agradó, ni podía cambiarlos ya que al día siguiente se iban para otro país."
  },
  {
    "user": "LynzC",
    "rating": 5.0,
    "message": "These are the most comfortable shoes. I wear them as regular tennies and for working out.  Always getting compliments. Best part is how comfortable they are AND cute! Looking at buying more (different color)."
  },
  {
    "user": "Pixiecat",
    "rating": 5.0,
    "message": "Very deep black color with Puma logo nicely placed. Shoes are true to size. Wide box gives added comfort for my wider feet.  Puma are known for a flatter shoe so doesn’t have the super arch but a supportive lower one.  Seems well made - good purchase."
  },
  {
    "user": "April",
    "rating": 5.0,
    "message": "Love the look and feel of these sneakers, and can’t beat the price.  The cushy foam insole is very comfortable, hoping it holds up over time."
  },
  {
    "user": "Ashshanta",
    "rating": 5.0,
    "message": "This is a stylish shoe that feels like I'm walking on clouds."
  },
  {
    "user": "Ekaterina Georgieva",
    "rating": 4.0,
    "message": "They look reliable to use on rainy days."
  },
  {
    "user": "Becky Stenkamp",
    "rating": 5.0,
    "message": "Love these, I am a heel runner, walker so they are great for me and they are super cute too!"
  },
  {
    "user": "Sheila King",
    "rating": 4.0,
    "message": "Shoes fit as expected, maybe a little loose in the toe area"
  },
  {
    "user": "Elizabeth Velasco",
    "rating": 4.0,
    "message": "I’m still adjusting to them"
  },
  {
    "user": "Abbey",
    "rating": 4.0,
    "message": "Love the shoes. Only thing was the size was not true size fit.  I've ordered 2 pairs of smeakers and had to send both back to get a half size up"
  },
  {
    "user": "Jessica Gomez",
    "rating": 5.0,
    "message": "Oh my god I love them they are so comfortable and the look is fire 🔥 😍"
  },
  {
    "user": "Anitza Quinones",
    "rating": 5.0,
    "message": "Cómodos"
  },
  {
    "user": "Ana Mendoza",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Gretchen Peterson",
    "rating": 5.0,
    "message": "Great for working due to the fact they are Softfoam, but also pretty and bright enough to be worn as an every day sneaker! My favorite pair of Pumas so far!"
  },
  {
    "user": "Arenthia",
    "rating": 4.0,
    "message": "Great shoe but they run small"
  },
  {
    "user": "floria",
    "rating": 5.0,
    "message": "Loving them"
  },
  {
    "user": "Kelly Edwards",
    "rating": 5.0,
    "message": "Great for the fit and okay in comfort could use an an arch"
  },
  {
    "user": "Amanda M.",
    "rating": 5.0,
    "message": "I’m so in love with these shoes! The color glows and they for true to size. They are very comfortable. So excited for these!!"
  },
  {
    "user": "Jenny h.",
    "rating": 5.0,
    "message": "I have been having problems with my feet. Tried several different shoes. They all hurt my feet. This shoe is very comfortable and I’m very pleased."
  },
  {
    "user": "Carol Grant",
    "rating": 5.0,
    "message": "They look nice and are very comfy."
  },
  {
    "user": "Amber Johnson",
    "rating": 5.0,
    "message": "I Absolutely Love These Shoes I Got A Bad Back And Legs And These Shoes Are Amazing Feels Like I’m Walking On Clouds!"
  },
  {
    "user": "J.B.",
    "rating": 5.0,
    "message": "I love these shoes, ordered more pairs in case this style is discontinued.  They do run 1/2 size smaller, I normally wear 8 but had to exchange for 8.5."
  },
  {
    "user": "Betty",
    "rating": 5.0,
    "message": "very soft insoles when you walk it feels like heaven"
  },
  {
    "user": "Melody York",
    "rating": 5.0,
    "message": "These shoes are really comfortable. I'm a teacher and on my feet a lot so comfort is a must. These give you a slight bounce to your step which helps keep your feet from being fatigued at the end of the day. I wore these to work yesterday and didn't feel like immediately taking them off when I got home, which is a win. If you are thinking of buying these don't hesitate. They are well worth the money."
  },
  {
    "user": "Brandy Marley",
    "rating": 5.0,
    "message": "Memory foam sole made these so comfortable. True to size"
  },
  {
    "user": "Christine kane",
    "rating": 5.0,
    "message": "I wanted a black pair of sneakers with just a little color & I found these and the rest is history.  Great price & they fit perfectly 🥰"
  },
  {
    "user": "Julie baldwin",
    "rating": 4.0,
    "message": "I have always loved puma and the shoes are really light weight. The only thing is I wear size 12 womens and puma runs a little small. But I still love them!"
  },
  {
    "user": "BottomLine",
    "rating": 5.0,
    "message": "My favorite sneaker from Puma.  Made for wide feet. True to size.  Great for working out or running. The laces on the white sparkly a bit which is so cute...but not too much.  Highly recommend."
  },
  {
    "user": "Aurora Bragg",
    "rating": 4.0,
    "message": "This are really comfy and super cute. They’re a little tight on my feet as I have a fat feet. But they are great shoes. Perfect for working out. Comfortable. I love the colors."
  },
  {
    "user": "jamie s perry",
    "rating": 5.0,
    "message": "Fit perfect and very comfortable shoes to wear no matter what your doing !"
  },
  {
    "user": "Mimi",
    "rating": 5.0,
    "message": "All I know is these are literally like walking on cloud.  The most comfortable shoe I've wore in a longtime. They have this cushion that's amazing."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "Comodidad buen soporte"
  },
  {
    "user": "Drea Drea",
    "rating": 4.0,
    "message": "I absolutely LOVE this shoe. I wear a size 10, originally bought a 10 and my toe is too snug at the top so it causes irritation, otherwise fit my foot like a glove. So since my toe was crammed to the front, I ordered this 10.5, which I now know Puma runs small, you have to size up. Problem is, once Puma leaves 10, the shoe bevies a wide and the form/structure isn’t the same. Now my foot is swimming in the shoe. Assuming this is a “running” shoe, it’s higher in the back and lower in the front so it always feels like my foot is always sliding down to the front out of my shoe. I’m always adjusting. Other than that, they are very padded so very comfortable for walking, running, standing."
  },
  {
    "user": "Psythiros",
    "rating": 5.0,
    "message": "They’re a perfect shade of blue, so they go with all of my jeans. I’m very comfortable walking in them. And the cat logo!!!"
  },
  {
    "user": "david",
    "rating": 4.0,
    "message": "Very comfortable and light"
  },
  {
    "user": "mely",
    "rating": 5.0,
    "message": "These shoes feel amazing!!!!!!! I work in the medical field and I am on my feet all day. These are the first shoes I have ever owned that I can work all day sometimes 12hrs and still my feet don’t hurt love them. I’m ordering two more pairs for a backup"
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "poonam rana",
    "rating": 5.0,
    "message": "I am using this pair of shoes for walk."
  },
  {
    "user": "LaNutcia",
    "rating": 5.0,
    "message": "lovely shoe just know it runs small"
  },
  {
    "user": "Leslie Oyler",
    "rating": 3.0,
    "message": "I asked for a shoe for nurses and these were at the top of the list. By the end of the day, my feet hurt. I haven’t had them very long and already aI need.née ones because the tops are wearing our. Not well made at all"
  },
  {
    "user": "Stephanie",
    "rating": 4.0,
    "message": "I work on my feet all day, after the first couple hours, the comfort was gone. It’s nice at first, just not for the long run."
  },
  {
    "user": "Alejandra Puente-Frantzen",
    "rating": 5.0,
    "message": "Its beautiful, comfortable and the best walking shoes ever. However... its not for sports. You are warned."
  },
  {
    "user": "Areli Abrajan",
    "rating": 5.0,
    "message": "These shoes are so comfortable, feels like you are walking on gel, & they are cute, I am a 6.5 but I purchased a 7 and they fit great."
  },
  {
    "user": "rckimrll44",
    "rating": 4.0,
    "message": "These are just as pictured and look great.  They are comfortable, but not cushiony enough to wear for a job where you're on your feet for 10 hours a day. You will need inserts for more comfort"
  },
  {
    "user": "Virginia",
    "rating": 5.0,
    "message": "Muy bueno"
  },
  {
    "user": "Jenise",
    "rating": 5.0,
    "message": "The soft foam is amazing! I’m on my feet for over 12 hours a shift as a nurse and my feet DO NOT hurt after my shift is complete. I love these shoes!"
  },
  {
    "user": "Teresa Tweedle",
    "rating": 5.0,
    "message": "I normally wear a 7.5 but glad I ordered a size 8 they fit perfect! These shoes are so cute and comfortable! They are so light weight and great support! I have never bought puma’s but absolutely love them! I will probably buy another pair in a different color"
  },
  {
    "user": "S. Kearns",
    "rating": 5.0,
    "message": "This are hands down one of the most comfortable pair of sneakers I have ever worn. I workout in these every day. I feel no stress on my feet after."
  },
  {
    "user": "Jan B",
    "rating": 5.0,
    "message": "I like the way that these fit"
  },
  {
    "user": "Chris Mortimer",
    "rating": 5.0,
    "message": "Shoes are good quality and very comfortable. They have a very thick foam cushion insole that feels so good on my feet even after a 12 hour shift and then walking around the grocery store after work. No tired or achy feet at all. The laces are a little long for my liking, but I just tuck them in the side of the shoe and it worked well for me. The toe in these shoes runs very wide and I have fairly wide feet that typically hang off the sides of most women’s sandals. I normally wear between a 7, 7.5, or 8 in most all shoes. A 7-7.5 in tennis shoes and 7.5-8 in dress shoes usually fit perfectly. If you have narrow feet, these are prob not gonna be a good fit. Even on my wide feet I have to pull the laces very tight and it scrunches up and wrinkles the whole side of the shoe where the laces are anchored. I still give this shoe 5 stars because they are very good construction and feel very well made, they are just a little too wide for my liking, but I’m keeping them to wear in cooler weather (It’s Florida so not that cold down here) as they will be much more comfortable with 2 pair or thicker socks. :)"
  },
  {
    "user": "James Williams",
    "rating": 4.0,
    "message": "Fit is perfect, even better proce"
  },
  {
    "user": "Elena Sherbanesco",
    "rating": 5.0,
    "message": "This are the shoes I go to among all other brands."
  },
  {
    "user": "Lisa Higgins",
    "rating": 5.0,
    "message": "Was nicely surprised as to how comfortable these sneakers are!!"
  },
  {
    "user": "Patricia Pallarino",
    "rating": 5.0,
    "message": "Lots of great comments on this shoe. A must have."
  },
  {
    "user": "TammyTrotts",
    "rating": 5.0,
    "message": "As soon as put the on my feet loved the did hot hurt breaking the it perfect"
  },
  {
    "user": "Bernadette Tucker",
    "rating": 5.0,
    "message": "These are such cute shoes. I love the color of them. They are comfy but do fit a little small."
  },
  {
    "user": "Daria Lee",
    "rating": 5.0,
    "message": "I own lots of shoes. To date, these are the most comfortable ever. They are like walking on pillows."
  },
  {
    "user": "West Coast Dreamer",
    "rating": 3.0,
    "message": "Not sure if a little pointy-er shoe or something else, but my (perfectly normal) big toes were pushing against the ceiling of the shoe to the point where I could literally \"see\" them - both rubbing and wearing incorrectly. Returned."
  },
  {
    "user": "Hannah",
    "rating": 4.0,
    "message": "It’s hard to find shoes, right now, that aren’t made of mesh, on the toe area. I can wear these shoes during and after rain, without getting my feet wet. They’re also easy to clean. The design is… interesting… but they’re worth it for the non-mesh material."
  },
  {
    "user": "Steven C.",
    "rating": 4.0,
    "message": "It is not used for sports but for walking. They look nice they are cut 1/2 smaller than you normally expect but look great with outfits for casual wear"
  },
  {
    "user": "Russell Watts",
    "rating": 5.0,
    "message": "Fits well! Very comfy! Thank you!"
  },
  {
    "user": "Kristen croxford",
    "rating": 4.0,
    "message": "Nice solid shoe, runs a bit small"
  },
  {
    "user": "Toya E",
    "rating": 4.0,
    "message": "I’m going to start with the CON.  This fishnet type material is not easy to clean when soiled.  So watch for this, I used simple green and a toothbrush since soap and water didn’t quite sink into the material threads and remove soil because of the tightness of the nylon threading.  PROS:  Lol first of all I’m a Puma fanatic!  I do not run at all.  I wear these as style as I do all of puma wear.  I work on my feet 10 hours a day and the cushions in this style of shoe for on the job work at amazon is GREAT!!! That’s a big plus for me!"
  },
  {
    "user": "Parrotfriend",
    "rating": 3.0,
    "message": "Puma shoes used to be ideal for medium to narrow feet. Now almost all models default to wide and thick feet. This shoe is cute, good looking and comfy - but only if you have wide and thick feet. It is true to size for 7.5 but the width is wide. All the new Puma models seem to be too wide nowadays."
  },
  {
    "user": "Joie Quijano",
    "rating": 4.0,
    "message": "beautiful shoes. love the design and colors."
  },
  {
    "user": "sminckler",
    "rating": 5.0,
    "message": "Don’t think about it, just buy them! These sneakers are literally like walking on a cloud, every step you feel the smoosh in the cushion and it is AMAZING! I’m on my feet at least 12hrs a day and the feet still feel great at the end of the day. Also I am a true to size 7 and they fit perfectly"
  },
  {
    "user": "FRANCISCO HERNANDEZ",
    "rating": 5.0,
    "message": "El interés mostrado en complacer al cliente entregan antes de lo esperado"
  },
  {
    "user": "Leta Rolfson",
    "rating": 5.0,
    "message": "I bought these back in 2020 and they started off nice. However over a few months I noticed the inside insert heel area was breaking down. I now suffer from heel pain. I say of you buy them just watch out for and maybe change out the insert"
  },
  {
    "user": "Kris",
    "rating": 4.0,
    "message": "I picked these shoes for 2 reasons : #1  My husband recommended Puma sneakers for being extremely comfortable, and they are. #2 The color is my absolute favorite anything in like a seagreen or turquoise I've got to have it. The shoes are very comfortable, lightweight, and adorable as far as looks. Although mine have started coming apart at the seams now granted I have to wear mine daily due to work but I also haven't had them 6 months yet. BUT if you're looking for cute, comfortable lightweight sneakers NOT for everyday work wear. These are great"
  },
  {
    "user": "Kay and Allen",
    "rating": 3.0,
    "message": "Love the color and I love Pumas. However with these shoes, the soles don’t last long. My feet end up hurting at the end of the day."
  },
  {
    "user": "Michael Rooney",
    "rating": 5.0,
    "message": "shoes are super comfortable"
  },
  {
    "user": "A",
    "rating": 5.0,
    "message": "Comfortable, fit well would recommend."
  },
  {
    "user": "Andrea",
    "rating": 4.0,
    "message": "They are comfortable. But I wear an 8 1/2 and they feel too big. I had already worn them or I would have returned them. So I have to wear thick ankle socks with them."
  },
  {
    "user": "Jennaya B Cook",
    "rating": 5.0,
    "message": "Super comfortable"
  },
  {
    "user": "UglyPony",
    "rating": 3.0,
    "message": "I ordered these in size 11 women and they were a little too big but they looked ugly on and not really that comfortable."
  },
  {
    "user": "JoA",
    "rating": 3.0,
    "message": "Just ok shoe. Black fabric is fantastic but I just don’t care for that blue ribbon on the side. Inside is soft but almost like plastic squishy sofa lol not a fan at all hence returned the item"
  },
  {
    "user": "Susan Gavagan",
    "rating": 5.0,
    "message": "Fit true to size"
  },
  {
    "user": "Hannah Tounsand",
    "rating": 5.0,
    "message": "Comfortable and supportive."
  },
  {
    "user": "Veronica E",
    "rating": 5.0,
    "message": "Son tennis cómodos, solo que como son de tela en la parte de arriba se pueden ver las puntas de los dedos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Light weight and good support for a lot of walking tours. Blended with most of outfits. Great price and look for a last minute purchase."
  },
  {
    "user": "MELLY",
    "rating": 3.0,
    "message": "The media could not be loaded. I bought these shoes for the gym. They work but I wouldn’t say the are the best gym shoes. My feet keeps sliding to the front wherever I’m working out or simply walking.  As long as there is a slope or something I have to keep pulling my foot to the back of the shoes. Not very comfortable. Also the front part of my foot keeps sliding to the side of the shoes causing the shoe to be lean or unbalanced.  I have to consciously try to keep my foot in the center of the shoe. I love the color and it’s cute with white socks. It’s OK!"
  },
  {
    "user": "christine clabaugh",
    "rating": 5.0,
    "message": "I love these they are super comfy and I know I have to order a half size smaller as I have had a bunch of Puma's before."
  },
  {
    "user": "JO",
    "rating": 3.0,
    "message": "Cute and just like the pic but they run big"
  },
  {
    "user": "Nr",
    "rating": 3.0,
    "message": "Para un regalo"
  },
  {
    "user": "lynn smith bellinger",
    "rating": 5.0,
    "message": "Perfect sneaker for me When my feet swell up the sneakers breathe with me Expand and then go back to normal when I need it"
  },
  {
    "user": "Maria Mindieta",
    "rating": 3.0,
    "message": "They look nice but they buckel at the toe are of my foot."
  },
  {
    "user": "D. W.",
    "rating": 5.0,
    "message": "Too small."
  },
  {
    "user": "RainySky",
    "rating": 3.0,
    "message": "Aquired taste. Maybe try, try before you buy!"
  },
  {
    "user": "Twiggy",
    "rating": 4.0,
    "message": "Great shoe, the size seemed a bit snug, but overall great"
  },
  {
    "user": "JR",
    "rating": 3.0,
    "message": "The toe box is too wide. Shoe marked as regular but for someone who has normal-wide ball of foot width these were too wide and made the shoe look a little sloppy and wrinkled the fabric when I pulled the laces tighter. Although it was roomier than most shoes and the comfort made up for the visuals."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are my first pair of Puma’s. I bought them for work based on the colors and style but I was concerned that they wouldn’t be comfortable or supportive. After a few hours working someone complemented my Puma’s and that’s when I realized how comfortable they were, I had forgotten I had a new pair of shoes on and they felt cushiony and supportive. I am a nurse who works 12 hour shifts and was impressed with these sneakers!!!"
  }
]