[
  {
    "user": "D. Elliott",
    "rating": 4.0,
    "message": "These are very nice shoes, but the 6.5 (my normal size) was a little too small and the 7 is slightly too big. I can wear them, but need thick socks.  Wish the fit was better."
  },
  {
    "user": "Russell Donald Hartley",
    "rating": 4.0,
    "message": "This is the 3rd time we bought these shoes perfect"
  },
  {
    "user": "Rebecca Bala",
    "rating": 5.0,
    "message": "Love so comfortable"
  },
  {
    "user": "Mike Burtt",
    "rating": 5.0,
    "message": "Fits as expected"
  },
  {
    "user": "Misty",
    "rating": 5.0,
    "message": "Best tennis shoes for comfort, support and they never break. I walk a lot and climb up and down heavy equipment all day every day. They don’t break down sole stay . Better than Nike and UA !!! Great shoe"
  },
  {
    "user": "Anton",
    "rating": 5.0,
    "message": "I recommend this to my friends"
  },
  {
    "user": "Lisa Stonerock",
    "rating": 5.0,
    "message": "Love them perfect fit and very comfy."
  },
  {
    "user": "Nelson Rubio",
    "rating": 5.0,
    "message": "Very sassy, smooth and light weight."
  },
  {
    "user": "AHM",
    "rating": 5.0,
    "message": "I love these shoes. Lots of wiggle room in the toe area and very comfortable for my wide foot."
  },
  {
    "user": "Lester",
    "rating": 5.0,
    "message": "My wife is an RN in an emergency room at a small hospital. She’s on her feet 12-16 hours a day. She loves these shoes. She will not use any other shoes."
  },
  {
    "user": "Amanda Cha",
    "rating": 5.0,
    "message": "Excellent, fantastic and fashionable."
  },
  {
    "user": "Debra J Sword",
    "rating": 4.0,
    "message": "These shoes are fantastic"
  },
  {
    "user": "tina s.",
    "rating": 5.0,
    "message": "I ordered a half size bigger than Normal because it was medium width and I take wide.  It was not true to size because it was almost too tight."
  },
  {
    "user": "Carmen Burchfield",
    "rating": 5.0,
    "message": "I love these shoes! This isn't the first pair that I've bought and I'm pretty sure, they won't be the last!!"
  },
  {
    "user": "Renee Ruthenberg",
    "rating": 3.0,
    "message": "Part of the bottom left shoe is falling apart since first day. The bottom is separating from the rest of the shoe."
  },
  {
    "user": "Michelle Pettis",
    "rating": 5.0,
    "message": "I like the gym shoe"
  },
  {
    "user": "Ann M Miller",
    "rating": 5.0,
    "message": "Liked the look of the sneakers, they fit well and seem comfortable after first use. Was happy to get them a bit cheaper, but could have used an even better sale price..."
  },
  {
    "user": "Edward McCartney",
    "rating": 4.0,
    "message": "Well made shoes memory foam leaves quickly and kinda heavy. Good winter time shoe as it’s a little warmer."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love my new tennies"
  },
  {
    "user": "kel leh",
    "rating": 5.0,
    "message": "Good for"
  },
  {
    "user": "Kelly",
    "rating": 5.0,
    "message": "Fits perfectly! Beautiful shoes!"
  },
  {
    "user": "Marla Woolley Johnson",
    "rating": 5.0,
    "message": "K Swiss are my favorite Tennis Shoes and these are perfect.  They are very comfortable and are cute.  I'm going to buy another pair but different color scheme.  Also they're made extremely good."
  },
  {
    "user": "Steve M.",
    "rating": 3.0,
    "message": "After first time used bottom sole came apart"
  },
  {
    "user": "dorine emery",
    "rating": 4.0,
    "message": "Why do they stop makiing great shoes?  I've been buying kswiss for years because they were the absolute best.  Super comfort and support.  But they change them so that now they are only very good shoes.  I expect they will conform to my foot in time (stretch) because they feel tighter than they normally do.  They are still better than any other kind.  Unlike Sketchers, these KSwiss hug my foot for great support.  But similar to Sketchers, these KSwiss have areas that rub, like on my left big toe.  Heavier socks would help but these are too tight now for heavier socks than thin cotton summer weight.  I've all along bought size 7, so that's what i ordered.  That's what i got.  No problem, but these are not as comfortable as the size 7's i used to get.  They felt smooth inside all over, these don't.  The style is a little different, look more like Sketchers too.  I really prefer the old ones.  I still have 2 pair of them, they have conformed too well with my feet, plus i've worn them geocaching and hiking, so it was time for new ones.  But i couldn't find my kind in the stores.  I panicked and bought Sketchers but were quite unhappy with them.  So glad to have found KSwiss on Amazon even tho they are not super like the older ones, they are still very very good and i recommend them.  I tried every other kind on that were available in a well stocked sneaker store.  Believe me, KSwiss are still the best.  They've held up surprisingly well.  Plus i like the gripper soles for walking all sorts of trails, this is really an important feature which many sneakers do not have.  KSwiss are still the best."
  },
  {
    "user": "kim shanley",
    "rating": 5.0,
    "message": "Always by this particular shoe for many many years hard to find in the stores now but I'm on my feet all day and the shoe is great for that"
  },
  {
    "user": "Juan Villarreal",
    "rating": 5.0,
    "message": "I bought for my daughter  she loved them"
  },
  {
    "user": "Claudia",
    "rating": 5.0,
    "message": "I just used them switching the laces on them and I thought I would write a review after two years of using these pupppies. First I would like two say I have washed these 5 times already and they still look pretty good. ( I highly recommend a shoe dryer, I made a review on the one I bought and love it). Second, the support is incredible! I walk on concrete all day and my feet don't hurt when I wear them. I sometimes forget how beautiful it feels to move around when I wear them. I can tell a huge difference. Third, I like the look.. Last, the price. I highly recommend them. P.S. I bought a pair of black ones as well and same thing with those."
  },
  {
    "user": "Julie 💕",
    "rating": 5.0,
    "message": "These are very comfy, and I’m glad I got them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I've used K-Swiss for years; their quality remains consistent. I particularly like the strong arch support and the great traction. Good value - lasts a long time."
  },
  {
    "user": "Susie",
    "rating": 5.0,
    "message": "The pictures above are the same exact style as the white kswiss I am reveiwing except they are the grey version. This is a good shoe for casual wear but I've been wearing them for pickleball too.  The quick stops and starts, the quick change of direction, have not been kind to the inside back of the shoe.  For the price, this shoe does NOT stand up well to wear and tear though I know this is not a pickleball shoe.  I end up with a perfectly good outer shoe with holes worn in that area. I don't know what kswiss is doing differently....I would pay a sale price for these shoes but not full price."
  },
  {
    "user": "Jami Nelson",
    "rating": 4.0,
    "message": "I was looking for a new pair of shoes for work and I am on my feet all day. I needed a shoe that was comfortable but also needed to be lightweight and not bulky. For me they are awesome! My only issues are what looks to be seam malfunctions. On the tongue instead of being flat against my foot, the seams are pressed against my foot on the edges of the seam and cause deep indents in my skin and have started to make my foot go numb. Also, there is a bubble that has formed on the inside of my right shoe by my big toe where the two parts come together and it is uncomfortable but something I can deal with. Along with the seam issue. It is better now but I sometimes still have to maneuver the seams around. But all in all very comfortable shoes to wear. Minor issues with how durable and comfortable they are. They also seem to be waterproof. I haven't walked into water with them but no water has ever touched my socks no matter how wet I get them! However, not slick resistant much! AND these are very very stiff when first recieved!! Very hard to break in and it hurts beware!!"
  },
  {
    "user": "Annie",
    "rating": 5.0,
    "message": "Last summer, when I came back to tennis after years off, I tried four pairs of shoes before I settled on these--two other pairs of k. swiss and a nike. Everything was okay at first, but not perfect. Really good support for lateral movement and the cushioning makes it easy to stay light on your feet (sometimes it has the opposite effect and you sort of sink in). I'm ordering a second pair a half size down because they do stretch over time and I like them on the snug side. (I've been wearing my last pair for a year and in the summer I played tennis almost daily--a few times a week once we moved indoors--and these have lasted well). I will probably need to break them in around the house a bit before playing in them."
  },
  {
    "user": "george pauley",
    "rating": 2.0,
    "message": "Love them but they started to tire apart after wear them 9 times, gave away to heldss person. Disapp6"
  },
  {
    "user": "Tina Navarro Malone",
    "rating": 5.0,
    "message": "I love their customer service my package was left at my door when I got home my package was gone I contacted Amazon they replaced my order with no problems at all they were kind their concern was for me the customer and that I was happy I love the shoes they're worth the price I buy a pair of these shoes every year thank you Amazon for your awesome customer service and your product and you're reasonable prices good job this is the cheapest place you can find these expensive shoes at Amazon for under $50 imazing"
  },
  {
    "user": "Stefanie",
    "rating": 5.0,
    "message": "I love these shoes and still do. They’re very comfortable. I was just disappointed when the seam cracked after only having them a few months."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Have been wearing about 4 to 5 times a week for tennis for the last several months. Looks like I have several more months of tread left. Nice and wide even with a bunion. 😬"
  },
  {
    "user": "robin",
    "rating": 4.0,
    "message": "Love these shoes they are super comfortable. They are a little big but not sure if I ordered a half size smaller if they'd still fit. But the width is great and they have the memory foam so the are the best to stand in for over 8 hours a day."
  },
  {
    "user": "Agnes Savenok",
    "rating": 3.0,
    "message": "I’ve had these for a few months and already the sides are coming unglued. If you live in a warmer climate and play tennis in the heat, consider a different shoe."
  },
  {
    "user": "Stepfanie H",
    "rating": 5.0,
    "message": "I ordered the wrong size but they are so nice if I had the right size it would of fit.. so I returned them and then ordered the right size..I bought my son a pair and he loves them!! He says they are so soft on his feet. They are true to size and comfortable to walk in.. he says out of all the shoes I've bought him these are his favorite and wants more so I'll be looking in different colors and styles"
  },
  {
    "user": "Chris Allison",
    "rating": 5.0,
    "message": "FINALLY!  After months of searching we found \"the shoe\" our daughter likes.  Difficult finding it in stores.  Finally gave into an online purchase. Her shoe of choice and Amazon had it.  Took a chance and didn't go to a wide. Shes comfortable, and most of all happy."
  },
  {
    "user": "Tamra Gregory",
    "rating": 5.0,
    "message": "I love these shoes. They fit great, feel amazing on my feet and are super cute."
  },
  {
    "user": "Dawn B",
    "rating": 3.0,
    "message": "I wanted to love these so bad because they are super cute. I had a pair of k-Swiss years back and they were the most comfortable pair of sneakers I’ve ever had. Unfortunately, these don’t even come close. Although these feel lightweight, they feel bulky on and hot. They fit true to size but are not comfortable. I tried to break them in indoors but now I’m trying to sell them because my window for return is up. Cute but disappointed."
  },
  {
    "user": "Mary Finlay",
    "rating": 4.0,
    "message": "Perfect for 12 hour shift’s on my feet"
  },
  {
    "user": "Paul Lundstrom",
    "rating": 4.0,
    "message": "Only issue is laced loosen so easily. Needed to replace right away. Otherwise, love these shoes for all day at work!"
  },
  {
    "user": "Henrietta L. Thies",
    "rating": 5.0,
    "message": "This is my second pair of KSWISS brand athletic shoe. The first pair I purchased because I needed a shoe that would support my ankles and feet for long periods of standing as a gas station clerk. I purchased this pair as a back up to the old pair. Still the same comfort and look. Love this brand and quality."
  },
  {
    "user": "Dee",
    "rating": 5.0,
    "message": "I brought these for my mom not realizing I needed to buy a 9 wide so I was able to keep for myself. They fit comfortably."
  },
  {
    "user": "Sandee Candiff",
    "rating": 5.0,
    "message": "I have trouble with my hip if I don't wear good supportive shoes.  These shoes always seem to do the trick.  When I  wear these shoes my hip problem  goes away."
  },
  {
    "user": "resa may",
    "rating": 5.0,
    "message": "I love the comfort and memory foam. I have a high arch and need the support. I also have plantar fasciitis and need extra support.  These shoes provide the support to keep my feet from hurting.  I purchase at least 2 a year and spray water proof to help make them last.  I love the colors and comfort. These are the best tennis shoes and carry large sizes too"
  },
  {
    "user": "Diane  A King",
    "rating": 5.0,
    "message": "I really like the fit, quality and durability of my K Swiss'  They fit great and comfortable.  This is the excact pair I had purchased before. They laste a long time with everyday use. The shipping was only 2 days later than expected but was worth the wait. Very happy about my purchase. Would highly recommend the product purchase through Amazon."
  },
  {
    "user": "Michael Hensley",
    "rating": 5.0,
    "message": "My picture shows a brand new shoe and a shoe after 1 year of use as a full time ER nurse. I walk miles and miles in these shoes and these are the only ones that don't hurt my feet and my feet don't ache after a 12 hr shift. They are sturdy and easy to clean. I go through 1 pair per year."
  },
  {
    "user": "Elma",
    "rating": 5.0,
    "message": "I was a little hesitant to buy these because im a guy and wasnt sure On the size but took the chance because the same style for guys is $10 more and we all like to save $ so with a bit of google search for sizing bought then and no regrets as comfy as any kswiss ive bought in the last 15 years and the pink on them isnt no big deal, and quality is to early to tell but seems to be just as good as my lst pair which i bought these to replace after 2 years"
  },
  {
    "user": "Earl",
    "rating": 4.0,
    "message": "Have purchased this shoe for several years for my daughter who plays junior tennis, 5-7 days a week.  One pair lasts her about 3 months.  Reason why we've stayed with them, they fit well, have memory insert & leather.  She goes thru the toe in no time, can't wear a mesh shoe.  We've tried different colors too in this same shoe, so this type it what the black w/ purple trim, very pretty.  However after 2 days of practice the bottom sole is coming off.  In comparing w/ her the pair purchased before these, they have a different sole.  The manufacturer has changed the sole, so if you're looking for a court shoe, this isn't it. The shoe sole won't slide on the indoor court surfaces."
  },
  {
    "user": "David Bixler",
    "rating": 3.0,
    "message": "I am a Medical Assistant, so I am on my feet a lot. The tred is coming off and it tripped me. I almost fell. I have only worn these shoes for work and only for about a month. Very diaapointed."
  },
  {
    "user": "Bege",
    "rating": 5.0,
    "message": "Worn these tennis shoes over 40 years. The fit is great, consistent, and the look classic fantastic."
  },
  {
    "user": "Sandra Braden",
    "rating": 5.0,
    "message": "Love these shoes second Pair must haves in my opinion they hold up great I work in the medical field and they are easy to clean when needed too!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "We love these shoes! They are the most comfortable sneaker style shoes we have ever owned! I have health problems that make walking difficult, let alone walking long distances such as at theme parks, but with these shoes I can walk all day & night! They have a very comfortable inserts (like memory foam) plus these shoes are lightweight which basically feels like I have nothing on my feet. They have a great supportive insole which works well for my extremely arched feet but also works well for my daughters very flat feet too. The quality it fantastic, in fact I bought these because my first pair finally retired after 10 years! My daughter has had her first pair for over 8 years and they are still holding up wonderfully. These are the only sneakers we will buy!"
  },
  {
    "user": "MS. BOSSY",
    "rating": 5.0,
    "message": "I absolutely love my k-swiss shoes, I am shocked that I order another pair threw Amazon and they both are perfect !!!! I love the arch the best , it's just right🤐"
  },
  {
    "user": "Lynnette",
    "rating": 5.0,
    "message": "I've been wearing K-Swiss for about 20 years. These did not disappoint. It's hard for me to buy shoes w/out trying on so took 3 orders but finally got it right. Retuns were no problem"
  },
  {
    "user": "Cinnur11",
    "rating": 5.0,
    "message": "I don't usually write reviews but I decided to based on how pleasantly surprised I was about these shoes. I am a nurse and finding nurses shoes is a pain in the ass. You need something that is comfy and supportive. I normally wear a wide width shoe and when I first put them on they were a little tight but I knew they would stretch. They felt very supportive and sturdy. A lot of shoes feel hard with bad arch support but these were great and I am flat footed. I feel very comfortable being on my feet all day. No blisters or working the shoe in. I was shocked. I just expected  the annoying discomfort with new shoes. This is my first time using this brand but it won't be my last. There is a good reason why there are positive reviews. Hopefully, you will have the same experience with these shoes. Buy them now! What are you waiting for? ;-)"
  },
  {
    "user": "Jeremiah Knight",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "rredbird",
    "rating": 4.0,
    "message": "Comfortable"
  },
  {
    "user": "ct",
    "rating": 5.0,
    "message": "Love these"
  },
  {
    "user": "Teresa Scofield",
    "rating": 5.0,
    "message": "I don't just like these shoes,  I love these shoes! My feet were hurting before and I'm on my feet a lot! On hard floors. Now it's like I'm walking on cloud!"
  },
  {
    "user": "Tracy Rusch",
    "rating": 5.0,
    "message": "Work on my feet all day. Very comfortable shoes. I immediately bought a second pair."
  },
  {
    "user": "Deborah Ackley",
    "rating": 4.0,
    "message": "I am a professional house cleaner, and am on my feet all day. I finally found this brand, and style of sneaker that has a high arch and are comfortable. The cushioning lasts for almost a whole year, but.... the one thing that keeps this sneaker from being 5 stars is they are slippery on wet floors. Because I clean in tiled and linoleum rooms (bathroom and kitchen) I have to be extra cautious if water gets onto those floors. I have slipped several times due to this problem. They are not a non-slip sneaker, and wouldn't purchase them again, except that they are the only brand and style that has the high arch cushion that I have been able to find."
  },
  {
    "user": "Amy W.",
    "rating": 4.0,
    "message": "Great quality shoe.  Since all leather-like, they are on the heavy side, which is what I wanted.  I put \"couple hours\" because I am still getting used to them, and since they don't breathe, I doubt I would wear them all day, but good for outdoors.  The smaller lace to lace width makes it easy to change how tight or loose they are.  I like a wider shoe, and these work for me.  This is a good all around shoe.  Good support and traction.  I play tennis in them.  Not as good as a walking shoe....you'd want a bendier shoe for walking.  But, the padding makes them extra comfy."
  },
  {
    "user": "Heidi",
    "rating": 4.0,
    "message": "Really like the shoes they fit like a glove thank you very much will be ordering more"
  },
  {
    "user": "AB",
    "rating": 5.0,
    "message": "Hello the shoes worked out perfectly.  They were a gift.  She really liked them even tho they were not her first color of choice.  She was very glad I picked those out, she liked them better.  So every thing worked out perfectly as I said before."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Love them! I am a shoe person I have many pairs and these are my favorite. Extremely comfortable and that is important considering I broke a bone in my foot years ago and most will hurt at some point."
  },
  {
    "user": "Tara Cervantes",
    "rating": 5.0,
    "message": "Love these shoes! Got them faster than I thought too!"
  },
  {
    "user": "Jean M",
    "rating": 5.0,
    "message": "Constructed well,this is second pair they have been consistant in fit and quality. Supportive, after removing insoles they have plenty of room for my custom foot orthotics. I work in medical field and am on my feet all day, I have many shoes but these are my go to shoes for comfort at work."
  },
  {
    "user": "Janelle Charlet",
    "rating": 4.0,
    "message": "Was a little tighter then I like but should be fine when I get them broke in. Love K-Swiss Footware just wish they had more choices of walking shoes with good arch support. Even though I said somewhat small the length is good they just feel like they are not high enough up on my foot so my foot slides up and down in them until I get them broke in would be great if they fit better when I first get them. Had one pair of K-Swiss years ago that felt great from the moment I first put them on had 2 pair just alike."
  },
  {
    "user": "Roxanne Sutton",
    "rating": 5.0,
    "message": "The width and arch are perfect!! Extremely happy with my choice!"
  },
  {
    "user": "Superduper",
    "rating": 3.0,
    "message": "I regret so much for buying this shoes. It’s ok to use for a little time, or couple hours since you dont have to have a lot. No arch support- at all! I tried using on a 6-hour shift, standing most of the time and all I can remember from that day is the pain I felt on my feet, legs and back. I felt worse than a 12-hour shift when wearing better shoes. So, if you need to stand or walk for long periods os time, find something else."
  },
  {
    "user": "Mary Gardill",
    "rating": 2.0,
    "message": "If you are buying these hoping for the classic KSwiss quality, forget it.  These are just wannabees.  There is negligible arch support, however, these succeed in bottom cushion.  The back of the sneaker is high u shape and cut into my ankle at the two high points.  After I have worn them it is hard to return, but I’ll keep them for workouts with the TRX that require no lateral motion or walking."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These were even better in person! I was afraid they would be too heavy but they aren't at all! I'm so pleased with this purchase!"
  },
  {
    "user": "Elena G.",
    "rating": 5.0,
    "message": "I’m on my feet all day and these shoes are very comfortable."
  },
  {
    "user": "Annette",
    "rating": 5.0,
    "message": "I have been buying these shoes for years. I love them! They have a very clean look and last a very long time. These run about 1/2 size bigger compared to Skechers and other brand names. I have about 30 different shoes of all brands. These shoes are very comfy the 1st time wearing them from the memory foam soles inside. I'm kind of bummed about how much room I have and this is my first time to wear them. I know that shoes tend to loosen up the more you wear them. I would definitely recommend these shoes to anyone who is looking for comfort and a clean looking shoe! I will be back to buy more when these need to be replaced!"
  },
  {
    "user": "Tresa Neece",
    "rating": 5.0,
    "message": "great shoe.  Fit great. Got what I paid for.  Was on my feet a lot.  And my other brand name shoes  were making my feet hurt.  These are get support"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Years ago I had a pair of K-Swiss shoes and loved them. I finally ordered another pair and I'm, falling in love with them again! I am on my feet for 8-9hrs while working and my feet have never been sore since getting these shoes. I think there is a little break in period with these but not from walking on them. Since they are leather, they are a more firm material. The top of my last two toes hurt a little but after about a week I feel no pain. I love that there was virtually no break in period and I can wear them for so long and so often without sore feet."
  },
  {
    "user": "Tam",
    "rating": 5.0,
    "message": "I have been wearing this shoe over 20 years as a nurse! I have a crazy old injury to my foot and this is the support and stability I need ."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I stand for the majority of my day and the support is excellent.  They are a little narrow,  probably should have gotten a wide. Overall great looking sneakers and I loosened the laces to give myself a bit more room. I'm sure once the are.broken in, they will be perfect"
  },
  {
    "user": "Theresa Allred",
    "rating": 5.0,
    "message": "Kswiss seems to be the only shoe that meets my expectations and are a true fit and comfortable."
  },
  {
    "user": "Autumn Renee",
    "rating": 4.0,
    "message": "These shoes are comfortable with memory foam insoles and high arches. They are like a pillow on your feet. Nice and sturdy soles. Easy to keep clean. I sprayed with some waterproof spray to keep them clean and shiny."
  },
  {
    "user": "Lisa Walker",
    "rating": 5.0,
    "message": "I have not worned the shoes just let but after trying on I was more pleased. I got a 1/2 size larger because often Kswiss run a bit smaller."
  },
  {
    "user": "The LovelyLabLady",
    "rating": 5.0,
    "message": "These are my favorite work shoes! I have bought afew pair over the last several years. They are perfect for working in a medical lab- leather and great arch support."
  },
  {
    "user": "Tina Vergin",
    "rating": 5.0,
    "message": "Everything"
  },
  {
    "user": "Sarah Wengerd",
    "rating": 5.0,
    "message": "Great pair of shoes! However they run small. I normally wear 10-10.5 medium. Needed to get an 11w in these. Otherwise a great shoe if you’re on your feet a lot especially on concrete or tile. Great support and comfort!"
  },
  {
    "user": "Nancey Hoday",
    "rating": 5.0,
    "message": "I have worn the K-Swiss shoe (same color and style) for many years after Nike stopped making my favorite shoe (and their lack of Patriotism lost my financial support). I'm the typical 7.5 m and these shoes need no breaking in for me. I do, however, add an insole to better support my flat feet. Would, have and will buy again."
  },
  {
    "user": "Glenn",
    "rating": 5.0,
    "message": "The media could not be loaded. Very comfortable. love these shoes and will buy again. Fit perfectly,  arch support is great, sole of shoe is nice and thick."
  },
  {
    "user": "Kayla",
    "rating": 5.0,
    "message": "Love them. Comfy. Cute, and fit great i went up a halfa size cuz i wasnt sure how theyr shoes fit an theyr a tiny bit big but theyll be perfect. Lol"
  },
  {
    "user": "Sandra J Leon",
    "rating": 5.0,
    "message": "Love the shoes."
  },
  {
    "user": "A Jaeh",
    "rating": 5.0,
    "message": "Purchased this pair for my wife to match the pair purchased for my 9yo.  Both are happy, no complaints about sore feet.  Treated both with protect, child's pair is about 2 months old, scuffs rub off and clean up nicely."
  },
  {
    "user": "mcslc",
    "rating": 5.0,
    "message": "I have terrible feet. Tons of issues and it has been so hard to find shoes that fit comfortably. Got them yesterday and have been wearing them all day. No pain. So happy with them. Good support and wonderful construction plus look.  Me students love them and gave me compliments. Tempted to get more. Why I just found these shoes now?"
  },
  {
    "user": "James R Ivey",
    "rating": 5.0,
    "message": "I’m on my feet for 10 hours a day for work. I have tried work shoes from walking company that to me were uncomfortable. I’ve tried Nikes which for me it was too narrow not that I have wide feet. I’ve tried sketchers still didn’t work for me. K-Swiss is the only shoes that I can be on my feet for 10 hours without hurting and comfortable."
  },
  {
    "user": "Savannah Shipley",
    "rating": 3.0,
    "message": "The shoe is alright for short periods of time but if you work on your feet long hours I suggest getting something else. The top of the shoe were the laces center above your toes is extremely un comfortable an when you squat down or bend your toes in that area if really hutrs."
  },
  {
    "user": "vivid imagination",
    "rating": 5.0,
    "message": "2 years old and still feel gr8! Absolutely love these shoes... They fit perfect....went to rally stood for 6hrs... and my feet never hurt (that's unusual) and again I've had these shoes for 2yrs.  Getting another pair in blk when available :("
  },
  {
    "user": "Brandy Davis",
    "rating": 5.0,
    "message": "I really liked the shoes and they came quickly and as expected but I do have pretty wide feet and they were just really tight on the top of my arch and around the ball of my foot. Great product otherwise."
  },
  {
    "user": "Marilyn",
    "rating": 5.0,
    "message": "I love these shoes. They are so comfortable. This is my second pair. It's hard to find shoes for me. These fit perfect."
  },
  {
    "user": "penny Hamilton",
    "rating": 5.0,
    "message": "I love this show, it fits great and look great."
  }
]