[
  {
    "user": "M. Mirarchi",
    "rating": 5.0,
    "message": "I'm a big fan of Sperry shoes.  The fit is consistent, from sneakers to top-siders to duck boots.  A big plus when you buy shoes online. These Sperry camo sneakers are green and brown with a bit of gold bling.  They look great with casual pants/jeans.  I've worn them everywhere and they stay looking clean."
  },
  {
    "user": "LWP",
    "rating": 4.0,
    "message": "I bought these when Keds stopped making my favorite casual sneakers, when they were on a lightning deal. I wanted shoes to wear without socks in the spring and summer. Compared to the Keds, these are heavier and don't breathe as well. The sides of the tongue want to fold under, so I have to be aware of that when I put them on. I think I will be okay wearing these over the fall and winter with socks but I will find a better replacement for my Keds Sandy."
  },
  {
    "user": "Tara",
    "rating": 4.0,
    "message": "I was looking for a stylish and comfortable shoe that would go with anything (dresses, shorts, pants) for a trip to New York City. I had to upsize to a 9W. My shoe size ranges from 8.5 to 9 in most shoes.  I still had some trouble getting them on even sizing up, but once I did they were comfortable. The laces are not real functional and I couldn't loosen them without unknotting them.  For everyday walking around, these are probably good enough.  But I expected more. They appear to have a thick sole, but feel just like any other flat shoe I have. I was hoping for something closer to a tennis shoe. I ended up switching to my Tom's for most of the trip.  For the cost, I'll stick with Tom's for my casual shoes."
  },
  {
    "user": "Jen C.",
    "rating": 4.0,
    "message": "I like these because they look a little more polished than average tennis shoes. I had some issues with rubbing irritation on the back of my foot I think because they were comfortably loose."
  },
  {
    "user": "beachgirl",
    "rating": 5.0,
    "message": "This is the second pair I have purchased. The width of the shoe is just right. It is not too tight at all.  Comfortable, casual, and cute.  I wear when I’m going shopping and my feet are not sore even after a few hours. I purchased navy since my cream colored got dirty easier and navy doesn’t show dirt."
  },
  {
    "user": "D B",
    "rating": 5.0,
    "message": "I like thatvit fit me well. And it arrived agead of schedule - talking of fast delivery."
  },
  {
    "user": "Anne",
    "rating": 5.0,
    "message": "Love the look, color and fit of this shoe!"
  },
  {
    "user": "Raven",
    "rating": 5.0,
    "message": "I've worn them twice so they have a few specks of this & that but they are good quality."
  },
  {
    "user": "Mary Jane De Ramos",
    "rating": 5.0,
    "message": "Always love Sperry! Thank you always. 💙"
  },
  {
    "user": "Lai Yee Chun",
    "rating": 5.0,
    "message": "I like everything about this pair of shoes. Good quality canvas, beautifully made, and love the beige colour. I'm considering buying a second pair of a different colour!"
  },
  {
    "user": "Elle",
    "rating": 4.0,
    "message": "Pretty, well priced but not very comfortable. I always have to wear socks to wear those otherwise they really rub against my feet. Also the laces are quite short. It seems like Sperry is trying to save money on laces and it’s annoying. It’s my second pair where the laces are really short."
  },
  {
    "user": "MoMo",
    "rating": 5.0,
    "message": "I love these so much I have 8 pairs in different colors. The navy blue tend to fade to a grey-blue."
  },
  {
    "user": "Claudia Foy",
    "rating": 5.0,
    "message": "My favorite so I ordered two more pairs"
  },
  {
    "user": "Chabely Romero Isa",
    "rating": 4.0,
    "message": "Tal cual la imagen, son hermosos, muy cómodos"
  },
  {
    "user": "Debra L Davis",
    "rating": 5.0,
    "message": "Love these shoes!"
  },
  {
    "user": "Charles Kosciuk",
    "rating": 5.0,
    "message": "The shoes are so nice. Fits great and definitely a great price."
  },
  {
    "user": "Kim Berry",
    "rating": 5.0,
    "message": "I really was happy with the way they look. Very sporty and comfortable. I have neuropathy so I must have a comfortable shoe. I have a size 9 wide and they feel great. True to size. I recommend them for looks and fit."
  },
  {
    "user": "Kassor Wagner",
    "rating": 4.0,
    "message": "I absolutely LOVE Sperry's because of the style, fit, and comfortability. I purchased these with another color which both shoes I love. However, everytime I wear them I get a rash on the top of my feet where the tung rubs against my skin. I realize it must be the material that the shoes are made from, due to everytime I put them on and wear them longer than a few hours. I don't want to return them because I absolutely love them. So, I have to figure out a way to wear them without getting a rash... until then it's on my shoe wrack where I can admire them 😬😐"
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "Bought these to replace a previous pair. They sip on easily and fit well. Really comfortable. They are a great boat shoe - good grip, non-marketing - while also being a cute shoe for casual outfits."
  },
  {
    "user": "sunsplash",
    "rating": 4.0,
    "message": "The size is just right except for the width. I ordered a wide and they fit like a regular.  While the length was fine, I probably could go up a 1/2 size and have the fit be more comfortable.  They also slip off the back of my heel which is odd considering the rest of the fit.  I'm going to try and break them in in hopes of them stretching a bit as well as trying them with socks."
  },
  {
    "user": "Ashley Spangler",
    "rating": 5.0,
    "message": "These fit as expected and are very cute! Comfortable enough to wear all day, and they go well with many of my outfits."
  },
  {
    "user": "Victoria Malloy",
    "rating": 5.0,
    "message": "A great walking show. Stylish and super comfy and slips right on"
  },
  {
    "user": "Lisa Davis",
    "rating": 5.0,
    "message": "Ordered my normal size in W.  Super cute and comfortable.  TTS"
  },
  {
    "user": "Betty Lee",
    "rating": 5.0,
    "message": "Got it for a deal “used”. Looked brand new in original packaging"
  },
  {
    "user": "V",
    "rating": 5.0,
    "message": "I have bought two pairs over the years and am so in love with how comfortable and durable these shoes are. They're the perfect summer shoe! They can take just a little bit to break in but after a few wears they are perfect."
  },
  {
    "user": "Lynne Catoggio",
    "rating": 5.0,
    "message": "Received my order a few days earlier than expected which is always great!  Shoes are comfortable and well worth the price.  Sperry is always a great choice."
  },
  {
    "user": "Robbie Pope",
    "rating": 5.0,
    "message": "I have a narrow heel and average width across the toes. The elastic bands goes across the top arch and my heels do not slip in and out. They clean up easily in the washer. I set them in front of the window to dry which is about 2 days. Leave the leather shoestrings when washing."
  },
  {
    "user": "Amy R",
    "rating": 5.0,
    "message": "I was very leary about buying these shoes because I have always been a fan of converse. Soo glad I did because they ate so cute and comfortable. Went shopping all day in them and my feet did not hurt and I have high arches! I think I may need these in a different color!"
  },
  {
    "user": "SFB",
    "rating": 4.0,
    "message": "I like the slip on aspect. It is a little stiff to walk in - but it may break in over time. It is stylish and seems well made."
  },
  {
    "user": "Osbrofan",
    "rating": 4.0,
    "message": "The style and color are great. Ordered 7.5 W and these were quite narrow. Bought a shoe stretcher and stretching solution and widened them, and I can wear them, but they are not really comfortable for wearing all day.  I love the style, but disappointed in the fit."
  },
  {
    "user": "West Coast Nomad",
    "rating": 5.0,
    "message": "LOVE these shoes. I'm shocked that they don't make my feet look big and they're comfortable from the moment I slip them on. I'm buying yet another pair as I want them in a variety of colors."
  },
  {
    "user": "Nicole Jennings",
    "rating": 4.0,
    "message": "I love the way they look. They were a bit stiff when I pulled them out of the box but they have relaxed quickly. I usually wear my Sperry's with no socks and I had to wear these a few times with socks before I felt comfortable enough to go sockless. I also had to put inserts in them to get a bit of an arch and some cushion as there is none. Very flat so if you are using them on a day where you have to walk a lot then they might start to hurt your feet. This is the only reason I gave it 4 stars instead of 5."
  },
  {
    "user": "Kathy N",
    "rating": 4.0,
    "message": "Love the color & fit! I do wish it had more arch support, but it’s hard to find shoes that do anyway. I can fit my orthotics inside of these & be comfortable all day."
  },
  {
    "user": "Jessica MacNeill",
    "rating": 4.0,
    "message": "Overall it is not a very comfortable shoe."
  },
  {
    "user": "Marguerite Yeomans",
    "rating": 4.0,
    "message": "I like the shoe and I can wear them, a little hard to get foot in"
  },
  {
    "user": "Amazon Customer bmj",
    "rating": 5.0,
    "message": "I bought these for working on a vintage train. They are comfortable and give support."
  },
  {
    "user": "Oscar Rene Gomez Reyes",
    "rating": 5.0,
    "message": "Excelente calidad mi novia quedo encantada con su regalo"
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "I love this style of Sperry sneakers that I have 15 pair ,doubles on some because I like to have my sneakers look  new. Been buying these for years now. They fit as they suppose to, comfortable . I always buy 3 different colors to take on vacation to walk universal etc feet don’t hurt at the end of the day."
  },
  {
    "user": "marianne fenton",
    "rating": 4.0,
    "message": "like them but look different from pic."
  },
  {
    "user": "april alonzo",
    "rating": 4.0,
    "message": "They’re good just to match with a nice outfit but not that comfortable"
  },
  {
    "user": "Lois Fortin",
    "rating": 3.0,
    "message": "I waited several weeks for these sneakers to be in stock. I actually ordered the gray and the black received the gray wore them for one day at work. Very disappointed in the comfort very heavy feeling sneaker. I did love the look I came home and canceled the black pair so for short duration couple hours not a lot of walking they will work and also have that classic Sperry Style."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I got these on Amazon Prime day. I feel like they are the perfect shoes to tie together an outfit. Super classy!"
  },
  {
    "user": "Robin Painter",
    "rating": 5.0,
    "message": "I have issues with my left foot after a surgery but these are comfortable and simple. Will be purchasing more."
  },
  {
    "user": "P. Hoag",
    "rating": 5.0,
    "message": "Well made like all Sperry shoes.  Do not come up short in the toe.  They are made to slip into.  I have unrolled the leather ties to give more room for putting the shoe on. Fits well with low sock.  Tie could be cut shorter and knotted to suit for slip on.  Tongue is stabilized by elastic to keep it in place."
  },
  {
    "user": "TJ Watson",
    "rating": 5.0,
    "message": "The shoes are great and fit as expected"
  },
  {
    "user": "Duke",
    "rating": 5.0,
    "message": "Wife wanted these shoes in this color for awhile.  She looked everywhere - no luck.  One evening, over dinner, she mentioned her frustration to me.  Five minutes later they were ordered from Amazon.  Four days later she had the size and color she wanted after searching for weeks."
  },
  {
    "user": "Jamee Haines",
    "rating": 5.0,
    "message": "I found them to run a little bit small.  I love the color and quality of these shoes!"
  },
  {
    "user": "fan in DC",
    "rating": 5.0,
    "message": "I have always loved Sperry shoes and these did not disappoint.  I wanted a quality pair of white sneakers that I could  wear walking, out to lunch, and shopping.  I love these as they are classic and will last a long time."
  },
  {
    "user": "L. Pet.",
    "rating": 3.0,
    "message": "This shoe is comfortable for sitting in a desk .  It is not for walking any distance.  No arch support.  Not adjustable.  Lots of compliments on the style"
  },
  {
    "user": "jk",
    "rating": 4.0,
    "message": "Love the style and color of this shoe. Fits comfortably. Could use a little more arch support."
  },
  {
    "user": "Teresa Bishop",
    "rating": 5.0,
    "message": "Very nice and comfortable"
  },
  {
    "user": "Susan Campbell",
    "rating": 4.0,
    "message": "The linen/canvas is a yellowish white. I needed to have sized up 1/2 size."
  },
  {
    "user": "P. Sidlo",
    "rating": 4.0,
    "message": "Fits pretty well, they need to be broken in, stiffer than others that I have bought"
  },
  {
    "user": "Brandi B",
    "rating": 5.0,
    "message": "This is my 3rd pair of this style they go with so many things are comfortable and just to darn cute."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I have several Sperry sneakers but this is the only one that has partial rubber soles. The rest of the sole has a fabric like material. Just wanted to put this put there!"
  },
  {
    "user": "Tammy LaCoursiere",
    "rating": 4.0,
    "message": "I have a difficult time finding shoes that fit. I generally wear a 6.5 wide. For these I’ll order a second pair in size 7. The width is perfect but my toes are nearly touching the end and the arch feels off. Overall I’m happy with my purchase and will be ordering another pair soon!"
  },
  {
    "user": "MARSHA ROACH",
    "rating": 4.0,
    "message": "They aren’t true to size as the other pair I already had . They run at least a half size bigger then your normal  shoe size."
  },
  {
    "user": "Rosey",
    "rating": 4.0,
    "message": "Great looking but I had to go up half a size."
  },
  {
    "user": "Ashley Ahola",
    "rating": 3.0,
    "message": "I know these have rave reviews but I felt they ran kind of small and just weren't as comfortable as everyone has made them out to be. I ended up ordering a pair from Skechers that looked extremely similar and were more comfortable. Ultimately, I ended up wearing a cheap pair from Target that were white."
  },
  {
    "user": "Sarah",
    "rating": 4.0,
    "message": "The shoes are comfortable and fit as expected. I have a narrow heel, and these stay put. The right one has two stitches between the eyelets and toe but the left one doesn’t."
  },
  {
    "user": "ayn",
    "rating": 4.0,
    "message": "I loved the color and I was happy to buy the same shoe for my daughter and myself. I wasn’t happy that I was not able to return for the correct size"
  },
  {
    "user": "Abigail Davenport",
    "rating": 5.0,
    "message": "These shoes go with any outfit. They are quite comfy but I wouldn’t wear them on long walks. They are easy to slip on and off."
  },
  {
    "user": "melanie traylor",
    "rating": 3.0,
    "message": "They are cute. And I love the brand. I bought them for casual dresses, tho it turned out they don’t look great for that… I also can’t wear them very long. Not great for walking. I always end up with an achiness on the top of my foot wear the tongue presses in a bit too tight."
  },
  {
    "user": "Fit Junky",
    "rating": 4.0,
    "message": "Loved the style but I have narrow heels and it was a poor fit for me. I had to return."
  },
  {
    "user": "Kathy Nay",
    "rating": 3.0,
    "message": "The fact that the seam is right at the heel and bunches up there is probably why these shoes instantly started tearing at my heel. I also read the insoles we’re removable. They’re definitely glued in and removing would leave sticky residue and maybe some of the insole itself behind. It’s gonna be a no for me."
  },
  {
    "user": "EasternShores11",
    "rating": 4.0,
    "message": "I got these for summer casual wear, and it fits just right. Minus a star for the super stiff back heel area, but otherwise very cute and will work with just about any summer outfit! I'm flat footed so I just added those stick on arch support cushions. Good purchase!"
  },
  {
    "user": "Sanee",
    "rating": 4.0,
    "message": "Loved the shoe but had to return as it was too narrow even with ordering a wide width."
  },
  {
    "user": "TRAx2",
    "rating": 5.0,
    "message": "These run big size down."
  },
  {
    "user": "Tabitha Jayne",
    "rating": 4.0,
    "message": "These shoes are super cute and I definitely recommend, HOWEVER they are pretty narrow. I have small narrow feet, I wear a consistent size 6 and have for as long as I can remember buying my own shoes. These are bit tight on the front sides of the shoes, near the top laces. There’s plenty of room for the toes, my toes don’t feel crunched and the length of the shoe is good so I think sizing up would have made them a bit too big. Hopefully they will stretch out a bit with some wear."
  },
  {
    "user": "Erin",
    "rating": 4.0,
    "message": "Love the colors & texture on this shoe! I so wish it would've been a little wider. Sad that I had to return."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love sperrys. The canvas is heavier than standard style.Still cute and comfortable"
  },
  {
    "user": "AmazonGoddess Customer",
    "rating": 5.0,
    "message": "They are great"
  },
  {
    "user": "Monica",
    "rating": 5.0,
    "message": "Like the material, colors, perfect size"
  },
  {
    "user": "mary mahan",
    "rating": 4.0,
    "message": "I love the look of these. Great for summer…just slip on and off! Comfy too!"
  },
  {
    "user": "Kara Womack",
    "rating": 5.0,
    "message": "I love the look and comfort of these shoes."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "Bought leather Sperrys years ago when I was on my feet a lot. The support helps relieve my back pain and my feet don't hurt at the end of the day. I know from experience they hold up really well. So glad they have canvas."
  },
  {
    "user": "Andy L",
    "rating": 5.0,
    "message": "Shoe was a little loose, but was able to tighten with laces"
  },
  {
    "user": "TERRI HOBSON",
    "rating": 4.0,
    "message": "not a lot of support so you couldn't walk any distance a day of shopping your feet would hurt but they are cute and fun to wear, made well"
  },
  {
    "user": "Lightleeds",
    "rating": 3.0,
    "message": "Small, narrow, and hard to get on. The leather shoes laces don't help the situation at all. I can usually can were a normal size 9. Afraid to size up, just to be disappointed again. Sigh."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Thank you Sperry for these sneakers. Can a sneaker be elegant, well I think these are very fashionable. They dressed up my shorts. They are comfortable even when they don't have arch support. Of course, that could be added. I bought my size and it fits perfectly, and will even if I added the arch support. I am a standard size. I love the leather laces that are in place and don't have to be tied. I just slip in my feet. Very happy with my purchase."
  },
  {
    "user": "Sharon Vance",
    "rating": 5.0,
    "message": "These shoes fit true to size and we’re great price. I wear them all the time and I would say they’re easily one of my top three favorite shoes to wear for running errands. Very comfortable and you don’t have the time he slipped right on"
  },
  {
    "user": "Maura K. Lorenz",
    "rating": 5.0,
    "message": "These are so cute and comfortable for summer. They run just a tad loose but that has made them much easier to just slip on and go! The blue ones are my favorite!"
  },
  {
    "user": "Mary Plowman",
    "rating": 5.0,
    "message": "I have balance issues and have tried many different kinds of shoes and these actually work! Thank You"
  },
  {
    "user": "Jessica",
    "rating": 4.0,
    "message": "Love the look of this shoe. The fit was as expected. I will say, it was super difficult to get my feet in at first. After a few wears it loosened up a tiny bit. Still kind of tight getting my feet in. Other than that I really love them."
  },
  {
    "user": "SYLVIA GAITAN",
    "rating": 5.0,
    "message": "Love the sneaker it’s comfortable. It’s more a fashion statement. Good support used them on a trip to Hawaii did not get tired. Have not used them for workouts."
  },
  {
    "user": "Tammy Stafford",
    "rating": 4.0,
    "message": "I wear a size 7 but these are tight…."
  },
  {
    "user": "Lida",
    "rating": 4.0,
    "message": "I like the style and colors, however Not much support"
  },
  {
    "user": "stephanie lawson",
    "rating": 5.0,
    "message": "Love them, put them right on and wore them all day"
  },
  {
    "user": "Madeline",
    "rating": 5.0,
    "message": "Me encantaron son negros lona pero el negro es intenso y son muy cómodos si tú pie es delgado tr quedará perfecto pegados y de la talla son la talla correcta no vienen ni grandes ni pequeños normal"
  },
  {
    "user": "Monica Mahoney",
    "rating": 5.0,
    "message": "I love my Sperrys although I did have to use a foot stretcher which is no problem definitely worth the purchase and comfortable a nice versatile shoe to go with anything"
  },
  {
    "user": "LikeCats2",
    "rating": 3.0,
    "message": "These are the most adorable shoes but sadly the way Sperry had them constructed there is a seam at the back of the ankle that rubs my ankle area raw.  The material is very stiff and hard so not kind to skin in that area.  My suggestion if you really really want these shoes to purchase bluster pads thick socks and really monitor your feet while walking.  Its sad that a shoe that is supposed to be such a quality brand would not think ahead in design to prevent this from happening.  I accidentally threw box away so can't return they are just the cutest but poor construction in that area of shoe"
  },
  {
    "user": "JJ",
    "rating": 3.0,
    "message": "This summer I purchased two pairs of Sperry sneakers.  Neither of them are comfortable.  They are cute but everytime I wear them I need to put bandaids on the backs of my heels!"
  },
  {
    "user": "Karen",
    "rating": 4.0,
    "message": "Love the comfort of these shoes but they run big.O"
  },
  {
    "user": "Pocono Mom 3",
    "rating": 5.0,
    "message": "I ordered the size I wear with slip-ons and sandals first and it was too tight. Went through the exchange process for a size 7, which was super easy, the new shoes were here the next day and they fit perfectly. They were comfortable from the moment I put them on and they look great with shorts and my sporty dresses."
  },
  {
    "user": "mel",
    "rating": 5.0,
    "message": "The media could not be loaded. I always wear roxy , saw these on sale form prime day ! I figured I would try ! So glad I did ! I have them in three colors . They are so comfy and so cute ! Love them"
  },
  {
    "user": "Maria Cotto",
    "rating": 5.0,
    "message": "Quedan muy cómodos,  perfectos con jeans, shorts."
  },
  {
    "user": "TNE",
    "rating": 5.0,
    "message": "Love the fit, maybe a little wide, I have a wider foot and they fit.....not HUGE fan of the wide sole, but they are still very cute"
  },
  {
    "user": "Tona J",
    "rating": 5.0,
    "message": "A very comfortable and affordable shoe."
  },
  {
    "user": "Amuleto",
    "rating": 5.0,
    "message": "No breaking time required, feels very comfortable despite not having a lot of art support. I could walk in it for hours since day one."
  },
  {
    "user": "Robin Cantu",
    "rating": 5.0,
    "message": "I really like the comfort fit of the shoe. Very nice casual shoes to wear."
  }
]