[
  {
    "user": "Celine Kate",
    "rating": 4.0,
    "message": "I loved the animal print sneakers. I purchased the red and beige animal prints.  They are very eye catching and add a pop of excitement to your outfits but for me… they were very narrow. I couldn’t get my foot in the shoe. I usually wear a 7.5 but I couldn’t wear these due to the width. I do have chubby feet but I don’t usually wear a wide size in sneakers. I guess these were not for me but they are very cute."
  },
  {
    "user": "Clara Villegas gomez",
    "rating": 4.0,
    "message": "satisfecha"
  },
  {
    "user": "Carola Powell",
    "rating": 5.0,
    "message": "Wanted comfortable dressy sneakers and ordered the Cliff Sneakers in the Black and Gold design…super comfortable and love his use of different textures in the materials and design.  Ordered my normal size 8 and were a perfect fit.  Definitely worth the price!"
  },
  {
    "user": "Kylie",
    "rating": 4.0,
    "message": "I love that these are so cute and stylish. The price was of course a huge plus. They’re weirdly elevated at an incline in the heel but the sole is super stiff and not at all forgiving. I don’t recommend for long period wear."
  },
  {
    "user": "ingrid albu",
    "rating": 4.0,
    "message": "Fits well,  but received a different print than the one I ordered. Ordered Animal Multi, received Animal."
  },
  {
    "user": "Annki",
    "rating": 5.0,
    "message": "These are super comfortable to wear and at the same time they are super cool. I can easily walk quite long distances in them if needed. Got so many compliments for them, wether I wear them to jeans or a simple dress."
  },
  {
    "user": "Moon",
    "rating": 5.0,
    "message": "I absolutely love these!"
  },
  {
    "user": "JessClio",
    "rating": 5.0,
    "message": "Very good pair of shoes, light, comfort, and fits well"
  },
  {
    "user": "Jude me",
    "rating": 4.0,
    "message": "I like them just a little to small"
  },
  {
    "user": "MIRELLA RAVARINO",
    "rating": 5.0,
    "message": "Sturdy, but lightweight and fabulous blue and gold design ‼️🌟"
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "These shoes are so cute like the pictures.  Only thing is there was absolutely no give they are so stiff . I gave then to my daughter who didn't mind that"
  },
  {
    "user": "martha haro",
    "rating": 5.0,
    "message": "Quedan perfectos"
  },
  {
    "user": "Susan G Stringer",
    "rating": 5.0,
    "message": "I just got around to wearing these with the change of seasons.  The fit is perfect.  They are so comfortable -- like walking on air!"
  },
  {
    "user": "Jae Wells",
    "rating": 5.0,
    "message": "I personally love animal prints! These sneakers go with every color (except maybe pink) in anyone's wardrobe! They are unique, fun, comfortable, and enjoyable! They are lightweight and fashionable! I wear them daily!"
  },
  {
    "user": "Angela",
    "rating": 4.0,
    "message": "I LOVE this shoe-it is absolutely adorable and every time I wear them I get complimented. The issue is that the fit is a bit uncomfortable, especially for a sneaker. They feel a bit shallow (like the part around my foot isn’t high enough and after a long day, my feet hurt a bit. It’s not enough to not wear the shoes, but I don’t wear them on days when I plan on a lot of walking."
  },
  {
    "user": "JR",
    "rating": 4.0,
    "message": "Cute style, good fit for a more edgy moderate priced sneaker."
  },
  {
    "user": "Shauna",
    "rating": 4.0,
    "message": "Love the look of these. Only downfall is they aren’t very comfy."
  },
  {
    "user": "Kylie",
    "rating": 5.0,
    "message": "I absolutely love these shoes. I get so, so, so many compliments when i wear these. I also get a few inches taller, which i also enjoy. i wish there were more shoes that looked similar!"
  },
  {
    "user": "Elsa Kuehn",
    "rating": 3.0,
    "message": "Don’t expect to wear them for very long until you break them in"
  },
  {
    "user": "alejandra",
    "rating": 3.0,
    "message": "The shoes are definitely cute but I don’t think the quality in this case is great. Within the second day I wore them, the glitter started coming off. It came with a little bag of some shiny things but not the same as the shoe which seemed weird to me. I will not consider buying again the ones with glitter. Other than that I like the style of the shoe. I bought 1/2 size bigger to make sure I was comfortable since I have wide feet."
  },
  {
    "user": "Trudy C.",
    "rating": 3.0,
    "message": "STIFF, Not Comfortable walking shoes for sure!!!! And I doubt That these are Really STEVE MADDEN I’m still trying to find out if not there going back!!!! Far as Looks Yea there a eye catcher!!!! Box was pretty much Tore Up when i opened package, makes me think they just put these in a STEVE MADDEN box they found!!! Who Knows! Maybe they will loosen up some after I wear them couple more times IDK but will definitely update this review!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Rated 3 because they ate cut. Rid small and narrow. Order at least one size bigger than normal"
  },
  {
    "user": "JKey",
    "rating": 3.0,
    "message": "Cute shoes but not comfortable at all . No cushion or support"
  },
  {
    "user": "Jamilaeyes",
    "rating": 5.0,
    "message": "Love these!"
  },
  {
    "user": "Guadalupe.",
    "rating": 5.0,
    "message": "Los compré en talla 8.5. Soy de pie delgado, en talla 9 me quedan también perfectos. Los compré en 5 modelos."
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "message": "I had to take mine back because they are hard to me. There is no cusion and narrow at the top. Uncomfortable shoe"
  },
  {
    "user": "Deanna",
    "rating": 4.0,
    "message": "Love the shoes! However I should have ordered a size smaller. Now I can’t wear them😞"
  },
  {
    "user": "Amanda Booth",
    "rating": 3.0,
    "message": "The shoe was too small. Even when having loose strings, it was work to get the shoe on. Cute shoe, but hard to size."
  },
  {
    "user": "Shiretta E.",
    "rating": 5.0,
    "message": "Love the shoe"
  },
  {
    "user": "Prime Negotiator",
    "rating": 5.0,
    "message": "These shoes get sooo much attention...every single time I wear them, I get raving compliments regardless if I know the person or not. Besides catching the ladies' attention, surprisingly a lot of men like them too...I am married but there have been a lot of rando men loving and complimenting on my shoes as well. I mean these shoes essentially does the flirting for you...they are also good icebreakers cause when you walk into a room, people will not only compliment them but also ask what brand they are; where you bought them, etc...all in all, I LOVE them; these shoes are dramatic and glorious! I normally wear a size 5.5 or 6 and got a 6 for these shoes...I suggest sticking with your usual size and do not size down. The shoes actually look a little bulkier than what I usually wear/prefer, but I think it's because of all the padding, which makes the shoes sooo comfortable! I am petite, so I LOVE that these shoes give me some additional height! Yes, these shoes look fabulous but they are also practical as well...they are comfortable and solid shoes to wear for a while. I enjoy going on really long walks and these shoes worked out perfectly! As dramatic/loud these shoes look, they actually go with a lot of outfits...these shoes are definitely the stand out piece, so just make sure you don't have a lot of eye catching prints on and let the shoes show off itself. All in all, these shoes are trendsetting! They can compliment your fun, creative, funky and outgoing personality! They are like almost perfect!!"
  },
  {
    "user": "Nia Neely",
    "rating": 4.0,
    "message": "They decent for the money, however, for better comfort choose a size up"
  },
  {
    "user": "Mrl05140",
    "rating": 5.0,
    "message": "I received so many compliments wearing these. They are comfy too! So pretty - don’t hesitate! Buy them!"
  },
  {
    "user": "MARY",
    "rating": 4.0,
    "message": "The sneakers are really cute, but they are not too comfy"
  },
  {
    "user": "ana",
    "rating": 5.0,
    "message": "Duro muchas horas de pie por mi tipo de trabajo y han sufro súper comodos y bellísimos"
  },
  {
    "user": "chastity a billups",
    "rating": 5.0,
    "message": "Many compliments on this shoe and yes it is cute.  If you have wide feet the shoe is not for you as the front is slightly snug and does not have much room for comfort.  I love this shoe as the heel support provides comfort while I'm on my feet for 12 hours."
  },
  {
    "user": "sam",
    "rating": 5.0,
    "message": "Got these on sale they are cute not that comfortable"
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "Love these, definitely get the complements, a little narrow in toe so would size up half a size!!"
  },
  {
    "user": "DANTAM HUYNH",
    "rating": 5.0,
    "message": "I like them"
  },
  {
    "user": "Mr. Wilson",
    "rating": 5.0,
    "message": "Got for my wife and they are fire!"
  },
  {
    "user": "Kristy",
    "rating": 2.0,
    "message": "I love the look of this shoe. I also read the reviews about the wedge in the heel before I bought it.  Unfortunately they where right. It is so uncomfortable to stand or walk in them for an 8hr shift.  I was very disappointed that I paid full price for a shoe that looks absolutely stunning, but miss the mark on comfort.  It matters when your feet, knees and back are in pain from a shoe that just looks great, but leaves you feeling like crap."
  },
  {
    "user": "Jacci",
    "rating": 4.0,
    "message": "I ordered these in my size from a designer shoe store and they were so small. Impossible to find my size anywhere online...then lo and behold, they became available on Amazon. If you like funky looking shoes, these are perfect for you. They position your foot a little forward and they run small. I usually wear a size 8 but ordered these in an 8 1/2. They are narrow in the front of the foot and around the toe but a little wider in the heel. Order a half size larger than what you normally wear and just wear a thicker sock. I love these! I did not buy them to wear them as sneakers but as funky looking shoes. The only reason I gave it four stars is that I think this one was purchased and returned. There was no packing in the shoe insole look like somebody was wearing it a little bit. I was not about to return it because they are so hard to find."
  },
  {
    "user": "Hope Hayes",
    "rating": 5.0,
    "message": "These sneakers are unique, fashionable and very comfortable."
  },
  {
    "user": "Dallas Buckhanon",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Due to defective seam on top of my right foot, would you consider discounting this item. I would prefer a new pair but their sold out and discontinued. The box I rec’d was open and not in its original condition. Apparently also uncomfortable for pervious customer .  I love the shoes and cannot wear for long period of time, but willing to suffer a lil pain , their just too cute"
  },
  {
    "user": "marymoten",
    "rating": 4.0,
    "message": "Very cute shoe. Made for a narrow foot"
  },
  {
    "user": "JessicaB",
    "rating": 3.0,
    "message": "Very cute and styled shoes. I wear an 8, bought an 8.5, glad I did as they are a bit narrow. They are very stiff, not very comfortable. The tongue part of the shoe sits tight on the foot. I will try to wear them to break them in."
  },
  {
    "user": "Amber Anders",
    "rating": 2.0,
    "message": "These shoes look cheap. They appear to be something that would be bought in the childrens section at a big box store. The picture do not truly show how plastic of these are in person."
  },
  {
    "user": "Kjirsten M. Randall",
    "rating": 4.0,
    "message": "Love them!!! They look even better in person, but they definitely run small. Description says true-to-size, I usually always wear a 7-7.5 with 7.5 normally running a little large, I bought the 7.5 and they’re almost too small, so I actually need an 8 (I never ever wear size 8 usually way too big) and they’re out of that size so I’m super bummed. Other than that, super cute sneaker."
  },
  {
    "user": "Kassondra",
    "rating": 5.0,
    "message": "Bought these on a whim and absolutely love them.  Comfortable and cute.  I get tons of compliments on them."
  },
  {
    "user": "KAREN",
    "rating": 5.0,
    "message": "These are very confortable and have some arch support. Love that they are platform and add some height. Cute and fun!  Will buy in more colors!!"
  },
  {
    "user": "seribell",
    "rating": 5.0,
    "message": "Es ni 2do par que compro y satisfecha. Excelente calidad y comodidad."
  },
  {
    "user": "Ski-dogs",
    "rating": 5.0,
    "message": "I trust Steve Madden brand- not my first pair- love their bold designs, good and lasting quality- wide fit is what I go for- prompt arrival and packaging- the sole is high quality and grippy. Always a good buy!"
  },
  {
    "user": "Michelle",
    "rating": 3.0,
    "message": "Great looking shoe but runs small. I will order again when available in a larger size"
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "I love these shoes, they are definitely a show stopper. They are very comfortable. I usually wear a 10 , but from reviews I notice everyone has been complaining of them being narrow in the toe box. I ended up getting an 11 because 1/2 sizes were not available. They are the perfect fit and give my toes the wiggle room for a comfortable fit. I would recommend going up a size if you have an issue with needing more space in the toe box. I will be ordering more in different colors. The colors definitely add  a flair to my outfits. These shoes are a must have in your wardrobe if you have a unique sense of style."
  },
  {
    "user": "Tenisha",
    "rating": 3.0,
    "message": "I like the style, but it’s very heavy, and I wouldn’t recommend for waking long distance."
  },
  {
    "user": "Elizabeth Hammond",
    "rating": 5.0,
    "message": "I absolutely love these shoes. I've had so many compliments when I wear these. They look great with any pair of jeans. It took a couple wears to break them in, nothing crazy. They were comfortable from the beginning but just a little stiff or tight like you would expect a new pair of shoes. Even after a year they are still my favorite shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I get multiple compliments every time I wear them. Down side is the toes space is small and my little toe hurts half way through the day. I love the height I get from them!"
  },
  {
    "user": "Caitlin",
    "rating": 3.0,
    "message": "Item arrived in perfect condition. Ordered my usual size but it does run small as a heads up to anyone else ordering."
  },
  {
    "user": "Jhakiria Warren",
    "rating": 3.0,
    "message": "Need to go up a size for real. My foot is on the small/narrow side. I went up to a 7.5 from my normal 7 and it was still too small."
  },
  {
    "user": "BDAllen",
    "rating": 5.0,
    "message": "So many complements! I get stopped every time I wear these, literally EVERY TIME!! This is my second pair. They’re a bit snug over the top of the arch at first but they have plenty of give once worn a couple times. I was a bit leery with my first pair but after a few short outings they loosened up and we’re very comfortable. I experienced exactly the same thing with my second pair."
  },
  {
    "user": "Dreamer",
    "rating": 4.0,
    "message": "Already received compliments, love the style. Ordered a 1/2 size bigger, fits nicely. However, the toe area is a bit narrow."
  },
  {
    "user": "Monica Bangura",
    "rating": 5.0,
    "message": "Like everything about my shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Received sooo many complements on them"
  },
  {
    "user": "T.Henry",
    "rating": 4.0,
    "message": "Love them they are very comfortable 🤎🖤❤️"
  },
  {
    "user": "lesly qualls",
    "rating": 4.0,
    "message": "The product was tight in toe area and sung on heel . I ordered a 9m but this 9 was to tight needed a 9 1/2 or 10 so I recommend a size up !!! Not good for airport walking 🤦🏽‍♀️"
  },
  {
    "user": "Wendy Brown",
    "rating": 5.0,
    "message": "I normally wear a size 6. But these were way to small. I sentvthem back with no issues. Cute shoes though."
  },
  {
    "user": "Tiffany",
    "rating": 3.0,
    "message": "The media could not be loaded. They are sneakers but like a wedge inside so you stand at a bit of an incline. Has a super cute, matte look. But they are hard as a brick to walk on. No padding in bottoms at all."
  },
  {
    "user": "Shaydee",
    "rating": 5.0,
    "message": "I loved everything about the shoes but after wearing them for a while my feet did hurt a tad bit. I would purchase another pair."
  },
  {
    "user": "Aaron",
    "rating": 5.0,
    "message": "These Shoes were a gift for my wife she loved them she they were comfortable and made her taller lol exactly as expected"
  },
  {
    "user": "Christy Parks",
    "rating": 5.0,
    "message": "Little narrow in toes, comfy wear!"
  },
  {
    "user": "Pamela D.",
    "rating": 5.0,
    "message": "It’s so great to wear sneakers that give me a bit of height - 2. 1/2 inches for sneakers is pretty awesome!!!"
  },
  {
    "user": "Ranl47",
    "rating": 5.0,
    "message": "I love these shoes. They are so stylish"
  },
  {
    "user": "Melanie",
    "rating": 5.0,
    "message": "I get so many compliments on these! My students at school are trying to be like me."
  },
  {
    "user": "Erika Kingsley",
    "rating": 5.0,
    "message": "I really like Steve Madden's artist eye. I love the patterns and different variations. I have recieved many compliments. They almost have a wedge heel. I think with a shoe insert they would be more comfortable. I'm very pleased and hope to order more."
  },
  {
    "user": "Cmart1214",
    "rating": 2.0,
    "message": "These are super cute. They run so small though. I wear a 6. I bought a 6.5 and they were still too small. Sadly I had to return them. So I can’t say anything about comfort or quality. They looked like they were well made. They did feel very stiff like they’d probably take some breaking in….but I can’t say for sure."
  },
  {
    "user": "sofia",
    "rating": 3.0,
    "message": "son hermosos. pero corren a pequeños, tuve que regalarlos"
  },
  {
    "user": "Bettina CONFIAC",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Alecia",
    "rating": 5.0,
    "message": "I like"
  },
  {
    "user": "Veronica",
    "rating": 5.0,
    "message": "I'm in love with this shoe!! These are definitely my favorites right now. Can't wait to spot them!!!"
  },
  {
    "user": "KC",
    "rating": 4.0,
    "message": "I'm surprised that the shoes aren't more comfortable. I do love the look ... so looks like I'll be buying inserts."
  },
  {
    "user": "SA Customer",
    "rating": 3.0,
    "message": "El artículo no es original pues no tiene el sello oficial de Steve Madden pero me queda bien"
  },
  {
    "user": "Adrienne",
    "rating": 3.0,
    "message": "I’m 100% usually a solid 10 but I had to size down in these to a 9.5 - definitely size down a half ladies!"
  },
  {
    "user": "Myneisha Robinson",
    "rating": 5.0,
    "message": "These were so much prettier in person. I get so many compliments"
  },
  {
    "user": "Yarly",
    "rating": 4.0,
    "message": "Muy bonitos pero incómodos en la parte de arriba del pie. Tal vez para pies delgados."
  },
  {
    "user": "Shay",
    "rating": 5.0,
    "message": "I got these shoes without expectations honestly but they fit so good I ordered a half size up b/c I broke my right foot and I can’t have anything too tight on it. I haven’t wore them yet but they fit great walking around the house!"
  },
  {
    "user": "Falco Benfield",
    "rating": 5.0,
    "message": "Love these fun classy dress sneaker.  Perfect for dressing up a pair of leggings or fun with jeans or even a casual dress.  Comfortable to wear all day!!"
  },
  {
    "user": "Herica Ferreira",
    "rating": 5.0,
    "message": "Excelente calidad, talla, ancho y sobre todo la altura, mis zapatos favoritos a partir de ahora!!! La entrega fue super rapida!!! Amazon Te AMOOOOOOO!!!🥰🥰🥰"
  },
  {
    "user": "Lisa Arnold",
    "rating": 4.0,
    "message": "Very cute shoes!  A little narrow in the width.  I went up a half size to compensate."
  },
  {
    "user": "Charity Mitchell",
    "rating": 4.0,
    "message": "Shoes look exactly as shown"
  },
  {
    "user": "AB",
    "rating": 3.0,
    "message": "Smaller than expected"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These sneakers are super cute, different and girly. I love the way they look; however, I wished they fit better than they did. They were a little snug on me. I am a true 11 and these fit like a 10.5"
  },
  {
    "user": "robbin jordan",
    "rating": 5.0,
    "message": "I love the shield, the style and the comfort"
  },
  {
    "user": "Brooklyn Cain",
    "rating": 5.0,
    "message": "They are narrow in the toe but overall true to size. Very fashionable. Could use an inner sole for more support. Happy with the purchase."
  },
  {
    "user": "Shannon",
    "rating": 2.0,
    "message": "Okay. Real review. Didnt expect the real deals but these are very poorly made. Ordered a 6. It fit properly. They look very cheap. You can see the glue all over it. The bottom of the shoes are peeling away, loose threads everywhere! I'm sending back and ordering from the site like I usually do."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "One shoe was to tight and really hurt my foot. Other than that, lots of compliments and I love them."
  },
  {
    "user": "Tamecia Shaheed",
    "rating": 3.0,
    "message": "The shoe is really cute and looks expensive and high quality, but they aren't comfortable. There's a part on the inside that causes pressure on the top of my foot. Maybe a 9 1/2 W would have been better but that's not normally my size."
  },
  {
    "user": "Andrea",
    "rating": 5.0,
    "message": "I purchased these for my 5th grade girl. She wears a size 7 and they fit as should. They are narrow, but I heard they do stretch. She told me they aren't comfy as a Brooks tennis show, but she loved the style of them."
  },
  {
    "user": "Johna Bland",
    "rating": 5.0,
    "message": "I love these shoes they fit great and they are very comfortable"
  },
  {
    "user": "CS",
    "rating": 5.0,
    "message": "They are narrow to put on and tight to the right fit . Need a 1/2 size up depends on ur feet . Can't have fat feet!"
  },
  {
    "user": "Danielle",
    "rating": 4.0,
    "message": "Love the look of these sneakers... makes working out and running errands look like you’re doing it in style! The shoes are a bit tighter than I expected, my normal size is 6.5, so I ordered a 6.5 and they’re pretty snug."
  }
]