[
  {
    "user": "Dorothy D.",
    "rating": 5.0,
    "message": "For the incredible low price of $19.99, and once I found them inexplicably at $15.99, these are super winners in my book.  People mistake them for converse, I don't care about brands anyway but some people do.  I wear 9.5 and the 10 fit very well.  I did need to add in a set of press-on arches to make them comfortable and that added to the price but I am still satisfied.  I get tons of compliments on them.  I would not wear them for lengthy walking but they are great for running errands etc. Now for the cleaning:  I recommend first of all spraying them with sneaker protector to minimize stains.  I also recommend not wearing them in the mud or when spattering spaghetti sauce :) if you want to keep them clean.  Throwing them in the washing machine totally messed up my white ones so don't do that! I think I had worn them without socks and some dirt from the soles of my feet transferred into the interior of the shoe.  When they became wet, the dirt spread and stained the outside of the shoe.  However, cool thing! I was able to paint them with acrylic paints (directions on line) and now I can wear them again.  You can clean those toe caps with whitening toothpaste, it works amazing!  Thanks for these very affordable, fun, and comfortable shoes!"
  },
  {
    "user": "Prolificus",
    "rating": 4.0,
    "message": "Initially I was concerned that I may not like these shoes. So many people mentioned the lack of arch support and that the shoe bed is totally flat. However, I came across a reviewer that stated how much she loved these shoes after inserting an \"arch cookie\" - just below the padding in the shoe bed. What the heck. I decided to give them a try. I ordered a pair of size 9 shoes and then searched Amazon for a pair of arch cookies. Upon receiving the shoes, I immediately inserted the arch cookie and walked up and down my hallway. Wow... I love these shoes! I was ready to commit and step out of the house with them on. If you have a high arches like mine, the arch cookie is such a wonderful solution for flat bedded shoes. Now I'm going to order this same shoe in blue and get a couple more arch cookies. RATING: I gave the shoes 4 stars since I had to cough up the money to create a better fitting shoe. Otherwise I would have given them 5 stars. They're cute and priced well enough to order them in several colors. I hope this helps anyone out there who is undecided about these cute, retro looking sneakers."
  },
  {
    "user": "Meagan Johnson",
    "rating": 5.0,
    "message": "I was a bit skeptical at first, as I have always worn brand name Converse. I found these in white for a Prime Day Deal and paid $15. It kills me to say it, but I actually like these better than Converse! Usually Converse are tight along the sides, but these are a bit looser (in a good way) and fit much more comfortably. I ordered the white to try it out, and I already have the yellow pair coming and the sea foam colored ones are sitting in my cart. 10/10."
  },
  {
    "user": "Jonesy",
    "rating": 5.0,
    "message": "Although these aren’t the typical converse sneakers  I’m used to buying, they weren’t bad at all!.  I really like the look/style and the fit was pretty good too.  I don’t do well with flats because of my arch, but I had plenty of room to add both  a shoe cushion and arch support which only made the comfort even better.  If you’re looking for a low cost tennis shoe that’s stylish, these are a great choice.  The only thing that bothered me is that the items were not shipped via Amazon but USPS and with that the box was very damaged and had also been opened.  Not what I expected for an Amazon delivery."
  },
  {
    "user": "L A Pasco Productions",
    "rating": 5.0,
    "message": "I purchased my first pair in a floral print, and because of the excellent quality and fit, I have now ordered 3 more, in solid colors. The price can’t be beat, and they start out more comfy than Converse brand, which I previously wore for years!"
  },
  {
    "user": "Danielle",
    "rating": 4.0,
    "message": "love the style! Has a orange glow to the shoes in certain lighting. Only downfall is the shoe runs a bit large. I wear a size 8 and they are definitely loose."
  },
  {
    "user": "LB Reed",
    "rating": 4.0,
    "message": "I only bought them for Halloween this year, so I'm not sure if the overall fit from being worn. But they are bright white and resemble the picture displayed"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The size rating is off. I ordered my normal size but they were too small. Returned and ordered a size up and they just fit but I assume they will stretch with wear. Shoes are super cute! They are almost identical to my chucks but without the labels of course. Would definitely order more."
  },
  {
    "user": "dreamweaver",
    "rating": 4.0,
    "message": "I ordered my usual size 8.  There was a bit of room at the toe, but it wasn't too big of a deal.  The shoes are okay.  Thin and narrow.  About what you expect from these type of shoes and what it looks like in the pictures.  The quality is fine. I've always avoided shoes like this as an adult because they hurt my feet as a kid, but thought I'd give it a try.  They hurt my heels in the back.  Especially on the right foot where there's a spot that rubs."
  },
  {
    "user": "Noah",
    "rating": 4.0,
    "message": "They're cute and I like them but they do run small. I wear and 11 in similar shoes so I ordered an 11. They fit but not super comfortably. For the price tho I'll keep them, just won't wear them if I've gotta be on my feet a lot. Other than that the actual shoe is nice, good soles and seem well built."
  },
  {
    "user": "Andrew",
    "rating": 5.0,
    "message": "I’ve worn converse brand growing up, and now, I cannot believe how expensive they’ve gotten?!  So, I purchased a pair of size 6 low-tops. They fit wonderfully, look and feel great! :D I also appreciate that there are not obnoxious labels on the outside or the inside of the shoe that reveal its another brand, just a simple, clean converse look."
  },
  {
    "user": "jennii Louise",
    "rating": 5.0,
    "message": "Nice shoe my first experiment of blinging the shoes. They are sturdy and great color.  Not really for working out more a fashion shoe. Would buy again. So many colors to choose."
  },
  {
    "user": "Sarah",
    "rating": 5.0,
    "message": "Love these shoes! The arch support isn’t great so I just got a good pair of dr scholls inserts and that fixed the problem. Definitely reccomend!"
  },
  {
    "user": "Gabe Middleton",
    "rating": 4.0,
    "message": "They were a little tight but I think the more I wear them the more comfortable they will be. They look just like the picture"
  },
  {
    "user": "Mike",
    "rating": 5.0,
    "message": "These shoes are well made and are cute.  There is no support in them but converse tennis shoes do not have support.  I can slide my supports in and wear them comfortably.  It’s a win!"
  },
  {
    "user": "happydaze",
    "rating": 5.0,
    "message": "I’ve bought about 5 pairs of these in different colors over the last couple of years, I love the “Converse” style but at a way better price point! They last, and are cute"
  },
  {
    "user": "Alicia Estrada",
    "rating": 4.0,
    "message": "Cute fits right, will probably buy more colors"
  },
  {
    "user": "Dr. Davia Coutcher",
    "rating": 5.0,
    "message": "These are a great pair of everyday canvas shoes! Size 6 ( perfect) Comfy Beautiful crimson red color!"
  },
  {
    "user": "Zoey Roosevelt",
    "rating": 5.0,
    "message": "Even though I wear a heal support, because one of my legs is shorter than the other, I'm happy to say that these shoes work well for me."
  },
  {
    "user": "Ellen Lewison",
    "rating": 5.0,
    "message": "Shoes are truly a good fit, give good support, stylish and comfortable.  Better than Converse - more cushion and excellent price. Great quality - second time buying them - array of colors to choose from.  Luv these shoes."
  },
  {
    "user": "Hayley",
    "rating": 5.0,
    "message": "I love these shoes. I need to order more in more colors and styles"
  },
  {
    "user": "Lisa Vermillion Black",
    "rating": 5.0,
    "message": "I love classic Converse.  I'd love these low tops in every color."
  },
  {
    "user": "Tasha S",
    "rating": 5.0,
    "message": "These shoes are cute and inexpensive. I used them for work. They don’t have a lot of cushion on the bottom. However, you can use an insert."
  },
  {
    "user": "Tess",
    "rating": 4.0,
    "message": "I bought these as a staple piece for my wardrobe bc I couldn’t afford converse. I have no complaints they are comfy."
  },
  {
    "user": "Laura",
    "rating": 5.0,
    "message": "good quality. Would buy it again"
  },
  {
    "user": "YELITZA M.",
    "rating": 5.0,
    "message": "Bonitos y cómodos. Combinan con todo"
  },
  {
    "user": "Suza",
    "rating": 5.0,
    "message": "These sneakers are adorable and very comfortable. I would wear them more for leisure as there are other options more suitable for working out, unless it's low impact like weightlifting."
  },
  {
    "user": "CaseyLeigh",
    "rating": 5.0,
    "message": "These shoes are adorable, great color and very comfortable. I wore them all night to a concert event where I had to walk a lot and stand most of the night. First time wearing them and had NO issues with discomfort. And I got lots of compliments. Great color, great look - all around win especially for the cost. I got them in yellow and a teal/blue color and love both!"
  },
  {
    "user": "Brady",
    "rating": 5.0,
    "message": "I ordered a size 8, since the other reviews suggested going up a half size. Bad idea, for me at least. These are great-looking shoes, but I trip in them. Might order another pair in a smaller size."
  },
  {
    "user": "Iheartdeals",
    "rating": 5.0,
    "message": "My kid wears them every day. Looks and wears out to the same degree as the more expensive converse. I will continue to save my money and buy these."
  },
  {
    "user": "Pamela kelly",
    "rating": 5.0,
    "message": "I want two other colors, I had the white for summer, I need the navy, and the sparkle ones for fall.."
  },
  {
    "user": "Jackie",
    "rating": 5.0,
    "message": "Every time I wear them I get compliments on them. They look just like converse just no logo and are honestly just a comfortable. I will say the same for $15 was a great way to try them out. I needed up getting 4 pairs and would recommend to friends and family. The sizing runs about the same at converse."
  },
  {
    "user": "Arizona",
    "rating": 5.0,
    "message": "I bought these for my daughter and they look great.  The color adds a pop to her jeans and shorts.  She says they are comfortable. Great for the price."
  },
  {
    "user": "Octavia",
    "rating": 5.0,
    "message": "I love these sneakers. I bought 3 different pairs."
  },
  {
    "user": "Aeriele",
    "rating": 4.0,
    "message": "they came late which I was mad about but that ok because that has nothing to do with the shoes. Anyways there 20 dollars they not going to be the best best but there light weight and easy to move in. they came nice and clean and I like them there good for the price I paid if you want them to be super on point then you might have to buy you some shoes from the store but yep the all."
  },
  {
    "user": "Brenda A",
    "rating": 5.0,
    "message": "I love how the shoe feels and how it fits it does remind me of the converse. I also like that the shoe lace is a stretchy material. I would recommend anyone to buy this shoes"
  },
  {
    "user": "Lacey",
    "rating": 5.0,
    "message": "Great shoes especially for the price! Durable and exactly as pictured"
  },
  {
    "user": "Jocelyne Ngassa",
    "rating": 4.0,
    "message": "Great fit"
  },
  {
    "user": "Paige Carew",
    "rating": 4.0,
    "message": "The shoes fit really well but the toes are a bit tight and the laces get stained a metal color when you tighten them"
  },
  {
    "user": "amanda p.",
    "rating": 5.0,
    "message": "They look exactly like the picture, the fit is exactly how the size should be. Definitely worth the price. Will buy in other colors"
  },
  {
    "user": "M. Ryals",
    "rating": 5.0,
    "message": "Wear and 8, bought and 8, and viola the fit perfect !  The shoe is well made and has plenty of support to wear all day ."
  },
  {
    "user": "JLD",
    "rating": 5.0,
    "message": "I like the Converse Chucks style but didn't want to spend $75 on a pair of shoes. These look just like the chucks but without the converse \"name\" in the back. If you don't care about having the name tag, these fit perfect. Want a few more colors now."
  },
  {
    "user": "Dark Godis",
    "rating": 5.0,
    "message": "Quality made shoes. I would suggest too size up if you have wide feet. Overall very pleased. Shipped extremely fast with no issues"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I didn't buy these for athletic pursuits. I bought them because they're cute, and in that they are perfect! I added an orthopedic insole for support. I truly enjoy wearing them."
  },
  {
    "user": "Constance Miller",
    "rating": 4.0,
    "message": "These came in super fast and they are so cute!!! Unfortunately I have to return them. I wear a 7 1/2, but these weren't available in half sizes, so I ordered the 8 since shoes this style can be narrow and they are way too big. Definitely should have gone with the 7"
  },
  {
    "user": "Ashlee Gaucher",
    "rating": 5.0,
    "message": "Can’t tell from a distance they aren’t converses. Worth it for a discount to the original"
  },
  {
    "user": "Mama M",
    "rating": 5.0,
    "message": "I'm cheap, and wasn't going to buy name brand, but I really wanted some of these type shoes. So when these went on sale, I jumped on it. I usually wear a size 8 1/2.  But in the name brands I got from yard sales, I can take a 7 1/2 so I was worried what sizing scheme these would follow. Since these don't do half sizes, I tried the 8, hoping they were a little larger. They fit perfectly! They have crisp black and white colors and are fairly comfortable. At a glance they look like the real thing, so I'm happy!"
  },
  {
    "user": "Marya",
    "rating": 5.0,
    "message": "Comfortable as expected. Prettty"
  },
  {
    "user": "shee",
    "rating": 5.0,
    "message": "I wear a 8.5 and bought an 8 because I have narrow feet. The shoes are comfortable and I didn't have to add an insert. They are quite fun and I have received many compliments. This picture of the shoes is after two months and a couple of wears."
  },
  {
    "user": "Joanie",
    "rating": 5.0,
    "message": "I wouldn't purchase these again. My daughter now has 3 pairs of these in different colors. To late to return. But the toe area is way to tight. Her feet hurt in them, and we can't put an insole in them because no space. No cushion in foot bed causes her pain in her feet."
  },
  {
    "user": "Leslie",
    "rating": 5.0,
    "message": "I bought these for a costume and have ended up wearing them more than my Chuck’s! They are true to size and more comfortable than my much pricier Converse."
  },
  {
    "user": "Christie Kolb",
    "rating": 4.0,
    "message": "Not bad! Ordered a 10. I have an average width foot. Bit snug from the ball of the foot to the toes with the heel being a little wider, odd at first but gets better as I break them in"
  },
  {
    "user": "Eunice",
    "rating": 4.0,
    "message": "They do run a little big so if i could have gotten 1/2 size down i would have. Other than that i love them!"
  },
  {
    "user": "Cleann Cameron",
    "rating": 5.0,
    "message": "Cute and comfortable!"
  },
  {
    "user": "Julie S.",
    "rating": 5.0,
    "message": "I recently shattered my ankle and needed whole shoes vs sandals. These are adorable and my new favorites! They are by far the most comfortable shoes I now own."
  },
  {
    "user": "Micah Meek",
    "rating": 5.0,
    "message": "I love these shoes. They are fairly comfortable but super cute."
  },
  {
    "user": "Mandi Wright",
    "rating": 4.0,
    "message": "I love the look of Converse shoes, but not the price or the fit.  I have pretty wide feet, so real chucks can be uncomfortable after a while.  These are little wider and accommodate my duck feet much better.  The price is great as is the selection.  Wide width ladies, I urge you to give these a chance!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I like the style and comfort on my  feet"
  },
  {
    "user": "Sarah M",
    "rating": 5.0,
    "message": "For the price tag, you cannot beat these shoes!!"
  },
  {
    "user": "Tricia",
    "rating": 4.0,
    "message": "Fits more comfortably than my actual converse, but not much arch support. I’d buy again"
  },
  {
    "user": "SUZI",
    "rating": 5.0,
    "message": "Love the color and fit. So cute, really comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these shoes . Its not converse but looks like it and it was comfortable and affordable thank you"
  },
  {
    "user": "Linda Daniels",
    "rating": 5.0,
    "message": "I love these sneakers. I get lots of compliments on them.  They are comfortable and look a lot like converse."
  },
  {
    "user": "Tiger",
    "rating": 5.0,
    "message": "Ordered my normal size 9 tho I wear sneakers/Converse 9.5. Fit perfect.  Didn’t hurt feet at end of work day.  School colors black/gold and these were great color to match spirit gear."
  },
  {
    "user": "Dore Williamson",
    "rating": 5.0,
    "message": "Design is perfect for footwear."
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "I've been wanting black converse for a while ,but just can't bring myself to spend that much money on myself. These are honestly just as great as converse/chucks !! Great dupe ! I'd love to buy more. Though I do live in Arizona and shoes just aren't for this heat ."
  },
  {
    "user": "IBAHAMMER",
    "rating": 3.0,
    "message": "I wear Converse sneakers all the time.  I have a decent collection of Converse sneakers.  I bought ZGR’s canvas sneakers to compare because the price difference is big. I never have to breaker in my Converse; they are comfortable right out of the box.  ZGR’s sneakers are stiffer and less comfortable.  I have wore them with no show socks and without socks and the comfort level compared to Converse is quite noticeable.  My biggest issue is they hit me funny below the ankle and rub the skin.  This is the 4th time I have worn them and the stiff seam is still digging into the skin below the ankle.  I think they would be fine if you wear your sneakers with thicker socks but I don’t want to.  They look good and the soles have good cushion but I wouldn’t buy them again. UPDATE: I wash my Converse sneakers all the time.  I washed these sneakers twice since purchase.  First wash was normal.  Second time I washed them there was pink cardboard in the washing machine.  I thought I forgot something in my pockets until I saw that both inserts popped out in the wash.  There was a layer of pink cardboard between insert and the sole.  It totally got shredded up in the wash.  It peeled off really unevenly."
  },
  {
    "user": "Daniel Villareal",
    "rating": 5.0,
    "message": "Wife loved them just right size & look great"
  },
  {
    "user": "Momof2boys",
    "rating": 5.0,
    "message": "These are a great neutral color to go with anything!  I have worn name brand Converse for years & LOVE them, but thought I'd try these cute (much cheaper version) & I was not disappointed!  I've worn them several times & they fit my big ol' size 10 just fine.  I wear a size 10 normally & these are a true fit.  They don't have as much toe room as Converse, but they still fit fine & are comfortable!"
  },
  {
    "user": "K. Harris",
    "rating": 4.0,
    "message": "I ordered a size 11, it fits more like a 10.5, but for the price point I won't complain about it being on the snug side. These are cute, I got a few compliments the first day I wore them."
  },
  {
    "user": "Jade",
    "rating": 4.0,
    "message": "they do run a bit small so i suggest sizing up I'm a size 7 normally and got a size 6 and theu are perfect. I was a bit sketchy for the price but it's worth it i highly suggest for back to school!"
  },
  {
    "user": "Griffin's Granny",
    "rating": 5.0,
    "message": "I have wide feet so I’ve never been able to wear Converse tennis shoes.  These are a perfect fit!  Can’t wait to order more!"
  },
  {
    "user": "mike detherow",
    "rating": 4.0,
    "message": "Left one fits good right shoe touches my big toe. Getting more comfy and looser. The more I wear. Cute, good quality. Keeping but will not order other colors unless they make 9 1/2 !!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Shoe was a great fit"
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "Nice quality. Good fit. A great deal in replace of Converse."
  },
  {
    "user": "Matt",
    "rating": 5.0,
    "message": "A coworker had purchased these and loved them so much she suggested I get some, too! We work at a college, and this yellow is the perfect color for our black and gold! I have wide feet, so I was nervous- but these are just fine 🙂"
  },
  {
    "user": "Ms H.",
    "rating": 5.0,
    "message": "Enjoy daily"
  },
  {
    "user": "Corie",
    "rating": 5.0,
    "message": "Fits as expected. I have a wider foot and was worried. These are super comfortable"
  },
  {
    "user": "leah",
    "rating": 4.0,
    "message": "the shoes are great in that they pass for the real thing when looking at them. they are not the comfiest to wear for extended periods of time, so I would suggest getting some sort of inserts with them. the laces were a little big in my opinion but I've managed to tuck them into the shoe which isn't terrible just a little inconvenient and not the comfiest feeling either. but all in all they're decent shoes, especially for the price."
  },
  {
    "user": "Anamarie Marx",
    "rating": 4.0,
    "message": "Not true to size. I can range between a 6-7 with shoes. These were a pinch to big as a size 6. Beyond that, great shoes for my wedding reception!"
  },
  {
    "user": "Kenya",
    "rating": 5.0,
    "message": "Perfect and looks great"
  },
  {
    "user": "Regina Cline",
    "rating": 5.0,
    "message": "Got so many complements on these. They fit just like converse and my daughter was jealous bc she just spent $70 on a pair of actual converse. Lol These we’re so great I plan on getting more colors."
  },
  {
    "user": "sadie",
    "rating": 5.0,
    "message": "These are great sneaker for every day living.  I would not use them for working out however, there’s not enough support for workouts.  They are great for shopping and hanging out.  I’m going to buy another pair.  I really like them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Casual walking"
  },
  {
    "user": "DrowningBlonde",
    "rating": 5.0,
    "message": "Cute sneakers"
  },
  {
    "user": "Etta Trammell",
    "rating": 5.0,
    "message": "Comfortable and great buy"
  },
  {
    "user": "Knitter1",
    "rating": 5.0,
    "message": "These are beautiful sneakers! I love the design and the quality is great. What I find a problem is that they are slightly tight on the top of my foot. They feel good on my foot length, but the top pushes down on the top of my toes. I'm trying to decide if they will stretch with wear, which will mean I keep them, or just returning them. If I didn't love the design, I'd just return them. What to do??? Hmmm...."
  },
  {
    "user": "Larissa Coe",
    "rating": 4.0,
    "message": "All these positive \"true to size\" reviews are crazy! I usually wear Women's 7.5 in most shoes, 8 in low-top Converse to avoid blisters, and these are closer to a Men's 8. I plan to exchange them, and the look + quality are what I expected so I'm rating them 4 stars, but just be aware you may want to get a couple sizes to try and return the ones that don't fit."
  },
  {
    "user": "Grisell",
    "rating": 5.0,
    "message": "I bought these to customize for a themed party. I loved final result, not the originals but believe… if you looking to save some bucks, this is your option. Color is slightly different from rubber, not bright white."
  },
  {
    "user": "Barbara Hudson",
    "rating": 5.0,
    "message": "Picnic"
  },
  {
    "user": "M.S",
    "rating": 5.0,
    "message": "I'm a true size 8 but I had to size down to a 7 and they fit me great. My friend who is a Size 9 fit into the 8 perfectly!"
  },
  {
    "user": "Philerene Duffy",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Tierra",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "brittany mills",
    "rating": 5.0,
    "message": "Sometimes cheap shoes will rub the side of your toes when you wear them all day but these don't!! Look great and feel great!!"
  },
  {
    "user": "JWalsh",
    "rating": 5.0,
    "message": "I bought these because I didn’t want to spend serious money for name brands.  I just wanted them for wearing around the yard or running to the store.  Love the retro look!!!  I think they run slightly larger but with Sox they will be perfect…also, I think the more you dirty them up the better they will get!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wear size 7.5 my feet are not wide. After reading the comments I ordered down. Had to return size 7.  They were too exact my toe hit the top of shoe.  Ordered size 8 comfy fit, just wish it came in half sizes. My size 8 will do. This shoe is not sized like Converse."
  },
  {
    "user": "Ann B",
    "rating": 5.0,
    "message": "Love the fit, feel, & support. Well worth it."
  },
  {
    "user": "Amy graves",
    "rating": 5.0,
    "message": "I bought these for my 10 year old daughter. She’s notoriously rough on shoes so I have a hard time spending $60 on a park that won’t last 6 months. These are by far the best Chick Taylor dupes I’ve ever seen. I will be buying my self a couple pairs as well I’ll be getting my daughter a couple pair in white and navy. These are great a great cost effective choice for parents that need to buys shoes for their kids. I get nothing out of this review and I’m picky."
  },
  {
    "user": "LadyDi",
    "rating": 4.0,
    "message": "I love these but for me they run a little short. Had to return them."
  },
  {
    "user": "Kit",
    "rating": 5.0,
    "message": "I have these shoes in several colors now and just live them. They a re cute, comfortable and decent to walk in. They have very little support however so not good for a workout."
  }
]