[
  {
    "user": "Shareef Elhadidi",
    "rating": 4.0,
    "message": "This has become my favorite white sneaker, I had a pair of Nike Blazers, but for me, these are far more comfortable. I really like the silhouette and for the price, I prefer them to the Reebok Club C. I only wish they had them in the vintage white and green."
  },
  {
    "user": "Adriana Colmenarez",
    "rating": 5.0,
    "message": "What elegance of shoes, I love them very much and seeing them on my husband was the best."
  },
  {
    "user": "Oscar Sanchez",
    "rating": 5.0,
    "message": "Looking nice and I like them simple as that"
  },
  {
    "user": "Sarah",
    "rating": 5.0,
    "message": "Got these for a comfy work shoe- now they’re my favorite daily pair! Can’t get any better than this for $40. So impressed with these!!"
  },
  {
    "user": "Danielle Bijelic",
    "rating": 5.0,
    "message": "These have to be my boyfriends favorite shoes. They are comfortable,  fit great, and the price is perfect."
  },
  {
    "user": "Jim McGregor",
    "rating": 5.0,
    "message": "these shoes look fantastic in your made of high-quality materials"
  },
  {
    "user": "Natasha lopez",
    "rating": 5.0,
    "message": "Me gusto , fue un regalo que le hice a mi papá y le encanto 😌"
  },
  {
    "user": "Kawaguy",
    "rating": 5.0,
    "message": "I bought these shoes because of the price. I am happy with them and they are comfortable."
  },
  {
    "user": "Samantha",
    "rating": 5.0,
    "message": "Super cute!! I ordered these in 6.5 in mens. I’m an 8 in women's size. I could’ve sized up to a 7 honestly, but the more I wear them the more they are breaking in. I’ll order a 7 next time when these shoes are done for."
  },
  {
    "user": "jim695",
    "rating": 5.0,
    "message": "I don't understand some of these negative reviews. I've been shopping with Amazon for several years now, and whenever I've had an issue with ANY product, Amazon Customer Service has bent over backward to make me happy, even when the mistake was due to my own stupidity or ignorance. If you're not happy with a purchase you've made here, at least call their toll-free Customer Service number and let them try to help you to sort things out. Okay. Now that I've gotten that off my chest, on with my own review: After some extensive shopping both locally and online, I ordered a pair of these Reeboks from Amazon because, for some stupid reason, shoe stores no longer carry Reebok shoes (one manager even told me that Reebok went out of business)! I live in northern Indiana, so I shopped several (many) stores in Columbia City, Warsaw, Fort Wayne, LaGrange, Angola and Marion over a period of about four months. To be fair, a few stores had one or two pair of Reeboks, but none had the style I was looking for, nor did they have them in my size. Because I needed a pair of white sneakers, I finally relented and bought a pair of Nikes from Shoe Show in Columbia City. I wear a 14 (4E), and they had plenty of different styles of Nikes in that size, but no Reeboks. Anyway, while the Nikes were not bad shoes, they just weren't comfortable, even after I had worn them for a couple of weeks, so I decided to buy the shoes I wanted in the first place, which brought me back to Amazon.com. I've been wearing Reebok Classics for fifteen years, but they weren't available here in my size, so I thought I'd try the very similar Club Memt. I placed my order after midnight on May 9th. I'm not an Amazon Prime member, so I was satisfied when my order confirmation stated that my shoes would be delivered by May 16th. After all, shipping was free for these shoes, so I figured a week was reasonable for UPS Ground. I was delighted when I received an email the following morning saying my package had shipped and would be delivered by May 12th. I was absolutely flabbergasted when my order was dropped off at 1pm on May 11th! Less than 48 hours after I had placed my online order, my new shoes, in the correct size, were delivered to my doorstep in perfect condition. Are the soles thin? Well, yes, I suppose they are compared to basketball or hiking shoes, but these are casual-wear shoes, and they're not made for athletic activities or for slogging around in mud and gravel. I put a pair of good-quality gel insoles in them, along with a pair of heel/arch supports and, not only do they fit perfectly, they look great with my kakhi slacks or just a pair of blue jeans. More importantly, THEY'RE COMFORTABLE, and I enjoy wearing them. Now, honestly, they are white shoes, so they do get a little dirty when I wear them outside, but I've discovered an ingenious solution to this problem: I WIPE THEM OFF WITH A DAMP RAG WHEN I GET HOME. I guess I should mention that I paid full price for these shoes, and I was offered no incentive to leave a positive review. I retired from the U.S. Navy in 1995 and I do not work for Amazon.com, Reebok nor for any other company. I wrote this review because I like and wear Reebok shoes, and because I'm impressed with Amazon.com's customer-oriented business model and their unwavering commitment to customer satisfaction. If you've taken the time to read my loquacious comments, I hope they've been helpful to you in making an informed shopping decision."
  },
  {
    "user": "Brittany Daviau",
    "rating": 4.0,
    "message": "I would suggest buying innersoles for these shoes, as my partner’s feet were bothering him and in so much pain the entire event!"
  },
  {
    "user": "Beto",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Cornell M.",
    "rating": 4.0,
    "message": "Love it"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The shoe size is right  on the money but they do run a little narrow but the still feel great"
  },
  {
    "user": "Claudia Papini",
    "rating": 4.0,
    "message": "My son loved it"
  },
  {
    "user": "Gail",
    "rating": 4.0,
    "message": "I have a wide foot so these fit nicely.  Been wearing this brand for years."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfortable and styles"
  },
  {
    "user": "Inez Guerra",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Deanna Lee",
    "rating": 5.0,
    "message": "Not wide enough"
  },
  {
    "user": "Shaun",
    "rating": 5.0,
    "message": "I like the design of the shoe. Fits as expected."
  },
  {
    "user": "Rogelio Guillermo Zamora Castrejon",
    "rating": 5.0,
    "message": "Excellent shoe for the money"
  },
  {
    "user": "Jeffrey",
    "rating": 3.0,
    "message": "This is the only Reebok Men's Club shoes I could find that comes in \"Wide\". The other Reebok's Men's Club shoes were all too narrow in the toe box and squished my pinky toes. These are better, but it still rubs against my pinky toe. Unfortunately, it has more problems: It also is too loose in the heel and my heel moves up and down slightly causing wear. It also squishes the top of my foot a bit."
  },
  {
    "user": "Phyllis Swenson",
    "rating": 5.0,
    "message": "Comfortable shoe"
  },
  {
    "user": "Chester Wong",
    "rating": 3.0,
    "message": "The quality of the faux leather and rubber soul feels light, thin and flimsy. The toe of the shoes does not match, one is rounder at the point then the other. It looks like they just pulled each side off of bin and wrap them up in the box. The size felt a little small. I order a size 10, does not feel like a 10. I have the one inch space in the toe area but it felt and looked small to me. The colors and design of the shoe looked good overall."
  },
  {
    "user": "Wendy W",
    "rating": 3.0,
    "message": "I got these shoes to work out in, I wear thick adidas socks since they’re a little wide being mens shoes.. (I’m a woman) they crease on top when I walk on the treadmill and become extremely uncomfortable. I usually only get 40 minutes of power walking in before I can’t stand the pain anymore. If you want them strictly for fashion, yes. If you want them to walk 5 miles, no."
  },
  {
    "user": "Marv L",
    "rating": 4.0,
    "message": "Nice shoes but not for the serious athlete."
  },
  {
    "user": "DJB",
    "rating": 5.0,
    "message": "Product and Service was great, Will definitely order again."
  },
  {
    "user": "P. Carlson",
    "rating": 5.0,
    "message": "Feels good. Looks good."
  },
  {
    "user": "Sushant Vohra",
    "rating": 5.0,
    "message": "Reebok has done it. This is a great white pair to buy that looks great, can go with any outfit and is overall comfortable for regular use. I’d avoid running in those tho but other than that it’s a great product. Right amount of cushion all around and extremely easy to clean."
  },
  {
    "user": "Jay",
    "rating": 5.0,
    "message": "These shoes are nice and are very comfortable. They are slightly smaller than I am used to for size 10.5us, but still fit well. Maybe try a 1/2 size larger than you'd normally wear for a better fit. If you like how they look in the Amazon display pictures, then you will like them in person, they look the same. Maybe even a little bit better in my opinion. The insoles are nice and and sort, they are light and a great sneaker for casual wear."
  },
  {
    "user": "Trisha Mcclellan",
    "rating": 5.0,
    "message": "It is a nice looking shoe, and the product makes me look stylish. It fits great with Jeans.  These shoes fit as expected, and they are comfortable when walking.  I love them."
  },
  {
    "user": "Elizabeth Rivera",
    "rating": 5.0,
    "message": "To wear on a daily basis"
  },
  {
    "user": "Scott T.",
    "rating": 5.0,
    "message": "Good fit."
  },
  {
    "user": "Nina Martinez",
    "rating": 5.0,
    "message": "bottom of shoe to thin.  I can feel the rocks and Debree from the floor. bottom of shoe is to thin"
  },
  {
    "user": "D. R. GREENE",
    "rating": 4.0,
    "message": "Great looking as expected. When these originally came out i was 5’9, 145. Now I’m 6’5, 230. I need more support. But i recommend them as they are a good looking shoe."
  },
  {
    "user": "ZOB",
    "rating": 4.0,
    "message": "They fit snug I’ve been buying size 13 high school but now that I realized I can shop online I began getting 12 1/2 which is impossible to find in stores. Under Armor, New Balance, puma and Adidas fit perfectly at this size Nike has always ran small. But Reebok used to fit true to size. Maybe it’s this model specifically. Anyway the still fit but at first it’s uncomfortable at this point the feel fine but the snugness has crinkled the toe are. Not too harshly but enough to ruin self admiration (I don’t think anyone else would notice). I’m sure as the shoe breaks in further it will go away but by then the new shoe appeal is gone which is the point of white shoes (this is why this is my first pair of white shoes in over a decade). Anyway they still look good. And feel fine."
  },
  {
    "user": "Belinda R.",
    "rating": 5.0,
    "message": "Buena calidad"
  },
  {
    "user": "Brad B",
    "rating": 5.0,
    "message": "These shoes take me down memory lane. Classic look that's always in style for spring & summer"
  },
  {
    "user": "herb dobson",
    "rating": 5.0,
    "message": "Feels and fits perfectly"
  },
  {
    "user": "Kimberly",
    "rating": 5.0,
    "message": "I had been looking for shoes for so long and couldn’t find any! & reebok had my size im so glad i checked Amazon! I love my shoes!"
  },
  {
    "user": "Mark McInerney",
    "rating": 3.0,
    "message": "Very hard sole in the heel area.  Also, fairly narrow fit."
  },
  {
    "user": "Rafael",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "sidney m.",
    "rating": 5.0,
    "message": "A super comfortable shoe. That fits just right. Durable and stylish. I use this as a daily for work ,my feet doesn't get tired nor do ache and I do a lot of walking."
  },
  {
    "user": "MH",
    "rating": 5.0,
    "message": "Fit is great! Super cute and comfy"
  },
  {
    "user": "JazzDrum",
    "rating": 5.0,
    "message": "I bought this shoe based on the look, design, material and comfort.  I own more Reebok sneakers than any other brand.  I have found that with my wide foot and a pronounced bunion on my right foot, Reebok just seems to fit better than Puma, Addidas(who owns Reebok), and Nike.  It's important to me not to feel the shoe on my foot and Reebok is able to achieve that better than the others.  This pair is a 0.5 size larger than my normal but it fits perfectly.  I would definitely purchase it again."
  },
  {
    "user": "Wanda Duncan",
    "rating": 5.0,
    "message": "Comfort fit ,not to heavy, clean looks, goes with anything you choose to wear"
  },
  {
    "user": "Joosey Froot",
    "rating": 5.0,
    "message": "I usually wear an 11-Wide, but all of the Classics in a regular 11 are great for me. These in particular have a thinner sole than the rest of the Classics, which makes them great for driving; expecially manual cars."
  },
  {
    "user": "Normalguy",
    "rating": 5.0,
    "message": "I've bought many of these over the years.  From local stores and Amazon and they all have the same fit and look.  Can't go wrong with these casual sneakers."
  },
  {
    "user": "JH",
    "rating": 5.0,
    "message": "Good shoe, good price"
  },
  {
    "user": "Ladimer Loftus",
    "rating": 3.0,
    "message": "No support at all!"
  },
  {
    "user": "Christian Puente",
    "rating": 4.0,
    "message": "Buena calidad"
  },
  {
    "user": "T. Pilotte",
    "rating": 5.0,
    "message": "Looks and feels a lot like the ones I wore in high school in 1985. Ahhhh the memories. Decent support, comfortable (not too stiff) leather and great look that seems quite retro to me. IMHO these shoes look awesome new or well worn. Great for casual wear, hair metal concerts, sneaking out of Saturday detention or flying down the sidewalk on your favorite skateboard. Pairs well with jeans and black t-shirts."
  },
  {
    "user": "FlyBoy",
    "rating": 5.0,
    "message": "☆ ☆ ☆ For Classic Fashion sneakers, this unique semi-Oxford style beats the very pricy Derby style hands down in looks, comfort and durability. ,,,, It is incredible how just one high end brand could have that much herd mentality impact on almost every classic sneaker brand sold on the market irrespective of price. ,,,, There is not one sneakers brand that markets its classic style differently from  the one so expensive Derby copy sold in high end fashionable outlets. Well, I am glad Nike stuck to their own identity and followed their own wisdom. ,,,, Nike's semi-Oxford, by far, provides wearability, longevity and durability that exceed the herd which cost up to ten times the average Niike price. I purchased 2 of the Nike in two different color schemes, both of which have been put to severe and arduous use for a whole year, and I have yet to notice any change in the appearance of the leather in terms of deformity, creases or wearability. These Sneakers rock."
  },
  {
    "user": "Terry Boh",
    "rating": 5.0,
    "message": "I like the color and how casual the shoe looks"
  },
  {
    "user": "William Ek",
    "rating": 5.0,
    "message": "Great flat fit, could use a little more cushion, but a good shoe, I have the white version too!"
  },
  {
    "user": "Rigo A.",
    "rating": 5.0,
    "message": "Fit perfect love them"
  },
  {
    "user": "congressdan",
    "rating": 5.0,
    "message": "Reboxs are good shoes i think the most comfortable shoes i ever bought were BK's and these are a close 2nd"
  },
  {
    "user": "Charles M.",
    "rating": 5.0,
    "message": "bellos bellos"
  },
  {
    "user": "Carlos Monterroso",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "W. Sims",
    "rating": 5.0,
    "message": "Can't give up on the classic look.  Always the same!!"
  },
  {
    "user": "Chris Q",
    "rating": 3.0,
    "message": "Like the look, they aren’t made how the were. Didn’t fit my foot well. I have a C width foot. A lot of gapping across the top of my foot."
  },
  {
    "user": "Dion",
    "rating": 4.0,
    "message": "The shoe fix great 👍"
  },
  {
    "user": "Alvin H Johnson",
    "rating": 5.0,
    "message": "Loved the shoed"
  },
  {
    "user": "Shady Lady",
    "rating": 3.0,
    "message": "Bought the usual size and found it too small and too narrow. Returned. Nice looking shoe, though."
  },
  {
    "user": "Handy Andy",
    "rating": 5.0,
    "message": "This Reebok sneaker is a great casual shoe.  Not only well-made and comfortable, but also quite good looking.  I have had many compliments from friends. I made another purchase of the same shoe, so now I have both brown and black --  good enough for both casual and semi-dress."
  },
  {
    "user": "Carol Moore",
    "rating": 5.0,
    "message": "I like Redbox try to buy only them"
  },
  {
    "user": "Christopher Munoz",
    "rating": 5.0,
    "message": "Nice and comfortable"
  },
  {
    "user": "Regina Walker",
    "rating": 5.0,
    "message": "My husband loves his shoes very comfortable"
  },
  {
    "user": "Tonya",
    "rating": 5.0,
    "message": "Cute and goes with different outfits"
  },
  {
    "user": "Michael R. Siebels",
    "rating": 5.0,
    "message": "Exactly what she wanted"
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "Can't go wrong with the Classics!"
  },
  {
    "user": "jerry comstock",
    "rating": 5.0,
    "message": "Great pair of shoes!"
  },
  {
    "user": "Gary Hudson",
    "rating": 5.0,
    "message": "Good wear"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great product and fast delivery"
  },
  {
    "user": "Public Pete",
    "rating": 3.0,
    "message": "For me the top of these shoes isn't very flexible. So when I walk in them the top of it bends and cuts into the top of my feet. Too much room around my foot. Maybe a fatter foot this wouldn't happen, if you have long skinny feet I wouldn't recommend."
  },
  {
    "user": "bean pole",
    "rating": 3.0,
    "message": "The shoe fits lengthwise , but the toe (from the laces forward) is freakishly narrow to the point that I’m wondering if it’s a counterfeit shoe. I’ve worn Reeboks for years and this is a first for me"
  },
  {
    "user": "Eior2",
    "rating": 5.0,
    "message": "Fit a little bit large, just enough to get used to it. Choose half a size down and you should be ok."
  },
  {
    "user": "Reese",
    "rating": 5.0,
    "message": "These are fire I love them! I was scared when ordering these because they’re so cheap - less than $30 I thought they wouldn’t be authentic or made out of plastic. These are authentic, the box was in good condition all labels were on. They feel great when I put them on and I don’t see any signs of them being fake. Even have memory foam type material at the bottom feels good. I have been looking for some nice casual white leather shoes and these slap! I get mad compliments. I’m buying all these colors and will post the results. I would say that they are slightlyyyy narrow just a little. So if you have fat feet that may effect you. I didn’t let that effect the rating cause I don’t have that problem. Ima do some walking in them if they hurt my feet or somethin I’ll let y’all know."
  },
  {
    "user": "Daniela Lugo",
    "rating": 5.0,
    "message": "Queda súper bien, la talla correcta"
  },
  {
    "user": "Julio",
    "rating": 4.0,
    "message": "Good…"
  },
  {
    "user": "The Dude",
    "rating": 4.0,
    "message": "Nice but tight! Shoe seems a little tight & small for the size. Good looking with all leather upper. Hopefully it will stretch out over time."
  },
  {
    "user": "Oscar",
    "rating": 3.0,
    "message": "The shoes came in defective those pieces of string hanging off and black spots and sponges wasn’t too hard to clean up but it would’ve been nice to get it nice and clean instead of dirty I feel like these are lower grade shoes"
  },
  {
    "user": "Matthew M. Warner",
    "rating": 2.0,
    "message": "I have been wearing this brand and model of shoe for years because I have very wide feet and these come in extra wide size. They are comfortable, but they last 6 months on average and the last 3 months of that they are very loose on your feet from stretching. So I've been wanting to try other brands but never wanted to take the time to experiment and I wasn't sure how many other brands had the wide size.  I bought a pair of these Reeboks in April for $44, didn't start wearing them until June and now it's time for new ones. When I went to go for the \"old faithful\", I was shocked to see a gigantic price increase up to $60! WTH? This lead me to do what I've never done- search amazon by \"shoes extra wide 8.5\"  and I found out there are 100s of shoes in the extra wide size! I bought some Skechers that look very similar for $38- we will see how they fit and last. But anyway, I just wanted to thank Reebok for that huge increase that finally motivated me to realize there are many choices with extra wide (this was always very hard to find in brick and mortar stores, not so on Amazon). a 25% price increase is a GREAT way to get rid of those lifelong customers that were only marginally enthusiastic about your shoes, but were buying them out of habit. Bye Felicia!!"
  },
  {
    "user": "Ruben N.",
    "rating": 2.0,
    "message": "I like the style and color. They began to unglued around the front after about 8 months of light use. I expected better quality from Reebok"
  },
  {
    "user": "Robert",
    "rating": 4.0,
    "message": "Nice shoes,not that thin nylon material,came within the week and nothing was wrong with them. I do reccomend getting the next half size up from what you usually wear,glad I read reviews before buying or else these would be to small.. Not to great of a shoe if you have fat/wide  feet. But all around nice shoes"
  },
  {
    "user": "Berk",
    "rating": 4.0,
    "message": "I work retail and have put a couple hundred miles into these. They do run narrow, but I read the reviews and ordered a size wider than I normally wear, and right out of the box they fit better than pretty much any other shoe I've worn. Despite constant use and impacts, the seams are still going strong, there's very little wear on the soles, and with occasional oiling the leather is still strong and pliable. The biggest advantages to me, as someone who walks a lot on mixed terrain, are the combination of light weight, durability, and a surprisingly grippy and flexible sole. I would highly recommend these to anyone who works on their feet a lot. The one downside is that the soles are not terribly supportive, but that's actually a plus to me because I'm used to being barefoot or wearing thin leather soles outside of work, so it feels more natural and doesn't leave my feet sore."
  },
  {
    "user": "Manuel",
    "rating": 5.0,
    "message": "This shoes are awesome"
  },
  {
    "user": "JAMES ROBINGS",
    "rating": 4.0,
    "message": "I like the style they were fresh white on white. Size was to small I got a 13 my normal size in other shoe brands and they were to small and my head kept slipping up the back they're real low cut."
  },
  {
    "user": "Rock Hard - Ride Free",
    "rating": 4.0,
    "message": "Good looking kicks. A bit snug at front when ordering in true USA size. Best to order a half-size bigger than usual for less big-toe contact with upper at front of shoe."
  },
  {
    "user": "esperance donald",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Justin P",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Heather",
    "rating": 3.0,
    "message": "Produced just did last long. It was not easy to install. Conpresser stopped working within  weeks."
  },
  {
    "user": "Christina Crooks",
    "rating": 5.0,
    "message": "I was so happy to find these classic Reebok's again. I had a pair but they were getting old so what a plus to find the same ones at such a reasonable price."
  },
  {
    "user": "Jaye",
    "rating": 5.0,
    "message": "I switched to Adidas after Nike decided to endorse Communism. Unfortunately Adidas doesnt make a lot of their shoes in size 15, so Reebok was my next best choice for shoes under $70."
  },
  {
    "user": "tyrone",
    "rating": 4.0,
    "message": "I use the shoe for walking, it doesn't have much support, it fit like a wide shoe. But I had already worn it, so I kept it. I've purchase Reebok shoe's in the 90's they were great then. Not so great now!"
  },
  {
    "user": "Dmitri Hakobyan",
    "rating": 5.0,
    "message": "Superb snickers"
  },
  {
    "user": "Brian A Berlin",
    "rating": 5.0,
    "message": "Hard to find at most stores but still the most comfortable shoes on the market"
  },
  {
    "user": "Alcavant",
    "rating": 5.0,
    "message": "I haven't been able to find any pairs of this particular style of shoe in stores anywhere. They're comfortable enough to wear anywhere whether at work or home, walking, hiking, etc. They typically last a while too. I've already gotten dye on them, but that just adds character. Life is about the journey, not the destination."
  },
  {
    "user": "Christopher",
    "rating": 2.0,
    "message": "The media could not be loaded. 10 to 15 years ago you wouldn’t catch me in another shoe besides Reeboks. I saw the style online in Reebok classics I love the gum soul with the heel brown highlight. However as you can see in the video the white portion that meets the gum rubber is someone painted on and peeling off after only two weeks. I realize he’s a white shoes and they’re gonna get dirty. However a small amount of dirt and scuffs can be cleaned I can’t fix peeling rubber. I just wishes are better because I really like the look of them. Very low quality I wouldn’t buy again. I hope these photos and review are helpful."
  },
  {
    "user": "rosemary watson",
    "rating": 5.0,
    "message": "These are the shoes my son has been buying for years. Apparently they are just right for him, so they are just right for him."
  }
]