[
  {
    "user": "Brianna",
    "rating": 4.0,
    "message": "Love the look, but quickly realized it hurt to walk in and is tight enough on your feet to slowly get uncomfortable as the day goes on. Ordered half a size up from usual and it fits fine at first but definitely not functional for long days. Cant seem to loosen it enough to be comfy and it would be too big if I went up a size. Have had better luck with other puma shoes for that balance between comfort and style"
  },
  {
    "user": "TMDEFO",
    "rating": 4.0,
    "message": "A little stiff initially, will take a while to soften. Unfortunately shoes don't have the slit on the tongue to keep laces in place or the extra hole at the top for lacing, to keep heal from sliding forward in shoe. This is a important for use beyond casual wear."
  },
  {
    "user": "jenny",
    "rating": 5.0,
    "message": "Sharp looking shoe.  I have received many compliments.  It is decent for people with wider feet or any type of feet really. It’s not the most comfortable or supportive shoe, but the look makes up for it.  The sole is a little hard.  I only wear them on short outings right now, but I’m still breaking mine in.  The size is pretty true to size, but if you have wider feet, you may want to consider going a half size up for more comfort.  They do kind of squeeze your toes.  Go ahead, get you a pair.  They will look great on you!! Enjoy."
  },
  {
    "user": "sofia g",
    "rating": 4.0,
    "message": "I bought size 8.5 because it is the size I wear and the feedback indicated that it should fit me well.  It is a shoe with a beautiful combination of colors, I am not a fan of the brand but I am always willing to try brands and this time I allowed myself to buy some comfortable shoes to wear with different styles. The front shape is somewhat strange, maybe it's just that I'm not used to this model, it looks like a duck head.  Something that is very important to me is that the leather is not too stiff, this one is quite stiff, in addition, the model is for a narrow foot (very narrow), my foot is not wide but roomy shoes are better for me. This model is quite narrow, it is felt especially in the front part where the laces start, my toes fell asleep in a couple of hours and without wearing socks, I will need very thin socks or I will simply wear them without socks.  The sole is quite comfortable, although a bit stiff. After all, you can see the good material and they look durable, despite everything, I hope they soften with some use, I really trust that hahahaha"
  },
  {
    "user": "Sarita Ordoñez Murillo",
    "rating": 5.0,
    "message": "Realmente un excelente producto , son unos zapatos bellos , cómodos la talla es Justo la que se indica , muy buen precio"
  },
  {
    "user": "italia68",
    "rating": 4.0,
    "message": "I like the shoes, but they don't fit right."
  },
  {
    "user": "Nicole Washington",
    "rating": 5.0,
    "message": "They run kinda big, but other than that it’s a good and sturdy shoe, and not to mention stylish"
  },
  {
    "user": "Diana Gonzalez",
    "rating": 5.0,
    "message": "Al inicio, muy duras. ya con uso se volvieron cómodas. uso diario"
  },
  {
    "user": "Francescavenniro",
    "rating": 4.0,
    "message": "Un poco dura la zuela"
  },
  {
    "user": "lissette",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "So glad i got these!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They were a little stiff and came up too far on front of ankle. Not sure if a smaller size would have fit better."
  },
  {
    "user": "Andrea",
    "rating": 4.0,
    "message": "I’ll start by saying I’m a big girl. I usually wear a size 10 in US womens shoes. However, I saw all the reviews saying these ran small. I wanted to order a size up, BUT size 10 was the very largest they had, soooo… I decided to take my chances. I absolutely love them, but they sure hug my feet. I’m hoping they break in well, and thankful I have a desk job (not having to walk around a lot, since my feet are throbbing). It’s not intolerable, but certainly tight. I love the colors, and it seems like they have some decent arch support (I only think maybe, it’s hard to tell through the dull ache) I doubt this review helped too many people, but as the other reviewers say, size up! (If you can. *eyeroll*)"
  },
  {
    "user": "Kamz",
    "rating": 4.0,
    "message": "I bought these thinking they would fit fine and be as comfortable as it said. I was sadly mistaken, firstly they run tight across the foot and the stitching for the tongue of the shoe rubbed the top of my foot so bad, first day wearing left me in agony thru my 8hour nursing shift. I placed two cans inside to widen the top and loosened and relaxed the laces, it's better now but I would advise to buy a size larger than your regular size."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "EXCELLENT ITEM"
  },
  {
    "user": "Andrew Sylvia",
    "rating": 5.0,
    "message": "Very comfortable, didn’t have to “break” them in. Took them on a vacation to NYC and wore straight out of the box for 20k steps in a day."
  },
  {
    "user": "Serena Edwards",
    "rating": 5.0,
    "message": "This is my second pair and that is saying a lot, the first pair that I have; I wear to work, and I work in the hospital 12 hour days, they are that comfortable."
  },
  {
    "user": "Bill Hamilton",
    "rating": 5.0,
    "message": "Great fit"
  },
  {
    "user": "goodie",
    "rating": 5.0,
    "message": "Love it"
  },
  {
    "user": "Jenny",
    "rating": 3.0,
    "message": "I really wanted to love these. By the end of the day, my toes were actually sore from being in a small toe box. Returned."
  },
  {
    "user": "Hotwifeb",
    "rating": 4.0,
    "message": "The media could not be loaded. I love the design and they are comfortable. I have some feet issues and so far these have been great. I definitely recommend!"
  },
  {
    "user": "Nicola",
    "rating": 5.0,
    "message": "I had to buy a comfortable insole because it doesn't have enough arch support though it it cute.  I couldn't wear it for more than 4 hours with long standing."
  },
  {
    "user": "Ember S.",
    "rating": 3.0,
    "message": "Adorable and well made sneakers. I really wanted to keep these, but unfortunately the tongue is too stiff and really digs into the front of the ankle as the leather is a bit too stiff for comfort."
  },
  {
    "user": "Jef Duran",
    "rating": 5.0,
    "message": "Ok"
  },
  {
    "user": "Katelyn Muse",
    "rating": 5.0,
    "message": "Fit like a glove, very clean & authentic"
  },
  {
    "user": "Kate Dias",
    "rating": 3.0,
    "message": "These shoes are incredibly cute but VERY uncomfortable! I had blisters on the top of my feet with socks on because of the tongue of the shoe. There’s no support either. Wearing them for any amount of time is not only uncomfortable but painful. I was genuinely disappointed."
  },
  {
    "user": "eddress",
    "rating": 5.0,
    "message": "They are comfortable, but I didn't wear them yet"
  },
  {
    "user": "Amanda Feehan",
    "rating": 5.0,
    "message": "Love the shoes a little tight"
  },
  {
    "user": "Jem",
    "rating": 4.0,
    "message": "Love the look of the shoe! The price was great! Shoe does run on the narrow side and has a more narrow toe box. (I have average feet. I don't own any wide shoes - have never had to.) If wide width is an option I would recommend getting the wide. Otherwise, nice fashion sneakers for sure."
  },
  {
    "user": "Heather",
    "rating": 4.0,
    "message": "There is a lot to love about these shoes. I went up a half size and the fit is a little loose, but I think my regular size would be too small. I like the way they look, but more importantly they are comfortable to walk in, except… My only complaint is the tongue creating pain on the front of my ankle. I’m thinking it’s because they’re new and stiff. The more I’ve worn them the less it’s bothering me. I think the tongue is getting a bit more flexible so it’s more able to move with my ankle versus jabbing into it. It’s also helped me realize I don’t wear sneakers very often."
  },
  {
    "user": "Haley Kroll",
    "rating": 5.0,
    "message": "On the smaller side!!:)"
  },
  {
    "user": "Michelle Kasencak",
    "rating": 3.0,
    "message": "These are aesthetically pleasing however they cause a significant amount of ankle pain. I wore them with thick socks in hope of breaking them in."
  },
  {
    "user": "Alicia Perez",
    "rating": 5.0,
    "message": "Me agradó el color ,modelo y el confort al caminar"
  },
  {
    "user": "Lady Who Reads",
    "rating": 4.0,
    "message": "I can't remember the last time I had a pair of white, leather sneakers! These have a slightly thicker sole, and decent arch support.  I took them on vacation and I walked what felt like miles everyday and they didn't hurt my feet."
  },
  {
    "user": "C.M",
    "rating": 5.0,
    "message": "I have rocked Puma’s clothing, shoes and accessories since I was about 12 yrs old and they never disappoint me. I am now 46 yrs old and continue to wear them. These particular pair are absolutely comfortable and so darn cute!! I have no regrets"
  },
  {
    "user": "erica glasco",
    "rating": 5.0,
    "message": "Very Cute! The sneaker is narrow and I have narrow feet. So, I feel the snugness. Even with loosening the strings they are narrow. Overall a very cute purchase."
  },
  {
    "user": "EGH",
    "rating": 5.0,
    "message": "Loved it"
  },
  {
    "user": "Amneris Vazquez",
    "rating": 5.0,
    "message": "El producto llegó perfecto. En el tiempo esperado y en perfectas condiciones en su caja original!"
  },
  {
    "user": "MICHELE C HILSON",
    "rating": 5.0,
    "message": "Lots of compliments🤗"
  },
  {
    "user": "Lisa Rusk",
    "rating": 5.0,
    "message": "These shoes have been so comfortable from the first time I put them on to months later. There was no “breaking in” stage with these shoes like some other brand. Plus, they are so cute!!! I would highly recommend."
  },
  {
    "user": "Sarah Womack",
    "rating": 3.0,
    "message": "Super cute shoes.  Very decent quality.  I may not recommend for those with wide feet though.  My feet are killing me by the end of the day because I have wide feet.  So, now I only wear them if I know I'm only going to be in them for a few hours.  Should have returned but oh well."
  },
  {
    "user": "Firemom94",
    "rating": 4.0,
    "message": "UPDATE: The problem was I ordered the wrong size (8)! I wear a size 10, once I realized this I reordered a 10, the fit is much more comfortable! The only issue is the tongue is really stiff and rubs against my foot as I walked, but the rest of the shoe fits as expected. My reorder arrived quickly and I gifted the size 8s to my friend - she loved them! I love this shoe for the style, but it is not comfortable. I read the reviews, so I knew when I purchased the shoe I was taking a chance, but I really like the style. The package arrived early, YAY! I tried on the shoe and it was as the reviews said, very narrow fit around the arch. Plus there is something about the design, whereas the tongue of the shoe can be uncomfortable. I wore them to drive my son to work and back home, I was fine. But unless the leather begins to breathe and loosen, I do not believe I will be able to wear them for more than an hour. My purpose for purchasing is for fashion, not sport. Therefore, I plan to keep them and as I do with heels; assign them a speed limit. ;-)"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I really like the look of the shoe; the gum soles sold me! I moved up a half size and they fix well. My others are a bit short. The shoes are very, very stiff and will require quite a bit of breaking in. The tongue is very short, and stiff as well, and it hits a spot on the front of my ankle when I walk to the point of slight bruising. I wouldn't buy this style again, but I like the other Pumas I have."
  },
  {
    "user": "Luke&Kait80s",
    "rating": 5.0,
    "message": "These pumas are exactly as pictured! Very well made. No flaws. Even the laces are extremely well made with a gold tip.They are 100% leather so yes they are stiff. NOT TIGHT STIFF. You can easily make them comfortable by using a leather spray, or hair dryer for 20 seconds where they are tight. I use spray and walk around in them in the house until the spray dries and repeat as necessary. This takes weeks of breaking them in off. I would also recommend a shoe tree to keep them from creasing. A good show tree can also help stretch them. I am absolutely in love with these shoes! Will definitely purchase again!"
  },
  {
    "user": "Mark Baumann",
    "rating": 5.0,
    "message": "I usually wear between 9 and 9-1/2.  The 9's were too small.  I have a very high arch.  The 9 - 1/2 fit perfectly.  They are cute and will go with so many things.  I'm very happy with my purchase."
  },
  {
    "user": "Erika Kovacs Toth",
    "rating": 2.0,
    "message": "I tried them on as they arrived, and in within 5 minutes I had a horrible mark on my foot where it bends when walking. The tongues of these shoes are just as long as where the laces end and have a rather hard edge that are pushing into your feet.  Also, I have noticed that the piece that is hanging with the puma logo on the side is not leather, which piece goes all around where the shoe laces are. This makes me question which portion of these shoes are leather. The arch support I found OK as walking, but my feet lift out of the shoes when walking; no support for the heels at all. I am very disappointed and wonder, if anyone still made sport shoes out of real leather like earlier that I loved so much. These are a joke and will go back. The 2 stars are solely for the look and the shoe laces that have a nice heavy finish on the ends making them stay close to your feet. I am sorry for the less than desirable review, I  whish I had better experience with these."
  },
  {
    "user": "A. W.",
    "rating": 5.0,
    "message": "Color was even better in person.  Very comfortable and stylish.  My only issue is the sneaker tongue is very hard.  But I still love them!!! I would recommend.  I also purchased the black and I love them too!"
  },
  {
    "user": "Kelly McNally",
    "rating": 4.0,
    "message": "The tongue is stiff and causes blisters on the front of your foot."
  },
  {
    "user": "Tamara",
    "rating": 5.0,
    "message": "I love these sneakers! Great fit, extremely comfortable and, most importantly, easy to clean. They go well with a lot of outfits and are a perfect pick for a hot summer in NYC. 10/10"
  },
  {
    "user": "KWyatt",
    "rating": 2.0,
    "message": "This shoe was so tight and narrow. My toes hurt after a few hours of wearing. I couldn’t wait to take them off. The tongue of the shoes also rubbed the top of my ankles raw. I’ve never experienced a more stiff shoe in my life. Maybe after continuous use it would loosen up but I just couldn’t bare the pain it was causing. I has immediate relief once I took them off. I’m not sure if I have a “thick” foot but it felt like there wasn’t enough of the shoe to completely go over my ankles and so when I walked it felt unsecured. My ankle felt like they didn’t sit in the shoe all the way, I’ve not experienced that in another shoe. I returned them, I just couldn’t handle how bad they were designed. I DO NOT recommend."
  },
  {
    "user": "Tina",
    "rating": 3.0,
    "message": "Nice quality show.  Looks great.  A little more narrow than I expected but that may be the ankle surgery that had my foot a bit more swollen than normal.  No, nevermind it wasn't, these are slim shoes even on the foot without ankle surgery."
  },
  {
    "user": "Renee J. Batts",
    "rating": 5.0,
    "message": "I put my pencil skirts on and wear these to church. They’re so comfortable and I get compliments. I copied this shoe from a friend. She told how nice they were and she was so correct!"
  },
  {
    "user": "Erica",
    "rating": 3.0,
    "message": "These sneaker definitely arrive looking as I thought they would...color as advertised! The only issue I had was at the tongue area where u tie the shoe strings were painful tight. I worn them for a day trip 2 hours away. While driving I had to take them off cause the pain was killing me. They left a small bruise across the top of my foot. The shoe material was hard as a rock so these will need some breaking in. Felt as if I was wearing flippers while walking because there wasn't any bend. Meh😏"
  },
  {
    "user": "TheHammerThorkitty",
    "rating": 5.0,
    "message": "I really like these shoes, they look super cool, love the white with black toe pretty true to size. Only problem I have is they are really stiff and im sure with a little wear they will be fine"
  },
  {
    "user": "Baybound",
    "rating": 5.0,
    "message": "These shoes are so comfortable and look great! I already owned a black pair so I knew what to expect."
  },
  {
    "user": "Yolany",
    "rating": 4.0,
    "message": "Solo son un poco pesados … pero me encanto el estilo son perfectos"
  },
  {
    "user": "Allie Bakewell",
    "rating": 3.0,
    "message": "Ended up returning at Kohl’s. The reviews were right - I had read and listened to them advising to size up. I’m normally a 6-6.5 depending on the brand; I ordered a 7.5 and it was still too small. Very narrow. The shoe themselves were very cute, so it was disappointing they did not work out! The return policy was super easy, and the refund was back in my account in 5 days after the return was received"
  },
  {
    "user": "Aris  Alt. Reynoso de  almonte",
    "rating": 3.0,
    "message": "The media could not be loaded. yo pensé que esto tenis.. iban a llenar mi expectativa..primero son muy grande aunque compre tu talla..segundo son muy rígido  osea muy duro..no te dejan ni caminar..no tienen mucho soporte..si son lindo ..pero muy incomodo no lo quiero..cuando me lo pongo parezco  payasa....no pudieran tener ese precio..ni regalado lo quiero...por lo meno ami no me gustó.....esa es mi opinión..gracias"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Si eres de pie ancho recomiendo medio número más.  Para mi fueron perfectos."
  },
  {
    "user": "Trent Dudley",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Nene",
    "rating": 5.0,
    "message": "I love this shoe it does run rather small.  I ordered a 1/2 size up but should have took it up a whole size up.  Got so many compliments when I wore the shoe.  Just be sure and order next size up."
  },
  {
    "user": "Felicia Goff",
    "rating": 5.0,
    "message": "Cutest shoes ever"
  },
  {
    "user": "Kimberkaye",
    "rating": 5.0,
    "message": "I absolutely love Puma brand shoes for the styles, the colors and the comfort. I am in disbelief that I found a cute pair of GENUINE LEATHER  shoes at this price. I am always looking for quality shoes and these definitely hit the ball out of the park. They fit great and are comfortable as with all other Puma shoes I have owned. Room for the toes, the heel is cushioned and the sole is comfy as well. They do fit a little snug on the top of my foot because I have a bone that sticks up  from a foot injury, but I don't see this being an issue for anyone without this weird bone issue. I must mention-They are a little stiff at first because they are leather, but they gain flexibility as you wear them and move around. Definitely worth having in your closet!!"
  },
  {
    "user": "Amazonaholic",
    "rating": 5.0,
    "message": "Absolutely love these shoes! They take a few wears to get broken in, but they are fabulous! Easily cleanable and comfortable!"
  },
  {
    "user": "HaliB",
    "rating": 2.0,
    "message": "I bought a sportier pair of Pumas for work, they are so cushiony I love them, so I figured maybe these would have the same insoles. Well they don’t. It’s not even the insole part that kills me, it’s how stiff they are! I tried breaking them in and ended up with a blister on the bottom part of my ankle bone from where they rub. I’m keeping them just because I’ve worn them outside to break them in, and I figure maybe in the fall when I can wear taller socks or something they’ll get more use."
  },
  {
    "user": "Tiffanie",
    "rating": 4.0,
    "message": "These are beautiful but the fit is a little weird. I went with my bigger size (8 instead of a 7.5). They are tight in the middle, as other reviews mentioned, BUT my heels also tend to lift up out of the back. I've never had that issue before. It almost drags my socks down which is annoying enough to take a star away. I have high arches - I'm assuming that's the cause. They're breaking in nicely though. I feel like these are more comfortable after a few weeks of wear and the tightness will be minimal after a few more weeks. I sprayed them with Scotchgard Fabric protector before wearing to prevent stains and provide a little water resistance. I'd 100% recommend that if you get the white versions too. I also noticed the California style being sold on Free People for $90 so I feel like the $32 I paid was an extra good deal now."
  },
  {
    "user": "Tameka L.",
    "rating": 3.0,
    "message": "The shoe is cute & very stylish. I had to return for a replacement because the 1st pair I received you could see a small piece of pink string coming through the seams & the white shoe string had a brown stain on them. Received my replacement & was satisfied"
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Kindplanetposh",
    "rating": 4.0,
    "message": "Order 1/2 size up!!! Unfortunately I didn’t and have to send back. These really are a great deal at $34! I used to pay $65+ for the same style back in the 90’s. Only reason I left off a star is because something is off with the fit. I’ve always been an 8 in this style but these I could barely get on, too narrow. The arch support is high and comfy but makes heel feel like is barely on.... if that makes sense? You may risk heel slipping if you size up... maybe this shoe is best for narrow footed person in their regular size possibly replacing insole with something lower? Wish they fit, quality is high. Came brand new in box as described."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Stylish shoe that can be worn with anything."
  },
  {
    "user": "StellarMom",
    "rating": 5.0,
    "message": "Love these sneakers! Cute and perfect for the spring/summer. The leather is a little stiff and will need to be broken in (good quality)."
  },
  {
    "user": "Lily",
    "rating": 3.0,
    "message": "These shoes look beautiful. However, they are very uncomfortable. The tongue cuts into the ankle while wearing them, continually. It’s  a very narrow shoe, and when walking in them your feet come out of them at the heel slightly. There is no depth there. A very uncomfortable feeling. I wish I had kept the box, I returned them. They are so pretty that I wanted to make them work. But there is just no way possible."
  },
  {
    "user": "j",
    "rating": 5.0,
    "message": "First day wearing these, I received compliments about my shoes.  They are stylish for any age to wear and have the comfort to stand and walk in them all day."
  },
  {
    "user": "Foxy Roxie",
    "rating": 4.0,
    "message": "The media could not be loaded. Size:9w I ordered a half size larger just in case it fits a little narrow. Which I was right even tho I ordered  a half size bigger they were still a little tight across the top of my foot.I guess a good breaking in is all that’s needed. Purchased 9.5w"
  },
  {
    "user": "Grecia Bretel",
    "rating": 5.0,
    "message": "Mejor calidad en físico que la foto, el size es exacto, me encantó aún no es liviano y puede ser incómodo por el material que es duro. Quizás con el tiempo se ablande 😂😂😂"
  },
  {
    "user": "Betty Stephens",
    "rating": 5.0,
    "message": "The leather was not soft, and I expected then leather to be a little more softer. Other wise the shoe does fit"
  },
  {
    "user": "Ana",
    "rating": 3.0,
    "message": "My normal size is 9.5 in all puma shoes, wish I had sized up in this one though"
  },
  {
    "user": "Torey Jones",
    "rating": 5.0,
    "message": "If you have wide feet go up one size."
  },
  {
    "user": "Private",
    "rating": 5.0,
    "message": "This sneakers fit good,love it."
  },
  {
    "user": "Client d'Amazon",
    "rating": 5.0,
    "message": "Love these shoes."
  },
  {
    "user": "Nichole",
    "rating": 4.0,
    "message": "First of all, my box arrived very wet. I'm assuming this is not the fault of the seller but happened in the transportation process. However, they arrived in a package with a pair of boots and the boot bag was not wet. This is the reason I'm not giving 5 stars. The shoes themselves are nice. I'm pretty sure that what I'm seeing on the inside of the right shoe is water damage and if I had paid $60 for these then I'd be more upset. I don't think these shoes are for anyone who don't have narrow feet. Pumas usually fit snug and these are no exception. The first night they were almost too tight on the tops of my feet but have plenty of toe room. I stuffed them with grocery bags for two days and now they're fine. They have good arch support and other than water damage, I'm happy with them."
  },
  {
    "user": "DAMARIS RUTH HERRA BERNANBEL",
    "rating": 3.0,
    "message": "Anteriormente he comprado pumas pero de otro estilo , y en esos era 9.5 , en este lógicamente ordené el mismo size y me quedo ligeramente más grande , como si mi size fuera 9 , el talón de me sale un poco al caminar y esto me molesta. Pienso seguir usándolo pero no con el propósito inicial de mi compra , ya que lo quería para un everyday kinda shoe"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Shoes look good, but they have a very tight toebox. It looks like the shoes won't stretch either because they are made of synthetic materials, not \"Leather\" as the description says. They look great when I can squeeze my feet into them, but then I suffer if I wear them for more than about an hour. I would definitely return these if I hadn't missed the return window."
  },
  {
    "user": "rocio estrada",
    "rating": 5.0,
    "message": "Calce perfecto, muy cómodas. No llegó a tiempo."
  },
  {
    "user": "Onita Morgan-Edwards",
    "rating": 3.0,
    "message": "Great looking shoe but not quite wide enough for my feet."
  },
  {
    "user": "Alfredo Abich Fernández.",
    "rating": 5.0,
    "message": "Buena calidad"
  },
  {
    "user": "Vida Henderson",
    "rating": 5.0,
    "message": "Fits just fine"
  },
  {
    "user": "Ren",
    "rating": 4.0,
    "message": "The shows is a bit small for size nine I usually wear a 9 in sneakers but this 9 was way too exact and it runs the back of my foot give it a water bump at the back"
  },
  {
    "user": "Dombi renata",
    "rating": 5.0,
    "message": "Products still is like original. Great shoes . Fits perfectly"
  },
  {
    "user": "Susan M.",
    "rating": 5.0,
    "message": "Great looking sneaker. Size 9 was a little narrow for me."
  },
  {
    "user": "Gabrielle",
    "rating": 2.0,
    "message": "I bought these shoes. They went perfect with the golfing outfit I picked out and they were very cute on. However, these ran very small. My feet were dying while I was at the event. I had to leave early and take a lot of breaks from walking because my feet were killing me. I’ve never had a pair of sneakers do that before. I would’ve returned, but I paid $12 for shipping so I just gave them to my mom, her feet are smaller than mine. She hasn’t worn them yet. I’m so bummed they didn’t work out because I love the look of them."
  },
  {
    "user": "MT",
    "rating": 4.0,
    "message": "After breaking in, these are fairly comfortable, but still a little stiff!! The leather on the top part is also a little more green-toned than I anticipated, but still very cute!"
  },
  {
    "user": "Oscar",
    "rating": 4.0,
    "message": "Están pesados, no cómodos y salen 1/2 número más pequeño del usado."
  },
  {
    "user": "Shanon",
    "rating": 5.0,
    "message": "Ok just so everyone knows these come in a womans size, I'm a size 5.5-6y in boy's depending on the sneaker, In these I got 2 pairs 1st pair 6.5y way to small I had to loosen sho laces and take out soles which they now fit but no extra room at all in all black ones, I bought all white pair and bought a size half up this time a size 7y and they fit perfectly on me I like my sneakers tight so the 7y is perfect,just know to go a half size up because they do run very small and there womans which womans are smaller than boys,mens etc. I LOVE MY 2 PAIRS THEY GO PERFECTLY WITH ALL MY LEGGINGS WHICH I HAVE AND GREAT WITH ANY TYPE OF CLOTHING!! THEY DO RUN SMALL!!!"
  },
  {
    "user": "EllieMae",
    "rating": 3.0,
    "message": "The shoes are nice and fit to size, they are narrow and tight though.  Little arch support, with inserts i hope with fix that.  They are very uncomfortable don't wear if you're doing a lot of walking, at least until they are broke in. Been on my feet all day and they about near killed me. After wearing them for a while I'm a little disappointed.  The toe is cream the rest of the shoe white,  they look dirty even though they are brand new.  I have boney feet and they rub and hurt my feet every time I wear them, especially the left one,. It rubs on the bone of my left foot and leaves my feet absolutely killing me. Will never buy again."
  },
  {
    "user": "Mya R. McAndrew",
    "rating": 3.0,
    "message": "I love these shoes, they’re look great! BUT… they are very snug and stiff, considering It says they run true to size and I bought my size. the tongue digs into my ankle and my heel pops out when I walk. I’m hoping that when they break in better they won’t be so stiff and many of these issues will go aways."
  },
  {
    "user": "Chelsea M.",
    "rating": 3.0,
    "message": "Ordered a 1/2 size larger based on other reviews and the length is perfect, but so very narrow. Went out for a day of errands and was left with bleeding sores."
  },
  {
    "user": "Rita",
    "rating": 2.0,
    "message": "The shoes fit for the most part, but they are not comfortable.  I can only wear them for a couple of hours and have to take them off."
  },
  {
    "user": "Kindra Stephen",
    "rating": 5.0,
    "message": "The shoes fit very well. I am a size 9, and contrary to the advice to size up, I went with a 9 and it fit perfectly. FYI, my feet are also wide width, so normal size shoes does sometime fit tightly (especially stilettos) or not at all. It is a bit sturdy at first (typical of leather), but will loosen up after some time. I am very satisfied with my purchase and my decision to take one true to size."
  },
  {
    "user": "Sue",
    "rating": 5.0,
    "message": "Need to break them in a little but love them"
  }
]