[
  {
    "user": "Gggirlgeek",
    "rating": 5.0,
    "message": "I can't believe how fricking adorable these are. It's been a very long time since I've like new shoes this much. They are much cuter than I even expected. Very comfortable too. Lots of cushion inside. I am getting professional orthotics soon and there is enough room in these (with the stock inserts removed) that they should be fine, and still look good. I like how they don't look too big even though I have large feet. I can wear them with skirts. Very chic! I wear a size 9.5 in most American shoes and a 10.5 fits perfect. If I intended to wear thick socks or stand up for a long time I would get an 11 though."
  },
  {
    "user": "Julissa Galvez",
    "rating": 4.0,
    "message": "So I want to give this review almost 5 stars but the reason why I wouldn’t is because not even the first week and the white started to flake where the shoe begins the crease, it’s not horrible but I’m sure these shoes aren’t going to last long since I wear them with a lot of outfits. However, they are super comfortable they’re great for work if you have to walk or be on your feet and they are very stylish. You don’t have to break them in and they keep your toes with a lot of room. What I try to do is at the end of the day stuff the shoe with a big sock so the creases/ flakes don’t get bad. I don’t regret my purchase :p"
  },
  {
    "user": "Vick1989",
    "rating": 4.0,
    "message": "I really like these cute and casual sneakers. I treated them with a stain and water-resistant spray prior to wearing them to make sure they stayed white. They are a bit clunky though. A little chunkier than I had expected. All in all, they are perfect for casual wear!"
  },
  {
    "user": "Anne",
    "rating": 5.0,
    "message": "I was so excited when I got these tried them on they were too short and my foot flopped out of the back so their going back I wear a size 9, which that’s what I purchased, and I always buy pumas"
  },
  {
    "user": "Stella LeBlon",
    "rating": 5.0,
    "message": "Arrived Over-Night (Got Lucky) Wow, I'm in LOVE! - My new standard in a sneaker moving forward. I wear a 9W and these truly fit to size, I read reviews urging to size up but opted to go w/my norm & very happy I did! - I have purchased/worn Skechers for more than a decade and I must say, These Puma Sneakers (White/Silver) are a DREAM! - I have diabetic Neuropathy (Severe Nerve Damage) in feet & these shoes feel like a slice of heaven. Will put to true test as work shoe, I work for big box retailer so, let's see how they do after an 8hr shift ... Very Happy Lady Here! ... Buh Bye Sketchers, Hello Happy Feet!"
  },
  {
    "user": "Laur",
    "rating": 5.0,
    "message": "Comfortable, fit as expected. Have had them for well over a year now and I wear them frequently. Whenever they get dirty I just use a magic eraser on them and they look good as new."
  },
  {
    "user": "betty",
    "rating": 4.0,
    "message": "I love the style of these shoes. They are nicely padded. I am a true 6.5, and ordered a 6.5, but they seem to run small. Keep that in mind when ordering. Would recommend."
  },
  {
    "user": "Sonya",
    "rating": 5.0,
    "message": "Runs true to size and will stretch out half size up.  I was surprised at how comfortable and how mush arch support these platforms provide. Very comfortable shoe.  So comfortable infact that I will order Pumas before order Van's which was my preference before stumbling onto these."
  },
  {
    "user": "VJ May",
    "rating": 5.0,
    "message": "Comfortable shoes but length of shoe is slightly short. My foot is 10.5 but that size typically isn’t sold with many brands for women. The Puma womens size 11 fits more like a 10.5. I’m not complaining and only pointing it out for those that need a true size 11. You might consider going up a half to full size."
  },
  {
    "user": "Jolly Emanuel",
    "rating": 4.0,
    "message": "I generally wear a size 6 so I got a 6. I couldn’t immediately tell when I tried it on but after wearing it for a day, my toes are so cramped in the front of the shoe. My feet keep slipping out of the shoe when I walk sometimes so I think it’s just the toe box that is too small. Other than the sizing, the shoes are comfortable. The base has some cushioning, which is nice"
  },
  {
    "user": "Debo",
    "rating": 5.0,
    "message": "You might want to size up a half size. I wear a 9.5/10 and purchased the 10. The fit is a bit tight, but I’ve worn them several times and used a shoe stretcher and they fit perfect now."
  },
  {
    "user": "Christine",
    "rating": 5.0,
    "message": "I'm typically a size 9.5 or 10. I ordered a 10 in these and probably could've sized up to a 10.5. They're a little snug at the toes but otherwise super comfortable for daily wear! I walked around Asheville NC for 5 hours in these without any issues. Easy to wipe clean if anything gets on them too. Would def recommend these but advise that you may want to size up 1/2 a size from what you normally wear."
  },
  {
    "user": "DENISE SMITH",
    "rating": 5.0,
    "message": "This is a nice basic white sneaker and the price was a steal.  Half the price that you would pay in the store.  This was a great deal."
  },
  {
    "user": "MARY",
    "rating": 5.0,
    "message": "I normally wear a size 9. A couple of reviews suggested sizing up, and I’m glad I went with a 9.5. These are cute! I hate wearing shoes all day. I wore these for 18 hours one day last week with no issues."
  },
  {
    "user": "Leslie",
    "rating": 4.0,
    "message": "Shoe is wide and runs small. I normally wear a size 6.5. Returned the 6.5 for a 7. My toe is still touching the tip of the shoe. Shoe also runs a bit wide with no arch. Not overly comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes look great, they’re super white, and they clean easy! They are super comfortable and versatile. Definitely recommend!"
  },
  {
    "user": "BETH",
    "rating": 5.0,
    "message": "These shoes are amazing! I absolutely love them and they are super cute! I wear mine without socks so size may be tighter if you do. I love the bright white and thicker sole. Gives it a really classic look. I bought the high tops too!"
  },
  {
    "user": "Michelle",
    "rating": 4.0,
    "message": "These shoes are the perfect white color but anyone who says they’re true to size is straight out lying 😭 a size 6.5 fits me perfectly in almost all shoes but these were extremely TIGHT. They have memory foam inside that makes it even more compact. I don’t even know if a 7 will be good enough because my foot was smushed in the 6.5. SIZE UP! Either half or a whole size up!"
  },
  {
    "user": "Marietta Rodriguez",
    "rating": 5.0,
    "message": "Super comfortable and super cute! Bought them for my birthday party that’s up coming and it looks great with these socks and my dress. Totally recommend. I have flat feet and shoes always cause issues but these fit so comfortably and perfectly."
  },
  {
    "user": "Adriana",
    "rating": 5.0,
    "message": "Son súper suaves yo uso 6 y medio pero no podía mover los dedos son angostos sugiero pedir por lo menos media talla más"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Super cute absolutely love these! Size up half a size and they’re super comfortable. I originally got a 8 which is my normal size and returned for the 8.5 so I had a little but more room. I love these!!"
  },
  {
    "user": "Brooklyn16",
    "rating": 4.0,
    "message": "Great shoes however I got THE worst blisters on the back of my ankles from wearing these the first time for about 4 hours. Make sure to wear high enough socks. Ouch"
  },
  {
    "user": "iffy",
    "rating": 5.0,
    "message": "Brand new. Comfortable. Very light and breathable. Great for the price. A little stiff at first but easy to break in."
  },
  {
    "user": "KAB",
    "rating": 5.0,
    "message": "I loved these shoes so much, I bought them a second time. Clean look, comfortable when my day consists of a lot of walking and standing. Easy to spot clean."
  },
  {
    "user": "Amanda",
    "rating": 5.0,
    "message": "Love the look,  a little heavy. I got them really dirty at a music festival but they were easy to clean and they even held up in the washing machine.  Good purchase!"
  },
  {
    "user": "Nancy G Borjas",
    "rating": 4.0,
    "message": "I ordered half a size bigger than my usual sizing due all the reviews about this being smaller. Was a great choice, they fit me just right."
  },
  {
    "user": "Ginger in NC",
    "rating": 4.0,
    "message": "I got the product half off - and realized it was bc it was missing the box.  There were no extra laces included and mine had a stain on them.  The shoes are fine and squishy but they are tight down on the toes.  They don't bend easily and slip off my heels."
  },
  {
    "user": "Elizabeth S.",
    "rating": 5.0,
    "message": "I have plantar fasciitis and these shoes offer support/cushion for my heel. I get tons of compliments about how cute they are. I ordered a half size up based on the reviews and I am glad that I did."
  },
  {
    "user": "Fashionista",
    "rating": 4.0,
    "message": "I love the memory foam in the inserts like the material is easy to clean good for going out but not for long distance walking"
  },
  {
    "user": "JP",
    "rating": 5.0,
    "message": "Great shoe! Love wearing them out and to work. Comfortable & clean looking! Worth the price!"
  },
  {
    "user": "Vicky Vergara",
    "rating": 5.0,
    "message": "Zapatillas muy agradables y livianas"
  },
  {
    "user": "Kate",
    "rating": 4.0,
    "message": "Love the shoe, but my goodness... they run so small! I am a size eight and even the 8.5 was too small.  Ordering again to try a nine :/"
  },
  {
    "user": "Adriana Garcia",
    "rating": 4.0,
    "message": "Size up half a size or one size up I usually wear a 7 and got a 7.5 and they fit good ! The box was all torn up tho but didn’t affect the shoe"
  },
  {
    "user": "Gabi",
    "rating": 5.0,
    "message": "I would definitely listen to the reviews and size up by half or full size. I wear a 9 and purchased a 9.5 and they are perfect! Super comfortable and cute!"
  },
  {
    "user": "Maryann Vela",
    "rating": 5.0,
    "message": "Good arch support, comfortable puma shoes . Fits true to size."
  },
  {
    "user": "Customer",
    "rating": 4.0,
    "message": "I love these shoes! They’re so cute, simple, and comfortable but just a little heavy. I normally wear a size 10 but read some reviews and decided to size up since I have wider feet which was definitely a good choice. A size 10 would have been too small, so if you have wider feet size up!"
  },
  {
    "user": "Melinda S.",
    "rating": 5.0,
    "message": "Very cute and comfortable. I am very happy with these comfy shoes"
  },
  {
    "user": "Chely Pinto",
    "rating": 5.0,
    "message": "Muy lindos y super cómodos."
  },
  {
    "user": "Elisa Munoz",
    "rating": 4.0,
    "message": "The fit is too just right so get it half a size bigger so you may walk comfortably for a long period of time"
  },
  {
    "user": "Meredith G",
    "rating": 5.0,
    "message": "Walked around in NYC in these and have been wearing them ever since."
  },
  {
    "user": "Shelly",
    "rating": 5.0,
    "message": "I love all Puma sneakers. These are probably my 12th pair & I love how they fit. They go with everything. The all white is easy to keep clean in that they’re not suede or cloth. Just wash them off and they still look new."
  },
  {
    "user": "Betty",
    "rating": 5.0,
    "message": "Nice, cute shoe"
  },
  {
    "user": "Annika Anand",
    "rating": 5.0,
    "message": "Great find! It does run smaller but I was able to go up a size and they are very comfortable."
  },
  {
    "user": "alexandra",
    "rating": 5.0,
    "message": "Super comodos, el size concuerda, el color es un blanco colonial. Los ame"
  },
  {
    "user": "Marcos Armando Naula Bermeo",
    "rating": 5.0,
    "message": "Cómodos y excelte precio"
  },
  {
    "user": "Nicole",
    "rating": 4.0,
    "message": "These are comfortable, cute white sneakers at an affordable price. Saw reviews saying they run small, so I ordered a half size up and they fit me well. (I think the \"SoftFoam\" insert causes the size to fit smaller than usual.) I got the all white color which has a leather upper; I bought them from Amazon as the seller and the ones I got do not look fake and are real leather. The sole is a little thicker & has a little more height than my Stan Smiths. I'm a little worried that the ridges around the sole will get dirty easily, but I treated them with a water repellant spray before wearing & wipe them after each wear to try to keep them clean. Been wearing them for a couple of months, and I would buy these again especially for the price and given that they are leather."
  },
  {
    "user": "felecia",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Jordan Harris",
    "rating": 5.0,
    "message": "I was really skeptical about these based on the reviews but I’m SO happy I got these! I’m usually a size 6 but because I have wider feet, I decided to order a 6.5 and it fit perfect! They did not rub on my heel whatsoever and the cushion is perfect since I have high arches! Loved these so much more than I thought I would! Amazing!"
  },
  {
    "user": "Marianne S.",
    "rating": 5.0,
    "message": "It’s cute but size up"
  },
  {
    "user": "burji",
    "rating": 5.0,
    "message": "visually very high quality made, very soft and comfortable, I don’t know how it will be in practice"
  },
  {
    "user": "Jennifer brown",
    "rating": 5.0,
    "message": "Perfect shoes and good comfort"
  },
  {
    "user": "Diana Glass",
    "rating": 5.0,
    "message": "Bought these in my normal size but they ran short so I went up a size and they are great.  Nice looking sneaker, even got a compliment from my 7th graders!😳"
  },
  {
    "user": "Tanya Romano",
    "rating": 5.0,
    "message": "Bastante bonitos y cómodos"
  },
  {
    "user": "Patricia W",
    "rating": 5.0,
    "message": "These are the cutest shoes."
  },
  {
    "user": "Linda Y Rindt",
    "rating": 5.0,
    "message": "Walking when traveling"
  },
  {
    "user": "Tiffany seering",
    "rating": 5.0,
    "message": "These shoes are sooooo cute and I love the comfort they provide. Something I did notice however, as someone who sweats through their feet a lot, these shoes are not “lightweight” the leather is pretty thick and the shoe is very hot as you walk through the day. 30 minutes into my walk I was sweating all over due to my feet getting too hot. Gonna try again on a cooler day and see what results I get."
  },
  {
    "user": "Annette Hall",
    "rating": 5.0,
    "message": "Amazing look and fit. Very pleased with the quality and price."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very comfortable."
  },
  {
    "user": "LorenaV",
    "rating": 5.0,
    "message": "Me gustaron mucho, son cómodos y bonitos"
  },
  {
    "user": "Jasmine",
    "rating": 4.0,
    "message": "Nothing to write home about, but the shoes fit well and look cute. They are also very easy to clean and I like that they can dress and outfit of mine up or make it more casual."
  },
  {
    "user": "Loli",
    "rating": 5.0,
    "message": "So comfortable and fit was perfect!"
  },
  {
    "user": "Mom",
    "rating": 4.0,
    "message": "Cute, comfy, but a bit hot to wear for long periods."
  },
  {
    "user": "martha burch",
    "rating": 4.0,
    "message": "Runs small, otherwise great shoe"
  },
  {
    "user": "Nat",
    "rating": 4.0,
    "message": "They felt ok the first time - thought they’d stretch a little bit but need more time. Wish I could have returned them but waited too long. Order a half size up tho!"
  },
  {
    "user": "C. Nelson",
    "rating": 5.0,
    "message": "It is very cute... I really like the item."
  },
  {
    "user": "traci",
    "rating": 5.0,
    "message": "Love these shoes! Currently my favorite pair. Look great with jeans, loose linen pants, just about anything. Absolutely perfect fit, didn’t need to size up or down. No break in period needed. Highly recommend!"
  },
  {
    "user": "Ann",
    "rating": 5.0,
    "message": "Love these sneakers !!! They look so cute with jeans or shorts"
  },
  {
    "user": "orlando Llano",
    "rating": 5.0,
    "message": "Very cute and good material, easy to clean. Very happy with them."
  },
  {
    "user": "Elizabeth Cooper",
    "rating": 4.0,
    "message": "Shoes are cute, but are a bit on the small side. The toe box is fairly narrow"
  },
  {
    "user": "JODY RANKIN",
    "rating": 4.0,
    "message": "I agree with many other reviewers, these shoes run small.  They are very stylish and I’ve gotten many compliments on them, but I ordered a half size bigger than my usual shoe size and they are still a little snug, but wearable. Definitely size up and try before you buy if you can."
  },
  {
    "user": "John S",
    "rating": 5.0,
    "message": "Very nice shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This shoe is not only cute, but very comfortable. Highly recommend. True to size. I will definitely be buying this shoe again!"
  },
  {
    "user": "Erika Martinez",
    "rating": 5.0,
    "message": "Loved them!"
  },
  {
    "user": "Xavier",
    "rating": 5.0,
    "message": "Si perfecto"
  },
  {
    "user": "butter",
    "rating": 5.0,
    "message": "I wanted to give them a three and a half star for the weight but they didn't provide us with halves but they are comfy"
  },
  {
    "user": "D. Davis",
    "rating": 5.0,
    "message": "These are very comfortable.  I worn them while traveling and I didn't have tired back or feet.  Pretty stylish and people compliment me all the time when I where them with shorts or capri's."
  },
  {
    "user": "Allie Loy",
    "rating": 5.0,
    "message": "Very nice shoes"
  },
  {
    "user": "Amber Granberg",
    "rating": 4.0,
    "message": "LOVE how these shoes feel. I’m usually a 6.5-7 but I was like a 9 in these for some reason. Super comfy. My only complaint is that i bought a pair and the left shoe started squeaking SO BAD. Not sure why, but it was to the point where it would be embarrassing to walk into my classes. They also have a slight crease in the front that came around soon after buying. Not sure if it’s the shoe itself, my weird feet, or a combination of both. I can ignore these for how comfortable and cute they are"
  },
  {
    "user": "Kelley C",
    "rating": 5.0,
    "message": "These shoes are so comfortable!"
  },
  {
    "user": "Brittany",
    "rating": 5.0,
    "message": "I love the quality of the shoe however they are super tight and did rub on my ankle but after breaking them in it wasn’t as bad I do suggest breaking them in before bartending though lol!"
  },
  {
    "user": "Janie",
    "rating": 5.0,
    "message": "The toe area was tight and had to be stretched a bit.  I did have to order a half size larger for a more comfortable fit. I love the style and they’re easy to clean."
  },
  {
    "user": "Roxana",
    "rating": 5.0,
    "message": "The shoes are so comfy. I wear them all the time with jeans, casual dresses, whatever. Love them."
  },
  {
    "user": "Kinyon Stewart",
    "rating": 5.0,
    "message": "Just Right"
  },
  {
    "user": "Kem Kem",
    "rating": 4.0,
    "message": "Would have gotten 5 stars if it wasn't so close fit...literally sized up and was still too tight! Took out the inners and it's a great fit!!!"
  },
  {
    "user": "elizabeth concepcion rosado",
    "rating": 5.0,
    "message": "Excellent"
  },
  {
    "user": "Manushi",
    "rating": 4.0,
    "message": "I really like my sneakers. They are so comfortable. I always get .5 size bigger to have some room for socks. And these sneaker fits me well. Easy to clean. And looks cute with l summer dresses."
  },
  {
    "user": "Sarah",
    "rating": 5.0,
    "message": "The shoe fit just as expected, the inside is foam which I love. Such a cute everyday casual shoe!"
  },
  {
    "user": "Splen",
    "rating": 5.0,
    "message": "Very nice shoe and so comfy.  I love Puma's."
  },
  {
    "user": "ruth",
    "rating": 5.0,
    "message": "I was looking for white sneakers and these are perfect. True to size and comfortable."
  },
  {
    "user": "Juan encaracion",
    "rating": 5.0,
    "message": "Sencillamente perfecto me encantaron"
  },
  {
    "user": "Nyna",
    "rating": 5.0,
    "message": "Needed an all-white option and these are perfect."
  },
  {
    "user": "Shanny",
    "rating": 4.0,
    "message": "These are so cute! Especially with jeans or a maxi dress! I’m a true 7 and know I need to go up a half size in running shoes but these are still snug. Got a 7, returned for 7.5. Tried thinner ankle socks and hope they break in and loosen up. 8’s May had made the heel slip. I’m not sure but for the price, I’ll stick em out and see if I can break them in more."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Cute, comfortable, go with anything, great quality!"
  },
  {
    "user": "Aline Tavares",
    "rating": 5.0,
    "message": "Is very beautiful and comfortable"
  },
  {
    "user": "Shaquella",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "Mel",
    "rating": 4.0,
    "message": "These are cute shoes, but I was disappointed with the fit. They’re not very flexible and fit a little tight near my toes."
  },
  {
    "user": "Kemeshia Mitchell",
    "rating": 5.0,
    "message": "My Pumas were much more comfortable than expected. This is the first time I tried this brand. In my opinion, they are more comfortable than any of my Nikes.  I will shop this brand more often."
  },
  {
    "user": "Inglish Grover",
    "rating": 5.0,
    "message": "Size 11 Womens…fits as expected and are extremely comfortable."
  },
  {
    "user": "Brittany",
    "rating": 4.0,
    "message": "They're comfortable, they're cute, and the price was right. The only thing I'd say is just that they crease at the toes very easily. Within one or two wears I already had creasing in the leather at the toe area. Other than that they're nice."
  },
  {
    "user": "Diana",
    "rating": 4.0,
    "message": "I always use 7.5 or 24.5 CM and this one didn’t fit me.  They are like half number small. I had to return them.  Other than that everything is good"
  }
]