[
  {
    "user": "Julia X",
    "rating": 5.0,
    "message": "I have size 10 1/5 relatively narrow women's feet, and was not able to wear the regular Chuck Taylor shorelines (they totally fell right off my heels with the first step), and the classic Chuck Taylors were unflatteringly long while still pinching my little toe at the narrow tip and still slipping at the heal.  The high tops stayed on - but of course all that lacing and unlacing was a bit of work to go through for daily wear.  Finally I tried these knit version - resisting for a while thinking they'd look like imposters and lose the whole cool aspect of the originals - and I immediately fell in love; the fit, comfort, support and ease to pull on/off is huge improvement - and they have at least 99% of the cool factor of the originals. The don't run quite as oversized as classic Chucks - for point of reference I'd wear a size 7.5 in men's (while my normal size is 10.5 women's).  However, in these knit version for Women, I wear a 9.5 women's.  Still a whole size down. I wear them with moderately thin socks - not dress socks, but not thick athletic socks.  If I put on athletic socks they'd be too tight. So I suppose if I wanted to wear thicker socks, I'd have to get a 10 (only 1/2 a size smaller than my norm).  If you have average width feet (not narrow like mine), you might even find that they fit true to size without sizing down at all."
  },
  {
    "user": "Penny H.",
    "rating": 4.0,
    "message": "These are lighter than regular converse. When they arrived I thought at first they had sent the wrong shoe. The laces are short and we’re tied in a knot on top of the 4th eyelet, and I don’t care for that style. But I loosened the knots, then ran the laces over the eyelet, instead of under it, then tucked it in, which gives you the look they picture here. Once I realized I could do that successfully, I decided to keep the shoe. It squeezes a bit on the top of the foot. Hopefully that will loosen up, and my 6 1/2 feels more like a 7, but with the squeeze on the top of the foot, so slightly larger than normal and a top of the foot squeeze if you have high arches."
  },
  {
    "user": "Halie Van Allen",
    "rating": 4.0,
    "message": "Cute shoes! My feet are a 10, regular converse run a bit snug on me in my normal size as I have wider feet, so I figured these would be perfect. I was surprised how easily they slipped right onto my foot.  I really could have gotten away with a 9 or 9 and 1/2. That's unusual with my feet, because most of the time I have to size up.  If your feet are wider than a medium width these are super comfy but keep in mind the size, I would order at least a half size down."
  },
  {
    "user": "Stephanie M.",
    "rating": 5.0,
    "message": "I would literally buy these shoes in 50 colors. They’re so comfortable, stretchy and perfect for someone who is on the go. Make sure you follow the sizing guide. I typically wear a size 8, but sized down to a 7.5 per the sizing guidelines and they fit perfectly. Buy these- you won’t regret it!"
  },
  {
    "user": "Ashten",
    "rating": 4.0,
    "message": "Super happy with this product but had to return and get a smaller size."
  },
  {
    "user": "LaWanda Price",
    "rating": 5.0,
    "message": "I like the gather back to keep the shoes on"
  },
  {
    "user": "Crys GR",
    "rating": 5.0,
    "message": "These are very comfortable , Follow instructions and size down at least a half Size . I get compliments all the time"
  },
  {
    "user": "Haley Daniels",
    "rating": 5.0,
    "message": "They are exactly as described"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love the look of these sneakers however getting them on can be a bit of a bear.  I still love them and will wear them a lot though!  Very comfy and cute!"
  },
  {
    "user": "Nichelle K.",
    "rating": 4.0,
    "message": "My new favorite sneaker - always loved the look of Converse, but never found them comfortable - until I purchased these!"
  },
  {
    "user": "Regina Lancaster",
    "rating": 5.0,
    "message": "Converse are great shoes and have been around for years. I like the fact they just slip on."
  },
  {
    "user": "May Fale",
    "rating": 4.0,
    "message": "I initially bought a size 9 and had to return and get a size 8. Although, there’s a tad bit of space in the front of the shoe, I guess I’ll go with it. It is a little too snug fit but maybe if I break em in, it’ll loosen up a bit lol but they’re awesome so far."
  },
  {
    "user": "Tara",
    "rating": 5.0,
    "message": "Comfy stretchy upper I always get compliments on them !"
  },
  {
    "user": "D. Stewart",
    "rating": 4.0,
    "message": "I wear a 6.5 but these run large so they fit like a 7 or 7.5. As long as I wear socks they are not too loose. Cons always look great, the lightweight material is perfect for Fl summers, so other than being a tad too big they are perfect."
  },
  {
    "user": "ashley",
    "rating": 5.0,
    "message": "I did have to do a 1/2 size smaller. But, I LOVE THEM! I get so many compliments."
  },
  {
    "user": "Jose Alfaro",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Mary Mcadams",
    "rating": 5.0,
    "message": "Love these shoes"
  },
  {
    "user": "Maria Rios",
    "rating": 4.0,
    "message": "Giving these to my granddaughter. Have to size down two sizes"
  },
  {
    "user": "Desire",
    "rating": 5.0,
    "message": "I bought these to wear to a converse themed party and they were perfect. Based on the reviews, I decided to go down one size to a 6 and that worked out very well. They're made of a stretchy, breathable material and require no lace tying as they slip on easily."
  },
  {
    "user": "Geiger Lyric",
    "rating": 3.0,
    "message": "Ordered a full size down and they fit like others put it, clown shoes. I have narrow feet, ankles and skinny calves. Tried tightening them but still too wide. They feel like they could  be comfortable. Returning to exchange. I like them regardless of the size issue. Ordered another 1/2 size down bringing the total size down 1.5 from my smaller general size. Mens sizes?  Will update. Update : from a 7.5 to a 6, could probably do a 5.5. I’m not sure that I’m going to keep them. They fit better with a light ankle sock. It prevents them from slipping off in the back. They’re cute but not on my thin legs. Maybe with pants but for the price, I’m not sure that it’s worth it. I took a star off for the hassle/fit and another for the cost. They are light weight. Not sure what it is but look super long. A lot of people have said they are for narrow feet. I don’t find that."
  },
  {
    "user": "Nikki",
    "rating": 5.0,
    "message": "Great shoe! The material makes it light weight and breathable! Extremely comfortable!"
  },
  {
    "user": "Dee",
    "rating": 5.0,
    "message": "Oooh boy, these are exceptionally cute! They slip on like socks and the stretchy woven fabric make them perfect for summer...or really, anytime of year. I've worn Converse for decades and these are definitely my new favorites!"
  },
  {
    "user": "Kathalene",
    "rating": 4.0,
    "message": "These are by far the most comfortable converse i owned and its stretchable, but they run big so beware."
  },
  {
    "user": "S. Curtis",
    "rating": 5.0,
    "message": "These are my new favorite shoes!  Gonna get em in another color!"
  },
  {
    "user": "Mari Prado",
    "rating": 5.0,
    "message": "These converse are very comfy. After reading the reviews and knowing converse run a little bigger i went down half a size. I'm normally a size 7 but ordered a 6.5 and it fits perfect. I got them mine in grey."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I absolutely love these shoes. Easy on and off and look nice too."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Huge on me"
  },
  {
    "user": "KW",
    "rating": 5.0,
    "message": "I am usually a 9 or 8.5; the canvas version I have a pair in 9s. I am so glad I read reviews first. I got the 8 and still had some room in the toes. Super stretchy and comfortable. Very excited to wear these."
  },
  {
    "user": "Priscila (Yemi) Brown",
    "rating": 3.0,
    "message": "They are lightweight but just so so on comfort and way too big"
  },
  {
    "user": "Liz",
    "rating": 3.0,
    "message": "snug"
  },
  {
    "user": "Slim Shady",
    "rating": 5.0,
    "message": "The mesh Chuck Taylors slide on easily and look great.  I wear a size nine and they were too big.  Not sure as to why.  I will try an 8.5 instead.  Would love for Amazon to have more colors such as Hyper Magenta/black/white.  Now that color is fire!"
  },
  {
    "user": "Manuel",
    "rating": 5.0,
    "message": "na"
  },
  {
    "user": "Sebas",
    "rating": 5.0,
    "message": "Great product, fit as expected, exactly as the photos."
  },
  {
    "user": "April Robison",
    "rating": 4.0,
    "message": "I ordered these first in a size 7.5, usually I wear a 7.5 to 8 depending on the shoe or boot, but they were so long when I ordered them, I couldn't believe it...I returned and ordered a 7.  They feel awkward, and I was inclined to return them.  Long and NARROW.  I thought they must be a narrow width by mistake, but I looked at the tag, and no...just the way they turned out.  I also don't feel much of an arch support (I don't usually need one) but my foot \"rolls in\" a bit, and I've never had that happen before.  I don't wear shoes w/o socks, and was looking to see what style of sock I can wear with them, so apparently I've decided to keep them.  They are cute.  I love the color.  Not sure I can go without socks...and if you have a wide foot, or a flat foot, better avoid this one."
  },
  {
    "user": "Mary Leroy",
    "rating": 5.0,
    "message": "These converse remind of the look of Sperrys. Perfect for a dressy casual look. I usually wear a 6.5/7 depending on the shoe and I ordered a 6 and they fit perfectly. It’s a slim fit because of the material so if someone has wide feet these shoes might not work for them."
  },
  {
    "user": "TereseNicole",
    "rating": 4.0,
    "message": "Nice and stretchy, but runs big. Hopefully I can return it for a smaller size."
  },
  {
    "user": "brooksie09",
    "rating": 5.0,
    "message": "Probably my best shoe purchase in recent memory. Even if they're labeled \"women's,\" Chucks always run large ... I wear a 7.5 or an 8 in most shoes but ordered these in a 6.5, and they're perfect. I've barely taken these off since the first time I wore them ... timeless and adorable. A+ sneaks."
  },
  {
    "user": "Francine Blackwell",
    "rating": 5.0,
    "message": "Lightweight and stylish"
  },
  {
    "user": "MsMel",
    "rating": 5.0,
    "message": "Very stylish and comfortable. Nice light weight breathable spring summer shoe for when you don’t want to wear sandals. I sized up half size like reviewers recommended and they fit perfectly."
  },
  {
    "user": "Robin Smith",
    "rating": 5.0,
    "message": "I received them with a security device attached. Can not remove it so I need a suggestion."
  },
  {
    "user": "Wanda",
    "rating": 5.0,
    "message": "Chucks run a size large for me. I am normally a 9, tennis shoes 8 1/2, but I get my Chucks in an 8. This is one of the most comfortable pair I have."
  },
  {
    "user": "elssy",
    "rating": 5.0,
    "message": "Me encanto"
  },
  {
    "user": "S.Huff",
    "rating": 5.0,
    "message": "Great gift. Wish the price was as the manufacturer had intended and not marked up because the shoe is out of stock on other platforms."
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "Fitting bigger than I expected"
  },
  {
    "user": "Leticia",
    "rating": 3.0,
    "message": "The shoe is cute but when you walk the tongue rubs against my skin and makes it uncomfortable for that reason I had to return. Also it runs large"
  },
  {
    "user": "Andrew Comeaux",
    "rating": 5.0,
    "message": "Loved the shoe but could go down half size."
  },
  {
    "user": "Robin Porter",
    "rating": 5.0,
    "message": "Looks fun & Breezy at the beach!"
  },
  {
    "user": "Michelle Wright",
    "rating": 5.0,
    "message": "my old converse are beat up and needed a new pair - thought I'd try these"
  },
  {
    "user": "Taneeya",
    "rating": 5.0,
    "message": "They are perfect just make sure you order a whole size down!"
  },
  {
    "user": "Kim",
    "rating": 5.0,
    "message": "Great color… runs a little big"
  },
  {
    "user": "Evelyn",
    "rating": 3.0,
    "message": "Dislike because they are really large!"
  },
  {
    "user": "Zarif",
    "rating": 5.0,
    "message": "Awesome. Will buy agai1n"
  },
  {
    "user": "Kiki Abe",
    "rating": 5.0,
    "message": "I wish I had read all the reviews BEFORE purchasing my first pair. First, I received them sooner than was indicated. Yay! However, before they arrived in all my excitement, I decided to take a look at the reviews. I did NOT read the reviews thoroughly. I was in dismay when I read from reviewers that going down a size is recommended! I immediately ordered a new pair. I am a size 11 US/42 EU. I was shocked to find my feet swimming around in these shoes. I had way more space than I really needed. I do plan on wearing socks but they actually look large on my feet. I have narrow feet so, there is just no filling these out. I do hope the size 10 will fit just fine since there is no half size. These are lovely shoes and I wish I could order in every color. A must have in your summer wardrobe."
  },
  {
    "user": "Sheryl Natalie Brown",
    "rating": 5.0,
    "message": "Easy to get on and comfortable."
  },
  {
    "user": "MARIA GABRIELA PEREIRA GARCIA",
    "rating": 4.0,
    "message": "Siempre uso W10, soy 27cm. Dicen un talle y medida pero son 2cm más grandes. No sirven, los domare."
  },
  {
    "user": "Seed Chomper",
    "rating": 4.0,
    "message": "They are really nice shoes and the yellow is beautiful, but they are a large fit. I tried two different sizes, a 1/2 size down from my normal size and full size down. They seem to be long and narrow but are the same length and width as shoes from a different company. I ended up getting the slip-on mule, a 1/2 size down."
  },
  {
    "user": "Sam Noble",
    "rating": 5.0,
    "message": "I love Converse. I also love slip-on shoes, due to my bad back. So these are perfect."
  },
  {
    "user": "Heather",
    "rating": 5.0,
    "message": "Great sellers. Pleasure supporting their business. The reviews are accurate. Definitely size down. I normally wear a 6 and the 5 fit absolutely perfect!. I want to buy them in another color! Love them!"
  },
  {
    "user": "Rhea Davis",
    "rating": 4.0,
    "message": "I especially like the color and the style. Being able to pull the shoe on works for me wonderfully well plus the fact that I have not had a pair of Converse since I was a kid and now I have grandkids who wear Converse. We can rock together ‼️"
  },
  {
    "user": "marisa",
    "rating": 5.0,
    "message": "I love these converse! Looking to order them in black. I don’t like how regular converse look on me, they look so big like clown shoes. I normally wear a 10.5 in a running sneaker, but ordered them a size 10. They fit perfect and go great with so many outfits . My go to sneaker in the summer when I need support and experience heal and ankle pain due to wearing flip flops and sandals.  Go half size smaller too will be fine"
  },
  {
    "user": "Alexandra Rodriguez",
    "rating": 5.0,
    "message": "Love my Chucks"
  },
  {
    "user": "Jenny E.",
    "rating": 5.0,
    "message": "Order your favorite size- remember they run just a tad bit bigger than normal sizes.  These also come a little further up on your foot as you can see from my picture.  I love Converse.  I’m a loyal fan.  These shoes walked all over France with me!  Glad I bought them to travel with.  They look good with sundresses shorts and pants!"
  },
  {
    "user": "ERock",
    "rating": 5.0,
    "message": "I bought these WOMENS shoes for my girlfriend in her size and when she put them on they are way too big!  I checked the reviews and was baffled that nearly every review says they are 1 to 2 sizes too large.  How can Amazon let that happen?  What a waste of time, money and resources (shipping, returns, etc) because now I have to return them, and order a smaller pair and hope they fit right. I love converse but this is is ridiculous and the seller should check themselves before they waste more money, time, etc."
  },
  {
    "user": "Liss",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "gloria abaya",
    "rating": 5.0,
    "message": "The shoes run a bit large which is fine.  I was completely comfortable after 8 hours in the air.  My feet swell during travel but with the  extra room,  I had no problem."
  },
  {
    "user": "KM5",
    "rating": 5.0,
    "message": "I’m a true 7. Like other reviews suggested, I ordered a size down (size 6). For any Converse, the shoe will have to conform to your foot if it isn’t narrow. I just wore them around the house for a few hours. I did notice some slippage on the back of my heel when I was walking, but it wasn’t enough for the shoe to slip off. I plan to wear these on my upcoming trip. I’m not disappointed by the purchase."
  },
  {
    "user": "Amanda",
    "rating": 4.0,
    "message": "Very comfy and breathable fabric. The fit runs a little big. I am a 7 1/2 women's, I would probably fit a size 7."
  },
  {
    "user": "Rickey Gilbert",
    "rating": 5.0,
    "message": "These shoes are like wearing socks! Worth every penny!"
  },
  {
    "user": "Haley",
    "rating": 4.0,
    "message": "I love these shoes! Easy slip on and easy to clean. The ONLY reason I didn't give 5 stars is these are not available in wide. I had to go up 1/2 a size for a comfortable fit."
  },
  {
    "user": "TAP",
    "rating": 5.0,
    "message": "I wear these daily to my retail job. They’re super cute & go with everything.  Order 1/2 down from your usual size."
  },
  {
    "user": "Ms P.",
    "rating": 4.0,
    "message": "Cute, loved the feel, stretchy, however they run very large.  Ordered womens 5.5, could have used size 4.5."
  },
  {
    "user": "ashleylynn",
    "rating": 5.0,
    "message": "Most comfortable pair of converse I own!"
  },
  {
    "user": "Kimyotta L Miller",
    "rating": 4.0,
    "message": "So my normal size in women is a 7 but I should have went at least 1/2 smaller with these."
  },
  {
    "user": "Peggy Woods",
    "rating": 4.0,
    "message": "I bought the shoes to celebrate the election, a nod to Kamala Harris. I especially liked that they are pull on and i do not have to tie them, but they still have shoelaces.. They are designed well and quite comfortable with the right amount of arch support, just a little long for my true size."
  },
  {
    "user": "lissett reyes",
    "rating": 2.0,
    "message": "Shoe itself looks cool but it’s stain not sure if product was inspected before shipping"
  },
  {
    "user": "☆|-|@/_()☆",
    "rating": 5.0,
    "message": "I've never seen Chuck's like these and I am so glad I got them....they r comfy and snug but not to tight....my whole life I have worn a size 8 shoe but for sum reason I knew to go way smaller with these...I think my feet have shrunk but they r awesome and if u want them to be cleaned just toss them n the wash...super convenient🤘"
  },
  {
    "user": "Hattie Garcia",
    "rating": 5.0,
    "message": "I would recommend them highly."
  },
  {
    "user": "Angela",
    "rating": 5.0,
    "message": "I can’t express how much I love these shoes! I have 5 pairs and want to order more. No need to wear socks, light and airy, super soft insole. Easily washable. I normally wear a 7.5 but ordered a 7 which was a perfect fit."
  },
  {
    "user": "LunaFendi",
    "rating": 5.0,
    "message": "Every pair converse I have ever owned wear size 7 in women's. From the reviews I believed that these ran big, so I bought a size 6.5 in women's. The size 6.5 was too small. Very cute sneakers , no support though. My foot slides forward with each step. I intend to order size 7 and put in an insole, maybe that will help. I really want to love these! Visual gorgeous!!! Need to work! :D <3"
  },
  {
    "user": "Alissia Wilkins",
    "rating": 3.0,
    "message": "I got an 8 1/2 but they just seemed long in the front"
  },
  {
    "user": "KSinger",
    "rating": 5.0,
    "message": "These knit Converse are 100 x better than any other style. I purchased them in white at Journey's kids in a size 4, mind you,  I am a womens size 7 to 7.5. I have been looking tirelessly to find the black and when I did, I was elated. The support in this style is amazing and they look awesome with shorts, jeans, or for just casual comfortable walking. I am definitely buying back up pairs in both the black and white. That's how much I love them!!!"
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "I am happy with my purchase.  I love the material and the look and feel! There just a tad big in the toe area, but hardly.  Not enough for me to be unhappy with them. I have back problems from time to time and these are perfect because I can just slip them on without any hassel. I really do like them and would recommend!"
  },
  {
    "user": "Tracy Angell",
    "rating": 3.0,
    "message": "I love the look of these but they are too narrow for my feet."
  },
  {
    "user": "Danielle",
    "rating": 4.0,
    "message": "Either my feet are very wide or these shoes are very narrow. I couldn't get my feet half inside the shoe. Very nice looking, but sadly I had to return them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They even come out of the washing machine/dryer like new! My husband is so jealous they don't make men's in this style/fabric. These are my new everyday shoe and the compliments keep coming"
  },
  {
    "user": "Hilary Brenneman",
    "rating": 3.0,
    "message": "These shoes are super cute. I love a good white shoe. I have wide feet and was hopeful that the stretchy sides would work well. The reviews all said they run really big...to balance out my wide feet and large reviews I got my normal size. The shoes really aren’t stretchy at all. I not only found them difficult to get on, I only wore them for 30 seconds and my feet knew these weren’t gonna be my sole mates. The length was pretty spot on for me but the width is substantially narrower than a standard All-Star."
  },
  {
    "user": "Kayla DuVerger",
    "rating": 3.0,
    "message": "I’m normally an 8 1/2 so that’s what I ordered and there a size too big"
  },
  {
    "user": "sherry hinkley",
    "rating": 5.0,
    "message": "My fav converse!"
  },
  {
    "user": "MoDan Construction Services",
    "rating": 4.0,
    "message": "Love the shoes and the color, don't love that they are about a size too large."
  },
  {
    "user": "nj",
    "rating": 3.0,
    "message": "The fit and overall look is good but there is very little cushioning in the heel. My feet are not happy after a few hours.  Very disappointed."
  },
  {
    "user": "gfew",
    "rating": 5.0,
    "message": "I normally wear a size 7. Was thankful I read the reviews pertaining to sizes.  I ordered a size smaller than the 7. The 6 fit perfectly and the shoes are very comfortable.  Would have been totally pleased had they arrived in a Converse box. They were just placed in a shipping box. Recommended"
  },
  {
    "user": "Julie",
    "rating": 1.0,
    "message": "Definitely not original shoes; received two left shoes in the box and box was damaged. The shoes also seemed counterfeit as they were not the same size even though same shoe and were distorted/not usual shape and labeled same size."
  },
  {
    "user": "stacey thames",
    "rating": 5.0,
    "message": "I cannot say enough positive things about these shoes. I already had a pair and bought this pair for when my others wear out (if they do). I am over 40 and have never worn this brand until these this past summer. Being a nurse, I have worked in these a couple of times and they held me up great!!!! I wear between a 10-11 depending on the brand. I wear a 10 in these and it is a perfect fit! The other different makes of this brand seem to hurt my toes but these don’t."
  },
  {
    "user": "Mary from Nor Cal",
    "rating": 5.0,
    "message": "Love the way these Chucks look. The length and support are great. I was surprised to find them a bit tight across the foot. My feet are super “average“ in width — so not wide.  Since they are kind of knit, I’m hoping they will loosen up. Otherwise, I’m feeling very stylish in these Chucks!"
  },
  {
    "user": "Kelly",
    "rating": 4.0,
    "message": "They fit on the smaller size.  I would recommend going up a 1/2 size then your normal"
  },
  {
    "user": "Laura",
    "rating": 1.0,
    "message": "I first ordered these in my normal size and they were giant. I reordered one size down and they were delivered all scuffed up. They were clearly used shoes and should not have been sold as new. Someone wore them outside and got dirt and mark on the slides and white parts"
  },
  {
    "user": "Linda F.",
    "rating": 3.0,
    "message": "I bought this shoe because it said true to size and I found it not to be a true for me.  Length was a bit long, width was narrow and heal is loose.  I bought the yellow, quality appeared to be great but the size is not working for me so I will return and keep looking for another product that fits better.  Very disappointed."
  },
  {
    "user": "Preferia P. Range",
    "rating": 4.0,
    "message": "Looks good ."
  },
  {
    "user": "Kyle P.",
    "rating": 4.0,
    "message": "I got these for my wife for Christmas because she needed a new pair. I'm sure she will love them as they are exactly the same as her old pair."
  }
]