[
  {
    "user": "Schwendi",
    "rating": 5.0,
    "message": "The shoe is nice and wide and comfortable.  I bought an 8 wide but the wide was true so the length a bit long.  Toe box just right and I really like the pads where the ball of the foot hit. Need more arch support.  For some reason most shoe manufactures think wide feet have no arch. Mine are quite high.  I have wide feet with bunions.  These shoes are great for getting chores done and they are nice enough for wearing around town."
  },
  {
    "user": "Nancy T.",
    "rating": 5.0,
    "message": "The shoes are great. The color is even better than I had expected. I got a half size bigger instead of wide because they were less expensive. Size worked out great. definitely would buy again. The only down side was the condition of the box when delivered. The shoe box was totally crushed, but it didn't hurt the shoes."
  },
  {
    "user": "Mistress Ursula",
    "rating": 5.0,
    "message": "Always the perfect fit.  Have been wearing Keds most of my life.  Consistent in size, value, fit and style - whether solids, prints, lace up or slip ons!  This time I got red, which is such a great color anytime of year."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Perfect basic shoe when I want to wear something comfortable that isn’t big, hulking tennis shoes or too casual like converse. Easy to tie, stays on and I feel that it offers more support and padding than my other similar style shoes. A good, timeless style. Goes with just about anything."
  },
  {
    "user": "King",
    "rating": 5.0,
    "message": "I bought the white canvas. Looks really nice and neat. Very comfortable. Because of the sleek low cut they can be worn with dresses, maxi skirts, etc and still look put together"
  },
  {
    "user": "Mercedes",
    "rating": 4.0,
    "message": "Not sure these are authentic. They shipped from China and came in a plain brown box. But they are 10 dollars cheaper so I’m not gonna complain. They do run smaller though."
  },
  {
    "user": "Michelle Gibson",
    "rating": 4.0,
    "message": "Too much room in the heel, heel slips while walking"
  },
  {
    "user": "Denis R. Rhodes",
    "rating": 4.0,
    "message": "I like that I got what I ordered."
  },
  {
    "user": "Denise Noble",
    "rating": 4.0,
    "message": "Just got them snd they look great but theyre a 7.5 and lil big. Gonna return them and get a 7"
  },
  {
    "user": "Yolanda Carlson",
    "rating": 5.0,
    "message": "I am 84 years old and I have found that the heavier canvas shoes with the large heal cause me to stumble as I no longer raise my legs as high as when I was young. These shoes are perfect for me and have been great in not causing me to stumble. Falls at my age can be catastrophic and these 4-hole sneakers give me the confidence that I need. Thank you!"
  },
  {
    "user": "Patty",
    "rating": 4.0,
    "message": "It’s a Ked shoe.. it fits as I had hoped and if good canvas quality.. I haven’t washed yet so how  they hold up after a couples washes will add to their quality for me… thank you"
  },
  {
    "user": "heather",
    "rating": 5.0,
    "message": "I love these shoes! They are so cute and take me back to my childhood of getting new keds every school year. I usually wear an 8, but ended up having to exchange them for and 8.5 wide."
  },
  {
    "user": "Mjb",
    "rating": 5.0,
    "message": "Bought wide because of my bunion. Fits perfectly."
  },
  {
    "user": "Eleni",
    "rating": 5.0,
    "message": "Shoe is a cute classic! Fits as expected and the insole is surprisingly cushy for a flat bottomed shoe. Will buy again!"
  },
  {
    "user": "Priscilla Romero",
    "rating": 5.0,
    "message": "Comfortable shoes for every day use"
  },
  {
    "user": "Tamia C.",
    "rating": 5.0,
    "message": "Looks great with anything"
  },
  {
    "user": "kelly johnson",
    "rating": 5.0,
    "message": "This is my second pair of these.  They are very comfortable and look great!"
  },
  {
    "user": "Debra Fotheringham",
    "rating": 5.0,
    "message": "Keds were white, plain, and washable. They were just the right style to wear with casual dresses and pants. You can’t go wrong with keds and these are traditional and fit as expected."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Me gusta ese estilo de tenis para salir y hacer ejercicio muy cómodo"
  },
  {
    "user": "melton  hubbard",
    "rating": 5.0,
    "message": "I like this Keds shoes their very comfortable to wear it worth buys item"
  },
  {
    "user": "linnie",
    "rating": 4.0,
    "message": "They looked and felt fine, they were just entirely too big. I usually wear a seven wide in New Balance. I bought a seven wide in these and they were just too long."
  },
  {
    "user": "Sharpay Evans",
    "rating": 5.0,
    "message": "They fit perfect I wasn’t sure what size to get so I bought a thirteen extra wide first too big. Then a size 11 extra wide a little to big. Then a size 11 wide the finally fit. Now I know what size keds I am. I wear a size 12 running shoe so i went with a size 11 wide because I have two pairs that are just a standard width that fit great. A size 10 wide that fits great. I can’t wait to get a red pair of keds."
  },
  {
    "user": "KJF",
    "rating": 4.0,
    "message": "Great support.  Should have ordered a half size smaller."
  },
  {
    "user": "Venus Taylor",
    "rating": 4.0,
    "message": "Wrong color but love the style."
  },
  {
    "user": "kristybri",
    "rating": 5.0,
    "message": "I like these little keds. They're comfy,  cute, and comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are great, just as I remember as a kid wearing them. These aren’t the shoes to buy if you’re looking for arch support or anything, but nobody buys keds for that reason. These are cute and right for the price. They wash well too. Thank you for having bigger sizes!"
  },
  {
    "user": "L. T. Ellis",
    "rating": 5.0,
    "message": "These are the most comfortable shoe ever! They feel like ballet slippers but with support. By that, I mean that they fit my feet like they were made for me, are flexible, but add enough support that I can spend my day working on a concrete campus and not even think about them. Plus, they look great! I'm looking for more colors to order. I ordered the wide width and they are great!"
  },
  {
    "user": "Vickie J.",
    "rating": 5.0,
    "message": "fits like it should thinner then they use to be"
  },
  {
    "user": "Vetmom50",
    "rating": 5.0,
    "message": "Love my keds! I can't be without them!!"
  },
  {
    "user": "sherry hodson",
    "rating": 4.0,
    "message": "Shoes are narrow…I can wear them but if I order more I’ll go with the wide width. I do have kinda narrow feet but I thought regular fit wood b ok.."
  },
  {
    "user": "Kimberly",
    "rating": 5.0,
    "message": "I loved Keds when I was a child.  Now that I have grown up and Payless shoes has closed, it is difficult to find inexpensive shoes for a female size 12.  However I did find these and I completely love them.  They are the perfect compliment to my white jeans.  They look great with my blue jeans.  I am googling places to take them to have them weatherproofed, cause I seriously will be upset if they get stained! lol"
  },
  {
    "user": "Miss Barrett",
    "rating": 5.0,
    "message": "Crisp white keds What else is there to say Needs a Lil break in but that's a shoe 5 stars"
  },
  {
    "user": "Patricia Smith",
    "rating": 5.0,
    "message": "Tru to fit. Love them."
  },
  {
    "user": "Cassie Cupp",
    "rating": 5.0,
    "message": "Super cute and comfortable! Perfect for walking around"
  },
  {
    "user": "Jeffrey Burley",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "M P",
    "rating": 5.0,
    "message": "I love these sneakers. This is all I wear"
  },
  {
    "user": "eleanor glorioso",
    "rating": 5.0,
    "message": "LOVE MY KEDS!"
  },
  {
    "user": "Yellow Rose",
    "rating": 4.0,
    "message": "I have had this Style for a number of years. So therefore this is my favorite type of Keds.."
  },
  {
    "user": "Beth mora",
    "rating": 5.0,
    "message": "Always this is a well made product. Quality’s summer shoes"
  },
  {
    "user": "Luis Sesma",
    "rating": 5.0,
    "message": "I love my Keds they are comfortable on my feet, will purchase them again."
  },
  {
    "user": "MTKate",
    "rating": 5.0,
    "message": "I'm a long time Keds fan and these are a classic fit, true to size, with a comfortable cushioned insole."
  },
  {
    "user": "Helen Brown",
    "rating": 5.0,
    "message": "No complaints, only love"
  },
  {
    "user": "Rosie C.",
    "rating": 4.0,
    "message": "I bought my white keds last September!! This spring when I brought them out for spring I decided I would wash my keds to spruce them up !! I washed them alone in my machine alone & I air dried them for a couple of days!! When I went to put them on I noticed that the tongue was badly frayed & about to come off the shoe!! Usually, the tongue is reinforced by a liner along the edge!! This  pair of shoes had none of that!! They looked frayed at the tongue & poor quality for keds!! Are Amazon Keds seconds?? I am not pleased cause I take good care of my clothes & shoes!! Please Help me out with this situation!! Rosie Clearwater!"
  },
  {
    "user": "Veronic A.",
    "rating": 5.0,
    "message": "Wow, fantastic keds!! I have wide feet with high arches and it’s so hard to find good walking shoes that fit good. These are my new favorites. They fit perfectly and they are so stylish, I’m very happy."
  },
  {
    "user": "Glenn Owens",
    "rating": 5.0,
    "message": "I should have ordered a narrow width but they will work fine. Like them and will know to order narrow next time. Timely delivery and very satisfied. Thanks"
  },
  {
    "user": "Regina Taylor",
    "rating": 5.0,
    "message": "I have always loved Keds"
  },
  {
    "user": "Brown",
    "rating": 5.0,
    "message": "i’ve always been the biggest fan of Keds! This is my fifth paid! My favorite shoes of all time. They go with just about any bottoms… jeans, shorts, skirts… i wear them with everything!"
  },
  {
    "user": "Talvi",
    "rating": 5.0,
    "message": "I ordered the Keds in size 9 and was pleased - they are good solid quality sneakers.  Although they are probably the most faked/copied shoe, I still prefer to stick to the original so I have care for my feet that other cheaper knock offs wouldn't give."
  },
  {
    "user": "Linda from Indiana",
    "rating": 5.0,
    "message": "These shoes fit perfectly!! I wear a 9W & they are spot on for fit! I’m very pleased with this purchase!"
  },
  {
    "user": "Teri A. Fischer",
    "rating": 5.0,
    "message": "This product is just as you remember!  Perfect for any type of casual pant or skirt"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these for myself for casual wear and I am so glad I did! Comfortable, stylish quality that won’t break the bank. Love there shoes!"
  },
  {
    "user": "Sherika M.",
    "rating": 5.0,
    "message": "My Aunt is who got the shoes and she loves them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Just what i ordered. I have wore Keds for many years."
  },
  {
    "user": "Steve S.",
    "rating": 4.0,
    "message": "For my elderly mother, took two different sizes to get it right"
  },
  {
    "user": "TKDrew",
    "rating": 5.0,
    "message": "Needed black comfortable shoes for a formal event after foot surgery. Bought these black-soled sneakers .Worked out great. Replaced the laces with ribbon. Didn't look like I was wearing sneakers at all."
  },
  {
    "user": "Cece Spatola",
    "rating": 5.0,
    "message": "I love my new red Keds!!"
  },
  {
    "user": "KARMAN",
    "rating": 5.0,
    "message": "Have worn this brand for years and absolutely love them"
  },
  {
    "user": "LCityGuy",
    "rating": 4.0,
    "message": "Shoes arrived and everything was fine. I bought these as a gift; and I put some spray on them to protect them from stains. The spray made some parts of the shoes to turn dingy yellow. I then used hydrogen peroxide to restore them back to white. Right now I have been able to remove about 98% of the yellowish stains. I will continue working on them. Other shoes that were white canvas didn't have these problems. Be careful how you treat them and clean them... Nice classic white sneakers... they are nice Keds."
  },
  {
    "user": "Some1whocares",
    "rating": 4.0,
    "message": "I have really wide foot. Purchase wide size. Slightly tight first time put on. Could feel seam at the top. Second time was fine, comfortable. Wish the material made out of was thicker."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The media could not be loaded. LONG TIME KEDS LOVER! Ordered these to replace my last pair (as shown in photos) and after ordering I read reviews stating they were fake. Assuming the worst, I inspected the heck out of these new keds upon arrival. Everything seems legit, the stitching is consistent, and the tongue tags match my old pair. I took a video of the box it came in, side-to-side comparison with my last pair (I apologize for how nasty they are), and a close up to compare stitching. OVERALL: I don't think they are fake. Use your best judgement. If you're not in a hurry, order through the keds website or DSW. I will be next time so I don't have to worry about counterfeit."
  },
  {
    "user": "TMT Randall",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "suzanne ferrell",
    "rating": 5.0,
    "message": "Always perfect with shorts, pants, or a skirt. Bought four pair canvas,leather white or colored. White always right.!!  My fave forever."
  },
  {
    "user": "Anabell Salvador",
    "rating": 5.0,
    "message": "This is my second time purchasing these shoes. I like the fit"
  },
  {
    "user": "Kim Bradley",
    "rating": 5.0,
    "message": "I got what I expected.  Thank you."
  },
  {
    "user": "Toga Girl",
    "rating": 5.0,
    "message": "These are wonderful everyday shoes for going to the store, driving, around the house, etc.  They are attractive, light weight and clean up pretty well.  I am very rough on shoes, and mine last over a year.  They’re not for athletics due to low arch support, but I’ve never had any discomfort, even wearing 12+ hours (and I have high arches).  I need wide width, and Keds wide fit very well.  All-around, a good shoe."
  },
  {
    "user": "janice walker",
    "rating": 4.0,
    "message": "I have this tennis shoe and many other colors including an older white pair. After wearing this one day the material rippled and the shoe does not look good on my foot anymore"
  },
  {
    "user": "Charles Hanson",
    "rating": 4.0,
    "message": "vacation that includes a lot of walking"
  },
  {
    "user": "Carol Ferre",
    "rating": 5.0,
    "message": "Will buy more in different colors, love the comfort and price."
  },
  {
    "user": "melissa cruz",
    "rating": 4.0,
    "message": "Luv it, just has that gap when you walk...."
  },
  {
    "user": "Alioska",
    "rating": 5.0,
    "message": "La calidad es buena solo que yo pedí un número 7 y me quedo grande sugiero que se pida un número menos por ejemplo como yo que uso 7 tendré que pedir 61/2"
  },
  {
    "user": "Janey",
    "rating": 4.0,
    "message": "These are nice and comfortable but long, there's quite a gap at the front of the shoe. They're also just a little narrow, but luckily I'm able to wear them for an hour or so before they become uncomfortable. I take a medium width so it's not me, it's the shoe. If you're not sure, try them anyway, they're made well and of quality materials."
  },
  {
    "user": "Polly",
    "rating": 4.0,
    "message": "Great little sneaker"
  },
  {
    "user": "California Traveler",
    "rating": 4.0,
    "message": "Wanted a lighter weight white casual shoe. As expected not much arch support and would not wear for walking long distances. This is not a sturdy supportive shoe, but cute with casual outfits where a sports shoe is too much and a flat too dressy."
  },
  {
    "user": "Suzie",
    "rating": 5.0,
    "message": "I’ve had a hard time finding original Ked’s and was happy to find them on Amazon. The shoes are perfect. The box is sturdy and protective."
  },
  {
    "user": "Bridge-it",
    "rating": 5.0,
    "message": "I like it for its use as comfortable casual wear."
  },
  {
    "user": "New Yorker",
    "rating": 5.0,
    "message": "As soon as I opened the box I fell in love. These are perfect sneakers for the summer. Fit is great, they’re comfortable, and they haven’t fallen apart on me. Also my feet sweat a lot so my shoes tend to stink but that hasn’t happens with these either.  And the price is low compared to most other brands"
  },
  {
    "user": "Kathy S",
    "rating": 5.0,
    "message": "The only shoe my mom will wear. And this original style is hard to find! The canvas is sturdy. Keds logos in place. They look good. I'm ordering her another pair - gonna get 'em while the gettin's good!"
  },
  {
    "user": "Rob L",
    "rating": 5.0,
    "message": "Keds are always too narrow for my foot. These came in wide! They fit perfectly."
  },
  {
    "user": "Joi",
    "rating": 4.0,
    "message": "I really love these shoes, but in the picture I thought the color was a bit more green. I probably wouldn't have gotten them if I realized they weren't green at all."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfortable and offers some arch support.  I love simple sneakers that are not heavy or chunky.  These are just right."
  },
  {
    "user": "Rubylips10",
    "rating": 5.0,
    "message": "I purchased the Keds for a gift my friend loved them. They were a perfect fit & she loved the quality appearance. She has been a Keds customer for many years."
  },
  {
    "user": "Vet Sue",
    "rating": 4.0,
    "message": "The biggest disappointment in this show is That there is no support. The material is very thin.  If you’re looking for a good walking show this isn’t it. It’s cute with skirts, capris, and casual dresses. But for walking and exercising—find another sneaker for that."
  },
  {
    "user": "Wendy",
    "rating": 5.0,
    "message": "We have always been satisfied with the quality of Keds"
  },
  {
    "user": "shelba conger",
    "rating": 5.0,
    "message": "Love keds"
  },
  {
    "user": "Dawna McMillan",
    "rating": 5.0,
    "message": "Love these and they’re true to size. Would recommend buying."
  },
  {
    "user": "LMC",
    "rating": 4.0,
    "message": "Cute and comfortable.  However, they are very slippery on tile."
  },
  {
    "user": "DANA MEDVEDOVA",
    "rating": 5.0,
    "message": "I'm having issues with my wide feet, but these shoes are amazing. Simple comfy."
  },
  {
    "user": "Victoria",
    "rating": 5.0,
    "message": "I love these classic white Keds from the 90s. They fit perfectly and the quality is still great just like they’ve always been."
  },
  {
    "user": "Kindle CustomerSTaylor799",
    "rating": 5.0,
    "message": "I’ve worn keds for the last 60 yrs and they fit just as I remember. Love the clean tailored look with jeans."
  },
  {
    "user": "Thankful",
    "rating": 5.0,
    "message": "Not color shown in picture"
  },
  {
    "user": "G. A. Williams",
    "rating": 4.0,
    "message": "AS EXSPECTED"
  },
  {
    "user": "Vanessa D. Bunton",
    "rating": 3.0,
    "message": "Like the shoes but the shoes I received were dark blue not black."
  },
  {
    "user": "Gabby 😘",
    "rating": 3.0,
    "message": "Went based off the size I already currently have and these definitely are bigger than the ones I have. They slip off the back"
  },
  {
    "user": "Linda Gusnowski",
    "rating": 5.0,
    "message": "Just wanted some casual shoes to wear with long shirts and leggings- perfect!"
  },
  {
    "user": "Keely Grice",
    "rating": 4.0,
    "message": "These are the second pair of shoes I have bought. The first pair I wore walking around a lot at work and they didn’t last long and killed my feet. Now I have a desk job and they work great for casual walks. I wear a 9 wide so that’s what I bought and they fit great."
  },
  {
    "user": "Peter Knight",
    "rating": 4.0,
    "message": "My wife typically has a problem finding shoes to fit her wide feet. Often buying a larger size to get enough width, however, these really fit!"
  },
  {
    "user": "Sandra Sabine",
    "rating": 4.0,
    "message": "The toe of the shoe seemed very long. But they did fit well. The wide width was perfect. I wore the shoes all day and my feet did not hurt which is quite an accomplishment for my feet"
  },
  {
    "user": "Sonia Matias",
    "rating": 4.0,
    "message": "I like the kids just a little to narrow for my foot. I needed a medium."
  },
  {
    "user": "micha",
    "rating": 5.0,
    "message": "All okay !"
  },
  {
    "user": "donnashabbychic",
    "rating": 5.0,
    "message": "My Childhood sneaker  and retro chic!  Wow!"
  }
]