[
  {
    "user": "Jenny N.",
    "rating": 4.0,
    "message": "I've had the WORST time finding actually-wide \"wide\" shoes after foot surgery.  My only successes so far have been a couple (expensive) Merrells and (no-support, cheaply made) \"XW\" Easy Spirits.  These have been the first tennis shoes I've been able to get my post-surgical foot into other than a pair of Merrell Moab Flights!  They're just a hair too narrow for full comfort, but being that I got them for about half the price of the Merrells and my foot is still healing a bit, I'm going to keep them and they should fit better in another month or two. If you've been disappointed by way-too-narrow \"wide\" shoes like Asics, New Balance, or Columbia, these would be worth a try.  If you need really wide shoes, try the tennis-shoe height Merrels like Moab Flight or Moab 2.  Those are wider than these in the same size, but the mid-height Merrells seem to run a little more narrow. Other benefits: they look well made, have nice padding around the ankle, they're super lightweight, and they have a very supportive sole (can't be bent in half over the arch like cheaper shoes).  There is a little arch support built in, but I'm replacing the insoles with orthotics for a little more support just with my foot structure. Recommended!"
  },
  {
    "user": "JB",
    "rating": 5.0,
    "message": "I have 7 unopened pairs of these stored in my closet so I never run out!!  The support they offer is terrific - NO BREAK IN PERIOD NEEDED!  I have never had another shoe that was comfortable from the first moment that I put it on.  I buy them when I see them - because this particular version \" VERSAFOAM Cohesion 12\" is the best of all the Saucony that I have tried."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I purchased these shoes before going on vacation and I took a huge chance.  But my husband and I did a lot of walking while we were on our trip and I was pleasantly surprised.  The biggest thing about my liking these shoes is I have trouble finding anything that is comfortable.  I had Morton's Neuroma surgery, and over a year later, I still have pain in the bottom of my foot.  I need a shoe that provides good support, but is soft on my sore foot.  I couldn't afford 160 to 200 dollar shoes, and that is what a lot of the shoes that are recommended for my condition cost.  So for what I paid for these, and the fact that I got though several airports, and walking to see the sights on our trip, says quite a lot!  I don't know if these are all time, sure fire, all out, shoe for saving my poor foot from hating to walk, but they held up pretty well, and that made me happy that I bought them!"
  },
  {
    "user": "Suzanne",
    "rating": 5.0,
    "message": "Once I found my size in this brand I just get a different color when I want a new pair. I work standing on a concrete floor and replace my shoes every 3-6 months. Since I found this brand that fit well it’s been easier to just hop on Amazon and get a new pair. I’ll probably be going back and getting repeat colors after awhile. I do look for when a pair is less than the usual 59 something. I think these might have been a return because bottoms looked tried on, but hey shoes in the retail store have been too. So right size, cute color excellent condition they’re great."
  },
  {
    "user": "J. M. Lange",
    "rating": 5.0,
    "message": "I've never had a bad pair of Saucony and this one is no exception. Comfortable from day 1. These are replacing my previous pair of the same model that I've worn out with much use."
  },
  {
    "user": "Teresa Giuliano",
    "rating": 4.0,
    "message": "Price is good for casual shoe"
  },
  {
    "user": "Patricia",
    "rating": 4.0,
    "message": "Great shoe at a very reasonable price."
  },
  {
    "user": "mystery fan",
    "rating": 4.0,
    "message": "There is nothing to complain about. Good product Good delivery"
  },
  {
    "user": "R. T.",
    "rating": 5.0,
    "message": "I think these shoes are very comfortable and fit well. I wasn't sure about the color at first but it does march quite a few casual outfits in my closet. It's sort of a greenish blue."
  },
  {
    "user": "Addie K. Ziegler",
    "rating": 5.0,
    "message": "Love the color and very cushioning which is very important to me! Would order again!"
  },
  {
    "user": "Cheri Ramirez",
    "rating": 5.0,
    "message": "Love this brand, always a good fit for my wide feet and a great value for the money."
  },
  {
    "user": "joanne s",
    "rating": 5.0,
    "message": "Very comfortable. I have ordered several colors of cohesion 12. Some fit great. Some not so much. These were very comfortable for my feet."
  },
  {
    "user": "Linda Whitfield",
    "rating": 5.0,
    "message": "These are so comfy. I am so happy with this purchase"
  },
  {
    "user": "KC",
    "rating": 5.0,
    "message": "These shoes have exceeded mu expectations. They are comfortable. The all day support."
  },
  {
    "user": "Court",
    "rating": 4.0,
    "message": "I have really bad plantar fasciitis in my left foot, where my heel has been in intense pain for 5 months so far. I work on my feet for 40hrs/wk as well, so I have bought an absurd amount of shoes this year. These sneakers have been the most comfortable ones I’ve found thus far! I can actually make it through a day of work without dragging my foot by the time I get home. Granted, I did put insoles in that have a hard plastic arch support, but I still highly recommend these shoes, especially if you have bad feet."
  },
  {
    "user": "NeoNurse",
    "rating": 5.0,
    "message": "Feel great even after a 12 hour shift as a nurse. Light weight. Great support. Usually wear a 7, but had to exchange for a 7.5 and they are perfect! Even the shoe strings stay tied all day!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have wide feet and h-a-t-e shoe shopping; especially for running shoes, but these are comfortable, cute and fit me well. I’m glad I got them!"
  },
  {
    "user": "LSD",
    "rating": 5.0,
    "message": "Good product"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I needed a pair of sneakers \"next day\" for my intense workout session. They arrived on time and I wore them that evening for my workout and the following 4 days. No \"break in\" necessary and they felt great. Thank you."
  },
  {
    "user": "Notsomuch",
    "rating": 5.0,
    "message": "I'm very impressed with the fit. I wear a size 10 wide with very high arches and they fit great. I'm excited to wear them hiking"
  },
  {
    "user": "Jaej",
    "rating": 4.0,
    "message": "Wear the brand most of the time. Comfortable great walking shoe. Supportive and great colors. Highly recommend."
  },
  {
    "user": "Maureen Hale",
    "rating": 4.0,
    "message": "These shoes are great for plantar fasciitis. I was able to walk 6 miles with these on vacation after having plantar fasciitis earlier in the month. I purchased these because of the reviews about how helpful they are for the debilitating affliction.  However, it is important to mention that they are slippery on indoor smooth floor boards. I've walked outside in pouring rain and they haven't been slippery on concrete or asphalt. I would purchase again because of the plantar issue, but am hesitant about these treads on indoor smooth services. The tread looks good so I can only assume the material is the issue."
  },
  {
    "user": "cat rescuer",
    "rating": 5.0,
    "message": "I use this product for walking."
  },
  {
    "user": "M. Tiner",
    "rating": 5.0,
    "message": "Comfortable, nice looking and good support."
  },
  {
    "user": "AmazonCustomerIndianapolis",
    "rating": 5.0,
    "message": "Adequate quality; good fit."
  },
  {
    "user": "Joyce C",
    "rating": 5.0,
    "message": "These shoes arrived quickly and fit great."
  },
  {
    "user": "UAstudentn",
    "rating": 4.0,
    "message": "The media could not be loaded. Just received them in the mail but overall pleased - I only have had cloud foam sneakers for the past several years (fabric outside only) so I really needed a pair of sneakers with supportive side walls so that I could play tennis and other sports without twisting my ankle. I also didn't want to break the bank so when I saw these I was apprehensive because the cheapest color choice wouldn't have been my first pick but I figured why not? SUPER lightweight. I do think they are probably on the narrow side but I don't ever buy wide shoes so it works for me. I also am sure that as you wear these they'll give a bit because the front of the shoe is still mostly breathable fabric and not rigid. Will update more as I use them"
  },
  {
    "user": "L. O. Branch",
    "rating": 5.0,
    "message": "Saucony is very reliable.  They do not make anymore the model that I always got, so this one was the closest to it and it did not dissapoint."
  },
  {
    "user": "Sydney M",
    "rating": 4.0,
    "message": "I put these on and went for my morning walk, a little over 2.5 miles, with no discomfort at all. I'm not crazy about the colors available - am replacing an old pair of navy Sauconys with magenta chevrons ad would have preferred some darker color choices. But if the shoe fits ..."
  },
  {
    "user": "Madylon Ganser",
    "rating": 5.0,
    "message": "Product great, only I should have ordered wide"
  },
  {
    "user": "Amafan",
    "rating": 4.0,
    "message": "Nice looking and comfortable for light daily jogging. The laces are flimsy and short so will probably have to be replaced.  The price is reasonable."
  },
  {
    "user": "Gloria Anderson",
    "rating": 5.0,
    "message": "I am 60 years old and have suffered from foot pain in the balls of my feet for over 25 years.  I have spent hundreds of dollars on \"good walking shoes\" or \"great support shoes\", etc., only to have my feet hurt regardless when I have to walk for long periods of time or be on my feet for a long time.  I had just spent $125 on a pair of shoes that, while more comfortable, did not stop my feet from hurting after a while. I read the reviews on these Saucony shoes and thought I'd give them a shot.  I just got back from a mission trip to WV where I averaged over 13,000 steps a day.  It took me until the evening of the second day to realize that my feet didn't hurt! I cannot tell you how that made me feel. I highly recommend these shoes and plan to buy them from now on.  Also, they just happen to be very cute!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fit as expect!!"
  },
  {
    "user": "Nwagner",
    "rating": 5.0,
    "message": "These are probably one of the most comfortable shoes I have owned for the price. I work in health care and I would definitely recommend them."
  },
  {
    "user": "julie yochum",
    "rating": 5.0,
    "message": "Really like these shoes"
  },
  {
    "user": "Dana Maffo",
    "rating": 5.0,
    "message": "Great fit, really nice sneaker!"
  },
  {
    "user": "Hicks",
    "rating": 5.0,
    "message": "I wore these tennis all day long and they were very comfortable."
  },
  {
    "user": "Cheryl Walters",
    "rating": 5.0,
    "message": "After reconstructive foot surgery,  I need a good sneaker that would give my foot sturdy support. I am extremely flat footed & this shoe gives me the support my feet need. It is comfortable & the toe is roomy."
  },
  {
    "user": "brittany",
    "rating": 5.0,
    "message": "Very comfortable and good support and  especially if overweight. I use mine for working out"
  },
  {
    "user": "Diane",
    "rating": 5.0,
    "message": "Per my sisters recommendation, I purchased this shoe to play pickleball.  I was impressed with the support the shoe gave during my playing time.  The fit was true to size as well.  Overall, it was a very comfortable shoe and a great value!"
  },
  {
    "user": "Cindy",
    "rating": 5.0,
    "message": "Great shoes for the price!"
  },
  {
    "user": "Hguevara",
    "rating": 4.0,
    "message": "I ordered  a 8 wide  my usual size . I need like two days to break them in cause they were too  tight. But now they feel comfortable.  I'm going to order  more"
  },
  {
    "user": "Linda A",
    "rating": 3.0,
    "message": "These are affordable and nice walking sneakers. Because I walk on a dirt road I don’t like to spend mega bucks on sneakers that will look crappy in a few months. For what I use them for is great. I would not use these for endurance walking or running."
  },
  {
    "user": "Adele",
    "rating": 5.0,
    "message": "As to date these are my most comfortable running shoes I’ve ever owned! As you can see I even wore them out on a glacier! ☺️"
  },
  {
    "user": "Owl",
    "rating": 4.0,
    "message": "I’ve had my current pair of Saucony Cohesion 12 versafoam shoes for a couple of years, and it was time to replace them. When the new pair arrived today, the insoles were very hard, not cushiony. The shoe also seemed to be bigger, roomier than my current pair.  When I matched the 2 pairs side-by-side, the size was the same but the new pair was missing the React2U versafoam insert (see picture).  When I put the old insert in the new shoe, the fit and comfort were perfect.  I am not sure if the React2U versafoam insert was part of a product change and intentionally left out or if the insert was left out in error. If it was an error, I hope the company sends me the correct inserts.  If the product changed, I will not purchase these shoes in the future."
  },
  {
    "user": "David B Fretz",
    "rating": 4.0,
    "message": "Comfort is king"
  },
  {
    "user": "Connie P.",
    "rating": 5.0,
    "message": "This is my favorite brand due to comfort and support.  The best walking shoes I have."
  },
  {
    "user": "Frank White",
    "rating": 5.0,
    "message": "They are so comfortable"
  },
  {
    "user": "Vicki R",
    "rating": 5.0,
    "message": "These are such comfortable shoes. I can put in plenty of mileage on them and my feet feel great at the end of the day!!"
  },
  {
    "user": "Brooklyn",
    "rating": 5.0,
    "message": "I purchased these on sale and am very impressed with the performance, comfort, and support."
  },
  {
    "user": "Diane N.",
    "rating": 5.0,
    "message": "I love these shoes. The fit, the cushion, everything. I am an older person, very overweight and I like to hike. These shoes keep me safe, they have a good grip on trails and pavement."
  },
  {
    "user": "F Barker",
    "rating": 3.0,
    "message": "I bought this product in a different color (black) the first time and they were great. This one fit slightly smaller and after a few weeks I ended up with pain in my left foot."
  },
  {
    "user": "robert c fink",
    "rating": 5.0,
    "message": "Fit as expected. Love them."
  },
  {
    "user": "Jamie Mathis",
    "rating": 4.0,
    "message": "Takes some breaking in for the insides to form to your feet. I don't recommend wearing them for the first time for a long on your feet shift. They're cute though."
  },
  {
    "user": "Matthew Crenshaw",
    "rating": 4.0,
    "message": "The color and fit. I use for work"
  },
  {
    "user": "Christina",
    "rating": 4.0,
    "message": "They have an older look - I am in my thirties and feel they just have an older design They are comfortable, they are my daily shoe for now because of the comfort which ultimately matters the most to me- I have plantar fasciaitis and they seem to not aggrevate the situation and give support which is a win"
  },
  {
    "user": "Katb",
    "rating": 4.0,
    "message": "I love Saucony because they fit my foot so well as they tend to run narrow and there is no break in needed and they are comfy right out of the box.  I walk my dog 2-3 miles 4-5 times a week so a good pair of shoes is essential.  The price was excellent but I have one complaint and that is that the shoelaces were chea-eep.  Of course I just replaced them with new ones, but they were not meant to last long.  Overall I give them a good rating and hope my next Saucony purchase will be just as good and made better with a better shoelace."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I have worn this brand for several years for walking and love them"
  },
  {
    "user": "J. Leide",
    "rating": 4.0,
    "message": "bought these for summer for work- they are light weight and a nice color."
  },
  {
    "user": "Sherrie Berry",
    "rating": 4.0,
    "message": "I was very excited to get my shoes, I wear this brand or Brooks, my only complaint is they had a very tiny tight knot in one of the shoestrings and I am not happy about that. I had to use the point of a pen to work it loose."
  },
  {
    "user": "MattieB",
    "rating": 5.0,
    "message": "bought so i could have more support for my past injured foot that still bothers me. works great and people say they look cute. had a nurse tell me everyone in her hospital wears this brand after i had already bought the shoes so that's a good sign."
  },
  {
    "user": "Anita Stone",
    "rating": 3.0,
    "message": "I’ve had these shoes for two months. I love them. But the mesh already has a hole in it at the big toe. Not happy."
  },
  {
    "user": "Holly Azbill",
    "rating": 5.0,
    "message": "Liked everything about them"
  },
  {
    "user": "TXBookLover",
    "rating": 4.0,
    "message": "I don't normally buy shoes online as my feet are hard to fit. But since I've bought several Sauconys in the past, I know which product lines and size to get. Well, they're huge. They're okay if I wear my extra thick socks, but with standard socks they fall right off. They are the right size according to the label, and there's no W so I don't think they're the Wide version. I'll probably get some gel inserts for them and see if that helps. Otherwise, they're comfortable and look good. Saucony is my favorite brand."
  },
  {
    "user": "Deborah",
    "rating": 5.0,
    "message": "I have not done areobics in these shoes. Walking is great for me in these shoes"
  },
  {
    "user": "Nancy still",
    "rating": 5.0,
    "message": "This is second pair I have owned. I love these shoes. Comfy, good support, keeps my knees from hurting. This pair is wide, first order were not wide enough."
  },
  {
    "user": "Ziggy",
    "rating": 3.0,
    "message": "I buy these regularly, they’re great for waitresses/serving, but the toes wear out quickly. They’re super comfortable, but I wish the toe was more reinforced."
  },
  {
    "user": "Nancy L.",
    "rating": 4.0,
    "message": "I’ve never been dissatisfied with my saucony shoes. Stylish, comfortable and durable!"
  },
  {
    "user": "Sue Hanish",
    "rating": 5.0,
    "message": "This is my 3rd pair of Sauconys from Amazon. Fast shipment and overall trusty shoe"
  },
  {
    "user": "Kayleigh Ferrantelli",
    "rating": 5.0,
    "message": "I never write Amazon reviews, but I just had to this time. I am a bigger person with back pain when I'm up and about for a while and also struggle with planters fasciitis. When I wake up in the morning and the pain hits when I stand up, I know my shoes weren't that great. Not these- I worked a whole weekend standing AND deep cleaned the house with these bad boys. Comfortable, supportive, the wide fit FITS. I felt nothing the next day (the day I wrote this review). Will be buying again."
  },
  {
    "user": "Jeanne M Kennedy",
    "rating": 4.0,
    "message": "I like the shoes but was disappointed in the laces.  They are very thin and cheap.  This was not the case with the other 2 pair I bought in 2020.  I replaced these laces but at that price I expected better quality.  A minor matter and the shoes do fit well."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have a few pair of Cohesions that I rotate. This pair, the inside heel wore through far too soon. Can not wear for running as a result as it rubs and gives me blisters. And of course, that is past the return date, so stuck with it."
  },
  {
    "user": "Fire",
    "rating": 4.0,
    "message": "Walking"
  },
  {
    "user": "Nathalie Fernandez",
    "rating": 5.0,
    "message": "excelente inversión, longevidad o ideal para regalar"
  },
  {
    "user": "jane",
    "rating": 5.0,
    "message": "Liked very much...."
  },
  {
    "user": "Shayna Nikayla",
    "rating": 5.0,
    "message": "I have worn saucony cohesions for years. I have 15's, 14's, and 13's as well. None of the newer ones are comfortable. The toe box is to small. My foot doesn't sit down in the shoe enough on the 15 and 14's, causing my foot to slip out of the shoe. The 12's are the perfect shoe in my opinon. Stable, comfortable, with just the right amount of arch support. Oh how I wish the newer ones fit the same."
  },
  {
    "user": "Heather Blue",
    "rating": 5.0,
    "message": "My orthopedist recommended these because I've got fallen arches and a shoddy knee. Great for working out and running. I've got bunions and these sneakers don't make them hurt. I swap back and forth from the original insoles and professional orthotics and they still fit perfect. These are my favorite running shoes."
  },
  {
    "user": "VOVA",
    "rating": 5.0,
    "message": "Very comfortable,  great looking,  lightweight shoes. So far pretty durable too."
  },
  {
    "user": "Slong",
    "rating": 5.0,
    "message": "Lightweight, comfy, fit is true to size"
  },
  {
    "user": "Libby Griffin",
    "rating": 5.0,
    "message": "Problem feet"
  },
  {
    "user": "amazonPT",
    "rating": 5.0,
    "message": "I love these shoes. They are comfortable right out of the box."
  },
  {
    "user": "C. Ham",
    "rating": 3.0,
    "message": "They have a great look.  They are great for daily walking.  After only 3.5 miles, my whole foot was numb.  I will not be using these for running."
  },
  {
    "user": "K",
    "rating": 5.0,
    "message": "Great lightweight and comfort shoe"
  },
  {
    "user": "Alan Hazell",
    "rating": 5.0,
    "message": "I love these shoes! I suffered a painful foot injury many years ago and these shoes  do not cause any pain as most other shoes do! Please do not  ever discontinue these sneakers or I’ll have to go shoeless 😁"
  },
  {
    "user": "Elizabeth W. Allshouse",
    "rating": 5.0,
    "message": "All my Saucony shoes are more comfortable than the diabetic shoe the doctor gave me. I highly recommend them.  You never see an advertisement for them, because they don't have to. I'm a returning customer for years now."
  },
  {
    "user": "carolyn",
    "rating": 3.0,
    "message": "Not very comfortable"
  },
  {
    "user": "Nicole Leatherman",
    "rating": 3.0,
    "message": "Other reviews stated that the wide wasn't wide and I should have listened. It isn't as wide as typical and the size was a bit to small also"
  },
  {
    "user": "TP",
    "rating": 4.0,
    "message": "I had same pair for two years. Many miles on them"
  },
  {
    "user": "Susan H.",
    "rating": 5.0,
    "message": "Really like the shoe. I needed for support and comfort for a foot pain and it did the job. I didn't use it for working out so I didn't rate that part. Very pleased with the shoe and it's a good looking shoe."
  },
  {
    "user": "Natasha",
    "rating": 5.0,
    "message": "It took 3 tries to get the right fit. I returned the 11 and 14. These fit like previous versions with the wider toe box. Super comfortable. Great and convenient return policy from this seller. Love these shoes."
  },
  {
    "user": "MLee",
    "rating": 5.0,
    "message": "Saucony sneakers have always been a good choice for me.  These sneakers are very comfortable, flexible, lightweight, and supportive.  The arch support, which is important for me, is very good.  My first day wearing these sneakers confirmed why I've always liked this brand.  There is no \"breaking in\" period.  They're good to go right out of the box."
  },
  {
    "user": "Sharon",
    "rating": 3.0,
    "message": "Good for casual walking. Very comfortable"
  },
  {
    "user": "Gwenllian Horne",
    "rating": 5.0,
    "message": "This is my third time purchasing this shoe. I'm not a runner, but I have a very active dog and usually walk between 4 and 8 miles a day - these shoes take it like a champ. The first set of pictures are my most recent pair, which I bought in October. With my usual walking habits and how often I wore them, I would estimate they have about 1000 miles on them. As you can see, they are definitely worn down and in need of replacement. I think the usage I get out of them is a great trade-off. I've used them hiking, rafting and in my day-to-day life. The second set of photos is my new pair, which arrived today. I love that they are comfortable from the get-go. It does help to break them in a bit before you take a rocky trail or something, but I comfortably walked 4 miles in them today. They look great and have great support. They're also very breathable, which is nice to minimize sweat. As for sizing, I buy size 8 for these shoes. Usually, I'm a 7.5 or an 8, so if you're deciding between two sizes, I would size up. There's not any wiggle room either. All-in-all, these shoes are really a steal for the price. There are plenty of similar quality shoes out there for $100 or more. These are worth everything they cost!"
  },
  {
    "user": "pcd1221",
    "rating": 3.0,
    "message": "This is my second pain of Cohesions and even though same size and width was order there is a difference in fit. This pair was not as wide as last and length is longer."
  },
  {
    "user": "R. Hill",
    "rating": 5.0,
    "message": "Got these for my older daughter. She wears a size 10 but I always go up a full size when ordering sneakers for myself or my kids, so I got her an 11. They're her absolute favourite and she wears them to school all the time and whenever she has to do a lot of walking. She says her feet don't hurt after a long day. Cushioned but firm at the same time. I absolutely love this brand."
  },
  {
    "user": "bibu",
    "rating": 4.0,
    "message": "liked the comfort and I use for home exercise."
  },
  {
    "user": "Jacq62",
    "rating": 5.0,
    "message": "These are very comfortable shoes I wear for work. Comfortable and great support!"
  },
  {
    "user": "Francesca Quirk",
    "rating": 5.0,
    "message": "These are the best shoes for people with foot pain.  The width is not restraining. I have bought several pairs of this shoe!  My favorite by far!"
  },
  {
    "user": "New Amazon shopper",
    "rating": 3.0,
    "message": "These shoes look great!!  Fix perfect as soon as I put them on. I liked everything about them, except for the insole.  It’s extremely hard feels like you’re walking on concrete.  I have worn them daily for a few days hoping to adjust to the feel. That didn’t help and there is already dents when the heel and the toes are."
  },
  {
    "user": "Vivienne",
    "rating": 5.0,
    "message": "I've balked at the idea of owning athletic shoes for a long time (I'm vain and very picky), but these are amazing. I have high arches, and these have been comfortable for 10-mile walks. They were also very easy to break in. 10/10"
  }
]