[
  {
    "user": "Katie Blanchard",
    "rating": 4.0,
    "message": "Great dupe for the vans. Love this slip on. I ordered a 1/2 size up due to the fact my feet are a little wide. Still fit great!"
  },
  {
    "user": "Kayla Norman",
    "rating": 4.0,
    "message": "Bought these for my child to design as school spirit shoes. Good material. We love them"
  },
  {
    "user": "Lesa herring",
    "rating": 4.0,
    "message": "Comfortable"
  },
  {
    "user": "Audrey",
    "rating": 5.0,
    "message": "Though it’s not recommended to buy these shoes for foot support but for those who don’t have foot problems could wear the shoes. I bought them for the white color so I can paint them and put lobsters 🦞 on them. I couldn’t find shoes with lobster prints made for the shoes so I decided to make my own. As advertised, with great seamless structured shoes as I hoped for. Though the only problems you might have is it’s white and something that can get dirty or strain might make you consider keeping them a inside shoes or spray them down with water proof spray for outside use. Other then that they’re snug on my feet and it’s my first time styling my own shoes so I hope they look good."
  },
  {
    "user": "Chevonne C. Bartlett",
    "rating": 4.0,
    "message": "These are a standard casual value sneaker. They look just like the photo and are a bright white. They are very comfortable to walk in for long periods. They pair great with casual dresses and shorts. My only complaint is that when they are new, they take a little time to break in - very typical for any shoe like this. The inside lip on the back of the shoe rubbed a little against my heel with each step, so this caused some discomfort. But now they are fine. Once they wear out, I would buy them again."
  },
  {
    "user": "Rae",
    "rating": 4.0,
    "message": "As per usual, I read a lot of reviews before buying, and I completely agree with all the others, order a half size or full size up! These shoes run a little small. I'm usually a 5.5 or 6, so I ordered a 6.5 and it fits like a charm. With all shoes, give yourself some time to get used to them, but so far they're great everyday shoes!"
  },
  {
    "user": "Linda L Pershing",
    "rating": 4.0,
    "message": "Style price"
  },
  {
    "user": "Aprilann",
    "rating": 4.0,
    "message": "Awesome shoes too bad they are so narrow"
  },
  {
    "user": "Andrea Burnett",
    "rating": 4.0,
    "message": "This is my favorite style shoe, and I'm a perfect size 7, but these were a little on the narrow side. Even after a wash, they held up well"
  },
  {
    "user": "Maria Martinez",
    "rating": 5.0,
    "message": "True to size and very comfortable"
  },
  {
    "user": "linda mueller",
    "rating": 5.0,
    "message": "Support walking distance for my back Good support"
  },
  {
    "user": "Alex S.",
    "rating": 5.0,
    "message": "I'm a teacher, so I walk around all day. After I broke these shoes in for a couple of days, they've become my favorite shoes. Way cheaper than Van's, but just as comfortable and they look the same!"
  },
  {
    "user": "Dana P.",
    "rating": 5.0,
    "message": "I actually used fabric markers on my shoes for fun. I find these shoes to be super comfortable. I do have narrow feet. I read reviews that some people find them to be too narrow, but I don't."
  },
  {
    "user": "fifer",
    "rating": 3.0,
    "message": "I had to return these.  At first they were comfortable, but after wearing and walking for a while, they did not meet the width requirement I needed and that was not an option listed in the size chart."
  },
  {
    "user": "Krich714",
    "rating": 3.0,
    "message": "Nothing too fancy to brag on. They get the job done. Not overly comfortable but they aren’t bothersome either. They are fine."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "These are cute but overall uncomfortable. They fit well but back part is stiff. They hurt my ankles if I walk too much in them."
  },
  {
    "user": "Abigail",
    "rating": 3.0,
    "message": "They made my heel bleed until they were finally broken in. I had to wear them with bandaids for like 6 weeks. I’m still wearing them though…don’t ask me why."
  },
  {
    "user": "Sheryl Elliott",
    "rating": 3.0,
    "message": "No support at all. Runs a little narrow and rubs my little toes on the outside. Would never wear them if I had to walk any distance. Should have spent a little more and gotten a better quality shoe."
  },
  {
    "user": "eJay2Fast",
    "rating": 5.0,
    "message": "Shoes are so bright, price is just right….. going to purchase more for backup pairs. Awesome!"
  },
  {
    "user": "Sunny Dinh",
    "rating": 4.0,
    "message": "I enjoy the shoe, but it’s not a wear for a long time type of comfort shoe. It’s a taking out the trash, running short errands shoe. Super cute, and recommend for those reasons."
  },
  {
    "user": "Deborah Shaw",
    "rating": 3.0,
    "message": "These shoes were advertised as fit true to size. Well the ones I received were smaller than the size I ordered. I ordered a 7 and couldn’t put my foot in them anymore than my toes. The are small and narrow so order at least a size up."
  },
  {
    "user": "Ayana Rashad",
    "rating": 5.0,
    "message": "Comfortable size true to fit."
  },
  {
    "user": "ML",
    "rating": 3.0,
    "message": "These will serve the purpose but I will go back to a name brand.  These are killing my feet."
  },
  {
    "user": "PJ",
    "rating": 3.0,
    "message": "I didn't really expect much quality with these - there is not much support at all - but I bought for quick trips in the garden and running to get the mail. And it works for this purpose. If you are looking for all day comfort or being able to take long walks this is NOT the shoe for you. They are stitched fine though. Holding together well."
  },
  {
    "user": "courtney",
    "rating": 5.0,
    "message": "Fit well, super comfy and great price"
  },
  {
    "user": "Patricia Dempsey",
    "rating": 3.0,
    "message": "Good slip into casual shoe. Seams inside scratch skin and requires coverinf with sticky foam craft dot or bandage tape to avo"
  },
  {
    "user": "J. Kelly",
    "rating": 5.0,
    "message": "These shoes are very comfortable and look great. They are true to size. I will order in another color."
  },
  {
    "user": "Christina lynn",
    "rating": 5.0,
    "message": "just make sure to go like .5 up if you have wide feet"
  },
  {
    "user": "melissa",
    "rating": 5.0,
    "message": "Love these shoes, perfect for running errands, I needed these shoes because I have to walk outside to do laundry at my apartment complex and these are perfect to slip on and go.  Also I wear size 11 and it’s hard to find shoes in my size, my style, and actually fit."
  },
  {
    "user": "Jessica",
    "rating": 2.0,
    "message": "I threw them in the washer after wearing them once, sadly a muddy dog stepped on my foot but when I got put if the washer there was a 2 inch yellow line all the way around the shoe. Can't wear them anymore, they look horrible!!! Very upset that they changed colors! I washed them on warm water with regular detergent on gentle cycle! Wish I could get a hold of company so that i could make them aware of this!"
  },
  {
    "user": "A",
    "rating": 5.0,
    "message": "If your closer to an 8 but can get away with 7.5 these will be snug"
  },
  {
    "user": "TC",
    "rating": 5.0,
    "message": "The the super cute look, comfort and fit. Well made!"
  },
  {
    "user": "Linda Stewart",
    "rating": 5.0,
    "message": "Shoes fit well and are comfortable"
  },
  {
    "user": "K.A.",
    "rating": 4.0,
    "message": "Well, I'm a Keds snob, I ain't gonna lie. Time And money being what they are though I can't afford to buy a new pair every time a smudge appears . I gave these a go and color me impressed! They're Comfy and provide good support too! Honestly, the only reason I marked it down one is because, well, as I said in the beginning, Keds snob."
  },
  {
    "user": "JRice",
    "rating": 4.0,
    "message": "I had wanted a pair of white casual slip on sneakers.  I was on a tight budget, so getting Vans or Keds were out.  I had read the reviews and all seemed pretty positive.  However, there was one aspect that I saw come up repeatedly and I will have to agree; the insole.  If you wear with your bare feet, which I typically do, the inner insole will come out when you take your foot out of the shoe.  It can be a bit annoying, but not the end of my world.  The shoes look cute and are comfortable.  I really like the padding on the back heel area.  Great shoes for the price!"
  },
  {
    "user": "Joy",
    "rating": 5.0,
    "message": "From many of the reviews that I read, I thought I would receive a poorly made pair of shoes with all kinds of blemishes etc..  No so! These Amazon Essentials slip on sneakers are well made, thick canvas and thick soles. Many reviews complained that the insoles comes out when taking off the shoes, That doesn't happen with the pair that I received. I even tried taking the insoles out by hand, and they are securely glued down. They are pure white and the size fits very well. As with any new shoes, they will stretch and form to your feet after several wears. I bought some Kiwi sneaker whitener to clean them when they get dirty. I highly recommend these ship on sneakers!"
  },
  {
    "user": "Jacqueline Woodfolk",
    "rating": 5.0,
    "message": "Nice"
  },
  {
    "user": "ocbreeze",
    "rating": 5.0,
    "message": "Nice sneaker..."
  },
  {
    "user": "Marcia",
    "rating": 5.0,
    "message": "I’m so happy I found these online here on amazon. I was going back and forth whether or not to but them from Vans or from here. Something everyone should know is that it’s literally the same pair of shoes just different brands. I’m really glad i came to that conclusion because honestly I would’ve ended up spending $50 on the EXACT same pair of shoes I see here for much less. At that point I was just going to pay for the brand. I highly recommend getting these, they are very comfortable, fit perfectly when I tried them on, and beautiful inside and out."
  },
  {
    "user": "Megan",
    "rating": 1.0,
    "message": "I wish they would send me a new pair. I went to a baseball game and there was some light dust by the field the shoes held on and trapped it. I’ve put them through the washer, scrubbed with pine sol, and washed with dawn. It all collected in the creases. I wish I could get a new pair and I’ll never wear them around dust again! The design is not for that it’s seems I had to learn the hard way"
  },
  {
    "user": "Annelisa",
    "rating": 5.0,
    "message": "I thought these may be uncomfortable, or poorly made, but these are great shoes.  I've paid three times as much for Keds similar to these and these shoes are more comfortable.  I'm consistently between an 8 and an 8.5 so I went for the 8.5 and love how they fit. Wore them new for a long, long day out of a fishing boat and came home with happy feet but no fish.  I'm hoping these come back soon because I love them."
  },
  {
    "user": "heather",
    "rating": 2.0,
    "message": "Just not soft,  felt stiff and hard"
  },
  {
    "user": "Nexus430",
    "rating": 5.0,
    "message": "these shoes are super comfortable. As soon as I put them on, they immediately adapted to the shape of my foot and when walking with them the comfort was so great that I said to myself: I have to write a review for people like me, that my feet swell very often, for them to enjoy walking without pain or feeling tight feet. I recommend it 100%. And I'm already buying a second pair but in a different color."
  },
  {
    "user": "KarynH",
    "rating": 4.0,
    "message": "I use shoes like these as house shoes, or basically slippers. These are very comfortable, spot-on for fit, and you can't beat the price. The front part of the insole in the right shoe started to come up the second day I wore them but I wasn't surprised. This happens with a lot of shoes, even some expensive ones. If it ever comes completely out I'll re-glue it. If not, I honestly don't care. I'll be ordering another pair in black (I got the grey ones)."
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "message": "Should've read the reviews before ordering, they are quite narrow. Wider or thicker feet will need a half to full size up to be comfortable. I managed to get them on but they hurt so bad there wasn't a possibility of stretching them out. Will be returning them as I've learned my lesson!"
  },
  {
    "user": "June",
    "rating": 4.0,
    "message": "a very good shoe.  Well made.  The vamp is a little high for me because I have a high instep.  I also have a narrow foot, so  there is room in \\the shoe for a sock which prevents the van from rubbing on the insteon."
  },
  {
    "user": "TerryG",
    "rating": 5.0,
    "message": "I got these slip ons to wear around the house and around the yard. They are so comfy and the padded collar snugs right up to your ankle keeping them from slipping on your foot. I however am terrible with anything white. I will be dyeing these so that the dust and dirt won't be as noticeable. Maybe tye dyed would be good :). Worth the small price and quick shipping and I will be ordering more. Hopefully they'll start selling them in colors."
  },
  {
    "user": "Megan",
    "rating": 2.0,
    "message": "I was hoping these would be comfy slip ons, but they are very stiff feeling and aren’t soft on the top like I had hoped."
  },
  {
    "user": "racehorse6",
    "rating": 5.0,
    "message": "I ordered these preemptively for third trimester feet swelling but they fit great and are comfortable with my feet at their normal size. Still some room all around should my feet swell over the next few weeks. Never been one to wear this style of shoe before but I like how easy they are to get on and off. Bending over will become increasingly challenging, so this was an important feature for me. They make a casual outfit look a little nicer than just wearing flip flips and are good for transitional weather. Not terribly supportive or cushioned but I’m not planning on walking miles at a time in them. Did not need any breaking in time."
  },
  {
    "user": "Veracity Reviews",
    "rating": 5.0,
    "message": "I love these shoes! They are comfortable, lightweight & simply perfect. I work in a childcare & I have washed these shoes every week for a month. ( It's a must) The dirty spots come off easily on the top fabric part. The insoles come off sometimes. I have wide calves & feet. At first they did feel a bit tight, but not enough for broken skin. After a day it was broken in."
  },
  {
    "user": "Katherineeelaine",
    "rating": 4.0,
    "message": "I usually wear a size 8.5 and after reading other reviews about these running small I ordered a 9. Glad I did because they fit perfectly. The shoes look pretty well constructed on the outside. The padding inside seems comparable to my other tennishoes. The over all fit of the shoe is form fitting and on the narrow side. If you have wide feet I would consider looking at other brands."
  },
  {
    "user": "ssm",
    "rating": 3.0,
    "message": "For the price and my purposes, they work. I would not buy them again, though. I only bought these to have a pair of slip-on shoes to wear while cleaning the house (a weekly 4-hour task). I normally wear 7 Wide but will size up to 7.5 if Wide is not an option, like with these. The width of the 7.5 is still quite snug, but the length is as expected. My biggest problem with these is that the height of the bridge of my foot is larger than the shoe opening wants to be, so the top of my foot ends up looking pretty beat up when I'm done cleaning. I'm hoping that they'll stretch out over time. If I had bought them for everyday use, I would have definitely sent them back."
  },
  {
    "user": "A",
    "rating": 4.0,
    "message": "Very comfy shoes for little money! After about 6 months they did begin to get a little loose in the heel. But to be fair I wore them almost every day! So great value for 6 months and small price tag. I ordered two more pair. So comfy!"
  },
  {
    "user": "naboudib",
    "rating": 5.0,
    "message": "I used to buy a similar white slip on fabric shoe from another company in bulk because I love them so much. Wellll they stopped selling them and I couldn't find anything remotely similar until I found these and let me tell you...I LOVE THEM!! They are easy to slip on, extremely comfortable and my feet don't sweat in them!  I thought they were a little on the pricey side, but they are worth the money! My normal size is 8.5, which is what I ordered and they fit like a glove!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They run a little small but are nice white simple sneakers."
  },
  {
    "user": "ETZ",
    "rating": 4.0,
    "message": "Everything i was happy with accept i have high arch so does tighter if tops of your feet are thick or raised higher."
  },
  {
    "user": "M. Turchi",
    "rating": 2.0,
    "message": "Ugly slip-on htat I will be returning."
  },
  {
    "user": "Diana",
    "rating": 3.0,
    "message": "An inexpensive simple shoe that would go with many items in your spring and summer wardrobe. My biggest concern with issue is that it has no arch support. And I do mean none. I kept the shoe with the idea that I would put an arch support that. I hope that works out. But at that point you’re spending $10-$20 more to upgrade the shoe. You might just want to buy a better shoe."
  },
  {
    "user": "Krystin Fri",
    "rating": 3.0,
    "message": "I usually wear 6 1/2 or 7. I bought the 7 and could barely get these on. I cut the elastic but they still rubbed the back of my ankle pretty bad. Size up and do not buy if you have wide/thick feet"
  },
  {
    "user": "Mal",
    "rating": 5.0,
    "message": "I got these shoes for work! I work at a school with young children so they’re always stepping on my toes since they don’t know personal space just yet! I wanted a nice cheap pair I wouldn’t mind if they got dirty. They’re comfortable, and I have no problem wearing them all day working on my feet!"
  },
  {
    "user": "Susan Lynch",
    "rating": 5.0,
    "message": "My teenage daughter loves white tennis shoes. Instead of wearing her air force ones I got her these to wear because for the price I don’t mind if she gets them dirty, I can wash them. Now she wears these more than the expensive airforce ones. Fit was perfect. She is a size 7 and that’s what I ordered for her. Thank you !"
  },
  {
    "user": "Christy Bass",
    "rating": 5.0,
    "message": "I looked at these for a while before i bought them and still wasn’t sure about them when they were delivered. But i love them. They are so comfy. I’ll order another pair when these get too dirty. I do have to wear no show socks, otherwise the rub my pinky toes and my heels."
  },
  {
    "user": "marissa T.",
    "rating": 5.0,
    "message": "I love these! After reading all the other reviews I sized up half a size. I normally wear an 8 so I ordered 8.5 & it fit perfectly. They were comfy but somewhat tight at first, but stretched out throughout my first day wearing them & now they’re perfect! I highly recommend, especially for the price!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Definitely a good shoe for the price. I stand all day for work (I teach health education) and I’m on my feet for HOURS. I need a shoe that’s business casual. They aren’t the most comfortable shoes but they are much more comfortable than cheap flats. I’ll probably add a heal support because honestly when you’re standing for 8 hrs, every shoe becomes uncomfortable lol. Love how simple they are and how i Can wear them with just about anything. I feel like they run a little smaller so maybe half size up or full size up (which you should do with all sneakers IMO)."
  },
  {
    "user": "Tia R",
    "rating": 4.0,
    "message": "For me they were uncomfortable. But that’s only because I need a wide. Overall they are nice."
  },
  {
    "user": "Nayellis",
    "rating": 4.0,
    "message": "Super cute! A little to get used to, but with the right socks they are pretty great"
  },
  {
    "user": "Tiff Setzler",
    "rating": 3.0,
    "message": "The shoes are okay for the price paid. They are very tight to the point you cannot wear socks.  However the inside is very soft, and cushiony so it's fine.  Just a little rough getting on and off.  The length of the shoe is the correct size. My two biggest complaints are that the front half of the insert comes up when you take the shoes off, so you have to keep pushing it back down. Along with that there are annoying tabs on the inside, that keep rubbing the side of your foot, you have to cut them out, which is a real pain."
  },
  {
    "user": "Samantha",
    "rating": 4.0,
    "message": "You get what you pay for with these. I would've appreciated them to be a tad more roomy as I was already ordering a half size up, but for the price I'll take what I can get. They fit fine and they look nice. Go with most outfits. Would appreciate more cushion too."
  },
  {
    "user": "victoria lynn",
    "rating": 5.0,
    "message": "I love these shoes they were exactly what I needed I volunteer with a small feral cat colony TNR on one of the trails which is hard on shoes so  didn't want anything expensive, plus I do gardening.  Went by other reviews to order one size larger and glad I did because  they do run a little slim but  they are working out great so glad I found them, great price too now I can save my more expensive shoes for the gym."
  },
  {
    "user": "Customer",
    "rating": 3.0,
    "message": "I had to use a shoe horn to get these shoes on. The back is not flexible enough to use my finger to ease it on. The sides were also too high for my feet. They rubbed my ankle bones.  I returned the shoes."
  },
  {
    "user": "Patty",
    "rating": 4.0,
    "message": "Bought for my mom,  she loves them"
  },
  {
    "user": "cass",
    "rating": 5.0,
    "message": "These are super cute and cost much less than others. I have wide feet so I ordered half size up. They fit great and are very comfortable. One shoe does rub the back of my heel, but not enough to make uncomfortable."
  },
  {
    "user": "A.v",
    "rating": 4.0,
    "message": "Very narrow shoe but is cute good quality for the price"
  },
  {
    "user": "LR Jordan",
    "rating": 4.0,
    "message": "love slip ons and these fit the bill"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I absolutely love these shoes, perfect dupe for Vans! These are a bit more stretchy than Vans, and fit true to size. Just like Vans these don’t really have any support but they’re the perfect slip on shoe. Definitely buying a second pair!"
  },
  {
    "user": "Maureen Lawton",
    "rating": 4.0,
    "message": "They run a little big"
  },
  {
    "user": "eleanor glorioso",
    "rating": 5.0,
    "message": "Definately read  the description  carefully and order 1/2 size larger than your regular fit because these are described as being narrow, which for me means tight so I ordered 1/2 size up and the fit  is perfect!"
  },
  {
    "user": "KB",
    "rating": 5.0,
    "message": "Looooove these! They’re comfy and the perfect versatile shoe. I dropped a bottle of wine and the splatter got allll over them. Since they’re white I was easily able to spray them with a mixture of bleach and water and rinse under hot water. The wine is totally gone without a trace and it was super easy to do. Highly recommend if you want something that’s easy to wash."
  },
  {
    "user": "Bev",
    "rating": 3.0,
    "message": "Not sure. They’re definitely cute, but after the first day the back of the shoe was digging into my Achilles. I had to take them off after about 4 hours, I couldn’t stand the pain. Hopefully they’ll soften up."
  },
  {
    "user": "Elli Decker",
    "rating": 4.0,
    "message": "They’re super cute for the price but they run about 1/2 a size too small. I ended up reselling mine on facebook because I didn’t want to bother with returning them."
  },
  {
    "user": "bo lim",
    "rating": 4.0,
    "message": "Shoes are cute and look good, problem was that it runs small. I wear a size 7 in woman and it didn't fit. I suggest to buy a size up"
  },
  {
    "user": "widdershins",
    "rating": 3.0,
    "message": "At this price, it seemed worth the risk of a bad fit.  Alas, too tight in width and depth despite sizing up as suggested.  When I remove the shoes, the sole follows.  So as a square footed (short/wide) person, I recommend paying more for safer/better fit.  For slimmer feet, these might serve."
  },
  {
    "user": "Arie",
    "rating": 4.0,
    "message": "I wanted some easy slip shoes for Spring/Summer and wanted something cheap but cute. And I came to Amazon and found theses shoes and they're incredibly comfortable and fit as expected."
  },
  {
    "user": "Mara",
    "rating": 5.0,
    "message": "LOVE these. I sized up originally based on reviews, but found that my normal size was perfect so I exchanged them. My feet are narrow so maybe that is why. But these are so comfortable I wish they came in more colors!"
  },
  {
    "user": "Cait",
    "rating": 4.0,
    "message": "I’m a 6.5 or 7 usually. I bought the 7 and it fits great. Tight at first but it molds to your foot. They’re sturdy but not cushioned. Comfortable."
  },
  {
    "user": "A Dawg McGoo",
    "rating": 3.0,
    "message": "Way too narrow! I got them to paint on and that part was great but then I gave them away because they were too narrow to get my foot in ;("
  },
  {
    "user": "Bg",
    "rating": 4.0,
    "message": "Shoes arrived today, the size runs small very tight. I do recommend you go up a size when ordering. I recommend this product."
  },
  {
    "user": "Raylynn",
    "rating": 4.0,
    "message": "I really enjoyed them and they are my everyday show. I haven’t had it long but it’s starting to tear a little side but I hardly notice even when looking at it."
  },
  {
    "user": "Kaylie Ford",
    "rating": 4.0,
    "message": "Very comfortable and affordable but not high quality. I purchased these to wear during a short vacation and they held up great for a lot of walking. The insoles came out every time I took them off."
  },
  {
    "user": "Melissa Irias",
    "rating": 5.0,
    "message": "AMAZING SHOES! they are great I like that the sole inside can be removed and you can switch to some gel ones if youd like the original are comfy! I wear size 6, ordered size 6 and fit spot on. I dont wear socks with them though IF I did wear socks with them I'd need to size up."
  },
  {
    "user": "Sylvia Russell",
    "rating": 1.0,
    "message": "These shoes are too small, they don't fit. Why doesnt Amazon refund my money."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Adorable!! I wanted a pair of white vans but I have a toddler and I knew I didn’t want to spend 70 bucks on a pair of sneakers that would get destroyed within hours. These shoes are narrow but so are my feet and I ordered true to size. No blisters or breaking in- fit perfect and I’m obsessed and so happy!!"
  },
  {
    "user": "KMiller",
    "rating": 4.0,
    "message": "Very cute shoes, unfortunately I have \"tall\" feet for lack of better terms and they're too tight on the top of my feet. Bummed because they look great!"
  },
  {
    "user": "Bree",
    "rating": 3.0,
    "message": "The price is great! Although wearing them for a full day killed my feet, not very comfortable for long periods of time."
  },
  {
    "user": "Rhonda M",
    "rating": 3.0,
    "message": "This shoe is very difficult to get on the foot and when trying to take it off, the entire inner foot pad comes out and has to be pushed back into the shoe. Very uncomfortable and unable to be worn for more than half an hour. I own a gray pair and the material and fit are completely different. I tried a size up in the black but it didn't make a difference-still uncomfortable."
  },
  {
    "user": "Victor Alvarez",
    "rating": 4.0,
    "message": "Got half a size bigger and they fit perfect. The sole does come out but it’s not an issue."
  },
  {
    "user": "alissa Anne elliott",
    "rating": 5.0,
    "message": "My first pair of shoes were delivered by UPS on December the 10th.The UPS driver didn’t put the shoes in my screened front porch.So when I arrived home our dog had destroyed my new white shoes. So I had to order another pair and had them delivered to my place of work. The shoes look great 👍 Can’t wait to wear them 😊"
  },
  {
    "user": "Nelle",
    "rating": 5.0,
    "message": "I have seen and considered a lot of knock off vans in my life, but these really are a great substitute if you're not trying to drop a lot of money on casual shoes. The details are perfect. Super simple, tasteful, none of that weird stitching or obvious give aways that scream \"I can't afford brand names!\" I love these shoes."
  },
  {
    "user": "Michelle",
    "rating": 3.0,
    "message": "When I first tried these on I thought wow they are so tight!! I wore them a little more and they ended up stretching out and getting comfortable except one of the feet seemed tighter than the other for a little while longer.. The inside bottom liner comes up and out sometimes when I take them off. For the price not horrible but would not purchase again"
  },
  {
    "user": "Angelita Esquivel",
    "rating": 5.0,
    "message": "These shoes are great... I love them. I wear 8 1/2 but went a helf size bigger and they fit perfec...they're a little tight at first but whan you keep wearing them.. They start to loosen.. I also have them in (blck and white) and im going to order the grey one pretty soon here.. I just wish they had them in blue"
  }
]