[
  {
    "user": "NoEffn Name",
    "rating": 4.0,
    "message": "it felt like putting a slipper on, so soft and unstructured...and has about as much support as a slipper. Don't get me wrong, i kept them and have been wearing the everyday around the house but I had to put my orthotics in because they have no arch at all. Sole is pretty thin--they are really only suited to lite athleisure which is why i think they are overpriced (but luckily i got them on sale). On the plus side, they are definitely wide, almost too wide for my wide feet, which is shocking for women's shoes which always run narrow. But best of all is the color! I got the vibrant blue and love it. It is SO nice to be able to buy a wide womens' shoe that isn't grey, white, or pink. The color alone made them a 4 star review, it's somewhere between blue and purple and very bright--love it"
  },
  {
    "user": "Gloria",
    "rating": 5.0,
    "message": "updating my review from a few days ago: since they were beyond return date and were no good as they were, I pulled out insole and found a wad of brown paper under it. I assume it landed in there accidentally during final production steps, but regardless, I removed it, replaced sole, and they're good to go. These are nice, lightweight, slip on sport shoes. previous review: I bought these in June for my daughter who's out of the country. Got them to her in August. She started wearing them in Sept as it cooled off and really liked them, but just realized recently there's a hard, marble sized lump of something underneath the glued down insole in middle of one shoe. Not supposed to be there. I think it will probable become painful or more noticeable the more she wears them. I'm sure it's an unintentional flaw and would like to exchange for another pair but they're past the \"return window.\" I have a pair of these that I love, however."
  },
  {
    "user": "Steph",
    "rating": 5.0,
    "message": "These are my second time to purchase these shoes…love them! Super stylish and unique with out being too flashy. I normally wear an 8.5, and I wear a 9 in these…they run just a tad small. Don’t hesitate to get these! Make sure you buy them when they are lower in price. I paid $39.99 for them. They are great, but definitely not worth $64.99!! They are cute and comfortable, but definitely not super supportive."
  },
  {
    "user": "KC",
    "rating": 5.0,
    "message": "I have several pairs of these shoes. Three different colors right now. I have purchased the black ones 3-4 times because they are my favorite. I wear them almost everyday so they get a lot of use. I love that I can slip them on quickly and don’t have to untie the laces! I will continue to repurchase as they wear out. Super comfortable."
  },
  {
    "user": "Middle America",
    "rating": 5.0,
    "message": "I love these shoes so much I'm ordering a second pair bc they are now on sale! I wear them at my HIIT gym with an Assault bike. They are comfy walking around, but I would not wear them for long walking days or even medium walking days. I also dont think they'd be great for HIIT work outs including treadmills. I ordered a half size up as other reviews suggested. Very happy with this purchase."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love the color. Fits my wide foot well and looks nice. Tons of compliments about the style and color. Gave it 4 because of lacking arch support. But easily remedied with an insert which is possible given the good fit."
  },
  {
    "user": "Linda Sullivan",
    "rating": 4.0,
    "message": "I did order a half size larger and a wide width because of the reviews but I think I could have gone even a whole size up. I could have a little wider also but I could wear thinner socks and make it work. Very comfortable so I kept them."
  },
  {
    "user": "Paigef",
    "rating": 4.0,
    "message": "I had to order these three times to try and get the correct fit. The size I ended up with was a half size bigger than what I normally order and they ended up being a bit too big. However, my normal size is too small. The shoes are cute which is why I kept them. However, they do not have the support for working out, mainly just for normal wear."
  },
  {
    "user": "RCD",
    "rating": 4.0,
    "message": "These shows are very comfortable, and are nice for wearing around the house or walking a little but are not supportive enough for longer walks or working out."
  },
  {
    "user": "karen quinn",
    "rating": 4.0,
    "message": "they run small. i wear a 5, I bought a 6 as I like extra room when I exercise and these very snug"
  },
  {
    "user": "C.M.",
    "rating": 5.0,
    "message": "I'm on my feet at work and home. These are the only shoes I bought that don't hurt my feet. I even splurged on an expensive pair of Brooks that I can't wear. Thank God I finally found something."
  },
  {
    "user": "Darlene Riel",
    "rating": 5.0,
    "message": "Ok so ordered a 7 1/2 my usual size and they just fit!Tightly..so wore in house 2 days and now like a custom fit!It did stretch and they are perfect!I guess you could speed up that process with a thick pair of socks but I wear barefoot!Love!Love!Love!"
  },
  {
    "user": "Yara",
    "rating": 4.0,
    "message": "These sneakers are very comfortable and I use them al most daily for walking. However I could have used a 1/2 size larger. I’m an 8 but the show runs a 1/2 size small - so a 81/2 would have been better."
  },
  {
    "user": "Klamy1",
    "rating": 4.0,
    "message": "Would I buy these again? No. But they’re fine work shoes and will get the job done."
  },
  {
    "user": "Rich Juergensen",
    "rating": 4.0,
    "message": "The sole came unglued after only being worn a few time.  Very disappointed! Update: seller made things right and I will be trying another pair as they are super lightweight and comfortable."
  },
  {
    "user": "Jeanette C",
    "rating": 4.0,
    "message": "These shoes look nice and feel nice for everyday wear. But when I take walks of more than 20 minutes, the bottom of my foot starts to hurt. It seems I need more arch support than this shoe offers. I haven't had this problem with other New Balance shoes I've owned, even when they're getting old and worn."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I need 8 wide and these fit perfectly!  I can't believe how light weight and airy they are!  Love them!"
  },
  {
    "user": "Abigail Miles",
    "rating": 5.0,
    "message": "I am a true size 7 they fit perfect! Super comfy and they have laces but I just slip on they are just so easy to put on and very light!"
  },
  {
    "user": "Maddison W.",
    "rating": 5.0,
    "message": "Very comfortable and fashionable. Extremely lightweight due to foam sole and breathable upper material. Easy to slip on and off without untying the laces (not a step-in situation). The color is a nice soft blush/mauve, though admittedly on the tan end of that spectrum. No blue to speak of unless referring to the silver-toned accent striping. Overall, a good shoe. I'm enjoying breaking them in for Disney trip."
  },
  {
    "user": "Rebecca Hurwitz",
    "rating": 3.0,
    "message": "I bought these to wear for everyday, casual but nice sneakers. I haven't bought many sneakers online before, so I decided that they look really nice and I'll try them. When they got here, I tried them on and they still look nice but they feel way too thin for my liking. It feels like I can feel the earth beneath me. So, I put some insoles in them and they feel better but was not thrilled. I took them for a quick stroll and I realized that my feet were trying to roll inwards as if I was standing pigeon toed - which I have never had before. I was wondering why this was happening and believe its because the silhouette curve of the sole goes so far in when it reaches the arch that I guess there's not much surface area for my foot to lay on, which makes my feet want to roll in. It may seem like a subtle design choice, but it really should not be that narrow at the arch. Ultimately, with the insoles that I added and the shoes look nice I guess I will keep them but I will probably have to upgrade in 6 months which is not what I was looking for."
  },
  {
    "user": "Shopgirl",
    "rating": 5.0,
    "message": "I had stopped buying NB sneakers as the foam insole was not maintaining support and comfort. These are wonderful, have worn them on outings and a couple of long walks- so far they are great. And they are cute- get positive comments about them when out."
  },
  {
    "user": "Julianne Y",
    "rating": 5.0,
    "message": "So cute and comfy! I have wanted a pair of black tennis shoes and have these in white and the black  are super cute and super comfy! Will buy again!"
  },
  {
    "user": "Cameryn",
    "rating": 5.0,
    "message": "Love the sleek, slim look these athletic shoes have! They aren’t bulky or heavy like some shoes are. My only complaint is I wished they had a little thicker foam insert to provide more comfort after being on my feet all day. Otherwise, they are perfect and I would absolutely purchase them again!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are very comfortable good for walking for a long time"
  },
  {
    "user": "Marilyn Hope Lake, Ph.D. author",
    "rating": 5.0,
    "message": "I love the fact that it goes with everything. I'm not just a little old lady in white tennis shoes, I'm a senior with chic tennis shoes!!!"
  },
  {
    "user": "Stacy A.",
    "rating": 4.0,
    "message": "I absolutely love the shoes, light and airy, however due to the way they are made they run small and a little narrow.  I ordered up a half size and got wide width and thought that would work.  I really need another half size up but waited too long to exchange.  I'm praying they continue to stretch."
  },
  {
    "user": "Angie K",
    "rating": 5.0,
    "message": "I have several pairs of this style shoe. They feel tight at first but give them a day or two and they are great. Super light weight and comfy. I wear a 10 and always purchase my regular size."
  },
  {
    "user": "Alicia Plaza",
    "rating": 5.0,
    "message": "As pictured. Very light sneakers."
  },
  {
    "user": "Hailey",
    "rating": 5.0,
    "message": "I bought these when my feet really started to hurt during pregnancy and between the light weight, support and stretchy ness they have been my go to. Highly recommend!"
  },
  {
    "user": "Jamie",
    "rating": 5.0,
    "message": "If you’re debating, they’re definitely with the purchase. I can’t say how they hold up because I just received them, but they are super lightweight and comfy, and the the color (logwood) is everything I hoped it would be. I’m an 8 normally with average width so I ordered an 8, and they fit perfect. I’m so glad I didn’t size up as some other reviews indicated."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "One of my Favorate pairs of shoes, super comfortable!"
  },
  {
    "user": "24/7momma",
    "rating": 5.0,
    "message": "These feel great! I don’t like anything squeezing my feet. These are wide enough without being too loose."
  },
  {
    "user": "Allison Cross",
    "rating": 5.0,
    "message": "This is the most comfortable shoe I think I ever had"
  },
  {
    "user": "Leslie Lee",
    "rating": 5.0,
    "message": "These are cute skeakers, but I think best for walking and standing on your feet during a long day. Not sturdy enough for a hard work out or running."
  },
  {
    "user": "Joan Parulski",
    "rating": 5.0,
    "message": "The most comfortable shoes I have found to wear being on my feet all day."
  },
  {
    "user": "Kimberly Day",
    "rating": 5.0,
    "message": "These are very nice! I could have sized down .5 size though."
  },
  {
    "user": "Allyson Jayne",
    "rating": 5.0,
    "message": "I wore these for 3 days in Disneyland and didn't have any pain whatsoever. Super comfortable."
  },
  {
    "user": "Molly",
    "rating": 5.0,
    "message": "Super cute, and comfy! But I would size up either a half or whole size! I am usually a 9/9.5 in shoes, and I ordered a 9, and they were WAY too small. I returned them and got the 9.5. The 9.5 is still a *little* snug, but I didn’t feel like returning them a second time haha, but the 10 would have probably fit me perfectly."
  },
  {
    "user": "Laura Johns",
    "rating": 5.0,
    "message": "Bought for my daughter to work as a car hop in and they are very comfortable for all the walking she does."
  },
  {
    "user": "AZCO 2019",
    "rating": 5.0,
    "message": "I have several pair- wear them everyday!"
  },
  {
    "user": "Rebecca",
    "rating": 4.0,
    "message": "This specific one seems quite different from prior ones. While the cut & fit are about spot on, the white foam seems a much less bouncy, but more rigid, almost heavy styrofoam type vs the bouncy cushiony foam of prior shoes. I’ve worn this one now twice, only running errands for a few hours each time so no heavy use or long wear & then foam has visible stress points & creases. I have well worn pairs from 3 years ago that look like this after probably 50 wears. Disappointed in the foam/bottom part this go round. I love this style of shoe, over the last 5 years I’ve had 4-5 diff black white ones as they get used most & I retire them from nice looking to hiking to lawnmowing lol, so they last a while (& currently still have 7 other colors too that are worn when matched) the cut/opening is flattering even with shorts Or t-shirt/sweatshirt dresses - very comfortable, like a not really conforming yet supportive & flexible shoe. I wear the fuel core shoes to hike, mow my lawn, walk dog, workout & just all around leisure. I have a average foot width but size 10 so slimmer, very high arch but tend to like shoes with natural cushion or support vs rigid support, the ties are adjustable to fit the more narrow middle of your foot & then surprisingly they slip on & off & you don’t have to tie each wear. So convenient & a great everyday shoe. Quality seems to be drifting though suddenly as with most things post 2020."
  },
  {
    "user": "Alvaro sermeno",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Kelsey OToole",
    "rating": 5.0,
    "message": "So lightweight and comfortable, I am on my third pair. I get tons of compliments as well!"
  },
  {
    "user": "Eleanor Sanchez",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Abby H.",
    "rating": 4.0,
    "message": "I normally wear an 8 in New Balance shoes, so I didn't size up as some reviews mentioned.  I should have!  I have this same shoe from several years ago and they fit great. I ordered these on the same size and there is barely any wiggle room for my toes. I'm going to order a full size up and see if that helps (want to wear with and without socks).  These shoes are otherwise super comfortable and nice looking. I wouldn't try wearing them for any heavy duty running or exercise. I think they are too lightweight for that. They are great for walking and daily wear, though!"
  },
  {
    "user": "EL",
    "rating": 5.0,
    "message": "I love these shoes. They are less structured than typical running shoes, thus a little less supportive. However I didn't want clunky heavy shoes, as I use these for lifting. They are perfect for the gym, required no breaking in at all. I have since purchased another pair."
  },
  {
    "user": "Lizzie",
    "rating": 5.0,
    "message": "Great fit, feet didn't hurt after my workout."
  },
  {
    "user": "pjt",
    "rating": 5.0,
    "message": "I own seven pair of these shoes in various colors. Need I say more? I can walk for miles in these. The only thing is the memory foam does start to lessen but that is only after much use over a long period of time"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Not enough cushion"
  },
  {
    "user": "Rebecca Hicks",
    "rating": 5.0,
    "message": "I love the comfort and how they feel"
  },
  {
    "user": "Cheryl R. Jones",
    "rating": 5.0,
    "message": "I walk @ 5 miles every day and this shoe is perfect. The comfort level is amazing and the memory foam inner sole makes it feel like I’m walking on clouds. I love the fact I don’t have to wear socks nor worry about blisters. I just purchased my 5th pair of these shoes and cannot imagine going to another style or brand in the future."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "This was a great shoe. Wore it for a long period of time just straight standing and walking and it was perfect."
  },
  {
    "user": "Jenna Zarraga",
    "rating": 4.0,
    "message": "Love them for everyday where but wouldn’t use for running or working out!! Very comfortable bit where out sooner than I expected!"
  },
  {
    "user": "Heather Flanagan",
    "rating": 5.0,
    "message": "I love the subtle hint of Neon color. They're extremely light and easy to slip on and off. By far my favorite shoes for walking and daily activities."
  },
  {
    "user": "Angelika B.",
    "rating": 5.0,
    "message": "Very light and comfy sneakers"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great sneakers for those who need a wide toe box. Comfy and supportive."
  },
  {
    "user": "Pinkgirl22jg",
    "rating": 5.0,
    "message": "I can’t remember what they called this color it’s kind of like a lightish lavender  gray.  The shoes are super comfortable so good from minute one!"
  },
  {
    "user": "caylex",
    "rating": 4.0,
    "message": "I was hoping for ease in slipping these on, which is the reason I ordered them.  For me, I have to tug at the heel to get them on.  However, once they are on my feet the shoes are very comfortable and fit well.  I did not size up, but I did order the wide width because sometimes I wear a wide, other times I don't."
  },
  {
    "user": "Paris1973",
    "rating": 4.0,
    "message": "Liked the shoe but it was too small. Ordered my usual size but had to return it."
  },
  {
    "user": "Michele",
    "rating": 5.0,
    "message": "It’s used as an indoor shoe. It is sooooo comfortable and a terrific shoe for exercising!"
  },
  {
    "user": "Mariel Cali",
    "rating": 5.0,
    "message": "Best shoes for being on your feet all day! I read the reviews of shoes running a bit small so I ordered a half a size bigger and it fit perfectly!"
  },
  {
    "user": "Diane",
    "rating": 4.0,
    "message": "I love these shoes. Great arch support, lightweight and look great. I walk about  250 minutes a week (about 2-2.5 miles per day). These have held up well. I have usually worn a New Balance shoe but I never had tried this model before. My problem before has been worn out tread so had to throw out shoe after about 6 months. I have been wearing these for about 4-5 months and so far no tread problems. Highly recommend."
  },
  {
    "user": "C l willman",
    "rating": 5.0,
    "message": "Excellent"
  },
  {
    "user": "Art bug",
    "rating": 5.0,
    "message": "I like the comfortable fit and the fact that they don’t hurt my little toes on my left foot that are damaged and hurt all the time in all other shoes.  These are the best and look great too!  I keep getting compliments on how great they look.  I’ll be getting another pair soon for sure!"
  },
  {
    "user": "Terri",
    "rating": 5.0,
    "message": "I love these tennis shoes.  These are the most comfy shoes to work out in!!!  Love them!!!!!"
  },
  {
    "user": "djm",
    "rating": 4.0,
    "message": "Id try sizing up half a size. I normally wear 9 in women but had to exchange for 9.5. Im not a high activity kinda person but these feel good on my walks and errands"
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "Love this style of New Balance sneakers! I have many pairs in different colors. Very comfy. I am a nurse and they are great for standing and walking. Everyone at work loves/noticed the colors. I get a lot of compliments on them."
  },
  {
    "user": "Christensterling",
    "rating": 5.0,
    "message": "Super comfortable from the start… no need to break them in. TTS. I would buy again!"
  },
  {
    "user": "Daisy Dean",
    "rating": 5.0,
    "message": "The shoes have a lot of room in the forefoot; no toe squeezing; very lightweight and comfortable; ordered a 2nd pair directly after receiving the 1st pair."
  },
  {
    "user": "Marcy Moss",
    "rating": 4.0,
    "message": "They are comfortable"
  },
  {
    "user": "Ambra Britton",
    "rating": 5.0,
    "message": "I bought these shoes to work out in and they were better than expected. The shoes are light weight and the material expands to fit your feet perfectly. 5 out of 5 ⭐️"
  },
  {
    "user": "Janelle",
    "rating": 5.0,
    "message": "I’m a fan of New Balance. They’re always the most comfortable for me. But in all the years I’ve been wearing this brand, I’ve never had a pair quite this comfortable! I can be on my foot for 12+ hours straight and be comfortable. They run true to size for me, too."
  },
  {
    "user": "H&A",
    "rating": 5.0,
    "message": "I am a nurse/ caregiver at a assisted liveing and memory care center and I am always on my feet I have tried so many shoes and not even crocks compared to this if you are second guessing  honestly! Buy these shoes!!!!"
  },
  {
    "user": "Tricia S.",
    "rating": 3.0,
    "message": "I bought a Wide because online shoes often run tight, but these were SMALL and NARROW. I couldn’t even get my foot in them. (Photo shows my normal size next to same size in this narrow shoe, which was marked Wide but isn’t). I would give 2 stars for the bad sizing, but added a star for the FAST refund!"
  },
  {
    "user": "Sally S",
    "rating": 3.0,
    "message": "VERY light and comfortable EXCEPT, they’re too short.  My regular shoe size is 7, my regular sneaker size is  7 1/2.  Apparently I need an 8 in this sneaker.  Wish there was reinforcement on  the top at the big toe.  They may wear through there pretty quickly. Returning for larger size."
  },
  {
    "user": "CeeBee",
    "rating": 4.0,
    "message": "The shoe upper is very comfortable and accommodates my wide feet and bunion comfortably.  However, it has almost no arch support and I had to buy inserts for that purpose."
  },
  {
    "user": "Tonita Brown",
    "rating": 5.0,
    "message": "These shoes are very comfortable. Feels like walking on pillows.  I run and walk in them. I am pleased with this purchase."
  },
  {
    "user": "brittany",
    "rating": 5.0,
    "message": "I had to order a while size up."
  },
  {
    "user": "Catalina F Z",
    "rating": 5.0,
    "message": "I work in the medical field. They are very comfortable"
  },
  {
    "user": "KayK",
    "rating": 5.0,
    "message": "I was looking for a casual, comfortable, no-tie athletic shoe for summer. These shoes caught my eye because they reminded me of a stylized, updated take on old-school saddle shoes, and the idea of fuschia saddle shoes just made me giggle. I browsed for awhile but kept coming back, so ordered 1/2 size up as suggested. They fit perfectly and are super comfortable. I would have to go up another 1/2 size if I wanted to wear an athletic sock, but they're just for casual wear so I just wear sock liners. They aren't super supportive, but have enough for a trip to the supermarket or pharmacy. They are cute with jeans, and I think they'll look cute with a white jeans skirt and tee shirt this summer. For the price, I'm happy with my purchase. Edit: I spilled a bowl of tomato -based vegetable soup on my shoes and was afraid they were ruined. I decided to throw them in the wash with a load of light colors after pretreating with stain remover, and washed in cold water. I let them air dry, and they look and fit like brand new."
  },
  {
    "user": "kim muncy",
    "rating": 5.0,
    "message": "I work in health care and do 12 hour days. I work in a procedure area so some days I may have 6 or 7 patients. I am soooooo picky about my socks and shoes. These NB shoes have been the best I have had in years. Definitely worth the money. If you waver about width, go for the wide."
  },
  {
    "user": "alison",
    "rating": 5.0,
    "message": "Ordered these shoes twice now and always a perfect fit, super comfy, great support and no uncomfortable break in period like some new pairs of shoes."
  },
  {
    "user": "Kathy Moseley",
    "rating": 5.0,
    "message": "Comfy and supportive"
  },
  {
    "user": "Madi",
    "rating": 5.0,
    "message": "They fit just like my normal shoe size! Very lightweight and comfortable"
  },
  {
    "user": "Mayerli",
    "rating": 4.0,
    "message": "Son ligeros pero no sientes que tengas el pie apoyado en el piso, lo cual no es 100% comodo"
  },
  {
    "user": "Joseph",
    "rating": 5.0,
    "message": "Wife like told me I could buy her another pair when the wear out. : )"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fit perfect, great shoe for being on your feet"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fits true to size. I’m up on my feet all day at work and I love these!"
  },
  {
    "user": "KKITYH",
    "rating": 5.0,
    "message": "So these walking shoes are five stars. I really enjoy wearing them at each day. I definitely want to get another pair in a different color"
  },
  {
    "user": "Lori D",
    "rating": 3.0,
    "message": "These shoes looked the way I thought they would, but they were a little too low cut and also too short. Get a half size bigger if you decide to get them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I probably could have got a regular width instead of a wide. Good shoe for the price very comfortable"
  },
  {
    "user": "Melissa",
    "rating": 5.0,
    "message": "I’m on my feet for 8+ hours a day, walking and standing. These are the only shoes that did not hurt my feet or give me blisters. I have to wear higher socks so they don’t rub the backs of my ankles, but they are so comfortable that I don’t mind."
  },
  {
    "user": "Lexy",
    "rating": 3.0,
    "message": "I googled the best shoes for pregnancy and these popped up. However they provide no support. I’d also size up too, my feet usually don’t swell too bad and I’m able to fit into the same size as pre pregnancy however when I tried these shoes for a week I noticed my feet throbbing within the 1st hour and by the end of the work day my feet where so swollen that i could cry. I work in the hospital to give more visual."
  },
  {
    "user": "B. Turner",
    "rating": 3.0,
    "message": "While I love the looks of these shoes and they are comfortable, the insoles are the worst.  I have had them 2 months and don't wear them every day but the squishy insole under the balls of my feet are completely flat. I would have expected it to hold up better than that."
  },
  {
    "user": "MMC",
    "rating": 4.0,
    "message": "Love that they're super light and are slip-ons. With that being said, if you do mountain climbers, etc, they'll fall off your feet, since they're slipons"
  },
  {
    "user": "Amy Drescher",
    "rating": 5.0,
    "message": "I need a wider tie box and a little arch support. These shoes in wide fit the bill! Wear my usual 7.5 . I wouldn’t use for long distance run or walk but I will happily wear to work walking on a college campus and shorter walks. Super lightweight and offers decent arch support. Just not as supportive as athletic shoe or heavy arch support if that’s what you need"
  },
  {
    "user": "Nas",
    "rating": 5.0,
    "message": "These are great for walking around and they are vented to keep your feet cool which means they would not be great in the rain but other than that they are cute and very comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Super comfortable.  I can wear an 8 or 81/2 and the 8 fit perfectly"
  },
  {
    "user": "Caligirl",
    "rating": 3.0,
    "message": "These are comfortable shoes however I've only worn them about them about 15 times and the insole liner is already peeling up, very disappointing and all I did is walk."
  },
  {
    "user": "M.C.",
    "rating": 5.0,
    "message": "This is my 3rd pair. They are comfy right out of the box. I trust them so much I bought them to wear to Disney without breaking them in first! I wear an 8.5 in shoes and have always been a 9 in NB."
  }
]