[
  {
    "user": "John C.",
    "rating": 5.0,
    "message": "I purchased these shoes for when I was working in a restaurant for the comfort and padding inside the shoe.  I thought the sole was going to be very soft and shock absorbing.  To my surprise, it was very hard, then I thought this was not going to be comfortable at all.  The first day I wore them at work, I was amazed.  I now work as a delivery driver for 3-4 hours a day and always on my feet.  This shoe has the perfect hard sole, so I don't feel any rocks in gravel driveways or wooded areas.  There are four pads within the shoe.  Under the bend of the toes, at the ball of the foot, arch support, and at the heel.  I also wear these shoes when I walk up to 3.5 miles every night and when I'm done, my feet feel like they have been massaged during that time.  I don't want to take the shoes off, but I can't sleep with them on. I have recommended this shoe to friends and family.  A former co-worker of mine has also purchased a pair of these shoes and is also wearing them at work and has said he feels more relaxed when he is done working than with his old shoes he had.  I am looking to buy other colors of this same shoe to expand my shoe collection."
  },
  {
    "user": "vicki oland",
    "rating": 5.0,
    "message": "ive recieved so many compliments on my new shoes. so many i bought 5 pr of them. i just love them they are very comphy and true to size and so many compliments. i just love them. by a pr and you will shine amongst ur friends"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Too tight for my feet"
  },
  {
    "user": "William Govan",
    "rating": 4.0,
    "message": "I still don’t have my shoes after 3weeks"
  },
  {
    "user": "Gringo on Earth",
    "rating": 4.0,
    "message": "I've only worn them a couple of days. I bought them for walking on concrete streets and sidewalks and they're rather comfy for that purpose.  They did not cost much and so they have kind of a cheap appearance...they're entirely plastic on the outside.  The inside is softer fabric-like material.  I'll see if they are long-lasting and add to this post later on if I learn more on this.  The color is as shown online. People admire them.  They arrived quickly."
  },
  {
    "user": "Donte Boone",
    "rating": 5.0,
    "message": "They very fashionable and comfy. They'll last for a bit if you have backups but if you like to consently wear them, they won't last longer than a month."
  },
  {
    "user": "Jonita Calhoun",
    "rating": 4.0,
    "message": "I like the walking and working in these shoes."
  },
  {
    "user": "Guy Rochelle",
    "rating": 4.0,
    "message": "Liked the shoe. Fits well and comfortable"
  },
  {
    "user": "Kenneth Perry",
    "rating": 5.0,
    "message": "I get a lot of compliments a really good looking shoe"
  },
  {
    "user": "Larry",
    "rating": 5.0,
    "message": "Purchased for a person with balance issues - this shoe fits perfectly, comfortable & has helped with balance with its springyness."
  },
  {
    "user": "Neysa",
    "rating": 5.0,
    "message": "Me encanto el color. Super comodos"
  },
  {
    "user": "Romel Molina",
    "rating": 5.0,
    "message": "The shoes look great and are super comfortable."
  },
  {
    "user": "Diane Stidham",
    "rating": 5.0,
    "message": "We were going on a cruise knowing that there would be lots of walking.. The shoe was perfect. Cuperiod comfort durability and style exactly what we wanted."
  },
  {
    "user": "Jarom Smith",
    "rating": 3.0,
    "message": "I bought these shoes because they were significantly less expensive than the shoes I usually buy.  They look cool but they are not very comfortable, at least not at first.  The sole is very rigid (harder than most other shoes I have experienced), both inside and outside the shoe.  After wearing these shoes for a few days, my feet still hurt but it's less than it was initially.  I hope that eventually I will be able to wear the shoes without discomfort. One thing to watch out for -- the soles are not flat in two ways: #1 the surface of the sole itself is wavy, and #2 there are cutouts/empty spaces in each shoe which can make driving with these shoes a little tricky.  More than once, my foot has slipped off the accelerator or brake pedal, or the empty space of a shoe has caught the edge of a pedal.  Thankfully, my current vehicle is automatic transition so I only have one shoe/foot to worry about... but I have had a couple of \"scary\" moments as I went to apply a pedal and had it not work because of funky interaction between the pedal and the sole of my shoe.  Like the comfort issue, however, this seems to be happening less and less as I continue wearing the shoes while driving.  So maybe it's just an issue of \"getting used to\" the unusual surface of the sole. I gave the shoes three stars because they do look nice and they are as advertised.  I just didn't pay very close attention to the sole, or think about the problems it could cause me while driving."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I like the look and vibrant color. And comfort"
  },
  {
    "user": "Eric Ebling",
    "rating": 5.0,
    "message": "Had these shoes a year and did a lot of 5Ks and running the neighborhood and every time I were them out I get compliments on them all the time in the bright green color. For the price they worked out great and bought a second pair when over a year later the sole wore out because everyone loves them and they feel great. I'll buy a third pair when these wear out."
  },
  {
    "user": "Jennifer Kelly",
    "rating": 5.0,
    "message": "I've been looking for this color for a long time, and this color shoe is a favorite of mine so glad I found them on Amazon. I have bad feet and men's shoes fit me better and they feel better too. 🙂🙂 Keep up the good work Amazon."
  },
  {
    "user": "Kim Adams",
    "rating": 4.0,
    "message": "These run a little small but they’re still comfortable"
  },
  {
    "user": "Jerrod Ford",
    "rating": 4.0,
    "message": "I'm a chef so they are very comfortable but not so good on wet floors as they suppose to be non slip, I almost feel a couple times"
  },
  {
    "user": "justin r paschall",
    "rating": 5.0,
    "message": "These janks be hittin. I feel like I’m walking on marshmallows every step of the way. Don’t be a bonehead grab yourself to Pair if you’re feeling frisky"
  },
  {
    "user": "sharkita",
    "rating": 5.0,
    "message": "Comfortable & nice looking on."
  },
  {
    "user": "Erika castillo",
    "rating": 4.0,
    "message": "No son para ejercitar pero si para salir a otras cosas"
  },
  {
    "user": "N. Black",
    "rating": 4.0,
    "message": "My kid loves the color, it is comfortable. There is a weird meshy lining, and it is really easy for bits of turf to get inside the lining and be impossible to remove. Also the laces didn't really stay tied. Too slippery. But my kid loves them anyway, his complaints notwithstanding."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I like them fine. Would say more but I'm interested in the life of them. Mine will be worn more for casual."
  },
  {
    "user": "Scout Dad",
    "rating": 3.0,
    "message": "On the 8th day on my son wearing this shoe it has started to fall apart.  He wears a 7.5 so the store options here were none.  Once he can wear a size 8 which will likely be in a couple months he can actually find a solid shoe in his size.  I can't recommend this shoe for your kids it will dissapoint quickly.  If these shoes even make it to a couple months I'll be shocked."
  },
  {
    "user": "lowenbrown873",
    "rating": 5.0,
    "message": "I get nothing but compliments, in fact my brother ordered the green and the black. Great value with looks to boot"
  },
  {
    "user": "Lynne Wilson",
    "rating": 3.0,
    "message": "The shoe keeps slipping on my heal. I tried to do the trick to tighten it up but the eyelet is not far enough back to make a difference. I like the look and they are comfortable to walk around in but I cannot use them to exercise because my heal slips in them and will get blisters on my heals."
  },
  {
    "user": "neil g",
    "rating": 4.0,
    "message": "It’s good for fashion"
  },
  {
    "user": "Grisel",
    "rating": 5.0,
    "message": "Muy cómodos."
  },
  {
    "user": "Glenda Lankford",
    "rating": 5.0,
    "message": "I got these shoe for my daughter for a christmas gift.  I hope they'll be big enough. She likes green bay packers teams, so these are perfect."
  },
  {
    "user": "Mili",
    "rating": 5.0,
    "message": "They fit perfectly - the quality is good, and they are nice to walk around in. I've spent more on shoes that are less comfortable and practical. These are also the first pair of shoes I've gotten regular compliments on. So far so good, and I'm pretty darn happy with them. Roll that dice and give these a try, I really think these might be some of the best bang for your buck in sneakers right now. I'll have to get more in other colors haha."
  },
  {
    "user": "Mike cadman",
    "rating": 4.0,
    "message": "Have had these shoes for a year now. Have lasted well. I usually buy high end Nike or addias. Comfortable and price was good. Only complaint, is I have to keep cleaning hair from the souls. Other wise, I'd recommend them."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Hard plastic bottom. Size run big. No support."
  },
  {
    "user": "Julio",
    "rating": 5.0,
    "message": "Es un producto recomendable me llegó como lo esperaba muy cómodos....un 10...."
  },
  {
    "user": "Giovanna",
    "rating": 5.0,
    "message": "I wish there were no laces"
  },
  {
    "user": "carlos d. garcia",
    "rating": 4.0,
    "message": "The design wow'ed me and the fit was comfortable. So much that it got me motivated to go exercise."
  },
  {
    "user": "Cynthia Thomas",
    "rating": 5.0,
    "message": "Tried men's size since they didn't have this color in women's, full size smaller worked fine"
  },
  {
    "user": "Wayne Maddox II",
    "rating": 5.0,
    "message": "Super comfortable to walk in especially walking long distances."
  },
  {
    "user": "W. MAX SMITH",
    "rating": 3.0,
    "message": "The information said they were extremely comfortable for walking and that is not true. I bought them for work where I am constantly moving for 9+ hours and after three hours my feet hurt and the arch area felt like the hard soles were pushing through my foot. The soles are misleading and not as comfortable as they look."
  },
  {
    "user": "Jon",
    "rating": 4.0,
    "message": "None"
  },
  {
    "user": "humpert297",
    "rating": 5.0,
    "message": "The shoes are great, but cleaning the fins on the soles is time consuming, I will have to say."
  },
  {
    "user": "Big K",
    "rating": 5.0,
    "message": "Bought for work. Very comfortable."
  },
  {
    "user": "Nancy Guzzi",
    "rating": 5.0,
    "message": "The only thing is the inside could have a thicker insole"
  },
  {
    "user": "Luis Rodriguez",
    "rating": 3.0,
    "message": "When you are in a sitting position they are good but for running or walking you will feel the hard divisions  in the insoles. It will kill your feet if you use them an hour. The worst shoes I ever used."
  },
  {
    "user": "Christopher L Joyce",
    "rating": 5.0,
    "message": "The only dislike I have is the sole needs to a little bit thicker. Other than it’s a very comfortable shoe ."
  },
  {
    "user": "Hope Eaton",
    "rating": 5.0,
    "message": "Very comfortable 4 my feet"
  },
  {
    "user": "Erik J.",
    "rating": 5.0,
    "message": "Great shoe.  Very comfortable. The only downside is the indentation on the bottom.  I had to get used to it while driving because it would slip off the brake at times."
  },
  {
    "user": "Roque",
    "rating": 5.0,
    "message": "I love the design,,,,true to the advertising. I am usually a 9 1/2 and i ordered a 9 just because in the past shoes and sneakers tend to run bigger,,,so a 9 fit really goo. I am happy with the purchase"
  },
  {
    "user": "tks",
    "rating": 3.0,
    "message": "Outer sole is very hard plastic, no give.  Could have been more cushioned."
  },
  {
    "user": "W. L. Fuller",
    "rating": 5.0,
    "message": "Wear these shoes for a pinic, I was able to play kickball in them very comfortable color is pretty too."
  },
  {
    "user": "Capt. S",
    "rating": 3.0,
    "message": "I thought the sole of this shoes was supposed to be some new tech that would give comfort while walking. The shoe lacks cushioning and just isnt worth the money I spent. I have had $25 Walmart shoes that are more comfortable. Maybe they need to be worn in will revise later."
  },
  {
    "user": "Fernando",
    "rating": 4.0,
    "message": "They feel comfortable,, have them in different colors don't last very long,, well depends on use of course  no complaints from me ,,, 👍"
  },
  {
    "user": "Brand E.",
    "rating": 5.0,
    "message": "Fit perfectly, like walking on pillows. Terrific price."
  },
  {
    "user": "Joseph",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Denise Gray-Lynn",
    "rating": 5.0,
    "message": "My husband absolutely loves them. He got them for work. Says they are comfortable. He stands for 6-8 hours a day. He recommended that you put gel cushions in for long standing."
  },
  {
    "user": "ron",
    "rating": 4.0,
    "message": "Just a good quality shoe at a very reasonable price"
  },
  {
    "user": "Edwart",
    "rating": 5.0,
    "message": "excelente"
  },
  {
    "user": "Dawn Hodge",
    "rating": 5.0,
    "message": "Fits true, light weight, looks good. Nice shoe without paying a fortune for them."
  },
  {
    "user": "Nik",
    "rating": 2.0,
    "message": "The mesh blade sole of these shoes are a big part of the visual appeal. However, they are not comfortable to walk on. Also notice there are two open rings in the underside in the front center and the heel.  At first I thought this is odd, this is different, this is almost cool… However after an all day wear and wearing them for a walk I had to cut short, I am debating returning them. I have opted for purchasing insoles at the moment. Imagine the ring under the ball of your foot and the upright supports or the “blades” as a dull thick cookie cutter that you walk on all day. It doesn’t feel like you’re being cut obviously but you feel that hole every step. You feel the upright supports and gaps between then every step. The sole above that part of the design should be thicker and denser so as not to feel this. The heel hole isn't really noticeable compared to the tarsal half of your foot. The rest of the shoe is nice, comfortable, and durable feeling."
  },
  {
    "user": "Charles Blakey",
    "rating": 5.0,
    "message": "I have 2 other colors..very nice and comfortable and sporty...get a lot of good comments."
  },
  {
    "user": "Emmanuel Capers",
    "rating": 5.0,
    "message": "I have gotten many compliments on my shoes. They are a go to show when I want comfort and durability. Good job to the manufacturer!"
  },
  {
    "user": "Bob Collopy",
    "rating": 4.0,
    "message": "The outsoles are a bit too hard to absorb any impact. I'll be using them for casual wear instead of running. They look super cool on!"
  },
  {
    "user": "Sylvere Gahungu",
    "rating": 5.0,
    "message": "I like to get what I bought. But it takes so long to get it. Anyway I got it and love it Thanks"
  },
  {
    "user": "Jonathan B",
    "rating": 3.0,
    "message": "This shoe I own. It’s has a really cool look to it. But that’s it. It has no support, the shoe has foam rubber inside. With the heal no support either. Very difficult to put on the shoes without a shoe horn. When I walk it’s hard on my feet. But they sure do look cool.  Sorry  but I am returning them."
  },
  {
    "user": "MikeL",
    "rating": 5.0,
    "message": "I was a little doubtful about ordering a walking/sports shoe as inexpensive as this and not a traditional name brand. My first few steps told me that I had made a wise purchase. I wore them for several hours the first day and was pleasantly surprised that the shoes were as comfortable as a broken-in pair. The fit, for my size 13 foot, was as close as any shoe I have ever purchased. Of course, no shoe adequately compensates for my arthritis bumps, but the soft, flexible nature of this shoe does a respectable job of accommodating those bumps. The open web design of the upper part of the shoe allows one's feet to stay cooler and dryer than the shoes that are mostly leather or faux leather, which make my feet sweat. I highly recommend this shoe for anyone looking for a comfortable, affordable shoe that doesn't seem to have a break-in period."
  },
  {
    "user": "Blaqkat92",
    "rating": 5.0,
    "message": "I hav a yellow pair and my husband liked them on my feet so much that I purchased a blue pair for him.  he has odd feet. depending on the shoe so I had to go by the size he would wear for Nike Air max since they do resemble.  the first pair were too big.  second pair were perfect, the feel, the look and the comfort.  now I hav to find clothes to match.  lol"
  },
  {
    "user": "Chaz",
    "rating": 4.0,
    "message": "My grandson raved about the pair he got. he said they were the most comfortable sneakers. So, I ordered a pair. They have comfort, but not like my normal brand. After he saw that I got them, he told me the insides of his fell apart."
  },
  {
    "user": "jason grubbs",
    "rating": 3.0,
    "message": "Shoes look nice in pictures but you can tell there cheap made when you put your hand on them . Soles are very hard no give at all"
  },
  {
    "user": "PastorJ50",
    "rating": 5.0,
    "message": "The media could not be loaded. I just love them great fit"
  },
  {
    "user": "Marcia Frahler",
    "rating": 3.0,
    "message": "Soles are very hard"
  },
  {
    "user": "David whitley",
    "rating": 5.0,
    "message": "Walking and working out."
  },
  {
    "user": "George Martinez",
    "rating": 5.0,
    "message": "I can’t count how many times I’ve been told how cool these shoes are.  I like them so much that I’ve bought several different colors"
  },
  {
    "user": "Simón Resendiz",
    "rating": 5.0,
    "message": "Son unos tenis cómodos, muy bonitos y no pesan nada👌👌👍👍"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "These are great looking but way too hard sole. I couldn't wear, felt so inflexible."
  },
  {
    "user": "Amanda Nurnberg",
    "rating": 5.0,
    "message": "Husband only used these at the gym. The past few months he has complained of the shoes feeling harder on the bottom of the feet and making them sore. Turns out the soles are worn away leaving him running on the design rubber which you obviously shouldn't. Now we are hunting for new gym shoes that will work for him longer then these. Mind you we have used many brands of sneakers that have lasted years and this is the first time we ever encountered a shoe product with such a design flaw. These are great if you just want a nice design for going out but not ment for everyday exercise use."
  },
  {
    "user": "CAT HERDER",
    "rating": 4.0,
    "message": "I normally wear a size 10W and I bought the 10.5. It was a bit snug in the toes and should have bought 11.5 instead. Later because I like them so well I bought a different color at size 11.5 and they fit great. I use these for long walks up to about 5 miles+ but nothing athletic. I did add some gel inserts and the shoes took about a week of continuous use to break in. Excellent eyelet openings for laces. At 6' and 205lbs. it took me a while to develop some springiness in the soles. They were very hard with little give but later they developed some give. I was in an engineering dept. doing product analysis for several years. All of the colors draw compliments!"
  },
  {
    "user": "Stephen P. Boroody",
    "rating": 5.0,
    "message": "These shoes are great for the price. The fit is perfect. They are super comfortable. Only complaint I have is that the insole’s are very thin. Had to purchase a separate set. And just swapped them out. Fit is perfect for size. Great bargain"
  },
  {
    "user": "Mark A Delmege",
    "rating": 4.0,
    "message": "This shoe is great for walking. A little heavy of a shoe for me to want to use them for running, but you can't beat the comfort level for walking for miles."
  },
  {
    "user": "sandra dhaiti",
    "rating": 4.0,
    "message": "Was too big"
  },
  {
    "user": "That Energy Guy",
    "rating": 4.0,
    "message": "Overall good shoe for the price. Better packaging is suggested."
  },
  {
    "user": "Anthony j Anderson",
    "rating": 5.0,
    "message": "Weight training and light cardio and felt very comfortable"
  },
  {
    "user": "gary kudalis",
    "rating": 5.0,
    "message": "Nice colors great style For the money you can’t go wrong I run daily and these are not for running I get many compliments on the coke and style"
  },
  {
    "user": "Najibullah Torakai",
    "rating": 5.0,
    "message": "School and sport"
  },
  {
    "user": "Vidal",
    "rating": 3.0,
    "message": "Got lots of compliments (2 from sneaker heads) on this non brand name kicks. They are comfy as hell. Only down side is they should use a tougher plastic for the outer bottom sole. Mine broke almost instantly and was followed by a weird clicking noise every step I took. This was the shattered plastic scrapping against itself. Could see my sock through the hole. Got a new pair and painted nail hardener on said plastic area and no breakage so far but get back to the drawing table and use a better more durable plastic. I'd give it 5 stars if they use better material for the bottoms"
  },
  {
    "user": "Will",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Debbie Kornell",
    "rating": 3.0,
    "message": "A little small. Very hard uncomfortable sole. I returned them."
  },
  {
    "user": "mikey",
    "rating": 5.0,
    "message": "I got these shoes to help me with plantar fasciitis so I can walk longer with less pain. Not only are they so comfortable my feet don’t hurt after being in them all day and walking a lot, they realign my feet so my back doesn’t hurt! I have never worn a better more comfortable shoe. And the price is right because I’ve paid for orthotics before and that’s a killer."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Quality could have been a bit better ."
  },
  {
    "user": "Tina",
    "rating": 5.0,
    "message": "Not great comfort So if you are looking for support these are not it"
  },
  {
    "user": "Stan Little",
    "rating": 2.0,
    "message": "I like the looks and style. But too bad they are not comfortable. My feet hurt the first time wearing them because I can feel the design of the souls on the balls of my feet with every step! I will only wear them for very short periods at a time, or maybe go buy some gel insouls."
  },
  {
    "user": "Michael H",
    "rating": 5.0,
    "message": "These are a pair of nice shoes. I get so many compliments that I didn't expect. They are comfortable and for the price, I can't explain. I'm still dumbfounded that people pay hundreds of dollars for BRAND shoes when they can get some nice shoes less than $50. Only one small issue; I can't drive in them because of my pedals. I have already ordered some more shoes like this. I love bragging to my adult son how much money I saved!"
  },
  {
    "user": "Christoff",
    "rating": 1.0,
    "message": "This pair of shoes looks really nice; both on-line, as well as in real life when the order arrived. This is sadly where my positive impressions end. These shoes were quite tight from the onset. I knew it was not available in a wide-fit option; I nevertheless hoped that it will mold around my foot during wearing. After 4 weeks, my feet were in extreme agony, caused by these shoes. Upon contacting amazon, they were extremely generous, and offered to refund this purchase to me (I guess due to my 20 year membership with regular purchases from amazon.) Wearing these shoes felt as if I was walking with ice-skating roller blades on sidewalks. These shoes have zero arch support; zero cushioning; zero responsiveness (bounce absorption), and zero outsole traction on wet floors such as at the gym. The lesson I learned from this experience is this: just like you cannot expect reliability from a $1,000 vehicle, likewise can you not expect comfort, support and the other absent qualities I mentioned above from a $40 pair of running/walking shoes. It is just not happening. Add to the equation that this is a no-name brand, and you set yourself up for an unsuccessful shoe purchase. I am of the opinion that this shoe should not be offered on amazon (or elsewhere). I have since then  purchased a pair of New Balance shoes via amazon, and I am happy with them - just wish they were available in more colorful options than the predominantly (boring) black I had to settle for in a size 12 Wide fit."
  },
  {
    "user": "John D. McDonald, Jr.",
    "rating": 4.0,
    "message": "I’ve trying to get back into shape and these shoes are doing it for me. Between walking my dogs and running (really just a half run) these shoes are great all around."
  },
  {
    "user": "Angel M Fernandez",
    "rating": 4.0,
    "message": "Precio muy bueno!"
  },
  {
    "user": "Jim",
    "rating": 4.0,
    "message": "These shoes were recommended by a friend as very comfortable. For me they are not comfortable. The insoles are so thin you can feel the ridges of the sole. If I add a thicker insole the shoes will then be too tight."
  },
  {
    "user": "bonimarcjohnson2@yahoo",
    "rating": 4.0,
    "message": "I ordered half size to big"
  },
  {
    "user": "Ms. C",
    "rating": 5.0,
    "message": "Ita a very comfortable shoe."
  },
  {
    "user": "Camille Lewis",
    "rating": 4.0,
    "message": "This shoe was a little too big. They come in half sizes and going down a size, will not work. Pretty vibrant colors though"
  },
  {
    "user": "Christian U.",
    "rating": 3.0,
    "message": "They looking good. But after walking for 1hr your feet start hurting."
  }
]