[
  {
    "user": "Traveling Mom",
    "rating": 5.0,
    "message": "These classics -with a high heel twist- are super comfortable! Bought them with a particular event in mind, and now they are my loyal companion. Super comfortable! Worth every penny"
  },
  {
    "user": "Kyle Hayes",
    "rating": 5.0,
    "message": "I ordered my normal size 8 and they fit perfect. They are super cute and I wear them frequently!"
  },
  {
    "user": "Mary Richardson",
    "rating": 5.0,
    "message": "She was very happy with the style & fit!"
  },
  {
    "user": "neehigh",
    "rating": 5.0,
    "message": "I like the product a lot"
  },
  {
    "user": "Britney Updyke",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Yaskira Skarlin Ureña Díaz",
    "rating": 5.0,
    "message": "Desde hace tiempo quería estos converses por los versátiles que son y los bellos por fin aquí están"
  },
  {
    "user": "Livelife",
    "rating": 5.0,
    "message": "My grandaughter asked for this shoe for her 18th birthday - Amazon, had in stock and delivered ,exactly as was stated, and made a very happy girl receiving the present"
  },
  {
    "user": "Viviana Tarango",
    "rating": 4.0,
    "message": "Me quedaron"
  },
  {
    "user": "Fanny Jane OConnor",
    "rating": 5.0,
    "message": "Exactly how they should be… perfect! Super cute, comfortable"
  },
  {
    "user": "Kim McGrath",
    "rating": 5.0,
    "message": "Fun"
  },
  {
    "user": "Mariana Quiñonez",
    "rating": 5.0,
    "message": "Me gusta mucho, para usarlos al salir me encantan"
  },
  {
    "user": "jessica michel",
    "rating": 5.0,
    "message": "Todo perfecto me encanta 🥰"
  },
  {
    "user": "Ellie Gensch",
    "rating": 5.0,
    "message": "Awesome"
  },
  {
    "user": "S. Rose",
    "rating": 5.0,
    "message": "This is a super comfortable show that gives a small lift but not enough to cause you to be off balance.  It has room at the toes where I find a lot of Converse are uncomfortable at the toes and I was worried with the little lift it would pinch toes but it doesn’t.  They are wearing quite well, and like other Chuck Taylors I own, the white trim clean super easy so it looks pretty new with very little cleaning."
  },
  {
    "user": "Karen Nash",
    "rating": 5.0,
    "message": "I have no complaints."
  },
  {
    "user": "Angela Maria coloma",
    "rating": 5.0,
    "message": "lindos"
  },
  {
    "user": "Ann S.",
    "rating": 5.0,
    "message": "Gift for granddaughter - loves them"
  },
  {
    "user": "Randall Mahnke-Tang",
    "rating": 5.0,
    "message": "Love the sneakers, but they run 1/2 size larger.  Got the replacement smaller size and they’re amazing!!! I bought another pair before they sell out!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Love these!!! The only thing is the rubber sole gets dirty quickly. I clean them after every use."
  },
  {
    "user": "Billy Lopez",
    "rating": 5.0,
    "message": "Perfect fit. My daughter loves them and they look good 👍"
  },
  {
    "user": "Thomas Mitchell",
    "rating": 4.0,
    "message": "These shoes are amazing! When I got them they did not come dirty or damaged. They do run pretty big though. My usual size is a 8.5 and these were pretty big for 8.5. I might have to return them to get other ones so I suggest to get a half a size or even a full size down."
  },
  {
    "user": "Serena",
    "rating": 5.0,
    "message": "Fit Great. Been wanting these for a while and with the good price of amazon goods and having prime I was able to get these quick and efficiently."
  },
  {
    "user": "Imari",
    "rating": 5.0,
    "message": "Fits great & they're comfortable. Even got a free baby"
  },
  {
    "user": "Dessyyy",
    "rating": 3.0,
    "message": "Shoes arrived in a damaged box that smelled like chemicals. It was held together with rubber bands and inside was torn up packing paper. Shoe itself seems to be in good condition however"
  },
  {
    "user": "Emma",
    "rating": 5.0,
    "message": "I love love LOVE these so much"
  },
  {
    "user": "Jenny Littlefield",
    "rating": 5.0,
    "message": "My daughter loves them"
  },
  {
    "user": "Madison Dawes",
    "rating": 5.0,
    "message": "They fit like all other converse so i would round up half a size since converse run a little small. They came exactly as shown."
  },
  {
    "user": "Quentin",
    "rating": 5.0,
    "message": "I'd order your normal converse size, but if you've never had any I was perfectly fine with order my exact size 7.5W and they fit perfect. I probably could have gone down but I like to wear thicker socks sometimes and a size 7W may have been just a slight too tight for my comfort. LOVE the platform and so happy with the black choice. You just can't really go wrong with these shoes ever."
  },
  {
    "user": "Olguita",
    "rating": 3.0,
    "message": "Converse es una marca reconocida y sus zapatos clasicos son artículos de colección. Las cajas son como papel y para completar Amazon las empaca en una bolsa plástica como si fuera el único artículo que se va a enviar. Esta entrega fue un desastre igual que la anterior que devolví porque hasta manchados llegaron."
  },
  {
    "user": "Cassidy Udey",
    "rating": 4.0,
    "message": "I'd recommend getting your normal size. I got a 9.5, normally I'm a 10, and the shoes are a little too small."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Lovedd!! 🥰, So comfy and it fit perfectly. It was true to size for me, but converse sizes can be a bit big so either go with your normal size or go down half a size! My everyday converse is a 5.5 but it was getting a bit tight. I chose to order a 6 so i could have some room and so i wouldn’t have to worry about the shoe being small, because of course it will eventually fit if it ends up too big! Overall it’s amazing and i recommend ❤️"
  },
  {
    "user": "mur",
    "rating": 5.0,
    "message": "My daughter loves them !"
  },
  {
    "user": "Jill Taylor",
    "rating": 5.0,
    "message": "These are my first ever Converse. Don’t wait til you are 67 like me. So much fun to wear and the lift is great for us shorty’s!"
  },
  {
    "user": "Adah",
    "rating": 5.0,
    "message": "This product is exactly as described. I do have súpero wide feet though (my right being wider than my left), so my feet do hurt slightly when I wear them, so for wide ft people it’s just something to consider:) Not a product default though:))"
  },
  {
    "user": "Jess",
    "rating": 3.0,
    "message": "They fit great. I wore them to a concert. I stood for over 4 hours and walked another 2. They did not feel uncomfortable and was not heavy. I love them and will purchase again."
  },
  {
    "user": "Alana",
    "rating": 5.0,
    "message": "My daughter first used these under her prom dress for the night's dancing...we had her dress altered for heels that were good for the dress length that matched these Converse shoes. She loved being able to change shoes as the night wore on."
  },
  {
    "user": "Christie Keller",
    "rating": 4.0,
    "message": "The shoes are awesome but there were no laces. I thought that was a little strange."
  },
  {
    "user": "Mar H",
    "rating": 5.0,
    "message": "In my honest opinion: the shoes are fine, the only thing I noticed was on the sole, they are a little different than my other pair of platform converse (I posted a pic for comparison) I’m not sure if they are fake or not but they do look a little different maybe is the model Idk Other than that everything is fine and I’ll be keeping them because they are nice and super comfy"
  },
  {
    "user": "jody52770",
    "rating": 4.0,
    "message": "This is a good product fits as expected. But definitely over priced far as craftsmanship. More for style and looks."
  },
  {
    "user": "W6",
    "rating": 5.0,
    "message": "My daughter got these for her Birthday and she loves them. She likes the added lift too.  Adorable and go well with a lot of clothes."
  },
  {
    "user": "molly",
    "rating": 5.0,
    "message": "Just got these yesterday!! It arrived early, which was great! Super cute, a little painful when you first wear them but should break in just fine. A little, nay, a lot, expensive but amazing anyway."
  },
  {
    "user": "Riley A",
    "rating": 5.0,
    "message": "I love these! They came in two days. They seem to be authentic and are super comfortable. I sized down half a size."
  },
  {
    "user": "Anonymous Reviewer",
    "rating": 5.0,
    "message": "I bought these for my daughter. She loves them!!"
  },
  {
    "user": "Franchesca",
    "rating": 5.0,
    "message": "Siempre he amado converse, pero nunca había usado con plataforma. Sinceramente me encantaron, se siente la diferencia entre los normales y estos. Son un excelente complemento para tus outfits. 10/10"
  },
  {
    "user": "Carrie young",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Pen Name",
    "rating": 4.0,
    "message": "I love the look of the shoe but they are a bit uncomfortable. Overall I like them, just make sure you buy a half size up from your reg. shoe size for comfort."
  },
  {
    "user": "barb f",
    "rating": 5.0,
    "message": "Just as pictured.... love them"
  },
  {
    "user": "Chelsie Phillips",
    "rating": 5.0,
    "message": "I bought these for my niece and she absolutely loves them, she wears them every day."
  },
  {
    "user": "Meryl n sof",
    "rating": 5.0,
    "message": "So im a shoe size 6.5-7… it fits awsome and still room to grow in there! I didnt like the way the laces where so i bought diffrent ones but… there great and yeah!"
  },
  {
    "user": "bejanmiller",
    "rating": 5.0,
    "message": "Loved them"
  },
  {
    "user": "DawnD",
    "rating": 5.0,
    "message": "They are perfect! Comfortable, kid stylish, well made."
  },
  {
    "user": "Janelle",
    "rating": 4.0,
    "message": "Fit well."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great looking shoe, traditional look modernized platform style.  Buy your true size"
  },
  {
    "user": "Joel Krouse",
    "rating": 5.0,
    "message": "Volleyball"
  },
  {
    "user": "Karina Lungo",
    "rating": 5.0,
    "message": "GREAT!!!"
  },
  {
    "user": "Belmontegirl",
    "rating": 5.0,
    "message": "My daughter loved this style! But fits too small. She is a 7.5 so i had to return and will reorder one size up."
  },
  {
    "user": "Bailey Burns",
    "rating": 5.0,
    "message": "super cute , and comfortable. looks exactly like the photo & i get a lot of compliments!"
  },
  {
    "user": "Ronica",
    "rating": 3.0,
    "message": "I was so disappointed that the quality was this bad! A messed up converse sticker is non-excusable, especially for the price!"
  },
  {
    "user": "Sherry",
    "rating": 5.0,
    "message": "Bought for granddaughter, she liked them tome they were just sneakers"
  },
  {
    "user": "Ayden",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Dana",
    "rating": 5.0,
    "message": "Pretty good. I like them. Size runs larger I would reccomend sizing down. I’m normally 6.5 but got 6 and still was a little big."
  },
  {
    "user": "aubri",
    "rating": 5.0,
    "message": "value, on time, right size, extra comfy.. seriously, let’s get nostalgic 🖤🤍"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These run a bit big. Order a 1/2 size down. Sent back her size and ordered down. Speedy delivery, speedy return and refund, speedy 2nd delivery! She loves them!"
  },
  {
    "user": "Mia",
    "rating": 5.0,
    "message": "It is an awesome shell just did not work for what I needed it for"
  },
  {
    "user": "Madison",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Tristen",
    "rating": 5.0,
    "message": "Good stuff"
  },
  {
    "user": "glen",
    "rating": 5.0,
    "message": "With the added height provided added cushion."
  },
  {
    "user": "Stacey Blanton",
    "rating": 5.0,
    "message": "I bought these shoes for my Granddaughter. She loves them !!! She is a big collector. Over generations of Converse lovers in our family🥰 they never disappoints."
  },
  {
    "user": "Sonia CA",
    "rating": 5.0,
    "message": "True size and so beautiful I love this shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Cumplió las expectativas"
  },
  {
    "user": "Meri V",
    "rating": 5.0,
    "message": "A must have this year for Christmas as Tik Tok made em famous ! Perfect gift and perfect Converse style"
  },
  {
    "user": "marin",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "Maureen gano Smith",
    "rating": 3.0,
    "message": "They came with cheap small laces that aren’t converse laces. I don’t know why they were replaced. I bought another pair on the converse site and the laces were normal. I think they might have been returned because they were a bit dirty. I would recommend buying on converse site."
  },
  {
    "user": "Kathleen",
    "rating": 5.0,
    "message": "Fast and easy great quality"
  },
  {
    "user": "Mónica",
    "rating": 5.0,
    "message": "The media could not be loaded. Eh tenido un inconveniente pero al final estoy feliz con mi pedido que emoción"
  },
  {
    "user": "Amber Marriott",
    "rating": 5.0,
    "message": "These shoes were perfect for my teenage daughter! She wears them everyday! Comfortable and stylish."
  },
  {
    "user": "Dub-sizzle",
    "rating": 5.0,
    "message": "Bought for my daughter as a Christmas gift.  She loves them.  It’s a good looking shoe but definitely overpriced."
  },
  {
    "user": "lisa hoefener",
    "rating": 5.0,
    "message": "These are so cute and very reasonable"
  },
  {
    "user": "ava",
    "rating": 4.0,
    "message": "OMG I LOVE THEM!!! they’re absolutely perfect, they’re a little big but i also rounded up and went with a 10 and i usually wear a 9.5 but it’s not a big deal to me!! they’re so so cute the only thing i would earn is that the platforms aren’t as big as i expected but they’re thick enough that it’s hard to gauge pressure while i’m driving!"
  },
  {
    "user": "Kty Lozano",
    "rating": 5.0,
    "message": "Me agrado"
  },
  {
    "user": "Elisabeth J. Hagood",
    "rating": 3.0,
    "message": "They are listed as Women’s, but make sure you do not choose your size! Choose the mens size for your size."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Love them. I got a 8 1/2 and I wear an 8 normally. Was afraid they would run small. The 8 1/2 is a tad to big to buy true to size"
  },
  {
    "user": "Kenny Dee",
    "rating": 5.0,
    "message": "Chuck T still rules"
  },
  {
    "user": "Island Flier",
    "rating": 5.0,
    "message": "If it wasn’t Christmas I probably wouldn’t have spent that much. Otherwise the product was great!"
  },
  {
    "user": "Lauren",
    "rating": 5.0,
    "message": "Like"
  },
  {
    "user": "Amanda",
    "rating": 5.0,
    "message": "Love them!"
  },
  {
    "user": "Gisell de la Cruz",
    "rating": 5.0,
    "message": "Muy cómodos a mi hija les encantaron’"
  },
  {
    "user": "Pearline Byrd",
    "rating": 5.0,
    "message": "My granddaughter modeled them for the whole family with the biggest smile on her face. She loved them."
  },
  {
    "user": "Jackie shoemaker",
    "rating": 5.0,
    "message": "They are true to size and very comfortable. I would buy from this seller again and they arrived earlier than promised"
  },
  {
    "user": "Mustache 4",
    "rating": 5.0,
    "message": "Was a birthday gift for my granddaughter. Made her one inch taller which she was happy about. She was already tall, the shoes made her even taller. The shoes fit perfectly."
  },
  {
    "user": "Reese",
    "rating": 5.0,
    "message": "loved these, fit perfect and go with everything!"
  },
  {
    "user": "Manuel Eduardo Rodrigues Conduto",
    "rating": 5.0,
    "message": "Nice fit, nice gift"
  },
  {
    "user": "Katie",
    "rating": 4.0,
    "message": "They are snug around your toes and are taking a while to break in."
  },
  {
    "user": "J.COLIGNON",
    "rating": 4.0,
    "message": "The product is listed as 6.5 for the size on Amazon but when i received the shoes it is written 6. Eventhough the shoes fit. It s strange that there s some discrepencies between the website and the product."
  },
  {
    "user": "Isabella M.",
    "rating": 5.0,
    "message": "Yes"
  },
  {
    "user": "Whitney swanson",
    "rating": 2.0,
    "message": "Loved the look of these shoes but needed to return for a much smaller size. Says womens but fits like mens?"
  },
  {
    "user": "Shoe Girl",
    "rating": 5.0,
    "message": "They were for mu daughter and she loved them."
  },
  {
    "user": "Julia",
    "rating": 5.0,
    "message": "Love. And so happy that I patiently waited for"
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "Hands down my new favorite shoes. Size 6 fits as expected and the platform is adorable."
  },
  {
    "user": "Gail",
    "rating": 5.0,
    "message": "My grand daughter age 15 loves them.  They brought a big smile to her face and therefore to mine."
  }
]