[
  {
    "user": "Jay",
    "rating": 4.0,
    "message": "I ordered these based on reviews but was expecting to receive some crappy shoes... Wow was I wrong! These shoes are not only beautiful, they are crazy comfortable. I have very wide feet and have a pretty hard time finding comfortable shoes that are wide enough without being too long. In this case, I ordered a size 10 which I would normally wear in American sizes. These sneakers are just a tad long, but I can live with it. I ordered the off white/cream color. They rival my normal go-to brand (New Balance) for style and comfort. As soon as I finish this review I will probably order another color in a half size smaller. We'll see how they hold up over time."
  },
  {
    "user": "Kathy",
    "rating": 5.0,
    "message": "Love these Akk Sneakers / Tennis Walking Shoes ! I have many name brand sneakers Nike , Reebok etc etc . I found the Akk on Amazon and decided to try . I need a comfortable fit and like a little extra in the toes area . I love a solid sneaker that I can use for walking , errands , work and are light weight and not heavy feeling . I got the navy blue first .. beautiful navy then the maroon color also awesome ! I needed a new black pair and my again my go to is AKk  very happy ! I am very particular about the fit and with these Akk I can wear all day and my feet feel so so comfortable and well taken care of and just happy ! We all need happy feet ! Thank you"
  },
  {
    "user": "Taylor Rooney",
    "rating": 5.0,
    "message": "I got these for walking shoes 2 years ago and they are still in good shape. I am currently 39 weeks pregnant and they were one of the only shoes I was able to wear during my pregnancy because my feet would swell in all of my other tennis shoes. I am actually about to buy another pair in a different color. I usually wear them without socks, but can be worn with low cut."
  },
  {
    "user": "Jeanne S.",
    "rating": 4.0,
    "message": "Great lightweight shoe!  Feels like you’re wearing stretchy socks but not a lot of support, & somewhat too narrow for my wide foot. Greatest thing is that it doesn’t hurt my heel, unlike most shoes that come up too high & cut into my heel."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Thought I might be getting a shoe with a bit more support. I have bad feet, and change shoes throughout the day. Not enough support for outside walking distances."
  },
  {
    "user": "Gina Carroll",
    "rating": 5.0,
    "message": "I have spent a fortune on walking shoes over the years. I finally decided to save myself some money and try these. I walk 2-3 miles a day, and these are the most comfortable shoes I have EVER had. They are lightweight and look nice on. I can see why they received such positive reviews."
  },
  {
    "user": "R I",
    "rating": 5.0,
    "message": "These are absolutely the most comfortable shoes I have ever worn. I have bunions and hammer toes and usually need to wear extra devices on my toes in most shoes. A light pair of socks are quite sufficient with these shoes and I can go for walks in complete comfort. I ordered my second pair in a different color!"
  },
  {
    "user": "Kylie Rodgers",
    "rating": 5.0,
    "message": "I want to buy these in every color they are that comfortable. I'm a dancer and instructor so I am on my feet moving, twisting and turning. These shoes are supporting, good looking and SO EASY to take off/on (huge perk of my lazy side to have slip on shoes). 10/10 recommend. Will definitely be ordering these again"
  },
  {
    "user": "TKO",
    "rating": 5.0,
    "message": "I purchased these in black about a month ago and loved them from the first time I put them on.  I did add my inserts for my plantar fasciitis.  Walked on vacation for miles with no complaints and the next morning had no residual pain.  Decided to get them in dark red/burgundy and they are just as cute and comfy.  Highly recommend.  Love the style and the price.  There was a coupon available on Amazon so saved almost $10."
  },
  {
    "user": "iris young",
    "rating": 4.0,
    "message": "they are supposed to slip on.  this is not so easy to do"
  },
  {
    "user": "Sandy",
    "rating": 4.0,
    "message": "Very comfortable and pull on easily but need to use a hand. Not “slip in” like the new sketchers."
  },
  {
    "user": "Yahni",
    "rating": 4.0,
    "message": "Very comfortable shoe, comes exactly as pictured. Only issue is sizing is very small, I ordered my size (9) and ended up having to re-order 3x. A 10.5 ended up being perfect."
  },
  {
    "user": "P Epple",
    "rating": 5.0,
    "message": "Got these as I expected they would be easier to get on and off quickly now that sandal season is over. Can't quite just step into and go but there it little effort needed to get them on. Considering ordering another pair in different color"
  },
  {
    "user": "katismom",
    "rating": 4.0,
    "message": "I gave these shoes a 4 star because although I wear a size 7 (and got a European 38), my right toe still rubs a bit at the end of the shoe. Usually size 7.5s are too large (my heels tend to lift out of the shoe), so I was surprised that this fit so snugly. Other than that, the shoe is very comfortable and super light in weight. If it stretches out even the smallest amount, the fit may be fine. BTW, I am wearing the shoes with compression hose only, not even average weight socks."
  },
  {
    "user": "Krystal",
    "rating": 5.0,
    "message": "This was my 2nd purchase, I fell in love with these shoes.  Easy on, easy off,  I work on my feet for 12+ hours a day, it feels like you are walking on a cloud,  I use these primarily for nursing at my job.  If you are looking for a great shoes, perfect fit in a vast array of colors and styles you came to the right place.  I just ordered my 3rd pair,  I have used the same pair for over a year and they look and feel barely worn. Oh and a big plus they wash up well in my washing machine.  Just try a pair, they are very affordable and you will find them so comfortable you will want them on all day.  And they breath so well,  no more damp socks.  Go ahead, buy it.  You won't be sorry."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They are comfortable and light, but I have trouble getting down to put them on.  With my back issues I still have the same problem getting them on."
  },
  {
    "user": "RoseC",
    "rating": 5.0,
    "message": "These sneakers are very comfortable and feel like you are walking on a cloud. They do not have arch support and I would not recommend wearing them in the rain as they are made out of mesh. I walked in them for a couple of miles and had no issues. I highly recommend them and they are reasonably priced."
  },
  {
    "user": "Paula",
    "rating": 4.0,
    "message": "The shoes are very lightweight, cushioning, and comfortable. I teach school, so I am on my feet a lot. I ordered my normal size; they are a tad bit on the small side, but not too small that I can’t wear them. The only thing I dislike about the shoes is the popping sounds from the soles as you walk. When I walk around in my classroom or down the hall, it sounds like I have those popping fidget toys on my feet. If it weren’t for that, I’d give it 5 stars."
  },
  {
    "user": "Jodi Lee",
    "rating": 5.0,
    "message": "I wore these shoes throughout the summer! They were very nice ,my feet did not sweat in them .it was like putting a glove over my feet. they are holding up very well I ordered these in spring and it’s now fall. They are so comfortable and easy to put on! It is exactly what I was looking for just something very easy to slip on my feet and go out the door. They look good with shorts or knickers or even a Summer dress."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They are comfortable and cute. I got pink ones."
  },
  {
    "user": "Jeri",
    "rating": 4.0,
    "message": "Fit as expected very lightweight, but I was looking for more of a hands free shoe so I returned these for a different brand"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Ordered in white months ago just ordered another pair in navy.  These sneakers are light weight and great to knock around.  Throw them in the washer and air dry.  For the money they can't be beat.  Easy to slip on."
  },
  {
    "user": "Patricia L. Krogh",
    "rating": 5.0,
    "message": "I really like this shoe!! Lightweight and comfortable. Can walk around all day and my feet do not hurt!! Fit is good and price is great!"
  },
  {
    "user": "Carol Ann Plummer",
    "rating": 5.0,
    "message": "Reviews were right.  These are the most comfortable shoes ever.  Put them on and wore them all day with no foot pain."
  },
  {
    "user": "jmn",
    "rating": 5.0,
    "message": "Very pleased with these sneakers.  They have all of the features that I was looking for and at a reasonable price.  The size and color selection offer a lot of choices.  I would order them again."
  },
  {
    "user": "SueH",
    "rating": 4.0,
    "message": "Great shoe for travel and light walking.  It doesn't give me quite the support I'd hoped for on my daily 4 mile hikes and that's the only reason I gave it 4 stars.  I would order again though."
  },
  {
    "user": "songslady",
    "rating": 5.0,
    "message": "I was pleasantly surprised to find out how nice these shoes look, fit and feel.  All of my life I've had a difficult time finding comfortable shoes so when I tried these on for the first time I was truly amazed.  I'll soon be ordering more, trying other colors.  I never thought I'd buy a pink pair of tennis shoes because it's really not my color, but I am very pleased with my purchase.  These pink shoes are actually flattering and I love them!  Service was fast as well.  5 stars across the board!"
  },
  {
    "user": "Sonia M. Cvijanovich",
    "rating": 4.0,
    "message": "Advertised true to size but when I ordered my normal size found 1/2 size too big.  Also, slip on ability left something to be desired.  Video shows that you could step right into the shoe but found not really true.  Product is attractive and appears well constructed just not exactly what I hoped it would be.  Just my personal preference but may be fine for someone else"
  },
  {
    "user": "Herman",
    "rating": 4.0,
    "message": "My wife loves the shoes however I ordered black and received crimson"
  },
  {
    "user": "wanda r",
    "rating": 5.0,
    "message": "THESE ARE SO COMFTORABLE AND FLEXIBLE AND GREAT PRICE I WILL GET IN OTHER COLORS"
  },
  {
    "user": "checho55",
    "rating": 5.0,
    "message": "I have no complaints.  The product  does what it says. COMFORT"
  },
  {
    "user": "frees",
    "rating": 4.0,
    "message": "shoes are very comfortable and so light i thought they were missing from the box. my one surprise, and maybe it was my expectation, was that they aren't purely step-in but still requires hand assistance."
  },
  {
    "user": "Mom life",
    "rating": 4.0,
    "message": "Lightweight, fun colors and comfy"
  },
  {
    "user": "Jeanette Barton",
    "rating": 5.0,
    "message": "Very nice. Needed them for vet tech school and so far I really like them. I went to get another pair in black for work at the restaurant i work at but they weren't on sale anymore so I think I'll wait till price goes does down again. They fit very nicely like my $200 adidas. Not sure they will hold up as long as them but still very nice"
  },
  {
    "user": "Lauren",
    "rating": 5.0,
    "message": "I was surprised. I thought for sure that these wouldn’t compare to nice running shoes I’ve had in the past. I was skeptical to buy off Amazon. However, I love them and they feel great. Super comfy and I’m sitting here wondering what color to buy next!"
  },
  {
    "user": "Steinbeck",
    "rating": 5.0,
    "message": "I do not usually wear sneakers but as I added walking to my routine this pair works for me, lightweight and easy slip on."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was originally looking for wide shoes for work and I came across these. They’re NOT wide and didn’t realize it but they are very comfortable and my feet don’t hurt after a days work. First pair I bought was the thick version, then bought 2 more regular thin version for the colors. Would def buy more of these when needed. Plus who doesn’t love slip-on shoes?!"
  },
  {
    "user": "Ann Francis",
    "rating": 5.0,
    "message": "Love this shoe.  It's the best tennis shoe I bought ever."
  },
  {
    "user": "K. Harbaugh",
    "rating": 5.0,
    "message": "They are so comfortable and perfect for arch support but light weight"
  },
  {
    "user": "alicat",
    "rating": 5.0,
    "message": "I AM EXTREMELY HAPPY WITH THESE SNEAKERS! I HAVE BEEN LOOKING FOR A LONG TIME & HAVE TRIED ON MANY NAME BRAND SNEAKERS THAT DON'T COMPARE TO THESE. THEY ARE SUPER SQUISHY, VERY LIGHT WEIGHT & THEY DIDN'T COST ME A FORTUNE. EXCELLENT QUALITY, NOT CHEAPLY MADE. EASY TO SLIP ON BUT ACTUALLY LOOK LIKE I TOOK THE TIME TO TIE THEM. I WILL LIKELY BUY ANOTHER PAIR OR TWO, FOR WHEN THESE GET WORN OUT!"
  },
  {
    "user": "Callum Morham",
    "rating": 4.0,
    "message": "Too large for the sizing and not the best quality for anything more serious than walking around the block"
  },
  {
    "user": "Dianne Olson",
    "rating": 5.0,
    "message": "This is the most comfortable pair of tennis shoes I have eve woren."
  },
  {
    "user": "C. Cyr",
    "rating": 5.0,
    "message": "I fell for the old bait&switch… I was searching Sketcher’s Slip Ins after a recent surgery that left me with mobility issues. Somehow I landed on these thinking they were Sketchers (my bad) and I ordered them. Well, at first it was hard for me to get them on (afore mentioned mobility issues) but now I’ve figured it out and I love them! So comfy for all day on my feet. I’ve been wearing them everyday for a month and they are still good."
  },
  {
    "user": "Prime Customer",
    "rating": 4.0,
    "message": "I love how comfortable they are; the uppers are very soft and stretchy, the back of the heel is padded and comes up a little higher than typical shoes which protects from getting blisters, the fabric let’s my feet breath, has flexible soles, and good arch support! The only thing I would change is for the sole not to wrap up the front of the toe, it makes the shoe almost too short for me. I tied the shoe laces snuggly, this holds my feet to the back of the shoe and keeps the shoes from hurting my toes. My big toes were bumping against the piece of sole in the front. Other than that they fit perfectly."
  },
  {
    "user": "Annie M Thompson",
    "rating": 5.0,
    "message": "Love the color"
  },
  {
    "user": "Catherine Hankerson",
    "rating": 5.0,
    "message": "I stand / walk all day at work very comfortable sneakers"
  },
  {
    "user": "Valerie Rhymer",
    "rating": 4.0,
    "message": "Easy too wear!!"
  },
  {
    "user": "caesar Wong",
    "rating": 5.0,
    "message": "Very comfortable and good quality n good price. Very good on time delivery bc Amazon accepts my request to ship by USPS to avoid long delays of delivery so bad experiences"
  },
  {
    "user": "Jill Macchitelli",
    "rating": 4.0,
    "message": "These shoes are quite comfortable even without socks. Gray is the new neutral color, it goes with everything."
  },
  {
    "user": "David Pruitt",
    "rating": 4.0,
    "message": "Product very nice packaging could've been better for shipping, but great light weight and comfortable."
  },
  {
    "user": "E. Prado Gallegos",
    "rating": 5.0,
    "message": "These shoes are very lightweight and extremely comfortable. Great for a walking shoe."
  },
  {
    "user": "Mary B.",
    "rating": 3.0,
    "message": "I really like these shoes. They are light weight and have great support, especially for the price. I have narrow feet and always have a hard time with shoes, always seem to have to buy expensive shoes because my feet are so narrow. But I love these. The only negative issue is that they run small. I am normally an 8, no matter what brand I normally buy (New Balance, Avia, Nike). I ordered an 8 and my toe is at the very top even with really thin socks. But I like them enough to order an 8.5 and give the 8’s to my daughter for work"
  },
  {
    "user": "Rae J. Helms",
    "rating": 4.0,
    "message": "These shoes are inexpensive and comfortable. I wish there was a bit more cushioning in the sole."
  },
  {
    "user": "Vicki Childress",
    "rating": 4.0,
    "message": "Very comfortable."
  },
  {
    "user": "Bill B.",
    "rating": 4.0,
    "message": "My wife loves the comfort and support. Just be aware, they do not \"slip on.\""
  },
  {
    "user": "Rich",
    "rating": 4.0,
    "message": "They look great! They have a quality look and are super light weight. I will say I don’t think these will hold up with daily use for very long however for the price I don’t think they can really be beat."
  },
  {
    "user": "Cheryl Navarre",
    "rating": 5.0,
    "message": "I'm a massage therapist, so I'm on my feet most off the day. These shoes are light and very comfortable. My feet do not get that tired feeling by the end of the day. I love them."
  },
  {
    "user": "smwyzard",
    "rating": 5.0,
    "message": "First pair made a lot of “clacking” sound when walking. Very annoying. Amazon replaced them very quickly. New pair are perfect."
  },
  {
    "user": "Linda Craig-Fraga, another HAPPY customer!!",
    "rating": 5.0,
    "message": "Such a comfortable fit and very fashionable! I am a daily walker and these shoes are durable, fashionable for the price! I would absolutely purchase again!"
  },
  {
    "user": "Erikka Holland",
    "rating": 5.0,
    "message": "So glad I got them, true to size. It's like walking on air!"
  },
  {
    "user": "Rosemarie Gurin donors choose",
    "rating": 5.0,
    "message": "I have wore these shoes every day this summer. Very comfortable, easy to put on, and wash up nicely. Not too hot in the heat."
  },
  {
    "user": "Bfree",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "Lois j.Hulse",
    "rating": 4.0,
    "message": "Comfortable and light weight! Great for walking or just about anything!"
  },
  {
    "user": "Kathleen",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Deborah  Mcelroy",
    "rating": 5.0,
    "message": "I wanted a pair like I previously ordered only in the purple but they were different. But very nice for someone with a different foot than me"
  },
  {
    "user": "Lloyd Davis",
    "rating": 5.0,
    "message": "Lightweight, comfortable and easy on and off"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are extremely comfortable. Lightweight and easy to step into. I am very happy with this purchase as I have to be on my feet for work. I highly recommend!"
  },
  {
    "user": "P. K.",
    "rating": 4.0,
    "message": "Nice shoe but too narrow in toe area for my somewhat square toes."
  },
  {
    "user": "Mo.",
    "rating": 5.0,
    "message": "Very light, comfortable"
  },
  {
    "user": "Joan a Davis",
    "rating": 5.0,
    "message": "Love the fit style and price"
  },
  {
    "user": "Carrie B",
    "rating": 5.0,
    "message": "Love the comfort and lightweight! My arches are weak, but having feathers for shoes and not bricks makes it up for me (I can always add inserts). Love the breathability too!"
  },
  {
    "user": "Korran Roberts",
    "rating": 5.0,
    "message": "My daughter liked the shoes. They run a little smaller than size."
  },
  {
    "user": "A C Wilkerson",
    "rating": 5.0,
    "message": "The only feature I’d change would be the white soles."
  },
  {
    "user": "Emily Mueller",
    "rating": 5.0,
    "message": "I don't know what I would do without these.  I'm on my third pair because I wear them so much and they get gross and dirty so I keep buying new ones to be my \"nice\" pair but just end up wearing them constantly too.  They're super comfy and easy to slip on.  And since getting pregnant these have been a life saver.  The thought of bending over and lacing up tennis shoes could bring a tear to my eye.  Socks are hard enough.  These just sit by the door and I slip right in them and take the dog for a walk or run to the store.  This won't be my last pair, I will never go back to regular sneakers because of these...too darn convenient"
  },
  {
    "user": "dynesha henderson",
    "rating": 5.0,
    "message": "I work in a hospital and I do a lot of walking these shoes are awesome. They fit perfectly and are super cute on my feet. Could be better support thou but they are super lightweight and they get the job done; can’t wait to buy more in the future well worth the price:)"
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "Easy to get on and off."
  },
  {
    "user": "Dawn Ahearn",
    "rating": 5.0,
    "message": "I cannot use my left hand and they are so easy to put on"
  },
  {
    "user": "Bobbie Kurner",
    "rating": 5.0,
    "message": "Super light, comfortable and cute!"
  },
  {
    "user": "Karen Walker",
    "rating": 5.0,
    "message": "So very comfortable.  Already ordered another pair."
  },
  {
    "user": "Diane Del Farno",
    "rating": 4.0,
    "message": "Very light weight for walking. Vomfy"
  },
  {
    "user": "DeeDee Cee",
    "rating": 4.0,
    "message": "I love the color and comfort of this shoe. It is a very lightweight. I added an insert to prevent my toes from slipping forward against the front of the shoe because I have problems with that. There was enough room for that insert. The material that the shoe is made from is flexible/kind of stretchy so your foot doesn’t feel cramped. The only thing that I dislike is the top tab where the shoes laces tie. It doesn’t give a neat appearance when the bow is tied. I can live with that small detail or perhaps I am not tying the laces correctly."
  },
  {
    "user": "Sarahh",
    "rating": 5.0,
    "message": "These are a hidden gem. The price, they are lightweight and comfortable. Best of all they arrive in a shoe bag! This is amazing for an avid traveler like myself."
  },
  {
    "user": "Diane S",
    "rating": 5.0,
    "message": "It’s the most comfortable shoe! You. don’t have to tie these shoes. They slip right on. I now have 3 different colors of them. I highly recommend any AKK shoes!"
  },
  {
    "user": "dawn carter",
    "rating": 5.0,
    "message": "Love these sneakers they are light weight and feels like I have nothing on my feet. Would buy these again"
  },
  {
    "user": "Elimach001",
    "rating": 5.0,
    "message": "There is nothing negative I have to say about my new shoes. I absolutely love them. The color was perfect and exactly as shown in the pictures. Thank you AKK for such a great pair of walking shoes."
  },
  {
    "user": "Linda Salazar",
    "rating": 4.0,
    "message": "Shoes fit as expected and very comfortable to wear, didn’t like the thickness in the heel."
  },
  {
    "user": "Lynne Flynn",
    "rating": 4.0,
    "message": "Ordered a size 10. Size in shoe received says 41. Assume this is European sizing. But way to tight."
  },
  {
    "user": "ann schalk",
    "rating": 4.0,
    "message": "Slip on ?? I have shard time getting them on  why"
  },
  {
    "user": "kandy",
    "rating": 4.0,
    "message": "I wish you could easily step into the shoe (less flexible back)."
  },
  {
    "user": "Linda L. Andrusko",
    "rating": 4.0,
    "message": "I'm pleased with the comfort of these shoes. I like the light weight, the padding, & ease of getting them on & off. The arch is a little high when I first put them on, however they start molding to my feet, & there isn't any pain or discomfort. All in all, I recommend these shoes for daily wear."
  },
  {
    "user": "Liz",
    "rating": 5.0,
    "message": "I just loved the sneaker. Soft and durable and mostly comfortable."
  },
  {
    "user": "Michelle Smith",
    "rating": 5.0,
    "message": "Purchased these shoe for work. I walk a lot I work with ECE students and they are very active. They are amazing shoes and look great on my feet as well the fit. I have wide feet and they fit great and easy to clean. I wash them in the washer and let them air dry."
  },
  {
    "user": "Tama Collins",
    "rating": 5.0,
    "message": "These are very very comfortable shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very supportive of the instep and lower ankle while still being flexible.  Super comfy.  Fit perfectly. I wear a size 10 and usually am barefoot but these shoes feel great!"
  },
  {
    "user": "SGG",
    "rating": 4.0,
    "message": "Lightweight and comfortable"
  },
  {
    "user": "Ashley Domaska",
    "rating": 5.0,
    "message": "I liked how quick they came and they are a perfect Cheer shoe!"
  },
  {
    "user": "Arlenne Esbeidy",
    "rating": 5.0,
    "message": "Just got my second pair, this a the best work shoes I ever had , and the quality is good I had mine for over a year and decided to get new ones, I have to say I not only used them for work but also out in the snow and over ice they won’t slip"
  },
  {
    "user": "Berlie Crawford",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Sherrie L. Barber",
    "rating": 5.0,
    "message": "I've been experiencing some foot discomfort recently due to ongoing back issues.  Unfortunately, I literally am walking different....a shifting of weight, a now different gait - all a compensation for pain.  I was looking for a lightweight, washable, supportive shoe that could be worn indoors.  I live in Florida so didn't need a \"warm\" shoe.  Well.....found it!!!  I'm really, really pleased with this walking tennis shoe.  It is wonderful.  Lightweight, easy to put on, supportive and most of all just plain comfortable.  My feet are not hot and sweaty but simply encased with breathable material that gives no matter what position my foot is in.  Although the back issues are a forever thing my feet are noticeably feeling better too!!"
  },
  {
    "user": "Amanda Thompson",
    "rating": 5.0,
    "message": "I bought these for work as I stand for at least 12 hrs a shift and I like these better than the shoes I paid $150 for! I would definitely recommend!"
  }
]