[
  {
    "user": "Renee",
    "rating": 5.0,
    "message": "I bought this sneaker because I didn't want to spend a fortune on one.  Based on reviews I ordered a 7.5.  This is a great sneaker.  I walk 6 to 10 miles 3 times a week.  It gives me great support and is very comfortable.  I am writing this review about 2 months out because I wanted to make sure it was a lasting product.  I can say that the traction on the bottom of the shoe is still like new.  I like these so much I am buying another pair."
  },
  {
    "user": "Linda",
    "rating": 5.0,
    "message": "This is the second pair of these shoes that I've purchased over the past few years. The fit is perfect, wears extremely well and very comfortable. Like the fact they're made of leather. Only negative I have is that the laces are half the width of any shoe I have and very light weight -- not sure if they will last for any period of time. I will be replacing them."
  },
  {
    "user": "Dcx0821",
    "rating": 4.0,
    "message": "These are good sneakers for walking and standing. I stand for 8 hours at my job and they’re pretty comfortable! They’re also quite stylish and can go with any outfit:) I tried working out in them and since I get on the floor to workout sometimes, I noticed that they got a bit wrinkly if you bend at the toes…so if you don’t want that, don’t workout in them! Besides that, I would recommend these shoes :)"
  },
  {
    "user": "clsdoc",
    "rating": 5.0,
    "message": "I am older and use these for walking. I always have had great support and true to size fit with New Balsnce."
  },
  {
    "user": "Rebekah",
    "rating": 5.0,
    "message": "I’m a 6.5 and these fit true to size! Purchased these for traveling around Europe for 12 days and they were wonderful! I didn’t have to break them in, wore them every single day for 12+ hours and never had any rubbing, blisters or bleeding. Absolutely happy with how they worked out!"
  },
  {
    "user": "andra klidaras",
    "rating": 5.0,
    "message": "I love the color. Wish they had other fun colors. I add my own insoles, so I can't really comment on that or working out however I do walk a lot."
  },
  {
    "user": "momofmandm",
    "rating": 5.0,
    "message": "I think the shoe is cute. I couldn't get it on my foot. It has no arch support in it. It cushion is glued down. I have many problems with my feet with high arches this shoe was way to tight across the top. Wished NB would stop playing around I wore the 608 for years great stand by Might still be but that 1/24 of IA inch they trimmed makes o difference.PS I don't know it they trimmed material off but it feels like they did."
  },
  {
    "user": "poo",
    "rating": 5.0,
    "message": "I wanted to wear these for a while before I left a review, so I could see the fit. I have been wearing them for almost a month now and I have to say these are the most comfortable shoes I have. The very first thing I did and always do when I purchase a new pair of shoes is buy new insoles and remove the cheap ones that are in them. I started out wearing them for just a few hours a day and then increase until I’m satisfied, I haven’t had any issues at all no blisters or sore feet actually I don’t want to take them off at all they feel just like my slippers do very comfortable. You don’t find any sneakers at all today that have any leather on them at all maybe vegan,  but not real leather. These shoes are just a perfect fit and very comfortable I will purchase them again in another color I highly recommend them you will love them!"
  },
  {
    "user": "glory",
    "rating": 5.0,
    "message": "These shoes are fabulous for walking! I have the white ones and wanted the blacks ones too. Hoping they were as comfy as the white ones and they are! Fit is great. I wear a size 9 Wide. So comfy, and the faux leather is great when waling in the rain. My feet stay fairly dry. Highly recommend."
  },
  {
    "user": "PK",
    "rating": 5.0,
    "message": "Best sneakers ever.  Bought the white.  9 W.  My foot measures 8 1/2 but usually that size is too small in a sneaker.  These shoes are light weight and my foot feels supported and comfortable.  Plenty of room in the toe box."
  },
  {
    "user": "Cori",
    "rating": 5.0,
    "message": "I am a retired nurse (for the past 6 years), and started wearing these shoes for work with my scrubs, after trying many brand name shoes that were totally uncomfortable and did not enough support!  Frustrated after other major brands let me down constantly, I grudgingly tried this brand, and HAVE NEVER LOOKED BACK."
  },
  {
    "user": "RobinGB",
    "rating": 5.0,
    "message": "I've been wearing a certain type of New Balance shoe for years. This one isn't an exact match but pretty close. Some of the New Balance, like many other shoes today, are made to stretch and tear so you have to spend more money to replace them. It used to be that either you outgrew a shoe (if you were a kid) or, if an adult, that the support and tread would be the reason it wore out and needed replacing. These days shoes have a kind of fabric on them that stretches but also tears. This one has a kind of fabric but doesn't tear. I find them very comfy and give me support--since I'm overweight that's important."
  },
  {
    "user": "Kindle Customer CarmenB",
    "rating": 5.0,
    "message": "I love them and they came right away. This is the 3rd pair I have ordered from Amazon."
  },
  {
    "user": "mr. pitt",
    "rating": 5.0,
    "message": "Bought these for my mother 2 years ago. She has trouble walking without good shoes due to neuropathy. She is still wearing them and they still look good, and no structural issues. She loves them and says they feel great on her feet and help her balance and steadiness"
  },
  {
    "user": "Josephine Thurman",
    "rating": 4.0,
    "message": "I am excited by the fit narrow fits perfect  I wear AA width"
  },
  {
    "user": "Alondra",
    "rating": 5.0,
    "message": "I suffered from plantar fasciitis and these shoes bring comfort. Also a lot of stability when I’m walking. They are great! I don’t have wide feet so I don’t know how they are going to work with people that have wide feet."
  },
  {
    "user": "Nancy",
    "rating": 5.0,
    "message": "Sizing is accurate. I have wide feet, narrow heals,  high arches and a bunion on one foot. These are the only shoes I’ve found that fit comfortably right out of the box. Shoe size: 9 1/2 w"
  },
  {
    "user": "Nancy",
    "rating": 5.0,
    "message": "The fit is great! I always use NB walking shoes to get around. My podiatrist highly recommended this brand to me and is the only branch she wears."
  },
  {
    "user": "Arica",
    "rating": 4.0,
    "message": "If you are always walking outdoors these shoes are a horrible idea."
  },
  {
    "user": "Nancy Walter",
    "rating": 5.0,
    "message": "Wear them at least 6 days a week sometimes 7 days. Enjoy gathering comfort and comfort."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "This is my third pair."
  },
  {
    "user": "Brighten",
    "rating": 5.0,
    "message": "They really were a perfect fit!  The price was good as well.  Thanks!"
  },
  {
    "user": "Mary Hall",
    "rating": 5.0,
    "message": "I keep ordering the same shoe because I like it very much"
  },
  {
    "user": "Person Here",
    "rating": 4.0,
    "message": "I like that’s it’s REALLY comfortable, it is really pretty and i use it for my working out time"
  },
  {
    "user": "Karen Bouton",
    "rating": 5.0,
    "message": "Good support for my flat feet 😉"
  },
  {
    "user": "Frances Easley",
    "rating": 5.0,
    "message": "Great fit"
  },
  {
    "user": "Valerie",
    "rating": 4.0,
    "message": "Very tight fit. I normally wear a size 11M in women, an 11.5 may be more comfortable"
  },
  {
    "user": "Kelly Revolorio",
    "rating": 5.0,
    "message": "I don’t have wide feet but I saw some of the other reviews recommend to get the wide version for comfort and I agree. I think my feet would’ve gotten too hot because of how cushiony the shoe is inside. Very comfy and I last all day in these. They look cute too. Just fyi they’re not super supportive so if you struggle with that maybe consider using insoles. Totally worth it aside from that!"
  },
  {
    "user": "Mary Stickle",
    "rating": 5.0,
    "message": "I don't understand why, but I haven't been able to find a pair of shoes to fit in a long time. But I found these and they work. I will order another pair a half size bigger."
  },
  {
    "user": "Brittany",
    "rating": 5.0,
    "message": "Very cute but had to send back because they run small and they were cold out of a bigger size :("
  },
  {
    "user": "Kathryn R",
    "rating": 4.0,
    "message": "Returned and replaced with the correct size."
  },
  {
    "user": "Marcella Cook",
    "rating": 5.0,
    "message": "Comfortable for walking"
  },
  {
    "user": "Tom Betz",
    "rating": 5.0,
    "message": "Christmas present"
  },
  {
    "user": "Linda B. Buckley",
    "rating": 5.0,
    "message": "Fit is perfect and I love these new trainers."
  },
  {
    "user": "Tracy",
    "rating": 5.0,
    "message": "Theses shoes are very comfortable"
  },
  {
    "user": "James Dixon",
    "rating": 5.0,
    "message": "They were good for work out and walking"
  },
  {
    "user": "Bonnie",
    "rating": 5.0,
    "message": "I've been wearing this sneaker for years, going to hate when they discontinue it. It gets harder and harder to find every year."
  },
  {
    "user": "Ruth",
    "rating": 4.0,
    "message": "Walking"
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "Wore my first pair out so it was time for another pair. Ordered the same sneakers for the comfort and they last a long time."
  },
  {
    "user": "Lisa G.",
    "rating": 3.0,
    "message": "The support seems to be on the outside of the foot, not the inside. No arch support making the walking gait terrible. The inside of the foot tilts downward while the outside tilts upward. This will cause knee, hip and back problems even with an insert. If an insert is used you'll have to cut off the outside half and use the inside half. How does a company like New Balance make sneakers like this? They used to be a go-to for those with foot problems. It's better to find a New Balance store and actually try them on. I almost thinking that these aren't actual New Balance sneakers because they are terribly made."
  },
  {
    "user": "donna green",
    "rating": 4.0,
    "message": "It looks good and fits well"
  },
  {
    "user": "Momofonesweetie",
    "rating": 4.0,
    "message": "These looked nice but ran small (I always size up on an exercise shoe) but the toe-box was still too tight. Not for me."
  },
  {
    "user": "Susan K.",
    "rating": 5.0,
    "message": "I couldn’t find these shoes in stores, so happy with them. Great quality, great price!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "ok"
  },
  {
    "user": "M. Jacobs",
    "rating": 4.0,
    "message": "Tongue is too short!"
  },
  {
    "user": "SandraContreras0201",
    "rating": 5.0,
    "message": "Amazing for walking !!!"
  },
  {
    "user": "dolphingirl",
    "rating": 4.0,
    "message": "I like new balance.  Have bought them for years. Dr. Recommended them.  However, I was told to get walking shoes. I used to wear a 7 1/2 D or wide.  I ordered this type in the past-the walking shoe.  But when reordering the site kept trying to say training.  May be they changed. I do know the new shoe hurt my big toes.  For some reason shoe was too small. I ordered an 8 wide.  They seem to be ok. Just a smidge too big. If anyone knows a good walking shoe that I can get a wide and the ankle area is cut low.  I’m sure I’m not the only person with feet issues.  I don’t like the side of shoe hitting my ankle bone. These shoes were great a couple years ago but I think they are changing the fit. It’s a walking show per order & box.not training.. what’s the difference?"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My mother loves them and it supports her needs orthopedically"
  },
  {
    "user": "Tami G",
    "rating": 5.0,
    "message": "Loved the cushion fit!"
  },
  {
    "user": "Becky L Davis",
    "rating": 5.0,
    "message": "Awesome brand"
  },
  {
    "user": "Haley Mosley",
    "rating": 5.0,
    "message": "I’m so happy with my purchase! These New Balance are SUPER comfy and supportive! Great value for the price, I wore them on a 10 day camping/hiking trip and they held up great! Will absolutely buy these again….just get them!"
  },
  {
    "user": "Katherine R Cook",
    "rating": 4.0,
    "message": "I had major foot surgery 6 1/2 years ago so I need a good support & comfortable shoe. These shoes provide this. I will buy these shoes again!"
  },
  {
    "user": "Barb",
    "rating": 4.0,
    "message": "Not as much arch support as I would expect from an athletic shoe.  Will have to spend more to add an insert.  Happy, though to be able to find in a long narrow size"
  },
  {
    "user": "Dorothy",
    "rating": 5.0,
    "message": "Love this brand, good for a lot of walking. Been wearing them for years"
  },
  {
    "user": "Pamela Emery",
    "rating": 5.0,
    "message": "Very very comfortable"
  },
  {
    "user": "Tangela Oquinn",
    "rating": 5.0,
    "message": "For walking  didn't like the comfort of them I like the look"
  },
  {
    "user": "Cajun gal",
    "rating": 5.0,
    "message": "I have a widish foot, but I had gone to a local shoe store and they recommended this shoe for me.  I bought it twice.  Then I tried another brand, which I won't mention.  My widish foot slid around in the shoe and made my bones of my feet hurt after a long walk.  So, i ordered another pair of these shoes.  They fit so snugly and no riding around in the shoe for me!  I don't think i will be trying another brand or style from here on out!"
  },
  {
    "user": "Steph",
    "rating": 4.0,
    "message": "I’m on my feet 8 plus hours and it was recommended to me by another nurse who has really bad feet pain"
  },
  {
    "user": "Jen S.",
    "rating": 4.0,
    "message": "I have reordered these shoes twice and will again."
  },
  {
    "user": "Joyce",
    "rating": 5.0,
    "message": "Great comfort and support"
  },
  {
    "user": "Georgeanna Schneider",
    "rating": 5.0,
    "message": "I love these shoes and always order another pair when the ones I am wearing are shot out.  I should probably  order many backup pairs, since it seems everything I like to buy eventually goes away"
  },
  {
    "user": "Cheryl Hayes",
    "rating": 5.0,
    "message": "I owned a pair of these in the past. love the way they fit and feel.  when i needed a new pair i could not find them anywhere in stores or on line.  so glad I finally found them"
  },
  {
    "user": "Claire Moran",
    "rating": 5.0,
    "message": "This is a nice shoe.  The box it came in was labeled \"B\" for the width however the size when ordering did not include the width.  Had I known it was a \"B\" I might have ordered a half size larger.  The shoes are a bit tight but I'm hoping they will stretch a bit as they have leather uppers.  The support is great."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I really liked the shoes very comfortable with a lot of support but I did feel my foot get really hot I’m these."
  },
  {
    "user": "Crystal Longenecker",
    "rating": 5.0,
    "message": "My feet are very narrow and the narrow width fit perfect."
  },
  {
    "user": "HMD",
    "rating": 3.0,
    "message": "I was expecting more of an arch support but this one doesn’t deliver that."
  },
  {
    "user": "Tami",
    "rating": 5.0,
    "message": "Love the fit of this shoe style.  Have bought them white for years. Saw the blue and love the color.  Great support for walking my dog."
  },
  {
    "user": "Nathalie Prieto",
    "rating": 5.0,
    "message": "Love this shoes specially for long walks"
  },
  {
    "user": "Hanna-leena Joseph",
    "rating": 5.0,
    "message": "Most comfortable shoes I have had in a long time, size 7b toe box nice and wide. My foot is 3.5\" wide and the shoe is 4\" wide measured from the bottom outside so there is plenty of room but not too wide. Like these so much that I just ordered another pair."
  },
  {
    "user": "Diane",
    "rating": 5.0,
    "message": "Good quality, delivered quickly. Fit was perfect."
  },
  {
    "user": "Carl D./Rose D.",
    "rating": 4.0,
    "message": "did not fit seemed large."
  },
  {
    "user": "VICKIE AMOS",
    "rating": 4.0,
    "message": "Really like the shoe, the shoe strings are short and thin."
  },
  {
    "user": "Coni M.",
    "rating": 5.0,
    "message": "The most comfortable shoe NB makes"
  },
  {
    "user": "Barbara Young",
    "rating": 3.0,
    "message": "Amazon was unable over the past six months to provide my usual New Balance shoes.  I bought two pair of these as that seems to be all that is readily available.  They won't hold up like older models.  Shoe laces are so narrow  I will have a problem finding replacements."
  },
  {
    "user": "Nicole G",
    "rating": 3.0,
    "message": "I like that they are leather and not flimsy mesh fabric."
  },
  {
    "user": "Dar",
    "rating": 5.0,
    "message": "My old pair were worn and I was looking to replace them with the same shoe. The product arrived as described."
  },
  {
    "user": "Marleen",
    "rating": 5.0,
    "message": "I have always felt I had “wide” feet just because my foot is bigger than most women in my family. I am a size 10 and have always fit comfortably in regular size 10 shoes. However after reading some reviews saying that the shoe is a bit tight I decided to just get a 10 wide. After trying them on, I felt like maybe I should’ve stuck to the size I normally get. The shoes are comfortable but I can definitely feel the extra space in width. That is on me though, I don’t mind it at all because I’ve never been one to like a shoe to fit too perfect. I enjoy having a little bit of wiggle room and with the wide fit I have wiggle room without adding length to my shoe size. These are super comfortable casual shoes and so far I love them. I will update later after I give them a few months of wear time."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The shoes are great but I ordered the wrong size, need 5 and a half.  How do I exchange for the right size?"
  },
  {
    "user": "Angel",
    "rating": 5.0,
    "message": "This is the first pair of New Balance that I have purchased.  They feel great.  I needed support for my ankles.  These fit the bill."
  },
  {
    "user": "EILEEN JENSEN",
    "rating": 3.0,
    "message": "I always buy NB but these shoes are too stiff for me. There was no support arch so I had to add one. I have been wearing them for an hour a day to break them in, but that's all I kind handle. Hopefully I can were them outside some day."
  },
  {
    "user": "Jane F.",
    "rating": 5.0,
    "message": "This is my second pair of these new Balance shoes.  They are one f the best I have ever had!!  They have worn like iron and still clean up like new!  I highly recommend these shoes!!"
  },
  {
    "user": "Fara",
    "rating": 5.0,
    "message": "Me encantan por su color blanco, perfectos, muy cómodos, los uso con frecuencia y diversas ropas. Los adoro!!"
  },
  {
    "user": "Wheaton Mom",
    "rating": 5.0,
    "message": "I’ve been buying these shoes for work for the past couple of years. I do a lot of walking on cement, so I need shoes with really great support and cushioning. These shoes are the best I’ve found. They are comfortable right out of the box, too!"
  },
  {
    "user": "Linny Contreras",
    "rating": 5.0,
    "message": "I ordered a 6 1/2. I am usually a 6 1/2 to 7. I ordered the regular ones and they fit perfectly. They took about 2 days to break in and now they are my favorite for power walking. I'm 30 and I have a high arch on my foot and these give great support."
  },
  {
    "user": "paul c",
    "rating": 5.0,
    "message": "Bought these for my wife and she loves them. Great feel and she loves the support they give her. Light weight and well constructed. She highly recommends them"
  },
  {
    "user": "Wendy",
    "rating": 4.0,
    "message": "toe box crimps my toes"
  },
  {
    "user": "Con",
    "rating": 3.0,
    "message": "Very comfortable but not enough support at the heel as in my old, worn out new balance."
  },
  {
    "user": "JUDE",
    "rating": 5.0,
    "message": "They are very comfortable and easy to put on.  I like them alot.  This the third pair I have had."
  },
  {
    "user": "kat's comments",
    "rating": 5.0,
    "message": "Love new balance and that they have wide width!"
  },
  {
    "user": "Diane",
    "rating": 5.0,
    "message": "At last I have a pair of shoes that I can wear all day! I have bad arthitis in my feet!"
  },
  {
    "user": "Sue singletary",
    "rating": 3.0,
    "message": "She’s are not very comfortable the material is hard"
  },
  {
    "user": "kss",
    "rating": 5.0,
    "message": "I’ve never had a pair of shoes that made my feet itch like these.  Now, 10 months later, nothing has changed.  I would not recommend or purchase again."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "They do not seem to fit right. They seem a bit short, but slightly big where they tie.  I feel like there is not enough padding bc my toes feel like they hit the ground."
  },
  {
    "user": "Paula Schroeder",
    "rating": 5.0,
    "message": "I am over 70 and have had difficulty in finding a shoe that's comfortable and also offers support.  I researched and the shoe most often recommended is the New Balance line and especially the  411 V1 shoe.  The price is more than I usually spend but I was willing to give it a try.  I have been wearing the shoe for over a week and it was so comfortable from the first wearing.  Size is true and the width by the toes is roomy.  I am so delighted to have found the perfect shoe for me!!  Buying another pair right now!!"
  },
  {
    "user": "ChrisKlar",
    "rating": 4.0,
    "message": "Usually when I but a pair of shoes on Amazon, I get them, try them on, and send them right back because they feel cheap and uncomfortable. These were very comfortable at first try on and did not have a cheap feel to them. However, after working in them first day I realized they still needed a little more cushion on the ball of the foot. So I put in some inserts and they were great on the second day of work! Plenty of room in the toe box, food support, great for my shift at work in the kitchen."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love them!  Exactly what I wanted.  I walk about four miles a day these shoes are comfortable and look cute!"
  },
  {
    "user": "Carol Kirkland",
    "rating": 5.0,
    "message": "They feel very light even though they are a very sturdy shoe."
  },
  {
    "user": "JS",
    "rating": 5.0,
    "message": "Great shoes for walking. Fit well, comfortable and lightweight."
  },
  {
    "user": "A Johnson",
    "rating": 5.0,
    "message": "Here’s the deal, I’m in my twenties and I love a good long walk to the nearest coffee shop to spend $7 on an average cup o’ joe. Because of this, I knew I could not just order a Nike cross trainer because the support would be equivalent to a training bra. I needed a New Balance shoe. I needed THIS New Balance shoe. I ordered these knowing I would love them. I set the bar so high, anything less than would have morphed the Karen right out of me. And you know what? These shoes DELIVERED. I love them so much I’m going to give them names. I will wear these as my slippers. I will wear these as my walking shoe. I will wear these on my wedding day if I don’t spill too much spaghetti on them. I am a 7.5 and they fit as a 7.5 should. I have average sized feet and the width of the shoe is fab. If you’re looking for something you can wear all day / night here’s your sign."
  },
  {
    "user": "Lois O White",
    "rating": 5.0,
    "message": "Fit good and feel good"
  }
]