[
  {
    "user": "Irene Johnson",
    "rating": 5.0,
    "message": "Bought these to replace a worn out pair I already owned. Looked all over town for them to no avail. Finally decided to look on Amazon. Bingo! I’m sometimes afraid to buy shoes online for fear they may not fit. These fit exactly as my old ones did. Time to put some walking miles on them."
  },
  {
    "user": "Melinda",
    "rating": 4.0,
    "message": "Only had them 3 months and they have already lost their cushiony comfort and the laces come untied frequently. However, I wear them everyday to a job where I am on my feet a lot.  Overall though they are nice shoes.  They were super comfortable the first two weeks."
  },
  {
    "user": "hedamo",
    "rating": 5.0,
    "message": "These were a repurchase for me. I like them for spring and summer because they are a little lighter weight and quite comfortable. I wear a size 8 and find the size was perfect."
  },
  {
    "user": "Heather M Nelson",
    "rating": 4.0,
    "message": "Even though I take a wide width shoe after wearing them for a bit and stretching them out, they are very comfortable and lightweight. The only thing I do not care for is the laces. They are a flat lace and not rounded and tend to come undone easily but if double knotted work out great."
  },
  {
    "user": "Annie Jiang",
    "rating": 5.0,
    "message": "Nice and comfortable. I have always appreciated how supportive, durable, and comfortable most Skechers sneakers are. I am 6.5 (dress shoes and sandals), and this one fits best at 7.5. 7 is fine but if I run then my toes can touch the end of the shoes. so I exchanged 7 for 7.5, which turned out perfect!"
  },
  {
    "user": "Mary Ripp",
    "rating": 5.0,
    "message": "Very comfortable my favorite brand of shoes true to size on shoe size"
  },
  {
    "user": "Buck",
    "rating": 5.0,
    "message": "Didn’t have to go to shoe store the wife use’s them for her every day walking"
  },
  {
    "user": "Connie",
    "rating": 5.0,
    "message": "Comfortable, wide width shoes. Walked a lot in these and they do not hurt your feet.  These shoes are light weight and they look great!!"
  },
  {
    "user": "Ellie Clapier",
    "rating": 5.0,
    "message": "i like the style of skechers"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are most likely the most comfortable shoes I’ve ever had.. I like that they lace up. I will definitely be ordering more of these!"
  },
  {
    "user": "Satisfied customer",
    "rating": 5.0,
    "message": "I like the fit the comfort the look! Colors are bright love this sneaker! I truly recommend. You gotta have it. Put it u in your cart!"
  },
  {
    "user": "Roxy78",
    "rating": 5.0,
    "message": "Love the comfort and fit"
  },
  {
    "user": "Brittany",
    "rating": 5.0,
    "message": "Very comfortable! I walk 2 miles a day and stand for hours at a time at work in these. Have been wearing for 4 months and still as supportive as day 1. Lightweight. Breathable for summer, but warm enough for cooler days. Cute too. Highly recommend!"
  },
  {
    "user": "Gail",
    "rating": 4.0,
    "message": "Had to return for smaller size & seller was very responsive. Very lightweight comfortable shoes. Wish they had little more arch support but otherwise happy with item."
  },
  {
    "user": "dc143",
    "rating": 5.0,
    "message": "Finally another perfect fit. Normal width sneakers tend to either pinch my toes or be extremely tight on my high arch. The wide width fit perfect and very comfortable. I didn't even have to break them in."
  },
  {
    "user": "Bonnie",
    "rating": 5.0,
    "message": "I like the cloth tops.  Well made"
  },
  {
    "user": "Maryaventura",
    "rating": 5.0,
    "message": "Comfortable walking shoes"
  },
  {
    "user": "Brenda Duncan",
    "rating": 5.0,
    "message": "I wear these at work and everywhere"
  },
  {
    "user": "Donna S. Meredith",
    "rating": 5.0,
    "message": "These shoes fit well with good arch support and feel comfortable through the toe box."
  },
  {
    "user": "Deborah",
    "rating": 5.0,
    "message": "These shoes are very comfortable and well constructed. They fit true to size. They are stylish and exactly what I expected. I highly recommend."
  },
  {
    "user": "Peanut",
    "rating": 4.0,
    "message": "I've had foot issues and this comes close to what I would like.  In addition they are very attractive."
  },
  {
    "user": "Jo",
    "rating": 5.0,
    "message": "Very comfortable and suitable for a long day of work."
  },
  {
    "user": "josannafillmore",
    "rating": 5.0,
    "message": "The shoe is coming apart"
  },
  {
    "user": "patricia knoll",
    "rating": 5.0,
    "message": "Nice and comfy on my feet"
  },
  {
    "user": "CARA BAUER",
    "rating": 5.0,
    "message": "I LOVE THESE SHOES.  I THINK I GOT A GOOD PRICE ON THEM BECAUSE YOU HAVE TO TIE THEM BUT THAT'S EASY FOR ME AND WORTH NOT PAYING ALOT MORE FOR THESE!"
  },
  {
    "user": "Briana",
    "rating": 5.0,
    "message": "bought for work because im constantly working during my shifts. (i average about 15,000 steps a day at work). my feet never hurt anymore with these shoes!"
  },
  {
    "user": "DMP",
    "rating": 4.0,
    "message": "I like the shoe over all. Breathable material and comfortable.  Not  stiff at all. The black laces keep coming undone because it is a nylon type material.  Other than that I'm pleased."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love these shoes. Absolutely love them. I bought them for a trip to Europe so I’ve been breaking them in. I’m not sure what’s up with the soles but these things squeak loudly on tiled and paved flooring."
  },
  {
    "user": "Michelle Anne Schrokosch",
    "rating": 5.0,
    "message": "Very comfortable, will buy again."
  },
  {
    "user": "Sage Marie",
    "rating": 5.0,
    "message": "These are so cute and comfy I ordered them again in another color!"
  },
  {
    "user": "Ester",
    "rating": 5.0,
    "message": "They fit comfortably. Wore them on a walking trip and I was still comfortable at end of day with first wearing"
  },
  {
    "user": "mary",
    "rating": 5.0,
    "message": "Very comfortable and stylish shoe. Wish I had bought 2 pairs"
  },
  {
    "user": "Eric",
    "rating": 5.0,
    "message": "Comfortable work shoes and slightly breathable, not “hey dude” breathable fabric but breathable for a work shoe."
  },
  {
    "user": "Cathrina",
    "rating": 5.0,
    "message": "These sneakers are comfortable."
  },
  {
    "user": "Ramona Westerman",
    "rating": 5.0,
    "message": "I really like them, thank you!!"
  },
  {
    "user": "Di",
    "rating": 5.0,
    "message": "Fit perfectly and we’re very comfortable for walking long distances."
  },
  {
    "user": "Luis Matias",
    "rating": 5.0,
    "message": "Tardo mas tiempo en llegar de lo que esperaba. Pero llego y correcto."
  },
  {
    "user": "armando",
    "rating": 5.0,
    "message": "Very nice good stuff"
  },
  {
    "user": "Lindsey M",
    "rating": 5.0,
    "message": "I just got back from a 7 day Disney World trip and my feet survived! I am so glad I found these sketchers flex appeal shoes before we did Disney.  As most people know, Disney involves miles and miles of walking. We opened and closed the parks each day and these shoes proved their worth. I went through 115 degree heat to down pours with soaking socks and shoes and had no blisters or issues. Plus they dried out by the next day with just a little hair dryer action. I had different shoes on previous trips and my feet were so sore after a few days that I dreaded walking anymore. These sketchers are essential to anyone looking for good walking shoes for theme parks and especially Disney World!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "If they had arch supports they'd be perfect, but I still love them."
  },
  {
    "user": "DS",
    "rating": 5.0,
    "message": "The material, the color, the arch support are wonderful.  I am returning them for a larger size, though.  Looking forward to using the 7.5s"
  },
  {
    "user": "Someone",
    "rating": 4.0,
    "message": "Don’t like the back it rubs against the back of the foot"
  },
  {
    "user": "Nicole Sisson",
    "rating": 4.0,
    "message": "These shoes are great. I gave a 9.5 wide with a very high arch. They fit well and are comfortable all day long. Of note if you work in a silent office like mine, they make noise on carpet because of the tread. Over all great value."
  },
  {
    "user": "ANONYMOUS",
    "rating": 5.0,
    "message": "REALLY COMFORTABLE SHOE AND STYLISH.  LIKE THE CHOICES IN COLORS AND DESIGNS AND GREAT EXERCISING SHOE."
  },
  {
    "user": "donna nejad",
    "rating": 5.0,
    "message": "Great for walking as it has support for your feet."
  },
  {
    "user": "AE California",
    "rating": 5.0,
    "message": "I have another pair so am happy with this new pair. They are immediately comfortable."
  },
  {
    "user": "The Architect",
    "rating": 4.0,
    "message": "Bought for wife for one purpose, to mow the yard. We have a push mower. She stated they are comfortable. This way her nicer shoes aren’t sacrificed to grass stains and dirt."
  },
  {
    "user": "Tyron b.",
    "rating": 5.0,
    "message": "The media could not be loaded. I really love these shoes. When I first tried them on I thought I wasn’t wearing any shoes. They are extremely light. Soft in the inside and comfortable"
  },
  {
    "user": "Susan McCanne",
    "rating": 5.0,
    "message": "This is the perfect walking shoe! Very light weight, comfortable and the fit is spot on! Highly recommend this shoe!"
  },
  {
    "user": "Hubbard",
    "rating": 4.0,
    "message": "Looks good and would be perfect if they were a little bit longer.  I wear a 10 as are all of my Skechers. These are a little too short, saving money?  My biggest complaint is that I can't get them in half sizes. If I go to an 11 I can't wear them and the ones I have ordered in that size sit in my closet because if you get them a little too long one can trip and fall on their face."
  },
  {
    "user": "Barbara K. Weston Ct",
    "rating": 5.0,
    "message": "Great comfortable sneaker, lightweight, breathable fashionable. I wear them to work with my figs uniforms, great combo, can’t be beat for stylish comfort!"
  },
  {
    "user": "CLAUDINE Hway",
    "rating": 4.0,
    "message": "These are typical light and airy Skechers. I prefer the toebox of my Altra shoes but when I need a more affordable option then Skechers are my go to shoes."
  },
  {
    "user": "Janel K.",
    "rating": 5.0,
    "message": "These are breathable, washable,  and very walkable. Wear them at the gym every day."
  },
  {
    "user": "jeffrey sternisha",
    "rating": 5.0,
    "message": "fit like a glove"
  },
  {
    "user": "Mamaw",
    "rating": 4.0,
    "message": "I've gotten so many compliments on my sketches and the multi colors. They shoe are lightweight, and have good support."
  },
  {
    "user": "Génesis Ulloa",
    "rating": 5.0,
    "message": "Mucho más conveniente comprar por aquí, ya que en Latinoamérica es más costoso y estos zapatos son súper cómodos"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love this brand and normally wear an 8 1/2 but these were short in the toe area so I returned them"
  },
  {
    "user": "Abba",
    "rating": 5.0,
    "message": "Order these for my wife to work in and she kept going on and on about how comfortable they are."
  },
  {
    "user": "Sarah T.",
    "rating": 5.0,
    "message": "So comfortable"
  },
  {
    "user": "emily@moxiemag.com",
    "rating": 5.0,
    "message": "fits perfectly, provides support, the most comfortable of all the shoes I got that are like it."
  },
  {
    "user": "Buyer",
    "rating": 4.0,
    "message": "Bought these for work. I’m on my feet a lot. Very very comfy shoes. Only thing I have an issue with is they squeak when walking on smooth concrete floors but I can live with it"
  },
  {
    "user": "Susan",
    "rating": 4.0,
    "message": "I usually have issues with a tight toe box. These shoes have plenty of room and are very cushy and comfortable. Happy with the low cut around the ankles.....giving a pleasing fit."
  },
  {
    "user": "Robin",
    "rating": 5.0,
    "message": "I love these shoes!"
  },
  {
    "user": "Barbi",
    "rating": 5.0,
    "message": "This is my sixth pair.  Love them, I can walk for miles.  This pair (grey) came with white laces, and an extra set of grey laces as a nice bonus."
  },
  {
    "user": "Debbie",
    "rating": 5.0,
    "message": "These are my 3rd pair. Very comfortable and I didn’t need to break them in. Just put them on and go. Best tennis shoes I’ve owned in a long time."
  },
  {
    "user": "Pieretti",
    "rating": 5.0,
    "message": "Exactly as advertised. Helps with my Plantar Fasciitis."
  },
  {
    "user": "K. Varraso",
    "rating": 5.0,
    "message": "I am buying the third or fourth pair of these shoes for myself, and I just bought a pair for her of these to see if they are comfortable for the long walks she takes. We immediately put rubber shoelaces in the shoes, and they suddenly become wonderful, slip on, comfortable shoes. Also, the shoes last for a long while before wearing out. I wear pairs of these for at least a year, almost every day, and I have no foot pain. They have loads of cushioning that lasts and lasts. As I am known to be tough on shoes, this is a major positive. If I had to make a complaint, it would be that the wide shoes don't come in cute colors, like the \"normal width\" shoes do.  I'd love a pair of cute sneakers in purple or a lively print. But that doesn't happen if you have feet that are wider than \"normal feet.\" So, I settle for colored laces, and that makes them a little more cheerful. I am planning to take one of the older pair of shoes and painting them, to see if they look more customized this year. If so, then watch out!  There are going to be a pair of wildly colorful versions of these shoes walking around in Raleigh, NC or Boston, MA!"
  },
  {
    "user": "Martha",
    "rating": 5.0,
    "message": "Took a few weeks but well worth the wait. Skeptical because price was so low. VERY happy with my Skechers!"
  },
  {
    "user": "Lynn",
    "rating": 5.0,
    "message": "I'm a janitor.  On my feet long hours 6 days a week +.  The only sneaker I've found that doesn't hurt my feet. I'm a size 10 and they don't look like I am a size 10(clown feet). Super comfortable, durible, worth the money. I've been buying these for several yrs not that they don't last long, they do. I just like to freshen up my pair of shoes for work so I buy these every 2yrs. I still wear the previous pairs on occasion for maybe yard work ect...the older ones are still intact and comfortable.  Will continue to wear until they fall apart whenever that will be."
  },
  {
    "user": "Satisfied Buyer",
    "rating": 5.0,
    "message": "I haven't worn them yet. but trying  it on seem to be ok and fits well.  It seem true to size. I like Sketchers sneakers.  I was been wearing this brand for many years.  Thanks"
  },
  {
    "user": "leslie grace",
    "rating": 5.0,
    "message": "Very comfortable walking shoes real airy"
  },
  {
    "user": "Rebecca Calloway",
    "rating": 5.0,
    "message": "These shoes are very comfortable. True to size"
  },
  {
    "user": "Gayle",
    "rating": 4.0,
    "message": "Starting with the good- I love the style and material! Lightweight, breathable, and versatile with outfit coordination. They wash well and dry fast. The bad- If I would have known how narrow the basic size comes, I would have gone with the wide sizing. I'm pregnant and work 6 hour shifts. After 4 hours, my heels are in pain. If you're a person with wider feet, size up to the wide. If you are prone to heel pain, buy insoles with these! Other than that, these are a great shoes. Fast shipping, great packaging"
  },
  {
    "user": "Rick",
    "rating": 4.0,
    "message": "Wasn't sure about the color but liked it"
  },
  {
    "user": "Charles Lyttle",
    "rating": 4.0,
    "message": "Wish it had more padding. I still have to use an insert."
  },
  {
    "user": "M. Pinto",
    "rating": 5.0,
    "message": "These have to be the most comfortable sneakers ever.  I have neuropathy so I purchased these in the hopes that my feet will hurt less if I am out and about for extended periods of time.  I recently traveled and was stuck at the airport for 8 hours.  These sneakers performed better than expected and my feet did not hurt when I finally made it home,  I highly recommend it!"
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "The product was as expected.  What I was really impressed with was the delivery driver actually hid the package under a patio cushion.  That little effort to make sure I got it, 5 stars and more,"
  },
  {
    "user": "Terri Bogues",
    "rating": 5.0,
    "message": "I found these shoes ran true to size and are quite comfortable.  I have problems with my feet hurting if I’m on them too long and these let me stand on my feet all day with no discomfort and the end if the day."
  },
  {
    "user": "L. L. Carroll",
    "rating": 5.0,
    "message": "I have horribly painful feet. I’ve had 4 surgeries on my left foot and one on my right, plus I have neuropathy so my feet are always in pain. I took this show on a trip and found it extremely comfortable on our many walks around various cities. I was able to walk farther than I have been able to in other shoes."
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "I love these sneakers.  I have a wide foot but, not very wide. So sometimes the wide width in some shoes are to wide.  These are perfect in width and length.  The snug fit to the heal cradles your foot nicely and the arch is a nice fit to the foot. Fabric is light weight but not flimsy. After 6 months they still look nice and I bought another pair because I love them so much.  Highly recommend."
  },
  {
    "user": "TechieThomas",
    "rating": 5.0,
    "message": "I like the comfort.  The color fits with everything."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "So happy w/ this purchase. Have purchased other skechers but these are the best yet. Like walking on clouds, immediately feel like i have more energy just having them on. Definitely recommend!"
  },
  {
    "user": "Missy",
    "rating": 4.0,
    "message": "Not as much if any memory foam."
  },
  {
    "user": "AllieJones5",
    "rating": 5.0,
    "message": "Fit as expected Memory Soles are perfect for walking"
  },
  {
    "user": "Rivergirl",
    "rating": 4.0,
    "message": "I like these shoes for everyday around the house and shopping, however, they have not proven to be a good shoe for hoofing my daily walking routine. The inner foot bed is memory foam and I found when walking briskly I had trouble balancing on uneven terrain. It threw me off balance several times pivoting. I love the color, plan to keep them and they hug my foot nicely. I wish the sole was black because the white outer sole already shows discoloration."
  },
  {
    "user": "Grandma3",
    "rating": 5.0,
    "message": "I like the fact that this shoe is very light on my foot, very comfortable and soft inside and out.  I don’t like the fact that the laces untie unless you double knot them."
  },
  {
    "user": "KV",
    "rating": 5.0,
    "message": "These are lightweight and very comfortable!"
  },
  {
    "user": "KATHI W",
    "rating": 5.0,
    "message": "Most comfortable  skechers I have ever owned.  I  work  14 hours as a nurse and standing all day, I don't even realize I am wearing anything on my feet.  I  purchased  2 other  pairs."
  },
  {
    "user": "ROSE  R.",
    "rating": 5.0,
    "message": "I bought these to wear only indoors on my treadmill.  I have a pair that I now use only for outdoor wear.  They do not have that wide bottom that extend beyond the shoe itself - these are very uncomfortable for me to wear.  I just love them and I have purchased other brands of shoes and these are so much better."
  },
  {
    "user": "Skysaway",
    "rating": 5.0,
    "message": "They are cute and comfortable. I like them. I will order them again."
  },
  {
    "user": "sarika patel",
    "rating": 5.0,
    "message": "Fits perfectly and comfortable. Good support"
  },
  {
    "user": "Gregg",
    "rating": 5.0,
    "message": "An every day shoe."
  },
  {
    "user": "Dan Clare",
    "rating": 5.0,
    "message": "Good product"
  },
  {
    "user": "karen cole",
    "rating": 3.0,
    "message": "These sneakers are comfy BUT. The treads pick up every rock you step on and Brother, I mean every rock. I walked across my gravel driveway and once I hit pavement, it was revealed I was wearing tap shoes. I started to dream of appearing alongside Hugh Jackman in Broadways The Music Man, tapping my heart out as Marion Paroo when I realized I’m 60 and have no talent at all. Anyway, buy with caution"
  },
  {
    "user": "Diana prince",
    "rating": 5.0,
    "message": "Ha i finally got the size right. Got on time and fits perfectly."
  },
  {
    "user": "TRISHA",
    "rating": 3.0,
    "message": "Love Sketchers shoes. They are pretty much the only shoes I can wear, When I got this pair I had bought 2 pair at same time just different colors, the first fit great still wearing them but are getting worn down. This pair its like someone wore them previously they fall inwords and by the time my work day was over my back and feet hurt soooo bad. I didnt try them when I got them my mistake so cant send back now lesson learned. Otherwise nice shoes"
  },
  {
    "user": "Rockinpaints",
    "rating": 5.0,
    "message": "I'm on my feet all day and they are very comfortable."
  },
  {
    "user": "Elizabeth",
    "rating": 5.0,
    "message": "Fits my wide foot Comfort all day"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Exercise and casual dress"
  },
  {
    "user": "S. Contreras",
    "rating": 5.0,
    "message": "This is my 2nd pair. The last were 4 years old. They need zero \" breaking in\" for me. I adore the fit, comfort, and they match everything. I cut the laces and slip them off and on. Nothing but Love for these."
  }
]