[
  {
    "user": "Pat in Seattle",
    "rating": 4.0,
    "message": "I bought this on impulse because I thought I could pull them on like socks. I wanted something that would slip on with little fuss. However, the top is firmer than that, and I need to pull & stick fingers in behind my heels and it's almost as hard as the canvas shoes I have with elastic over the top.  For them, I need a shoe horn.  They are also not socks all the way through.  The bottom is a regular bottom with a thin layer of something resembling the exterior glued on top of a liner that can slip out.  It was also a little bumpy and made the bottom of my feet sweaty.  I may have to wear thin socks with these.  On the other hand I like their looks & they are comfortable enough, and a tad easier to pull on than the canvas slipons which have an elastic top. I'm keeping them for those reasons."
  },
  {
    "user": "Jenny O'Haire",
    "rating": 5.0,
    "message": "I was a little cautious about purchasing these shoes because I didn't recognize the name brand, but I needed some shoes that I could step into easily and comfortable enough to walk and/or run my dogs while wearing them. When these shoes arrived and I tried them on, I couldn't believe how good they felt and how I could run in them without hurting my feet. They are super cute and versatile. In fact, I'm wearing them right now!"
  },
  {
    "user": "Kendra",
    "rating": 4.0,
    "message": "I got these and was unsure, they were very comfortable but very wide, foot slide around, but by adding new thicker insoles it took up the gap and they are great now. Love them."
  },
  {
    "user": "Lutricia Downey",
    "rating": 4.0,
    "message": "This shoe fits as expected and is a good shoe for the money. It looks exactly like the picture and feels comfortable. I would recommend this shoe."
  },
  {
    "user": "Kar",
    "rating": 4.0,
    "message": "I am a 7 71/2 ordered  a 71/2 they fit nice slightly wide but wearable. I put a lightweight footie on and they fit perfect"
  },
  {
    "user": "Sparky",
    "rating": 4.0,
    "message": "In comparing this show to another pair I purchased, this pair is a bit big. I have narrow feet and the shoe is a bit roomy in the heel. I plan on purchasing an insole to take up the slack. This should make the fit perfect."
  },
  {
    "user": "kelly smith",
    "rating": 4.0,
    "message": "These shoes fit well, true to size.  I ordered the light blue and it’s exactly the color I expected to receive.  My only complaint is the heel is a bit hard so after standing a while I start to have some heel pain."
  },
  {
    "user": "Helena M.",
    "rating": 5.0,
    "message": "I am a server and work 6-7 days a week. Have a wide feet and got them half size bigger. They feel great. Easy on too. After 6 months of wearing them to work, they are still holding shape and very comfortable. I had ankle pain for 18 months since I fell and I think these shoes helped with support. There was no need to break the shoes either. AND they do not slip either. I wouldn't call them 100 percent slip proof- stepping on cucumber on the floor in the kitchen, they will slip but  wet floor is not really a problem. I just came back to buy more."
  },
  {
    "user": "Connie J. Atwood",
    "rating": 5.0,
    "message": "I really like these shoes! they fit to size (8) comfortable. I stand on my feet for 8 hours (30 minute lunch) and my feet did not hurt at all when I took them off. I bought the purple shoe and got alot of compliments on them. Good price too. I will probably will buy another color."
  },
  {
    "user": "jessica jones",
    "rating": 5.0,
    "message": "I got these based on reviews for comfort when standing all day. At first they were snug and I was unsure how well it would help my heel pain. But after a couple weeks they seem to have molded to my feet better. I can honestly say my feet hurt less at the end of the day when I'm wearing these. Well worth it! Not winter shoes or when it's raining but otherwise great!"
  },
  {
    "user": "heckaroni",
    "rating": 4.0,
    "message": "I work in an airport. I’m on my feet for hours and it works wonders! Only giving it four stars because the soles of the shoes aren’t gelled so the soles of mg feet get smushed and hurt by the end of my shift. The shoes are amazingly comfortable otherwise. They’re lightweight, flexible, the fabric of the shoe is soft and stretchy. Great work shoe for the price! I would give this 4.95 stars if I could be more exact."
  },
  {
    "user": "ZATARXUS",
    "rating": 4.0,
    "message": "\"Pro's\"#1, then I'll do \"Con's\" #2. Ok: 1. - My wife absolutely loved these! The no-laces helps when she may be running late, and even when time is not an issue the no-laces is very convenient. The craftmanship is very good quality, and the comfort is deservedly renowed for all Nike \"Air\" foot wear. Bonus is my wife had never bothered with a pair and so had not a good idea of the VAST improvement in comfort she was about to experience, as well as deserve! To see her happy and then hear how her feet didn't hurt her that day she got home while wearing these for the first time- PRICELESS. And the fact she received MANY compliments all day long- told me immediately, on \"top\" of her initial joy and happiness when I surprised her with them and she took them out off the box, to the fact that when there's any compliment- \"much less\" MANY COMPLIMENTS DURING HER DAY!- That these shoes made her very happy as well as her beautiful little feetsers! For me; I'm happy I know my wife and ended up selecting the perfect style AND color shoe- that I definately give the \"all systems go\" to Nike for this model and color \"Air\" shoe. 2. - The size was a \"little\" issue however, as in the description of the shoe, it's Amazon's BIG MISTAKE. AND HERE'S WHY PLUS THE SIMPLE SOLUTION; So pictures of the shoe and a description is good, but simply stating sizes ACTUALLY MEANS ONLY HALF OF THE INFORMATION EVERYONE NEEDS TO READ IN ORDER TO CHOOSE THE CORRECT SIZE!!!! Saying, for example, sizes from say 5 to 9 in 5.5,6,6.5,7 etc is NOT ENOUGH TO BUY THE CORRECT SIZE!!! Those numbers are next to meaningless if there is not a standard to reference the sizes with!!! That's HUGE when buying ANY CLOTHING!!! Companies can give whatever the hell number size to a shoe but the fact is that series of shoes run \"big\" or run \"small\" and saying that is also not enough either! As any intelligent person knows. So it's a guessing game- which can be completely avoided by 1 or 2 easy pics of the shoe WITH A TAPE MEASURE OR RULER NEXT TO IT SO WE CAN SEE THE EXACT DIMENSIONS OF LENGTH AND WIDENESS TO COMPARE WITH WHATEVER NUMBER THEY ASSOCIATE THAT SHOE WITH!!!! IN MY CASE THEY ARE SLIGHTLY TOO BIG!!!!!- and thank God I bought another DIFFERENT pair and got the size EXACTLY CORRECT. There's, IMO, no excuse at all for companies to hire some \"hair-brained\" dufus to come up with the graphics to advertise on the site, and on this case it's SHOES, and not to include in the advertisement graphics the extremely important info in a way that the consumer can easily see and understand!; therefore making the purchasing experience GREAT and no anxiety over if the size is going to be slightly off or not! That's completely unnecessary and definately RUINS a lot of surprises that otherwise would be perfect- THE WAY THEY SHOULD BE AS THE CUSTOMER IS PAYING HARD EARNED MONEY FOR THE PRODUCT!!!!! Again; a picture with a ruler adjacent to the shoe length AND width is PARAMOUNT for any and every shoe!!! Its common sense people! 1- Great shoe. 2- Idiot-level intellect not showing the TRUE SIZE next to the shoes themselves."
  },
  {
    "user": "Nancy",
    "rating": 4.0,
    "message": "Very comfortable for walking"
  },
  {
    "user": "Athene Khan",
    "rating": 4.0,
    "message": "A pair of  women's walking shoes sock looks  well made, the style look good and Comfortable. But I had a tough time putting them on. I normally wear size 7 , the length is perfect but it is too narrow, I am going to return them."
  },
  {
    "user": "valerie price",
    "rating": 4.0,
    "message": "These shoes are definitely not true to size."
  },
  {
    "user": "LaDonna Rae",
    "rating": 4.0,
    "message": "Love these shoes!  I used them for line dancing and give great support.  The ties are a bit long though.  I just have to tuck them so there is no tripping on them."
  },
  {
    "user": "Marianne Vecchio",
    "rating": 5.0,
    "message": "I now have 5 pairs of these shoes. I had knee replacement surgery a year ago and bought my first pair to wear to work. After that, I bought them in 4 different colors and my colleagues now wear them too. Don't hesitate! They fit true to size, lightweight and arch support."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They slip on fairly easily and once my tootsies are in place I am off!  I live in an urban area and walk everywhere and I find these very comfy for long days.  I feel my feet are well supported and that I am not pounding on the pavements.  Go for it!"
  },
  {
    "user": "nicci donley",
    "rating": 5.0,
    "message": "So I bought these shoes bc I was having foot pain. They felt amazing on my feet. I do notice I roll my ankle sometimes bc of the way I stand in them but I don't think that's the shoes fault. They are very light weight. When I first got them they were tighter to get on but after 2 or 3 days they slide right on with little effort. Unfortunately my foot has gotten worse with a lump on the bottom but this is still my go to shoe for now. I will be getting another pair in grey soon."
  },
  {
    "user": "Jane Smith",
    "rating": 4.0,
    "message": "Because you are not supposed to wear the same shoes every day, I alternate these shoes with my expensive Hoka sneakers. I like the slimness of these shoes and the look of them."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "These are perhaps the most comfortable pair of shoes I have ever worn. And, they are just about the least expensive pair of shoes I've ever purchased. I get many compliments from them all the time. I've had them now for at least 2 years and they are still holding strong. Would recommend highly."
  },
  {
    "user": "Lisa Hawsey Alexander",
    "rating": 4.0,
    "message": "I wait tables and wear these as work shoes. They fit fine but I added gel inserts for better comfort."
  },
  {
    "user": "Vickie J.",
    "rating": 4.0,
    "message": "to loose on my foot"
  },
  {
    "user": "LadyS",
    "rating": 5.0,
    "message": "A pair of women's walking shoe sock looks well made, the style look good and comfortable.  They slip on easily. They’re lightweight and flexible, and the fabric of the shoe is soft and stretchy. Great walking shoes for the price!"
  },
  {
    "user": "Tori",
    "rating": 4.0,
    "message": "I wear and ordered 8 1/2. Runs a little loose but perfect with socks."
  },
  {
    "user": "JDubya",
    "rating": 4.0,
    "message": "I love that they are so lightweight. I love that they are super comfortable after they are on my feet. I don't love their lack of arch support, but there's room in them to fit my custom arch inserts into them & still maintain good comfort. I hate that they are sooo hard to get onto my feet due to the sock-like material. Those of us with high arches know that shoes with a long top lip like these are often tight over that top arch bone. These are not tight, but after I finally get the front part of my high arch foot in them, the heel material has flattened, making it necessary to dig under (already broke a fingernail) and grap the heal fabric to pull it back up.  There is a back-loop but it is just too small and flimsy to grab onto easily.  An old shoe horn I found in my closet has become essential for these.  Even with the help of the shoe horn, though, these are exasperating to try to put on over a high top arch.  Most of us are accustomed to quickly put on our shoes quickly with one hand while we're standing up; that won't be happening with these shoes. O These are like trying to put on a sock (which takes two hands) but worse because this particular sock has a big bulky heal attached to it. Ugh!  It's not fun having to sit down and struggle to put them on every time, so I hesitate to recommend these. They are definitely not slip-ons. Update: after having these for a year and wearing them for walking on the sidewalk 4x a week on average, I continue to love and hate them - for different reasons. First, I'm disappointed in the quality. After a year of almost daily wear, the left sole has cracked so if i step in water, I get a wet left foot. Except for the cracked sole, they still look and feel new. Second, I'm happy with the way they've stretched and become comfortable, though it took a month of daily wear. Considering how difficult it has been to find a comfortable walking shoe, I've concluded these have more pros than cons. I don't like having to use a shoe horn to out them on, but they do look nice and they've worked well for my daily walks this past year."
  },
  {
    "user": "susan Blank",
    "rating": 5.0,
    "message": "Very comfortable, great for standing all day… I feel they run a tad bit big… I think 1/2 size smaller would of been more perfect, but I still am happy with my purchase:)"
  },
  {
    "user": "Butterfly Lu",
    "rating": 5.0,
    "message": "I gave this product 5 stars, not for its stylish look, but for its super comfortable wearing. My feet are very picky on shoes; one foot has bunion pain when walking and they tend to sweat all the time and need air circulation between toes. In the past, I wore sandals or open toe shoes all year around until this cold winter year. I can not wear stylish boots or brand tennis shoes because of my sweat feet. So, as I researched and found this shoes. Even though the product description says, \"Lady Girls Modern Jazz Dance Easy Shoe\", I am not a Jazz dancer, but I like the shoe's height and arching look. So, I decided to give it try. After I received it I wore it and I realized I made a good choice. Again, my 5 stars are not for its stylish look. The followings are my 5 stars' reasons: 1. Super comfortable for walking; it is very light; I can easily speed walk with this shoes. 2. it has some arching support that my bunion toe does not give me pain feeling while working. 3. its fabric allows my feet to breath through, so my sweaty feet would not make the shoes wet any more. 4. it is easy to slip on and off; no worry about tie up shoes. 5. it has a medium level high heel shoe effect and higher shoe base that make you feel a little taller and you can walk on raining or muddy road in city street without getting your shoes wet."
  },
  {
    "user": "Sara Carter",
    "rating": 4.0,
    "message": "Offbrand but good, I like the ease of putting them on, I am recovering from a hip and femur trauma and even putting socks on is a challenge.  Walking felt comfortable, didn't catch or slip, the only negative was the arch i not high enough FOR ME, I have a very high arch so I am not surprised, otherwise, I had no fatigue from wearing them to my physical therapy and walking the small amount I do, I would recommend!"
  },
  {
    "user": "Michelle S",
    "rating": 5.0,
    "message": "Arrived 9/30, expected 10/8, very fast. They are a little bit big with lightweight socks but I'm glad because I plan to use them during cold fall weather and there is room to wear heavy socks. The insole is very firm. Would be better with some kind of memory foam but I will try them with inserts if it gets too uncomfortable."
  },
  {
    "user": "Trish Canida",
    "rating": 4.0,
    "message": "I love how these look. But I had a heck of a time putting them on the first time. I hope it gets easier. They have good cushion… lots of toe room. I wear a size 10 and ordered a 10. The left shoe fits great but my right foot kinda pinches in the heel area. Not sure if I’m going to keep these. Maybe I need a 10.5."
  },
  {
    "user": "GS",
    "rating": 5.0,
    "message": "I hurt my foot and needed cushioning sole . I get so many compliments . Lol I laugh because I love heels . People love them ."
  },
  {
    "user": "paula peters",
    "rating": 4.0,
    "message": "feet hurt after brisk walking for more than 30 minutes"
  },
  {
    "user": "Luann Antonelli",
    "rating": 5.0,
    "message": "Love these dance sneakers , great for cardio dancing & Zumba Fit my size perfectly Thank you"
  },
  {
    "user": "Mary Jaskel",
    "rating": 5.0,
    "message": "I have wide feet and needed a shoe with support. I love these shoes. Going to check into more colors!"
  },
  {
    "user": "TC",
    "rating": 5.0,
    "message": "These shoes looked like they would have been very comfortable if they actually fit. We ordered a size up from normal but it was so narrow, it couldn't be worn. Return was no hassle."
  },
  {
    "user": "J.A.",
    "rating": 4.0,
    "message": "Fits well in the front but too loose in the heal. Hope with thick winter socks they will stay securely on my feet. I like the look of these."
  },
  {
    "user": "navylady",
    "rating": 5.0,
    "message": "I have had these shoes for a few  months now and I just love them. They fit great and they are super comfortable."
  },
  {
    "user": "Annette Wiiliams",
    "rating": 5.0,
    "message": "On my feet for 12-13hrs at work.  I ordered this shoe 1/2 size bigger, perfect fit. Lightweight and comfortable..  No more expensive clogs. Got a lot of compliments too."
  },
  {
    "user": "Elaine",
    "rating": 4.0,
    "message": "Can be worn as casual or dress"
  },
  {
    "user": "Theresa Linton",
    "rating": 5.0,
    "message": "My feet always hurt! The were just a bit difficult putting on, but it was worth it!! Feels like I’m wearing socks!!"
  },
  {
    "user": "Justyne",
    "rating": 4.0,
    "message": "I purchased these to where to work, because I have plantar fasciitis and cannot wear flat, unsupportive shoes. These are not orthopedic by any means, but they do the job and are very comfortable and breathable. I wear a size 10 medium, and ordered a size 10, and they fit perfectly with just enough stretch if I want to wear a thicker pair of socks. The top material of these is not particularly supportive because it is sock-like, so don't expect to wear them hiking. Otherwise a great shoe for everyday, regular use."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes do have a slight lift to them.  It is nit like wearing a flat shoe . But that is what I love about them . If you are out or have an occasion or just for every day wear they are very comfortable. Just realize they are not flat shoes ."
  },
  {
    "user": "Chef Beth",
    "rating": 4.0,
    "message": "Very hard to get onto my feet...but once they were on they were very comfortable.  I ordered a shoehorn to help get them on...hopefully that will make it easier."
  },
  {
    "user": "C Rearigh",
    "rating": 5.0,
    "message": "A bit snug at first, but a great show overall."
  },
  {
    "user": "Amanda",
    "rating": 4.0,
    "message": "The shoes are nice, and light weight. However, the sizing is strange, of course. I normally wear a 9.5 or 10 depending on the shoe. Since these are more narrow, I went with a 10. I probably should have gone with the 9.5 though. The back of the shoe has a higher sole, so when I walk, it feels like I'm sliding forward in them. But, they fit around the ankles perfect. And over all, I'm happy with them.... Just not great for distance walking."
  },
  {
    "user": "Mrs. Darla Lawson",
    "rating": 4.0,
    "message": "I like these sneakers, they're comfortable until you break them in, in which it doesn't take long to do. I will say they're nice to wear with outfits but don't use them for walking."
  },
  {
    "user": "John Fernandez",
    "rating": 5.0,
    "message": "Very comfortable…. Perfect fit Thanks, John"
  },
  {
    "user": "Jaime Atherton",
    "rating": 5.0,
    "message": "I purchased these for my 98 year old grandmother who is paralyzed on her right side. The shoe stays in place as she navigates her wheelchair with her one  \"good\" foot. The shoe is comfortable, durable and keeps it's shape. She would take them in more colors!"
  },
  {
    "user": "Janie M. Jackson",
    "rating": 5.0,
    "message": "The comfort is easy to slip on and looks good."
  },
  {
    "user": "Hlouis",
    "rating": 5.0,
    "message": "I’m in the healthcare field and on my feet all day. These are very comfortable, lightweight and good value."
  },
  {
    "user": "Michele Vuono",
    "rating": 5.0,
    "message": "Super comfortable great price, only problem is wish it had more ankle support otherwise no complaints"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I wear size 10.5. I ordered sizes 10.5 and 11. The opening of the shoe is extremely narrow- I couldn’t get my foot into the 10.5. I managed to squeeze my feet into the size 11 with much difficulty The fit is good, they’re very light weight and comfy . Hopefully I can stretch the opening to make them easier to put on."
  },
  {
    "user": "Barbara",
    "rating": 5.0,
    "message": "These are way better than I expected. My feet have been killing me and finally I have some relief. I'll be buying another pair"
  },
  {
    "user": "g3 from the UP",
    "rating": 4.0,
    "message": "At first, I didn't think these shoes would work at all because my wide feet protude in the shoe where the joints of my big toes are.  But, despite that, after wearing the shoes for a number of hours, they are nonetheless quite comfortable.  The shoes are definitely light and quite attractive.  I am pleased."
  },
  {
    "user": "Sonia Perez",
    "rating": 5.0,
    "message": "I love the look and the feeling 😍 💕 perfect fit"
  },
  {
    "user": "H",
    "rating": 4.0,
    "message": "The shoes run small"
  },
  {
    "user": "Mary",
    "rating": 4.0,
    "message": "Finally, after trying different brands of the same style shoe, I'm satisfied. This shoe is very comfortable."
  },
  {
    "user": "Jane V",
    "rating": 5.0,
    "message": "So comfortable and true to size, and they look great!"
  },
  {
    "user": "Lindsay",
    "rating": 5.0,
    "message": "Mother loved these and ordered again!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are super comfy, after breaking in. People say they run big, so I’m a regular 9, which I ordered, yes they stretch and the heel is oddly loose, but for me it’s not enough to have gone a size down. They are bouncy and comfy, but just don’t plan on walking jogging etc.. Bc they don’t support, like you could turn your ankle.  I do wish they had more support and since they are for fashion, I would say to the makers,, they are kool, make some silver, gold, hologram, like UK trainers ! ... tighten them up, then send me a 9 to review.. 🤣I’m serious !all in all I love them, just don’t use them to exercise but very unique feeling to wear, really like what you want to walk on. I’m thinking another pair is in my future 👍💙 I actually would love to see a “ pretty silver shimmer style” and would love to write a review. After wearing these a while I can update* that they do stretch, but it’s the material on top, not the length. If I could suggest again to tighten and glitz them up a bit they could really be a trend setting item, I would even do a video on matching them with both casual jeans and dressy night out!! Thank you fir passing this along to seller I A’m writing this review on the second pair I’ve ordered... I got the purple in a 9, they are much bigger than my Navy 9 that I got first. The shoe is so loose ( the top material is the problem, not the sole). They are comfy if you just stand, but the first day I wore these I fell and twisted my ankle. My complaint is I’m trying to work with the company, informing them that they have a good thing, just is inconsistent. As for Amazon, they say they are not responsible, but also will not pass complaint to seller. A dozen e-mails on tracking the package, but zero reply on why one size 9 fits and one says 39.5 and does not.i think they sent me the wrong size and this is my second pair. I feel they should replace them."
  },
  {
    "user": "Cast512",
    "rating": 4.0,
    "message": "I can’t say they don’t fit, just a little roomy inside. I like them though. A good solid sole as well"
  },
  {
    "user": "Dana P MI USA",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Amy D Lewis-Abner",
    "rating": 4.0,
    "message": "These shoes are truly comfortable but my ankles swell and sometimes they can get a bit tight especially if I wear socks with them, so if you have big ankles to start with I wouldn't suggest them even tho they do stretch"
  },
  {
    "user": "Kathryne L Sivils",
    "rating": 4.0,
    "message": "The only problem with this shoe is I can't get it to slip on!! I need a tab or something on the back end of the shoe so I can hold on to it to slip on!!"
  },
  {
    "user": "Mary Rodriguez",
    "rating": 4.0,
    "message": "Todos los artículos son perfectos muchos han sido para regalo y otros para mi pero si m gusta cm se maneja todo gran trabajo El q ustedes hacen Mary"
  },
  {
    "user": "Sharon Frisch",
    "rating": 5.0,
    "message": "These slip-on shoes are really very comfortable. The first day I wore them I did a lot of walking and they felt great. They have a nice heel cushion, they’re roomy, and very lightweight. And the price was right! I recommend these cute casual shoes."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Comfortable, can walk in them all day."
  },
  {
    "user": "James Johnson",
    "rating": 5.0,
    "message": "Great shoe for the price bought some of those through the insurance company and they were $150 and up"
  },
  {
    "user": "Dianna Reece",
    "rating": 5.0,
    "message": "I purchased this shoes in pink. I wear an 8.5 yet this shoe is to large. This is the only time I’ve had purchased shoes through Amazon and have gotten the size wrong. However this will not deter me from purchasing others."
  },
  {
    "user": "candice",
    "rating": 5.0,
    "message": "As a CNA I have been looking for comfort and ease on my feet! And these sneakers do just that! Will purchase again in furture!"
  },
  {
    "user": "Virginia Stevens",
    "rating": 5.0,
    "message": "I was surprised that no breaking period was needed! Walked in them all day long and didn't know I had new shoes on. Support for me was great! Recommend to everyone."
  },
  {
    "user": "HELEN A MADDEN",
    "rating": 4.0,
    "message": "Comfortable"
  },
  {
    "user": "Linda Pifer",
    "rating": 5.0,
    "message": "I wore these shoes every day walking ngoing every any place at all. They light weight n very comfortable. Like them very much"
  },
  {
    "user": "Tina Hoopes",
    "rating": 5.0,
    "message": "Nice comfortable shoe and I like the looks of it"
  },
  {
    "user": "JAHLON JACKSON",
    "rating": 5.0,
    "message": "I like that these shoes make your feet look smaller than they are."
  },
  {
    "user": "Harriet M. Robbins",
    "rating": 4.0,
    "message": "Cute shoe but rubs on toe"
  },
  {
    "user": "V Walker",
    "rating": 5.0,
    "message": "Would buy them again."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The selection and available colors will surprise you. Larger sizes are priced higher"
  },
  {
    "user": "Mallard Duck Girl",
    "rating": 5.0,
    "message": "These shoes were very comfortable to do my 2-3 mile walk in. Easy to slip on and go. Just what I was hoping for."
  },
  {
    "user": "Nyy",
    "rating": 5.0,
    "message": "I gifted these sneakers to my great grandma and she loves them"
  },
  {
    "user": "MMW",
    "rating": 4.0,
    "message": "My foot is hard to size - 5W.  They are small but thick.  At first they were tight across the top of my foot but soon stretched out to fit perfectly. Bought them for walking but love them so much I have been using them for work.  Only drawback is the inside sole comes out when pulling them off.  Will definitely buy again."
  },
  {
    "user": "Deb",
    "rating": 3.0,
    "message": "I bought these shoes and they arrived n the specified time frame. They are really cute and seem to be in style. They were sooo big I had to return them and I was hesitant about ordering a smaller size."
  },
  {
    "user": "Kitty",
    "rating": 4.0,
    "message": "looking for a step in but these are great slip ons  love them"
  },
  {
    "user": "Sheniceprince",
    "rating": 5.0,
    "message": "The shoe is comfortable the width is too small i would buy another pair but the with i use it too go to work."
  },
  {
    "user": "fuzyviking",
    "rating": 4.0,
    "message": "More heel than I expected or wanted and arch support is not quite right for a walking shoe."
  },
  {
    "user": "Sarah L. Blum",
    "rating": 4.0,
    "message": "I love how they look and feel but they slip off my feet when I walk in them."
  },
  {
    "user": "Gerri Calandro",
    "rating": 4.0,
    "message": "I always wear a size 7, and these run so big! I definitely suggest sizing at least 1/2 size down."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I got these and when they came in I immediately wanted to return them because I realized I ordered the wrong sneakers (I wanted some with laces).  I tried them on and thought oh ok...these are comfortable so I'll keep them.  I ended up wearing them out to a concert the next night with a cute dress and it was then that i fell in love.  The comfort and support they gave while standing at the concert the whole time was amazing.  Felt like i was on clouds. a few days later I took them with me to a conference and would switch into them after wearing heels all day.  I am so not a sneaker person but these......these are everything i didn't know I needed."
  },
  {
    "user": "Sky",
    "rating": 3.0,
    "message": "Visually, the shoes are nice. They fit as expected, and are comfortable. I gave three stars because of my disappointment on the bottom of the shoes. These are DEFINITELY NOT non-slip. If anything they are some of the most slippery feeling shoe bottoms I've ever felt. I would not trust to wear these shoes on wet ground, in the snow, smooth concrete, or waxed floors. Even on rough concrete I would feel nervous to wear these. It's a shame, because these shoes would have been perfect if the bottoms were durable rubber like most sneakers. I'll still keep them, just better bring an arm to hold onto just in case lol"
  },
  {
    "user": "Angel Lord",
    "rating": 4.0,
    "message": "I use them for work. I'm standing in one spot for 6 hours/day."
  },
  {
    "user": "Noreen McDermot",
    "rating": 4.0,
    "message": "Good shoes just not wide enough for my feet. Felt comfortable everywhere else just toes were not wide enough."
  },
  {
    "user": "Paulette Robinson",
    "rating": 5.0,
    "message": "I have neuropathy, plantar fasciitis, and I work 12 hour shifts!!! These work as well as other shoes that cost 3x as much!!! I have navy and black and will be ordering more as needed."
  },
  {
    "user": "Jllane",
    "rating": 5.0,
    "message": "Nice shoe"
  },
  {
    "user": "Adjo",
    "rating": 5.0,
    "message": "Exactly what I needed for my 5 miles walk per day and my hour on the treadmill. Very light and  comfortable. I will certainly recommend this pair of shoes."
  },
  {
    "user": "J. Twilley",
    "rating": 4.0,
    "message": "Not amazing for high arches, but honestly, they're super comfortable. I walk several miles per day at work, and it wasn't bad. Heels felt very bouncy. Fabric is stretchy and thick, and they feel very well out together. I'm not using them to replace a workout shoe, but for errands, small walks under 5 miles, etc. they're pretty good!"
  },
  {
    "user": "naomi k raybon",
    "rating": 5.0,
    "message": "They in a wide fit"
  },
  {
    "user": "Adilia",
    "rating": 4.0,
    "message": "Son cómodos"
  },
  {
    "user": "John Chaida",
    "rating": 5.0,
    "message": "Super cómodos para caminar, puedes pasar todo el día con ellos puestos"
  },
  {
    "user": "Sg",
    "rating": 5.0,
    "message": "Comfortable shoe. Size fit perfectly. I could walk all day in these shoes with no discomfort. Great price too"
  }
]