[
  {
    "user": "Vince Y",
    "rating": 4.0,
    "message": "Overall it is a nice pair of shoe at a reasonable price. The sole makes walking quite comfortable. A little rigid on the side, but probably will wear off once break in. Shoe laces are a little too long though."
  },
  {
    "user": "Richard Simon",
    "rating": 4.0,
    "message": "liked the price.liked the way they fit and liked the style,did not like the color it it was navy but it is so close to being black.real dark blue."
  },
  {
    "user": "Yeremy F.",
    "rating": 4.0,
    "message": "Hermosos y me quedan justo a la medida"
  },
  {
    "user": "Yasmin Wong",
    "rating": 5.0,
    "message": "Perfecto para mi hijo cómodo suave y el color que me pidió un producto muy bueno"
  },
  {
    "user": "Harold R. Castillo G",
    "rating": 4.0,
    "message": "Bien bonito los detalles y los acabados, persigan el precio y tendran una increible compra."
  },
  {
    "user": "Diego Morales cevallos",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Nailah Grant",
    "rating": 5.0,
    "message": "I loved it and it was a gift for my father"
  },
  {
    "user": "Claudia",
    "rating": 4.0,
    "message": "Muy grande y ancho"
  },
  {
    "user": "Marlon G.",
    "rating": 5.0,
    "message": "It everything I wanted. Superb!"
  },
  {
    "user": "Greg Edelman",
    "rating": 5.0,
    "message": "These shoes are great, run a little big. Really comfy and look good"
  },
  {
    "user": "Josua cedeño",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Buen tenis, calidad cómodo."
  },
  {
    "user": "Carlos A.",
    "rating": 5.0,
    "message": "Producto con la mejor calidad, super puntual"
  },
  {
    "user": "Reza Mahdavi",
    "rating": 5.0,
    "message": "Stylish shoes at a great price. Surprisingly, they are comfortable. I only use them a couple days a week for few hours, so far I am happy with my purchase. But it is only been a month."
  },
  {
    "user": "Omar",
    "rating": 5.0,
    "message": "Geniales"
  },
  {
    "user": "Dennis W Lueker",
    "rating": 4.0,
    "message": "Ordered a 8 1/2, they feel like a 9, lack of arch support is a negative and added with the feeling they are a half size to large and my age I feel off balance when I'm wearing them but I like the style, too lazy to return them and get a half size smaller LOL"
  },
  {
    "user": "Luis Escobar",
    "rating": 4.0,
    "message": "Son cómodos y se ven bien"
  },
  {
    "user": "Reginald Cox",
    "rating": 4.0,
    "message": "Great shoes just the sizes run a little big."
  },
  {
    "user": "Virginia Ocasio",
    "rating": 3.0,
    "message": "It simply was too large. I had it returned & refunded I ordered another. Picking up my order today😊"
  },
  {
    "user": "Patrick Douglas",
    "rating": 4.0,
    "message": "Runs large go down one size or a half size"
  },
  {
    "user": "Asher Giotis",
    "rating": 3.0,
    "message": "Did 14-17k steps a day all last week in Orlando going to theme parks and what not. These shoes weren't the worst, but also not the best. I was glad to remove them at the end of the day and could have for sure used a bit more arch support and cushion."
  },
  {
    "user": "Yisleny Monserrate Chavez Suarez",
    "rating": 5.0,
    "message": "The media could not be loaded. Tal cual la foto, talla correcta super buena calidad"
  },
  {
    "user": "Hussein Afify",
    "rating": 4.0,
    "message": "Good product"
  },
  {
    "user": "FredEx the Fave",
    "rating": 5.0,
    "message": "they fit perfect and are comfortable."
  },
  {
    "user": "Wander Javier García",
    "rating": 3.0,
    "message": "Cuando camino suena algo raro dentro, como que si tiene algo dentro"
  },
  {
    "user": "Israel",
    "rating": 5.0,
    "message": "El secreto es conocer tu talla, luego de eso todo se vuelve más fácil, el producto es igual al publicado."
  },
  {
    "user": "D.S.",
    "rating": 4.0,
    "message": "Bien"
  },
  {
    "user": "Mal",
    "rating": 5.0,
    "message": "My husband loves them. Comfortable and stylish!"
  },
  {
    "user": "Dustin",
    "rating": 5.0,
    "message": "These fit well and I like the look.  Easy to clean and great price. I wear them to the office and they're comfortable all day long."
  },
  {
    "user": "Steven",
    "rating": 5.0,
    "message": "Took a shot and ordered shoes on line for the first time and I’m very happy with them"
  },
  {
    "user": "Thierry",
    "rating": 2.0,
    "message": "Nothing positive to say, ive ordered many brand shoes online such as Nike, Puma, Fila etc... I never was disappointed till now on quality and size of a shoe. As usual before ordering i look up the brands official size chart (toe to heel measurement) oh boy not only they do not know their own sizes but they surely don't know how to measure ! ordered a 11.5 or 45 euro size which translated according to their chart to my toe-to-heel i received an 11.5 or 45 but measured up it sized equal to a 13 or 47 euro size according most other brands... Also there is zero comfort or quality in this shoe, there is no padding on the sides and bottom, the inner sole is just flat and thin, painfully to walk with even if its the proper size. the shoes feel cheap."
  },
  {
    "user": "paul S.",
    "rating": 5.0,
    "message": "Después de ponerle como 2 plantillas me quedo para la próxima compraré 1 talla menos. Y digo la próxima por qué a parte de lo grande son perfectos los zapatos caen con todo!! Muy cómodos y al año recién empezó a salir el color."
  },
  {
    "user": "Alex david",
    "rating": 5.0,
    "message": "Me gusto la calidad fue justo lo que deseaba lo uso a diario"
  },
  {
    "user": "Floyd Barkley",
    "rating": 5.0,
    "message": "Nice fit… dress up or dress down."
  },
  {
    "user": "Kelly Walker",
    "rating": 5.0,
    "message": "Están enormes y fue un regalo. Pir edo los quieto cambiar pir más chicos."
  },
  {
    "user": "Richard libby",
    "rating": 5.0,
    "message": "Ordered one day and the next day they arrived . Very nice with a a clean comfortable look.  Very happy"
  },
  {
    "user": "Irudie",
    "rating": 4.0,
    "message": "Next time I will go with my instincts."
  },
  {
    "user": "musab",
    "rating": 4.0,
    "message": "11.5. But look like 12.5"
  },
  {
    "user": "Roseanne",
    "rating": 4.0,
    "message": "Came side 8 but like and 9"
  },
  {
    "user": "Steve",
    "rating": 5.0,
    "message": "These are strictly for looks. They don't really provide much support. I also recommend the Crep cleaning kit to keep these, and all your shoes, looking good."
  },
  {
    "user": "Osama",
    "rating": 3.0,
    "message": "It feels lo loose and offers no support"
  },
  {
    "user": "Mario Zalamea",
    "rating": 3.0,
    "message": "Muy largo"
  },
  {
    "user": "Daniel S.",
    "rating": 2.0,
    "message": "Los zapatos son un poco grandes para la talla US que normalmente uso, pedí en talla US 8.5 y me quedan algo grandes debería haber pedido unos US 7.5 que estarían perfectos para mi. Algo que no me gusta es que los zapatos están hechos en China, desconozco si la marca TH tiene sus fábricas allá o si estos zapatos no son originales y son una réplica."
  },
  {
    "user": "Pdot",
    "rating": 5.0,
    "message": "Very comfortable. But layer seems to be needed inside"
  },
  {
    "user": "Ivan Valad",
    "rating": 4.0,
    "message": "I can't emphasize enough that the shoe itself is great. It looks fantastic, feels nice, and I get compliments. However, the soles are crazily smooth! Even while driving my car my foot has slipped off the gas pedal. Walking on smooth surfaces feels weird because there's no grip and my back foot sometimes slides a little as I push off my foot. Great shoe, would be a 5/5 if not for the slipping"
  },
  {
    "user": "Pepea",
    "rating": 5.0,
    "message": "En un regalo para mi esposo es 42 y en esa talla 8.5 El material excelente de muuuuy buena calidad y es idéntico a la foto hasta mucho mejor."
  },
  {
    "user": "Manuel E. Ramirez",
    "rating": 5.0,
    "message": "Muy bonitos, tallan bien. La talla es tal cual."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Is stylish, it fitted perfectly but they’re a little bit slippery"
  },
  {
    "user": "Martin",
    "rating": 4.0,
    "message": "Typical low support canvas shoe. A bit more substantial than Converse All Stars and a bit more appropriate for casual dress.  Less hip/classis.  Still, a good fit and a good look. The tread material is hard. It should be durable, but it slips on some laminate floors.  It is good on concrete and carpet."
  },
  {
    "user": "Juan Murillo",
    "rating": 5.0,
    "message": "I've been wearing these shoes daily for a little over a week now. Haven't had any quality issues, they're super lightweight and comfortable!"
  },
  {
    "user": "Denis Rozmus",
    "rating": 5.0,
    "message": "Very nice purchase"
  },
  {
    "user": "Andrea Adum",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Amanda Orbea",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Stephen Gordon",
    "rating": 4.0,
    "message": "This is a nice low profile shoe. It is a well made, light weight, reasonably comfortable, nice looking shoe. However, it is a little lacking in support.  I use an insole, and it works fine."
  },
  {
    "user": "jeffedge",
    "rating": 4.0,
    "message": "They're what you'd want out of a shoe. Very well put together. However the bottom offers almost no grip. On a sidewalk or carpet or something you're fine. However if you're on epoxy or any sort of smooth surface, your feet will kick out behind you has you put pressure to move forward. There is little to no grip on the bottom at all."
  },
  {
    "user": "Scott W",
    "rating": 5.0,
    "message": "Incredible deal. I take an 11. First time with this brand. Fit was perfect. Comfortable and stylish. Highly recommend. Got an amazing deal as well."
  },
  {
    "user": "Franklin Castillo",
    "rating": 4.0,
    "message": "Just 1/2 inch larger at least. Other than that great shoes, a lot of style, super comfortable."
  },
  {
    "user": "Biggs2749",
    "rating": 5.0,
    "message": "Very nice"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "It's super comfortable. The shoe matches the description and looks the exact way it is portrayed on the website."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Billy Tobey",
    "rating": 5.0,
    "message": "Very nice retro style sneaker but more comfortable than the old style."
  },
  {
    "user": "Chaitanya A",
    "rating": 5.0,
    "message": "Quality of shoes are excellent. Comfortable to wear long time !!"
  },
  {
    "user": "Sarah Elkholy",
    "rating": 5.0,
    "message": "Fast delivery good price"
  },
  {
    "user": "Marjorie",
    "rating": 5.0,
    "message": "Excelente tal cual la descripción volveré a pedir"
  },
  {
    "user": "C. R.",
    "rating": 4.0,
    "message": "Comfortable and stylish shoe. However, not a fan of the material on the bottom of shoes (cork material) as I have had experience with this before and they wear easily and let water into the shoe over time."
  },
  {
    "user": "Gecue",
    "rating": 4.0,
    "message": "Very nice, not really comfortable, you feel all the rocks you step on, but the style of the sneaker are cool. I will recommend only if you use them for styling for a cookout or gathering do not try to run in these or where them to walk for a long time. You will regret it."
  },
  {
    "user": "Benson saint fleur🇭🇹",
    "rating": 4.0,
    "message": "My foot size is 8.5, But it didn’t have it. And i choose a 8. That is amazing i had it for 12 hours on my feet it never hurt me and its fit. I love it but if someone need to buy it i an encourage you buy a leather one. 🇭🇹🇭🇹🇭🇹🇭🇹🇭🇹🇭🇹🇭🇹"
  },
  {
    "user": "Patrick reid",
    "rating": 5.0,
    "message": "I like this product and I appreciate the information and review by others it is so comfortable."
  },
  {
    "user": "quacy",
    "rating": 3.0,
    "message": "This looks good but only fits half size larger. So if you where 9 you should buy 8 1/2 instead"
  },
  {
    "user": "Silvia A.",
    "rating": 5.0,
    "message": "Excelente compra"
  },
  {
    "user": "Madison Grey",
    "rating": 5.0,
    "message": "He's usually a 10 but needed to repurchase a 9.5."
  },
  {
    "user": "Richard Guy",
    "rating": 5.0,
    "message": "Sturdy and very good look with a skinny jeans and a T-shirt from someplace like Tommy Hilfiger or Aeropostale or even American Eagle. Basically and outfits."
  },
  {
    "user": "GoAwayImReading",
    "rating": 5.0,
    "message": "My husband is very happy with these shoes and has gotten many compliments on them."
  },
  {
    "user": "Isaiah WallowinBull",
    "rating": 5.0,
    "message": "This item is goid for just casual wear I like how they look with skinny jeans"
  },
  {
    "user": "Josue Obed",
    "rating": 5.0,
    "message": "Muy conforme con la compra, recomendado al 100"
  },
  {
    "user": "INDIE",
    "rating": 5.0,
    "message": "I bought these for my son's 1st day of the new college semester, He said they are comfortable to walk in, totally loves them"
  },
  {
    "user": "Robert Lopez",
    "rating": 2.0,
    "message": "Sadly I love these shoes. They are nice, good fit, conformable. The only draw back is that after about 2 weeks the nice blue color started fading naturally without washing. They are new but now just look old and weathered."
  },
  {
    "user": "Michael1569",
    "rating": 2.0,
    "message": "I’m a size 13 for almost every brand and when these came in I was excited because they look so nice….but they are almost 3 full inches too large and I’m swimming in them..not accurate sizing at all. Returning these immediately."
  },
  {
    "user": "TheWiseTurtle",
    "rating": 4.0,
    "message": "I love the style on these shoes, but there is almost no traction; they might need to wear in a bit to get some grip, but be careful in the meantime or you might end up sliding."
  },
  {
    "user": "Carlos",
    "rating": 5.0,
    "message": "Exactamente como descrito"
  },
  {
    "user": "Luberkin",
    "rating": 3.0,
    "message": "Mes quedó grande"
  },
  {
    "user": "Al Days",
    "rating": 4.0,
    "message": "Very nice looking shoe. Was pleasantly surprised. Thought they looked better in person. Not the most comfortable shoe to wear though. I wouldn't recommend wearing them if you plan on being on your feet all day. But that is manageable."
  },
  {
    "user": "Candace Gosney",
    "rating": 5.0,
    "message": "Great shoes, good price. My 16 year old loves them."
  },
  {
    "user": "Junior",
    "rating": 3.0,
    "message": "Noticed a stain on them. They do fit a little big too."
  },
  {
    "user": "L. Chanel",
    "rating": 5.0,
    "message": "The most comfortable shoe on this planet. I'm ordering all colors."
  },
  {
    "user": "ali",
    "rating": 3.0,
    "message": "🤥"
  },
  {
    "user": "Israel Lauzo",
    "rating": 5.0,
    "message": "No me agradó que me quedaron grande los zapatos pero llegaron bien a Ecuador guayas"
  },
  {
    "user": "Matthew Needham",
    "rating": 3.0,
    "message": "They're stylish and reasonably priced, but the fabric lining on the inside of the shoe ripped, along with part of the soul on the side of each shoe. I've only had them since late August. Overall, not very durable. I think they would be okay for semi-casual occasions, but not for everyday wear."
  },
  {
    "user": "Russell Norsworthy",
    "rating": 3.0,
    "message": "Too dark of a blue I wanted much lighter but the shoes are nice"
  },
  {
    "user": "chris futrell",
    "rating": 5.0,
    "message": "Love my shoe I purchased"
  },
  {
    "user": "Gilberto Luciano",
    "rating": 5.0,
    "message": "Excellent product."
  },
  {
    "user": "overki",
    "rating": 5.0,
    "message": "Love it happy with this buy will buy agin from seller for what I paid for it was just like the pictures"
  },
  {
    "user": "Mario A.",
    "rating": 3.0,
    "message": "El tamaño no se ajusta a las tallas de tommy. Siempre soy 8.5 y el tamaño era como 2 tallas inferior. La calidad es buena."
  },
  {
    "user": "Isaac Rangel Mejía",
    "rating": 5.0,
    "message": "Quedaron perfectos"
  },
  {
    "user": "mhonken",
    "rating": 5.0,
    "message": "Comfortable. And fair priced. Very happy with purchase."
  },
  {
    "user": "Nicole Shirley",
    "rating": 4.0,
    "message": "Great shoe and value just runs big"
  },
  {
    "user": "Barry",
    "rating": 5.0,
    "message": "Nice shoes high quality at a great price."
  },
  {
    "user": "Dalida Polanco",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Gustavo Vasquez",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "DJS",
    "rating": 5.0,
    "message": "These sneakers are perfect for casual wear.  They are great for running errands, going out for a bite to eat, or you can dress them up for a garden party or down for a ball game.  They are not meant for, or good at working out, playing ball, or any kind of physical activity.  I have used these for going to the amusement park with my children and after a full day of chasing, riding and walking my feet survived, but would have been happier in my Nike runners.  They look great with jeans, khakis, or shorts and with just a little care last two years before cracking and falling apart.  I am using this same review for another pair as they are equal with the exception of color and minor cosmetics.  I have been wearing different iterations of these for going on 4 years and the quality and fit has been consistent."
  }
]