[
  {
    "user": "meg miller",
    "rating": 5.0,
    "message": "You can depend on keds for comfort , support and quality , also fit and good arch support too and with non slip soles what more can you ask. I have been buying them for years because i know i can depend on the quality at a decent price. yes they also pop right into the washing machine and air dry in the sun. I always buy the Leather ones , we get a lot of rain here in NH . LOVE my Keds , 8.50 wide , thank you."
  },
  {
    "user": "JP",
    "rating": 5.0,
    "message": "I love how keds fit my narrow foot!!!"
  },
  {
    "user": "G. Harvey",
    "rating": 5.0,
    "message": "These shoes have a nice and cushiony insole.  They did require some breaking in at first because they were rubbing the top of my feet a little too roughly. However, after wearing them with socks a couple of times, they no longer rub my feet so they fit great."
  },
  {
    "user": "Angela",
    "rating": 4.0,
    "message": "I bought these in a size 10 and I normally wear a 9 1/2 or 10. They are really cute; I like that they are a sort of leather-type material and not canvas, and the actual support of the shoe is comfortable, but they are tight for the size! Especially at the top of the foot. I don’t usually have this issue with Keds, but these seem to fit a bit different. I would say to size up maybe a half size if you are getting the white leather shoes. I hope this helps!"
  },
  {
    "user": "Jessica Bollinger",
    "rating": 5.0,
    "message": "These go with so many of my outfits! So comfortable too!"
  },
  {
    "user": "Terrye Bowling",
    "rating": 5.0,
    "message": "I like everything about them.  They are for every day wear."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great value made well!"
  },
  {
    "user": "A. Gross",
    "rating": 4.0,
    "message": "I ordered these to replace an old, similar pair from another maker. I wanted a leather slip on that would stay on, with a thicker platform sole and some arch support.  These are all that.  I also wanted a comfortable toe box and a fit that I wouldn't have to supplement with insoles and pads.  These are also, all that.  But...Do think carefully about the size you order!  I'm a pretty solid regular sz 10 but my toe area is a little wide.  After reading a bunch of reviews (and remembering another pair of Keds I own that are pretty narrow) I decided to order the 10 wide.  Perfection!!  I've never ordered a wide shoe in my life, but I may now! You might be wondering then why 4 not 5 stars?  Well, I have yet to wear them for more than 10 minutes so I can't yet comment on comfort or durability.  If I think of it, once I have, I'll update this later..."
  },
  {
    "user": "Sue B",
    "rating": 5.0,
    "message": "These are everything I expected. Comfortable and will be great fall footwear"
  },
  {
    "user": "trona frANZEN",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Pegleg",
    "rating": 5.0,
    "message": "Nice shoe!"
  },
  {
    "user": "Kristine L Brodie",
    "rating": 5.0,
    "message": "I always wear an 8.5, and these are a perfect 8.5.  Love the leather and the durability. I always wear a short little sock w/ these, and highly recommend. Plz don’t hesitate to purchase these shoes if you just need a slip on cute as hell awesome  leather shoe. Thank U Keds!"
  },
  {
    "user": "Jon Burton",
    "rating": 3.0,
    "message": "I wear a size 7 shoe and I was not able to even get my foot into this shoe.  :("
  },
  {
    "user": "Michelle L.",
    "rating": 5.0,
    "message": "The shoe sole is really comfy. Considering the price it is a good deal for a black leather sneaker. The only stiff part is the back of the ankle. Have to wear some socks to avoid skin tearing apart. Also, it looks good on skinny and long feet. They could fit wide feet but less chic."
  },
  {
    "user": "Jana Blount",
    "rating": 5.0,
    "message": "Everyone loves these as much as I do! Super cute, comfortable and stylish and my go to shoes daily!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Leather is supple, shoe seems supportive, but my narrow heel lifts out when taking a step.  Returned."
  },
  {
    "user": "Judy Perkins",
    "rating": 4.0,
    "message": "These shoes r so comfortable and goes with everything! Love, love these shoes!"
  },
  {
    "user": "J",
    "rating": 5.0,
    "message": "I love these shoes so much. I own them in black also. I wear them with everything and are perfect vacation shoes. I wear a 7.5-8 and 7.5 was perfect for me. Go get these in every color, you won’t regret it."
  },
  {
    "user": "Susan's Stitches",
    "rating": 4.0,
    "message": "A bit tight across the area where bunions develop requiring me to break them in."
  },
  {
    "user": "Sylv",
    "rating": 2.0,
    "message": "I like the look of the shoes and got complements when I first purchased. One of my coworkers even purchased her own.  The shoes are coming unglued around the side and front of the toes, both shoes, very disappointed.  I purchased these in January of 2022.  I hardly have worn them due to the summer months (hot flashes).  I just started to wear them this week due to it being a little cooler in the mornings, but taking my open toe flats to transition mid-morning at work.  Again I have hardly worn these and can't believe they are coming apart.  If I take a wild guess, I might have worn them a total of maybe 6 weeks since the time of purchase."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Keds are a great shoe. I have been buying them for years.  For work and casual."
  },
  {
    "user": "Ramon R",
    "rating": 3.0,
    "message": "Really tight fit, and very little flexibility. A rigid shoe."
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "Great quality, great fit, very comfortable"
  },
  {
    "user": "kelly kirsch",
    "rating": 5.0,
    "message": "I have always loved keds.  But as I have aged and my feet have changed they just aren’t the same shoes.  Too expensive for a poorly sized product."
  },
  {
    "user": "Shella Morland",
    "rating": 3.0,
    "message": "I really wanted this shoe but ended up needing an 8W I put it in my cart and when I clicked on it to buy the price had increased from $30 to $54…so I just returned the shoes."
  },
  {
    "user": "Kim",
    "rating": 5.0,
    "message": "Very comfortable shoe."
  },
  {
    "user": "Erica",
    "rating": 5.0,
    "message": "Very comfy"
  },
  {
    "user": "filipa Oliveira",
    "rating": 4.0,
    "message": "these sneakers are super beautiful but run a bit tight."
  },
  {
    "user": "Paulina P.",
    "rating": 3.0,
    "message": "This shoe was exactly what I was looking for.  The footbed was cushy and felt good, but even though I ordered the wide width, the shoe was still too narrow to be comfortable.  Sadly, I returned the shoes."
  },
  {
    "user": "Ashley",
    "rating": 3.0,
    "message": "Overall I love this sneaker. BUT, the right shoe fit my foot tighter than the left even tho my left foot is slighly bigger. It took a few weeks to break in."
  },
  {
    "user": "Erick Garcia",
    "rating": 5.0,
    "message": "Bought this for my wife on mother’s day ..she love them and love the way they fit ..she is happy with those shoes !"
  },
  {
    "user": "R",
    "rating": 1.0,
    "message": "I've stuck with Keds for Double Deckers for the last 4-5 years. In no other shoe on earth have I had to wear a wide, but these shoes require it. I've gone through at least 7 pairs in various leather and suede colors. The last few years the quality and comfort have gone downhill. Steeply. My current perforated suede pair cuts the side and heels of my feet causing so much pain I had to stop wearing them. I simply couldn't break them in because the materials are so tough. Just awful. The black leather pair I just bought is at least the 4th in this style I've had. Purchased 5 days before getting on a plane to take care of a sick relative in late Feb 2022. Three days in, the white rubber portion of the sole started puckering. Embarrassingly, they started gaping in the days to follow with each step- but I was away from home with only these shoes. So to go back and forth running errands and caring for my relative (in other words- normal stuff, no marathons!) these shoes deteriorated within 7 weeks. SEVEN WEEKS! Finally, when I wore them in the rain, I took a step and the entire front of the shoe buckled underneath me. The rubber literally folded under my foot and pulled away from the leather. I'm lucky I didn't get injured. Never again, Keds. I've been wearing them for decades- and the double deckers which were my go-to shoes- for the last few years.  The love affair is over. I deserve better. And so do you. Don't waste your money on this fast fashion. To wear shoes casually for 7 weeks and have this happen is preposterous."
  },
  {
    "user": "Stacey",
    "rating": 5.0,
    "message": "I love the style and leather.  Canvas is great but after wearing them once or twice they are dirty. With the leather you just wipe with a damp clothe and done."
  },
  {
    "user": "Erin D",
    "rating": 5.0,
    "message": "Comfy and easy to clean"
  },
  {
    "user": "Jayme Minor",
    "rating": 4.0,
    "message": "Soy size 7 pero lo compre 8 porque corren pequeños. Ahora ancho mucho t me grande"
  },
  {
    "user": "kira2013",
    "rating": 4.0,
    "message": "I normally wear a size 8, they’re a little tight across the bridge of the foot. I bought them in an 8 and I wish I would’ve bought an 8.5"
  },
  {
    "user": "madi benedict",
    "rating": 4.0,
    "message": "These are my shoes for work and unless i wear ankle socks, I am bleeding on my ankles from the backs rubbing my ankle."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "Look & fit perfect"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "They were ver my cute!  I wanted to be able to keep them but they were just too tight even when ordering a wide width."
  },
  {
    "user": "Deidre Dawson",
    "rating": 5.0,
    "message": "Fits perfectly ☺️"
  },
  {
    "user": "Teacher",
    "rating": 5.0,
    "message": "The shoes have been great. I wear and 8 and purchased an 8. The only down side… had to break them in, the part that rubs against my heel, was stiff, had to wear thicker socks to protect the heel from rubbing… now that I have broken them in, not an issue. Comfy foam soles. Easy to wipe down the leather."
  },
  {
    "user": "judy richard",
    "rating": 5.0,
    "message": "Love them just what I expected"
  },
  {
    "user": "Lori Tisdale",
    "rating": 5.0,
    "message": "When I find something I love (like these shoes) I like to buy an extra pair. Off I go to do that..."
  },
  {
    "user": "Theresa ridley",
    "rating": 5.0,
    "message": "I would buy again."
  },
  {
    "user": "FNS",
    "rating": 5.0,
    "message": "I’ve had Keds my whole life and fell in love with these easy leather slip ons. I’ve been needing replacements for my old ones and found these for a great price! They came as perfectly as expected and the seller left a nice thank you note with the purchase. Would definitely buy from this seller again!"
  },
  {
    "user": "MERLINA MARCELLIN",
    "rating": 3.0,
    "message": "Item was not a fit.  It run small.  But it looks good.  You should take a bitter size."
  },
  {
    "user": "Krista",
    "rating": 5.0,
    "message": "I out the shoe in and it was comfortable from the very first moment. Won’t have to break in my sneakers before wearing them."
  },
  {
    "user": "Jean O’Rear",
    "rating": 5.0,
    "message": "I like being able to just slip my foot in and I’m ready to go."
  },
  {
    "user": "Raleighite",
    "rating": 5.0,
    "message": "A little tight across the instep but hoping it will loosen up with wear."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Keds have always been my go to shoes. I thought I would try a wider width and they slipped off at the heel so I’m returning them."
  },
  {
    "user": "Wendy C",
    "rating": 3.0,
    "message": "The length of the shoe was true to size; the width was snug, and the arch insert was not in the right place."
  },
  {
    "user": "Norah Ogot",
    "rating": 3.0,
    "message": "First thought after trying...the heel height is too short. Makes the shoe loose at the heel while walking."
  },
  {
    "user": "Tracie K.",
    "rating": 4.0,
    "message": "Just as I remember wearing back in the day, only now with a little more cushion in the insole and a bit more lift with the double decker outer sole. Simple and cute! My only complaint is that the listing did not say the width of the shoe is wide, however that is what I received. A \"9W\" pair of shoes. I would have liked a little more snug fit, but they do still fit my foot without falling off so I'll keep them. If you have a true narrow or even medium width foot, and receive a \"W\" width like I did, these may not work for you."
  },
  {
    "user": "BKmom:-)",
    "rating": 2.0,
    "message": "Very narrow and I don’t have a wide foot. Not comfortable for the price and hurt me after using them only 1 time. Gave me blisters on the back of both heals from rubbing when walking. I don’t recommend these. They look cute but hurt your feet. I would have returned them if I could. I have cheaper slip on shoes like this and don’t have an issue."
  },
  {
    "user": "Karen Courtney",
    "rating": 2.0,
    "message": "I have a narrow foot but based on the other reviews I thought these would work. The color, style and price were exactly what I wanted. However, they were very uncomfortable, the \"foam\" insert was pretty hard and although I had the length correct the heels slipped off my feet to the point I was scrunching up my toes to keep them on. So here's the fix: I bought Dr Scholl's Memory foam inserts, cut them to fit and inserted them on top of the existing foam inserts. Then, I bought heel liners and put them in the heels of the shoes. Voila! Pretty comfy now, the heels don't slip and I can were them happily. I have a feeling I will be replacing the foam inserts and heel grips every so often and that probably added another $20 to the price. So if you find other shoes you like that cost a bit more I would probably go for that option in hindsight. I wear a size 6 and my foot is somewhat narrow but I don't usually have to buy narrow shoes."
  },
  {
    "user": "Helen",
    "rating": 4.0,
    "message": "Nice shoe. But, rubs one heel."
  },
  {
    "user": "Laura",
    "rating": 5.0,
    "message": "I wish I had rediscovered Keds Double Decker shoes sooner. I used to wear Keds when I was younger, but changed to other brands like Skechers (which I still love). This summer I bought a pair of Keds Double Decker canvas slip-ons when they were on sale. They were so comfortable I bought a brown leather pair for this Fall. I couldn’t find a black leather pair in the stores, so I tried Amazon. My shoes arrived beautifully packed in just two days. If you have wider feet you may not like the medium Keds. For me, they are a perfect fit."
  },
  {
    "user": "D Jo Mason",
    "rating": 4.0,
    "message": "I remember having these in the 90's. They fit nice and the Dream Foam feels good when walking. I am disappointed in the quality. I have noticed these days shoes are being made with cheap materials and consumers charged a high price. My expectation for a $50 shoe was let down. The one photo shows how they look after trying them on and walking around the house for a few minutes. Creases are already setting in. I remember my 90's keds being sturdy leather and they lasted me 10 years. I have a feeling these will not last that long."
  },
  {
    "user": "hoosier girl",
    "rating": 4.0,
    "message": "Good support, nice looking shoe but runs small and a bit narrow. I normally wear 8.5 to 9 in all of my shoes of various brands. I ordered a 9 in these thinking the leather would stretch some.  These shoes are still snug after a few weeks. I shouldve went with a 9.5 ."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I’ve been wearing keds doe years! Love the slip ons"
  },
  {
    "user": "Helen",
    "rating": 5.0,
    "message": "I bought the brown pair a couple months ago. It took several weeks to break them in. I received the black ones and wore them with zero break in time. Very comfy."
  },
  {
    "user": "Stacy Ynostrosa",
    "rating": 3.0,
    "message": "At first these seemed ok. They fit differently then my other keds. After a couple wears they just seem lose. They fit as big and comfortable as my other keds. Wish I could return them but I have worn them a few times now. I wouldn’t buy them again. If I get thicker no show socks they might be better."
  },
  {
    "user": "Jason Turnquist",
    "rating": 5.0,
    "message": "I usually wear vans but these are super comfy!!!! Wear an 8 and bought an eight and fit perfectly!!!"
  },
  {
    "user": "Via",
    "rating": 5.0,
    "message": "I love these.. They fit comfortable after a day of walking too .. no tightness in the heel or top of arch. They are made well. I highly recommend!!!"
  },
  {
    "user": "Shopper42",
    "rating": 5.0,
    "message": "I’ve been wearing these for years. They are super comfortable, easy to get on/off, and match with so many outfits. I get new ones to replace old ones I love them so much!"
  },
  {
    "user": "R.B.",
    "rating": 5.0,
    "message": "These are comfy, with decent arch support."
  },
  {
    "user": "Kathleen Croley",
    "rating": 3.0,
    "message": "Run small and narrow, should've gone half size up, but I had worn them for a day before deciding they were not going to break in easily"
  },
  {
    "user": "Cathy Goolsby",
    "rating": 5.0,
    "message": "I forgot how much my feet enjoy wearing leather Keds!  So comfortable and stylish. Good price."
  },
  {
    "user": "Ellen Bishop",
    "rating": 5.0,
    "message": "The shoe is awesome, I love everything about it ❤️"
  },
  {
    "user": "C Ventura",
    "rating": 2.0,
    "message": "Runs small in every sense of the word. Very little toe room and their idea of \"wide\" is deceptive. Beware if you truly need a wide."
  },
  {
    "user": "JUAN",
    "rating": 5.0,
    "message": "These shoes are so comfortable to use on long walks."
  },
  {
    "user": "caylan sinclair",
    "rating": 4.0,
    "message": "I am a big fan of these. They seem to run a little small, I am an 8.5 typically and may have been better with a 9 on these but I am hoping they stretch out soon. They look so so cute."
  },
  {
    "user": "Lori H",
    "rating": 5.0,
    "message": "These shoes look great w sweats or w jeans. Very comfortable."
  },
  {
    "user": "Patricia",
    "rating": 5.0,
    "message": "Bought these as a Christmas gift for our daughter.  She must have liked them because she wore them home!"
  },
  {
    "user": "Barbara",
    "rating": 5.0,
    "message": "I have left foot fusion and I'm over weight. I only wear New Balance tennis shoes. I've looked for awhile to find something affordable but a tiny bit dresser for work. I finally found them with my new Keds. These are absolutely perfect with support and style but after reading the reviews I did order half size up but I don't think I will the next time. They're ok with the up size but my normal size would have been too. I love these and definitely will order a second pair very soon. Well done Keds big Kudos to you."
  },
  {
    "user": "Gloria Hall",
    "rating": 5.0,
    "message": "very please. Comfortable for walking"
  },
  {
    "user": "Theresa Flippin",
    "rating": 5.0,
    "message": "Love these!  Fit well.  Keds are the only slip ons I can keep on my feet.  Other brands are made too wide and roomy.  Wear 7, narrow heels and slim arches.  Ordered 7 and fits true. Leather is durable.  Traveled in them recently doing lots of walking and had comfy feet!"
  },
  {
    "user": "Louise Vega",
    "rating": 2.0,
    "message": "I love ked sneakers, but not too happy with these. They ran too big"
  },
  {
    "user": "Daniel R. Hight",
    "rating": 1.0,
    "message": "I was so excited to buy a pair of Keds. I bought 3 different sets. I remember Keds being very comfortable and this style looked super cute. When I got them in, I had to squeeze them onto my feet. Immediately, I joked with my husband and said, \"I guess I should have bought the wide style\". I have never had to by wide size shoes in my life. I have, what I would consider, a normal width foot. I still had hopes that MAYBE they would stretch out a bit. I wore them the next day and they were literally cutting the circulation off in my feet. Uncomfortable would be an understatement, it was miserable. I was wearing socks and also put bandaids on that morning just to be safe, still got blisters. This style is EXTREMELY and unnecessarily narrow. I honestly don't know how any one would comfortably wear them. It's a huge bummer, because I splurged on three pairs (all different colors) and was really excited to have them. So my review is, if you don't have straws for feet, buy the wide option. Judging by the width of the standard, there's a chance those may be a \"normal\" width. Keds should really give a heads up or measurements on their listing so this doesn't happen to other people."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These shoes felt sooooo comfy but unfortunately it was just a little too tight. I wanted to keep them so bad in hopes that I could stretch them out a bit but I wanted them for work and I couldn’t risk being that uncomfortable. Tried to exchange for one size up but they didn’t have any"
  },
  {
    "user": "Nicole",
    "rating": 5.0,
    "message": "I like these shoes!  They are made for narrower feet.  I remember wearing keds as a kid in the 80’s but I haven’t tried them since then.  I’m glad I looked at the reviews bc the people complaining about them being to tight and causing wear/blisters-that was my cue to order them.  I’ve already worn them quite a bit-they need to be cleaned but I really like them!  Yay keds!"
  },
  {
    "user": "Kathryn Greskovic",
    "rating": 5.0,
    "message": "Very comfortable."
  },
  {
    "user": "Happymom116",
    "rating": 2.0,
    "message": "I’m between a 7 and 7.5. Sizing was fine but the heel hurt when I put them on right away. These would definitely need to be broken in and I could tell right away that they would cause blisters on the heel. They went back."
  },
  {
    "user": "Karen Sweeney",
    "rating": 5.0,
    "message": "Just received, took out of box, put on to check fit, left on entire day as sooooo very comfortable, love them!"
  },
  {
    "user": "maryl",
    "rating": 3.0,
    "message": "Bought it for work, I am in the medical field.  I was never able to wear them.  Way too narrow.  Thank you."
  },
  {
    "user": "Darla Gustafson",
    "rating": 3.0,
    "message": "I never have issues with my shoe size.  I wear size 7 and ordered 7.  I couldn't even get my foot in the shoe.  I gave to my daughter and they fit! She wears a size 6.  Nice shoe though.  I wish they would have fit."
  },
  {
    "user": "MARY P. BEASLEY",
    "rating": 3.0,
    "message": "Very narrow"
  },
  {
    "user": "SNS",
    "rating": 3.0,
    "message": "These are ok but definitely not platform or double decker as advertised. Just plain old keds. Disappointed."
  },
  {
    "user": "Brelin Hernandez",
    "rating": 5.0,
    "message": "Me encanta el ancho para pies delgado son fantástico."
  },
  {
    "user": "Darin",
    "rating": 5.0,
    "message": "Perfect shoes! My feet are average width and these shoes are just a bit too wide, but thick liner socks work well to improve the fit."
  },
  {
    "user": "Julie",
    "rating": 5.0,
    "message": "They are a bit narrow than I thought. Originally got a size 7 but then had to return and get a 7 1/2 because they were super tight. The extra half I really helped because overall the shoes were so tight and now they are perfect. I absolutely love them!"
  },
  {
    "user": "Dr. ESD",
    "rating": 5.0,
    "message": "Can’t go wrong with Keds"
  },
  {
    "user": "It's Brandy Eckman",
    "rating": 4.0,
    "message": "I wanted to love these keds. They are so cute and trendy, but I can't wear them all day because they rub my heal when I walk very far in them. Perfect for at the office, or around the house, but I could never wear them where I had to do much walking."
  },
  {
    "user": "Kristina Mills",
    "rating": 4.0,
    "message": "Should have ordered true to size for flats.should have ordered true to size for a regular ballet flat; not my running shoe size. They might slip even true fo size - but cannot comment fully on that. Still love the look & the price was half of any other brand that looked as well made. Very comfortable."
  },
  {
    "user": "JoAnn Crooks",
    "rating": 5.0,
    "message": "Such a classy sneaker. A little on the ‘tight’ side. But comfy. I live in them. Thanks."
  },
  {
    "user": "Kindle Customer",
    "rating": 3.0,
    "message": "The sole is very comfy. It took a long time to \"break in\" in the shoe. It was only a little tight around my foot for a bit. However,I recommend buying a hoaf size bigger perhaps. Both of the back of my heels are still healing from the shoes being so tight and rubbing on my heels. I still wear band aids when I wear them. I felt it would be too late to return them since i had been wearing them for a week already. ** It's been a month and I still wear bandaids on both of my heels. I'm hoping that one day it won't hurt to wear these shoes**"
  },
  {
    "user": "juliana duran",
    "rating": 2.0,
    "message": "Worn them not even a mth and already falling apart"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "They looked really nice, but gave me blisters for both feet after only 45 minutes.  Be aware!"
  },
  {
    "user": "grace.10",
    "rating": 4.0,
    "message": "They're great quality, just made for much narrower? feet maybe?"
  },
  {
    "user": "PSMI",
    "rating": 5.0,
    "message": "They were a gift and she liked them very much"
  }
]