[
  {
    "user": "O.W.",
    "rating": 5.0,
    "message": "I haven't bought this brand of shoes for years and I decided to spend the money and buy them because I was tired of buying other brands that either didn't hold up or they just didn't fit right. I am happy with my purchase. I bought my size and they fit perfectly. I'm not sure why the other brands seemed to be smaller when I purchased them but these shoes have not changed at all."
  },
  {
    "user": "Kayla Marshall",
    "rating": 5.0,
    "message": "Super cute and the aesthetic is so clean! 10/10"
  },
  {
    "user": "Navros",
    "rating": 4.0,
    "message": "I had to send back my 8 and get an 8 1/2 instead."
  },
  {
    "user": "Amber Goforth",
    "rating": 4.0,
    "message": "I am on my feet 10 full hours a night and these shoes are definitely not the worst I've tried. If they had more cushion on the sole they'd be perfect."
  },
  {
    "user": "Marian Leuis",
    "rating": 5.0,
    "message": "These are the most comfortable shoes! I love the all black for work! Awesome! Highly recommend!"
  },
  {
    "user": "tad007",
    "rating": 5.0,
    "message": "Very sporty looking! They've increased the cushioning in this shoe and it's much better. I love them! Highly recommend!"
  },
  {
    "user": "Renee Coffey",
    "rating": 4.0,
    "message": "Love the black sole and they are comfortable.  I wanted the ones with black tongue and laces though."
  },
  {
    "user": "Vickie D Davis",
    "rating": 5.0,
    "message": "Comfortable & simple design"
  },
  {
    "user": "Gracep",
    "rating": 5.0,
    "message": "I have always loved KSwiss 329's. These are awesome shoes. Fit as expected, as always. I can't say anything bad about these shoes."
  },
  {
    "user": "Susanna",
    "rating": 4.0,
    "message": "Not too bad but they are a bit big on me. They serve their purpose well enough."
  },
  {
    "user": "Penn1238",
    "rating": 5.0,
    "message": "Great product and on time"
  },
  {
    "user": "Ed henicksman",
    "rating": 5.0,
    "message": "I love these shoes they fit great and help my arches."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Pretty cor, good fit."
  },
  {
    "user": "Tpfam",
    "rating": 4.0,
    "message": "Comfortable shoes helped my back pain."
  },
  {
    "user": "Melissa Holley",
    "rating": 5.0,
    "message": "I bought these to wear to work and they don't hurt my feet"
  },
  {
    "user": "Karen Fordyce",
    "rating": 3.0,
    "message": "These shoes are good and comfortable for general use but not for the purpose I needed. I work on concrete floors and these shoes don't prevent my feet/toes from hurting durning an 8 hr shift."
  },
  {
    "user": "Julie 💕",
    "rating": 3.0,
    "message": "The shoes fit me just fine, they are comfortable, but.. I believe I was sent a used pair of shoes. The laces were already laced, and there is a knot in the lace that I can’t get out. There is a little bit of debris on the bottom of the shoes. As if they’ve been walked in. I’d really like to know if they are used. Because I’d pay for a ‘used’ price."
  },
  {
    "user": "Wanda Hall",
    "rating": 5.0,
    "message": "Great shoe can't go wrong with k-swiss."
  },
  {
    "user": "Yvonne",
    "rating": 5.0,
    "message": "Very pleased let me know when they're on sale again will certainly purchase two next time"
  },
  {
    "user": "Jones",
    "rating": 5.0,
    "message": "Perfect, brand new, never worn. Fit perfectly, packaged nicely."
  },
  {
    "user": "Theblessedmess",
    "rating": 3.0,
    "message": "Suoer cute but was not even close to my size 11 foot.  Seemed more like a 10 which I couldn't squeeze into.  Also narrow so that wouldn't have worked for me."
  },
  {
    "user": "Melanie Nelson",
    "rating": 5.0,
    "message": "loved the quality and color comfort"
  },
  {
    "user": "Toni Alvidrez",
    "rating": 5.0,
    "message": "Fit perfectly and comfortable"
  },
  {
    "user": "SamI Smith",
    "rating": 4.0,
    "message": "Fits like a gloves and feels like a dream...Id buy 100 more if the had more colors/designs"
  },
  {
    "user": "Tania Louviere",
    "rating": 5.0,
    "message": "A little big , but very comfortable , always a fan of K-Swiss shoes"
  },
  {
    "user": "COLTOJ",
    "rating": 1.0,
    "message": "I've been loyal to K Swiss for many many years and my favorite styles are no longer available so I purchased this style. I have tried to wear them and they hurt my feet and it goes right up into my knees. They have no give even after a long time. Horrid. I don't recommend them to anyone who has any orthopedic problems."
  },
  {
    "user": "Cheryl  jackson",
    "rating": 5.0,
    "message": "They are so pretty and omg so comfortable  will buy again !!"
  },
  {
    "user": "Kara Lawrence",
    "rating": 5.0,
    "message": "I'm a nurse and being on my feet most of myx12 hours, I like this brand of shoe."
  },
  {
    "user": "Heather Cantrell",
    "rating": 5.0,
    "message": "Only issue is they aren’t so great to wear while working out. Other than that I love them!"
  },
  {
    "user": "Elaina H.",
    "rating": 5.0,
    "message": "I like the shoes and I would purchase again"
  },
  {
    "user": "Christine Pruitt",
    "rating": 3.0,
    "message": "I thought I would really like these shoes but the only problem. The tung inside bunched up and they weren't so attractive then but we'll designed fix the tung and that would be awesome in every way. Thanks"
  },
  {
    "user": "Margo Wertenberger",
    "rating": 5.0,
    "message": "I love them they fit good and they are really comfortable on my feet"
  },
  {
    "user": "Raquel Carmona",
    "rating": 5.0,
    "message": "They fit as good as if I bought them from the Kswiss site, sometimes I can't find the colors I'm looking for in the original site.... Awesome😊...."
  },
  {
    "user": "Heather R. in Dallas",
    "rating": 5.0,
    "message": "Thanks for a fast expedient delivery.  Just what I needed."
  },
  {
    "user": null,
    "rating": null,
    "message": "Love them"
  },
  {
    "user": null,
    "rating": null,
    "message": "This style is great quality and looks good.  Fits true to size and generally comfortable, however I found after one wear my heels were blísteres badly as the backs are quite high despite the dipped shape.  Will need a heel riser to wear them again."
  },
  {
    "user": null,
    "rating": null,
    "message": "My niece loves them they fit perfect true to size and brand name"
  }
]