[
  {
    "user": "bpete",
    "rating": 5.0,
    "message": "I love these shoes. I was surprised by the price point. I was also surprised by how comfortable they are! When I first put them on, I couldn't believe how light weight they feel. I almost felt like I was just wearing socks they were so light! I took them for a run and was always surprised that my knees and ankles didn't hurt. Every shoe is different. Some may find these are cushioned enough, others may find that they don't have enough support. But, they are perfect for me. With any shoe, I recommend that you find a pair that feels good on your feet and that don't hurt you. These shoes were great for me."
  },
  {
    "user": "Mahesh Krishnaswamy",
    "rating": 4.0,
    "message": "I bought these NB shoes for my brisk morning walks, not for running. They are very light as many reviewers have pointed out. But most people will benefit from buying a half size bigger than they might normally do."
  },
  {
    "user": "Dev",
    "rating": 4.0,
    "message": "Got the blue, Love em, wear them every day for work (office, but a lot walking). Wish they had option for different color sole, like black."
  },
  {
    "user": "Rachael",
    "rating": 5.0,
    "message": "I bought these in 11 even though I normally am 10.5 due to another person commenting that this sneaker runs a bit small. I did not do a full size up like recommended by them but I probably could get away with an 11.5. Basically do yourself a favor and order atleast a half size to a full size up then what your normally used to. You'll be glad you did. Otherwise, for the price your getting a good value, decent comfort and quality, and they look pretty good too!"
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "Finally found a shoe that fits my duck feet!"
  },
  {
    "user": "PJ",
    "rating": 4.0,
    "message": "I am staring at them next to my old 775's, and can't explain why they look narrower, but when I try to measure them, they appear to be very similar in the toe box.  Optical trickery of the eye? I don't know.....they don't feel tight, but they just don't seem roomy either. Maybe I need to take my hobbit feet and go wider."
  },
  {
    "user": "Vicky Courson",
    "rating": 5.0,
    "message": "I love them because my husband doesn't squeak anymore. I called his old shoes squeaker sneakers"
  },
  {
    "user": "Nick Rabauliman",
    "rating": 5.0,
    "message": "The shoes arrived within a quick amount of time given my location and fits perfectly! Would recommend."
  },
  {
    "user": "MORY HARSH",
    "rating": 5.0,
    "message": "Fits my foot well, like all the other New Balance shoes I’ve owned over forty years. I am pleased with this purchase."
  },
  {
    "user": "Hangloose46",
    "rating": 5.0,
    "message": "I work on my feet all day and they are very comfortable. I also workout with them in the morning."
  },
  {
    "user": "G Cat",
    "rating": 5.0,
    "message": "Because of my wide foot, New Balance is my go to. This shoe is extremely comfortable and the sizing is spot on ."
  },
  {
    "user": "Samuel G.",
    "rating": 4.0,
    "message": "Super light weight, love the color and the design, but the like “foam” sole that usually has a nice “squish” as you walk is slightly stiffer than anticipated. Overall though, love the shoe"
  },
  {
    "user": "Brad",
    "rating": 5.0,
    "message": "Comfortable sneaker and fit my wide feet"
  },
  {
    "user": "Gustavo Dias Miguel",
    "rating": 4.0,
    "message": "Seems that is a little bit larger than usual"
  },
  {
    "user": "KJ in SD",
    "rating": 5.0,
    "message": "My son does parkour and loves these for flexibility and traction.  There's a trail running version of these shoes that doesn't have quite the traction so watch for the sole design for both.  This one has more surface area and the other is more varied for uneven dirt terrain."
  },
  {
    "user": "MattVK",
    "rating": 5.0,
    "message": "These shoes replaced an older pair of New Balance shoes that had worn out, and they didn’t disappoint. They’re very lightweight and comfortable for a full day of walking, and the wider toe bed gives plenty of room for my foot to spread out. The only downside is the stock insoles - very thin with no significant support, and they slid around inside the shoe. At one point one insole had actually crept up the back of my heel and was poking out the top of the shoe! However a quick $20 investment in some off-the-shelf gel insoles and the problem was solved. I’d buy this model again when these eventually wear out."
  },
  {
    "user": "Jessica Bruno",
    "rating": 4.0,
    "message": "Great quality except for the flimsy foam at the bottom, inside of the the shoe. It keeps coming out of place."
  },
  {
    "user": "Joshua Wright",
    "rating": 5.0,
    "message": "Love the shoes super comfortable, will purchase others."
  },
  {
    "user": "Adventure77",
    "rating": 5.0,
    "message": "I usually only buy New Balance for running, but this shoe caught my attention with the gradient color. Fits well, soft, light weight, and a firm sole. Would recommend and order more in different colors."
  },
  {
    "user": "Jennifer Vasquez",
    "rating": 5.0,
    "message": "Super comfortable , just size up."
  },
  {
    "user": "Logan Zimlich-Halter",
    "rating": 4.0,
    "message": "At first the shoe seemed like a squeeze but once you get it on it fits like a glove. Additionally the traction is great for indoors activities however for running it is not as impressive."
  },
  {
    "user": "Paula A. Wade",
    "rating": 5.0,
    "message": "great fit and very good looking"
  },
  {
    "user": "BigN",
    "rating": 5.0,
    "message": "Fits perfectly very comfortable. I have a large bunion and these sneakers fit great. No issues. Will get again"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The shoes is very comfortable, and fit just perfect"
  },
  {
    "user": "JAY KOOL",
    "rating": 5.0,
    "message": "These shoes are very comfortable and have held up nicely with me walking everyday with little wear on them. Holds up better than sketcher walking shoes. Would recommend to anyone!."
  },
  {
    "user": "Christine Duross",
    "rating": 4.0,
    "message": "The shoes are very comfortable and light weight. The shoe laces are just a little too short unlike other New Balance models  that are too long."
  },
  {
    "user": "A&K",
    "rating": 3.0,
    "message": "I have been a NewBalance truther for years, so much so that I had purchased approximately 20 pairs in a row. This changed last month when I purchased a pair of Brooks and was reminded how my feet and back SHOULD feel when wearing a respectable athletic shoe. My loyalty to NB was justified. As a size 13 X-Wide, they always made my size widely available without breaking the bank. Over the past few years, I've noticed a gradual decline in price along with a considerable decline in quality. In athletic footwear, you generally get what you pay for, and I am saddened that NewBalance has taken the route of quantity over quality. After 6 weeks in my Brooks, my feet feel better and my spinal pain has reduced with footwear being the only change. Beware of anything coming from NB under $100. They are NewBalance in logo only and should not be trusted; your body deserves better."
  },
  {
    "user": "SANDY BYRNE",
    "rating": 5.0,
    "message": "Love these and the soft back helps with my ankle problems!"
  },
  {
    "user": "Christine Welch",
    "rating": 5.0,
    "message": "I like they way they look on my husband feet and he told me that they are so comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Isn’t often that I have a new pair of shoes that I don’t feel they need “broken in”.  These didn’t"
  },
  {
    "user": "Chet Cessford",
    "rating": 5.0,
    "message": "Fits great!"
  },
  {
    "user": "Ray W. A",
    "rating": 5.0,
    "message": "Light and comfortable. I hope they last as long as the previous pair I bought. Just what I was looking for."
  },
  {
    "user": "Sam Dooley",
    "rating": 5.0,
    "message": "Love that they have an extra-wide size option, they look and fit great."
  },
  {
    "user": "Zack",
    "rating": 4.0,
    "message": "I run 20+ miles a week and go through shoes pretty often. I switch brands and styles almost every time because I base my purchase on sales and value. These New Balance are super light weight, thin and very breathable. I have a supinated foot landing and am a toe striker and I noticed after a few miles my feet moving around in the shoe. I’m guessing it’s because of how thin and light the material is that it started stretching the material. But other than that these shoes are good for the right person. Will use them for shorter light runs"
  },
  {
    "user": "Jo",
    "rating": 5.0,
    "message": "Very wide and foot shaped. Upper is nice and stretchy"
  },
  {
    "user": "Ryan J Bernhardt",
    "rating": 4.0,
    "message": "Great shoe! A little big than I was expecting and squeaks with the super feet inserts."
  },
  {
    "user": "Chan S.",
    "rating": 4.0,
    "message": "Runs slightly narrow but not enough to be uncomfortable.  Can't beat a pair of NewBalances for this price.  They look great and feel good."
  },
  {
    "user": "Camilo",
    "rating": 5.0,
    "message": "Muy satisfecho con comodidad y diseño"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "First pair of these I bought from a store and they were outstanding shoes. The second pair I ordered from Amazon and after the first hour of wearing them I had to take the sole out and re-glue it to keep it from sliding."
  },
  {
    "user": "William Sanabria",
    "rating": 5.0,
    "message": "Cómodos para ir hacer ejercicios !"
  },
  {
    "user": "David Shaffer",
    "rating": 5.0,
    "message": "Nice shoes fit as expected"
  },
  {
    "user": "Jon Schmidt",
    "rating": 5.0,
    "message": "I’ve been wearing this for some time now and they are great shoes for the cost.  I have been able to clear off some light grass staining from the fabric.  If you’re in dusty, dirty, grassy, or wet areas, I wouldn’t recommend"
  },
  {
    "user": "Richard Worthley",
    "rating": 5.0,
    "message": "I love these shoes. Super comfortable."
  },
  {
    "user": "DJ",
    "rating": 5.0,
    "message": "The shoes are lightweight and wide in the toe box area, which makes the shoe comfortable. The shoes are good jogging shoes. I recommend the shoes."
  },
  {
    "user": "Chanda",
    "rating": 5.0,
    "message": "I liked it"
  },
  {
    "user": "Samantha",
    "rating": 4.0,
    "message": "Small pieces on the sole started coming off about 3 weeks after I started wearing them. I wear them for standard walking. Nothing too strenuous. I was disappointed they didn’t last longer."
  },
  {
    "user": "Kenneth",
    "rating": 4.0,
    "message": "Very comfortable and fits well, I will buy again."
  },
  {
    "user": "Robert",
    "rating": 4.0,
    "message": "I would have given these shoes 5 stars, but the sole doesn’t feel quite thick enough.  I little more cushion would have been better"
  },
  {
    "user": "Matthew D. Brill",
    "rating": 4.0,
    "message": "Wear for fitness walking 2-3 days/week - not in winter.  Comfortable, etc. but rubber from sole started pulling away from toe on both shoes after about 7-8 months."
  },
  {
    "user": "Thaddeus Stevens",
    "rating": 5.0,
    "message": "New balance feel like air on my feet, so comfortable"
  },
  {
    "user": "W.T.",
    "rating": 5.0,
    "message": "These shoes feel like slippers. Very lightweight and comfortable fit. I bought them with the intention of using them for long walks and they work perfect for that purpose. I have also ended up wearing them to work most days as they are just too comfortable to pass up when I'm grabbing shoes in the morning. **All that said, I do not use these shoes for jogging or hiking. I prefer a shoe with lots of stability when I jog and hike and these have very little of it. I have a fair amount of pronation in my steps and these are not able to account for that. And as far as hiking goes, these shoes not only have no support, but the sole has no traction whatsoever. I would recommend this shoe to anyone looking for a very comfortable walking shoe and/or casual everyday shoe. But I would not recommend these shoes for any use with a higher impact than just walking around."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "New Balance fits me well.  I have a wide foot and high arch"
  },
  {
    "user": "Christina Cain",
    "rating": 5.0,
    "message": "Light weight mesh"
  },
  {
    "user": "Angel Negron",
    "rating": 4.0,
    "message": "El producto corre una talla un poco pequeña.. ejemplo yo carso un 11 1/2 y la verdad me queda ajustada."
  },
  {
    "user": "Ritner Day",
    "rating": 5.0,
    "message": "Great fit. Nice looking shoe."
  },
  {
    "user": "Lori",
    "rating": 5.0,
    "message": "I have been compromising because I couldn’t find a shoe in my size and width that actually fit. These are literally perfect and the most comfortable shoes I have ever owned, right out of the box. They also seem well made and durable. We’ll see."
  },
  {
    "user": "Gadgeteer",
    "rating": 5.0,
    "message": "Light weight, comfortable, and pleasing to the eye. Foam sole product makes walking a pleasure, combined with a roomy toe section.  I wear a 8.5 double wide size shoe which makes New Balance just about my only choice for this type shoe."
  },
  {
    "user": "T&C",
    "rating": 5.0,
    "message": "My husband loves them and says they’re very comfortable and he likes the way they look. Fit as expected and a great value."
  },
  {
    "user": "Paul Nye",
    "rating": 5.0,
    "message": "Comfortable, durable, lightweight"
  },
  {
    "user": "AJ",
    "rating": 5.0,
    "message": "They work amazing for where I I work. I will definitely buy these again when I need them."
  },
  {
    "user": "Mike Ewing",
    "rating": 5.0,
    "message": "I’m very happy with these shoes and will definitely consider buying again!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Before these shoes I just thought every shoe would hurt to walk in. Not an exaggeration. I will probably wear these every day for the rest of my life."
  },
  {
    "user": "Nas",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Michael Gonzalez",
    "rating": 5.0,
    "message": "Amazing Running shoes for the price!!!"
  },
  {
    "user": "KP",
    "rating": 4.0,
    "message": "The shoes looked great and felt good but just walking around in them got them dirty. I felt like I had to watch every step for fear I was going to get more dirt on them."
  },
  {
    "user": "Troy",
    "rating": 3.0,
    "message": "Won’t last very long . I can already see they will be wore out in a month ."
  },
  {
    "user": "Deyvis",
    "rating": 4.0,
    "message": "No sirven son malos"
  },
  {
    "user": "Robert Estep",
    "rating": 5.0,
    "message": "Very comfortable New Balance kicks! Love the white sole/black material contrast. Went for a two mile walk yesterday and they seemed to put a lot of pep in my step! Plus, I think they make my feet look hot!"
  },
  {
    "user": "Lamont",
    "rating": 4.0,
    "message": "The shoes are comfortable. I just got them so I’ve only used them once. Depending on how long they last I may reorder them."
  },
  {
    "user": "Lee Gómez Feist",
    "rating": 5.0,
    "message": "Estos zapatos deportivos de New Balance son perfectos y cómodos. Sobre todo si eres pie plano. Se estiran por lo que comprar una talla más grande me resulta incómodo. Son resistentes y a todo terreno."
  },
  {
    "user": "Mike",
    "rating": 5.0,
    "message": "These were a bday gift. They are the most comfortable shoe I've ever owned."
  },
  {
    "user": "Dan G.",
    "rating": 5.0,
    "message": "Very pleased with the purchase I used Amazons Try before you buy  program and fortunately didn't have to return.  I use to take a size 9 1/2 in NB and still do with other brands.  Now I  can only wear size 10s with this brand.  I take a 4E width and the X-wide fit perfect."
  },
  {
    "user": "Jessica Smith",
    "rating": 3.0,
    "message": "I hate to give three stars. they may be wonderful shoes.  However, they are not men's. I ordered a 10 for my husband and they were way too small."
  },
  {
    "user": "Crystal",
    "rating": 5.0,
    "message": "These shoes are so comfortable! I bought them for my Europe trip, and my feet didn't hurt at all. I love breathable material with thick soles, so this shoe was perfect. Be sure to order an entire size larger, though. I had to return the first pair I got."
  },
  {
    "user": "Joel Hertz",
    "rating": 4.0,
    "message": "Too light; not enough support or traction. Would not buy again; would like to return for full credit."
  },
  {
    "user": "Morris B.",
    "rating": 3.0,
    "message": "Not enough support"
  },
  {
    "user": "Lindsay B",
    "rating": 5.0,
    "message": "I have consistently worn this brand/style of shoes four the past four years. I work as a courier and they are the perfect balance of light weight but supportive and comfortable. I have gone through about three pairs a year (rotating every other day or so) but haven’t found something that works better for me than these. I wear them for just about everything even outside of work."
  },
  {
    "user": "Ashley McCurdy",
    "rating": 3.0,
    "message": "maybe a bit cheaply made"
  },
  {
    "user": "gio71",
    "rating": 4.0,
    "message": "This model does not match the standard size, buy one size larger, my advice"
  },
  {
    "user": "john",
    "rating": 5.0,
    "message": "Feels great on feet"
  },
  {
    "user": "JPoss",
    "rating": 5.0,
    "message": "I got these even though there seemed to be a few bad reviews. So far, not my experience.  #1 They look great #2 They feel great.  Lightweight, ventilated, and as normal with fresh foam NB’s it’s pike walking on a cloud.  Within an hour of wearing these while working outside I ordered another pair to have when these eventually wear out… shoes last me about 6-9 months before they start tearing up, regardless of brand."
  },
  {
    "user": "zack",
    "rating": 5.0,
    "message": "Very comfy and good for the gym. Originally bought as an extra pair of running shoes they work better for lifting thou cause of the memory foam."
  },
  {
    "user": "Gary McCluer",
    "rating": 4.0,
    "message": "Good for wide feet"
  },
  {
    "user": "mohammed al mashhoud",
    "rating": 5.0,
    "message": "Its a beautiful, comfortable and good quality"
  },
  {
    "user": "Miguel Brito",
    "rating": 5.0,
    "message": "Those shoes are the most comfortable i ever used !!!  I'd Would to buy other color :)"
  },
  {
    "user": "MisterWayward",
    "rating": 5.0,
    "message": "Great fit and look. I can wear these shoes while on my feet all day without any discomfort. They're light and comfy and a good value for what they cost."
  },
  {
    "user": "Reader",
    "rating": 5.0,
    "message": "My Sweetheart found they were super comfortable, he likes them very much."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Bought US 10 4e width, fit perfectly. Really comfortable for short runs so far."
  },
  {
    "user": "John Mack",
    "rating": 3.0,
    "message": "I purchased this brand because they offered X-Wide . Turns out compared to my Nikes they are not wide at all. Just more material added to top. Bottom is not as wide as my Nikes  Beware"
  },
  {
    "user": "M Wilds",
    "rating": 5.0,
    "message": "It's hard to find shoes when you have larger feet. New Balance I have found run true to size. Which is always nice since it takes out the guesswork from having to buy new shoes."
  },
  {
    "user": "ryan fernald",
    "rating": 5.0,
    "message": "Best prime day deal I got this time around. Love the feel and I can’t wait to put some miles on these. Every day, gym, walking, I can tell they’re going to be perfect"
  },
  {
    "user": "Her Xiong",
    "rating": 4.0,
    "message": "Bought extra wide and when delivered, shoe tag shows wide while box say xwide. Fits like a wide shoe and not an xwide shoe. Cushion/sole is not as comfortable as sketchers but it should last longer."
  },
  {
    "user": "Alex Rodz",
    "rating": 5.0,
    "message": "Nice and Comfy upto know."
  },
  {
    "user": "Kenneth Lowell",
    "rating": 5.0,
    "message": "Good fit, comfortable."
  },
  {
    "user": "Jonathan N. Aragones",
    "rating": 5.0,
    "message": "I like that the shoes are comfortable and roomy without looking like shoe boxes on my feet, and actually look foot shaped."
  },
  {
    "user": "Volt Phonic",
    "rating": 5.0,
    "message": "no te hace daño a tu pie son cómodos y muy bien confeccionados, son geniales, los mejores tenis del mundo. gracias a Dios. estoy feliz corro, camino, manejo en un viaje de 6 horas y me recuerdo que los tengo puestos cuando llego a casa. en tenis siempre NB V3 ESATN BIEN HECHOS!. y super rápido el envío."
  },
  {
    "user": "John P Klein",
    "rating": 3.0,
    "message": "Tongue of shoe should stay up when putting on the shoes.  Annoying."
  },
  {
    "user": "Alluring321",
    "rating": 5.0,
    "message": "The husband likes them"
  },
  {
    "user": "RocCandyman",
    "rating": 5.0,
    "message": "People have told me for years that NB are the most comfortable shoes. I never bought a pair before and I love these. I have 8 pairs of different brands but these are the best."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I usually never leave a review, but these shoes are really great!!! I do wish they came in 12.5 because 12 is just a little too small. Thank you"
  }
]