[
  {
    "user": "Pam C",
    "rating": 4.0,
    "message": "Shoes are comfy to wear but need \"wearing in\" as they are a tight fit and the material has no give. I do love them though."
  },
  {
    "user": "Rafael",
    "rating": 5.0,
    "message": "I bought several platform shoes off of Amazon and these were the only ones I kept. They were pretty rough on the back of my ankles the first wear (even with socks). So I stepped on the back of the shoes out of frustration and that seemed to loosen up the fit! Now they fit perfectly! The shoe feels like it pushes back on your foot which is nice (kinda bouncy). The rubber sole seems to be coming apart but nothing a little gorilla glue can’t fix. (I’ve only had these for like 3 months now and I don’t walk much in them). Another con would be that they’re easily stained, but that’s every white shoe.."
  },
  {
    "user": "Jeff W.",
    "rating": 3.0,
    "message": "Have had these shoes before and liked. This time, we’re much more expensive, took a long time for delivery, and one shoe looks yellowish, while both shoes have yellowish soles."
  },
  {
    "user": "Jenny Stark",
    "rating": 5.0,
    "message": "Love these! Perfect casual shoe. Fits true to size. I’m normally a 7.5-8 and I got an 8 and they fit perfectly."
  },
  {
    "user": "Malea",
    "rating": 4.0,
    "message": "Cute but not the most comfy!"
  },
  {
    "user": "Eva",
    "rating": 3.0,
    "message": "Can’t figure out why they would put a metal rivet (almost like a jean pants button) on the heel where it grinds into your bones. Not only do these run small but then the rivet makes it even more uncomfortable. Returning. Sad because they look very cute, but the material looks like it will absorb dirt and stains."
  },
  {
    "user": "Marcia Parrent",
    "rating": 3.0,
    "message": "I love the look… but the thick sole is not a good fit. Too heavy and does not form to my foot. As a result pulls apart! Darn!!"
  },
  {
    "user": "Opal",
    "rating": 3.0,
    "message": "Adorable shoes but just make sure you break them in a bit with thick socks before regular use. They gave me pretty serious blisters the first day I used them."
  },
  {
    "user": "Someone",
    "rating": 3.0,
    "message": "They look as expected but are too hard"
  },
  {
    "user": "Trisha Heredia",
    "rating": 3.0,
    "message": "Love the shoes but very stiff"
  },
  {
    "user": "Al Agua",
    "rating": 3.0,
    "message": "Smaller than expected and the fabric is too stiff, it hurts my feet :/ They look pretty cool though"
  },
  {
    "user": "Laury",
    "rating": 4.0,
    "message": "I really do love these sneakers! Unfortunately, they do run a little on the small side though. I always wear a size 7 in Steve Madden, and basically every other shoe I own, so when these came I did not even try them on at first because I've never had a sizing issue before. The day I ended up wearing them for the first time they were not too big in the length, just the width. I believe due to the shoe having a platform sole, it causes the shoe to fit slightly snug. I personally ordered another very similar type of shoe from Steve Madden that fit more comfortably, but I still LOVE these and think they are adorable with the right outfit! Be careful not to get them dirty though, because they are made of canvas, not leather & make sure to order a 1/2 size up if you do not like your sneakers to fit on the small side."
  },
  {
    "user": "Gabby",
    "rating": 5.0,
    "message": "I was looking for a platform sneaker for the summer and I was between a good amount. And honestly, I put these last on my list only because of the rating and reviews. Compared to the other shoes this one fell the lowest but I thought they were the cutest! Thankfully my boyfriend voted for these ones and they are so perfect! Whether you’re dressing up or down. Like everyone recommended, I went up half a size and they fit great. Well made. Fast shipment; It said they wouldn’t be here for a month but it was here in 2 days. But anyway, I really do recommend."
  },
  {
    "user": "Trudi",
    "rating": 4.0,
    "message": "Cute shoe and spring summer look."
  },
  {
    "user": "Suzanne Abrahamson",
    "rating": 3.0,
    "message": "I followed the recommendation to size up which was a bad idea although I’m not sure it matters. I’m a consistent 7.5 and all other Steve Maddens are a 7.5 and fit great. Because of the recommendation I ordered a size 8 and it was too big with a big gap at the heel obviously causing the heel to slip. My daughter who wears a 9 tried them on but they were a bit tight BUT the heel still slips badly. It’s just a shoe malfunction I guess and it’s far too annoying to deal with. Returning these and I’m SO sad because I absolutely loved them :("
  },
  {
    "user": "G",
    "rating": 4.0,
    "message": "I have purchased these shoes twice because I really love how simple and clean they look. But, I’m left disappointed again. I will say, for the first few weeks these shoes are great! But after about a month of wear they are falling apart, the laces rip, and they look very cheap."
  },
  {
    "user": "Marieb",
    "rating": 4.0,
    "message": "Overall I like these shoes. I took a chance after seeing mixed reviews on these sneakers. I am happy I did. I sized up because it runs a bit small and the size 9 fits me perfectly! On the downside, it can be slightly uncomfortable as my little toe occasionally rubs on the material. Won't recommend wearing if you're doing long walks."
  },
  {
    "user": "luvsun",
    "rating": 2.0,
    "message": "These look good on, but the sole is so thick and hard that they don't flex at all when you try to walk. The canvas shoe part is scratchy and stiff too, so there is no comfort whatsoever. I don't know how people walk in these. Return!"
  },
  {
    "user": "SAMANTHA HELDENBERG",
    "rating": 3.0,
    "message": "The back of the shoes rubbed the achilles part of my leg raw (silicone heal protectors helped with that) and the platform part of the shoe began to break away from the rest of the shoe as is shown in some other review's pictures. They lasted about a year with mild use (used about 4x a month) and I just put them in the trashcan a couple of weeks ago."
  },
  {
    "user": "Aldea",
    "rating": 3.0,
    "message": "These shoes are very cute but they arrived with dirt or mold on the back of one?? It did come off when I scrubbed with water but still for the price they could at least send a clean pair…. Definitely size up at least half a size!"
  },
  {
    "user": "martin white",
    "rating": 4.0,
    "message": "I loved the look , but the where very stiff. They gave me blisters on my heel"
  },
  {
    "user": "Pia LoSapio",
    "rating": 3.0,
    "message": "The interior of the shoe have a strange stitch or piece of fabric that constantly rubs my foot in the worst way. Also the short back make even the no-show socks slide off my foot. Kinda annoying but they are cute."
  },
  {
    "user": "Connie Niland",
    "rating": 3.0,
    "message": "I donot have it anymore."
  },
  {
    "user": "Emily",
    "rating": 2.0,
    "message": "I bought these to wear to a football game/ tail gate. By the end of the day I had blisters all over my feet. They are so stiff and the bottom of the shoes are so slippery. I really don't recommend."
  },
  {
    "user": "Julia",
    "rating": 4.0,
    "message": "They aren't super comfy but not bad. I would wear these if I wanna look cute, but not to work or walk alot in."
  },
  {
    "user": "Marcelo C.",
    "rating": 2.0,
    "message": "This shoes are just a fashion statement whenever you don-t intend to walk. Very uncomfortable as the shoe is very heavy and always slips up and down while walking, causing friction on the skin. Not true to size, they run larger."
  },
  {
    "user": "Stephanie Richardson",
    "rating": 3.0,
    "message": "Very cute shoes, but they were much too narrow.  I have an average width-slightly wide foot and they are too uncomfortable to wear."
  },
  {
    "user": "anonymous78",
    "rating": 3.0,
    "message": "I really like these platform sneakers but they rubbed my Achilles heel raw (bleeding) in less than an hour!  Now I have to wear blister band aids when I wear them.  Other than that, they are great!"
  },
  {
    "user": "patricia",
    "rating": 4.0,
    "message": "Me molestan en la parte del talón pero con una media gruesa funciona."
  },
  {
    "user": "Colorado Jan",
    "rating": 5.0,
    "message": "Cute.  Neutral. Fun."
  },
  {
    "user": "Rebecca",
    "rating": 4.0,
    "message": "They look just like the picture, exactly what I was looking for to wear with casual cotton summer dresses. They’re a bit big/loose but not enough for me to go down 1/2 size."
  },
  {
    "user": "Charley",
    "rating": 1.0,
    "message": "I have always purchased this exact shoe straight from Steve Maddens website (I have been wearing this style for over 2 years), but could not find it there anymore so I decided to purchase on Amazon. I received these less than two months ago and the sole is already starting to separate from the shoe… I have worn them no more than 10 times and this has never happened to me in the past. Sadly, it is outside of the return window so I am out a pair of shoes… do yourself a favor and buy them elsewhere."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Cute but about a half size to big, so ended up with blisters on both heels!"
  },
  {
    "user": "Courtney Sukitch",
    "rating": 5.0,
    "message": "I love the shoe and get lots of compliments on them!"
  },
  {
    "user": "Krystal",
    "rating": 2.0,
    "message": "They are so pretty but very uncomfortable."
  },
  {
    "user": "Jessica Wren",
    "rating": 2.0,
    "message": "After 7 days of high wear, the soles are separating. I just broke them in, they were uncomfortable the first 6 times as well"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I’m usually an 8 but I’m wearing a 9."
  },
  {
    "user": "Hannah",
    "rating": 1.0,
    "message": "One use and i got blisters that bleed through my socks. I only wore them to walk 2 blocks to class and back. I read reviews and heated the shoes up, wore fuzzy socks to break them in and stepped on the back of the heel but they are still so PAINFUL. They are cute but not worth the money and blisters"
  },
  {
    "user": "natalia",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "G Champion",
    "rating": 3.0,
    "message": "zero give/flexibility. if your going for looks,these are cool. not walking distance though,very stiff"
  },
  {
    "user": "Madeline Kelly",
    "rating": 1.0,
    "message": "I was really excited about these shoes because I have had two other pairs that were similar. Within 2 months these have fallen apart. The seams on one of the shoes have completely fallen apart and come undone. They are unwearable now. Do yourself a favor and purchase a different shoe. Was really disappointed."
  },
  {
    "user": "Angel Lynn",
    "rating": 4.0,
    "message": "Loved the looks but too tight for me and thats with no sock. I gave them to my daughter and they are perfect for her she wears A half size less than I do. If you get these order a half size larger"
  },
  {
    "user": "K. Callen",
    "rating": 2.0,
    "message": "Not very good quality. Wish I read more of the reviews before I purchased. Soles don’t hold up well. I’ve worn them less than a down times and they are about done."
  },
  {
    "user": "Jeffrey",
    "rating": 1.0,
    "message": "I am so sad- these are falling apart, I’ve never had shoes do this before, especially a good brand. The return window closed after 1 month, but I only wear them occasionally so I didn’t know they were poorly made until later than one month. I am so sad that Steve Madden would make such a cheap quality shoe."
  },
  {
    "user": "Alison Smith",
    "rating": 3.0,
    "message": "If you have wide feet these shoes may hurt. They are narrow."
  },
  {
    "user": "H",
    "rating": 1.0,
    "message": "Do not buy these shoes. I never review items until now... I wore these sneakers once and they were so pporly made the sole completely detached from the shoe within 30 minutes of being worn. I would never purchase this again - not even worth the $50. Poor quality. Bad experience."
  },
  {
    "user": "Shannon meyers",
    "rating": 5.0,
    "message": "Ran a lil small. But I love them. I wear them often and I'm ordering another pair."
  },
  {
    "user": "Anna",
    "rating": 2.0,
    "message": "Adorable look and feel like a good quality shoe on the outside. Bought these without reading the reviews (mistake) for a spur of the moment Disney trip. Just wearing them through the airport my feet were hurting, the shoes were heavy and felt super narrow. I had to buy new shoes as soon as I got there."
  },
  {
    "user": "Fantastic4",
    "rating": 4.0,
    "message": "This was a really cute sneaker! Loved the platform and material. I usually wear a M width but these were just too narrow for my feet. Unfortunately, I had to return them."
  },
  {
    "user": "Emma O",
    "rating": 4.0,
    "message": "I like them a lot and they fit as expected, the only thing I don’t really like is they are VERY slippery when walking on hard wood or other slick surfaces. This may improve over time the more I wear them, however."
  },
  {
    "user": "Traci Flores",
    "rating": 3.0,
    "message": "These are so so so cute but not meant for the wide foot friends"
  },
  {
    "user": "shoe lover",
    "rating": 5.0,
    "message": "I returned these. They are very heavy and not comfortable at all. Not what I expected."
  },
  {
    "user": "Karla Dominguez",
    "rating": 3.0,
    "message": ""
  },
  {
    "user": "Julia Brooks",
    "rating": 4.0,
    "message": "I love these but a little too big so size down!"
  },
  {
    "user": "Rosie",
    "rating": 2.0,
    "message": "These soles are so stiff, they slip off my foot when I walk and rub my ankles, take my socks off my heel. And they rub my pinky toe and 4th toe. Just suffering injuries and I only went two places. The material as you can see in other reviews is like a stiff canvas type of material. No padding on the outside of the foot. I feel like these were just made to look like the plain platform white sneaker you want but they’re not made to be walkable. Which is the point of buying a sneaker. I don’t ever leave bad reviews, but I’m mad I paid regular shoe money for a shoe that isn’t made to walk in. I want my skin and my money back lol"
  },
  {
    "user": "Iheartbubblz",
    "rating": 2.0,
    "message": "I ordered my normal size (8) and they’re huge. I wore 2 pairs of ankle socks and they still slip up which is causing a blister. Also, I’m not really sure why the sole’s have what seems to be felt on them. They’re slippery AF. Disappointed. They look cute, but that’s about it…"
  },
  {
    "user": "allie",
    "rating": 2.0,
    "message": "Such a cute pair of shoes. Living for the platform look! but they are so incredibly uncomfortable and slippery that I don’t think I will ever be able to wear them unless just for pictures. I would have returned them, but missed the return window🤦🏼‍♀️"
  },
  {
    "user": "Taylor Noe",
    "rating": 3.0,
    "message": "The shoes I received are great quality and match the picture, but entirely incorrect size. I am a 7.5 and these fit like a 6, if not smaller."
  },
  {
    "user": "Allison Gillies",
    "rating": 5.0,
    "message": "I’m normally a size 7.5 but went with a size 8. So happy that I did!! Steve Madden usually fits a bit tight & has left me with painful blisters. Sizing up left a little wiggle room for the breaking in process.  I’m 5’4” and I absolutely love the platform for a chic casual look. 10/10 recommend"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "message": "I love the look but definitely a hard shoe inside."
  },
  {
    "user": "CC",
    "rating": 3.0,
    "message": "Way too small"
  },
  {
    "user": "Amber700",
    "rating": 2.0,
    "message": "I had these shoes in my cart for quite some time until I finally pulled the trigger to order. Spending $50 on cheap shoes is annoying, but they were cute, so I wanted them. I normally wear a size 9, but with sneakers I like to go up to 9 1/2 to accommodate a sock and be roomy. So I ordered these in 9 1/2 & I couldn’t even get them on!! They are made so poorly, that they can’t even get that right. Back they go and I will look for a better quality shoe"
  },
  {
    "user": "Sara",
    "rating": 5.0,
    "message": "I love them! They’re super cute, and exactly what I was looking for. SIZE UP!!!! I only went up a half size which is fine, but I think next time I’ll go up a whole size. I got the white pair, and think I’ll buy the tan ones as well!"
  },
  {
    "user": "Duchess117",
    "rating": 1.0,
    "message": "The soles of these super cute platform sneakers are separating from the shoe after ONE wear!! Not only do they separate, they also split in weird places. I love Madden shoes and am HIGHLY disappointed at what’s happening—thank God for Gorilla Glue in a pinch—it’s the only thing holding the shoe together!! I love these type of sneakers to wear to dress down sundresses, capris, and skirts. Not sure if I’ll be going Madden anymore. Returning items is something I do NOT have the time or patience for so I’ve ordered another similar style from Kors. Hopefully other people aren’t experiencing this. I’m bummed—this is my very first negative review on anything I’ve purchased through Amazon."
  },
  {
    "user": "Frequent Shopper",
    "rating": 2.0,
    "message": "I really tried to like this shoe. I ordered it in different sizes. Unfortunately, none of them panned out, including the larger size shoes. All were very narrow. The inner seams would rest on the bone of the large toe AND the skin just above the small toe.  ..... In general, it's a cute shoe, but need a true medium width to fit well and be comfortable."
  },
  {
    "user": "martha iris",
    "rating": 3.0,
    "message": "Deben comprarse un medio numero más, uso el 6.5 y no no me lo he podido poner, demasiado apretado"
  },
  {
    "user": "Abigail Scarff",
    "rating": 1.0,
    "message": "These shoes were so cute when they arrived, but the canvas started pulling away from the sole the first time I wore them. The visible damage looks trashy and detracts from the look of the shoe so, unfortunately, I haven’t worn these much since. Disappointed in the quality and would not recommend."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "pinches my toes but very cute"
  },
  {
    "user": "GLW",
    "rating": 2.0,
    "message": "Thought these shoes would be really cute and had high expectations. Tried them on and was disappointed that they were an entire size too small. It was difficult to tell if they’d even be comfortable in a size that did fit."
  },
  {
    "user": "add",
    "rating": 1.0,
    "message": "I don't know why the put a emblem button on the heel of shoe it rubs against ankle bone cause blisters."
  },
  {
    "user": "Jizzica",
    "rating": 2.0,
    "message": "It’s a cute design, but my heel slides out every time I walk and it’s not comfortable. The platform is super high and doesn’t leave much room for the heel to stay inside the actual shoe. The problem area is the heel part - there’s just not enough room for my heel to stay in the shoe. It’s just a weird fit overall. I love Steve Madden and this shoe was very disappointing /:"
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Shoes started separating from the sole after one wear. I tried to fix them with super glue and hot glue but it doesn’t work well on the material and won’t hold. Save your money."
  },
  {
    "user": "jen",
    "rating": 1.0,
    "message": "Shoulda read the reviews prior to purchasing.  I normally wear an 8 in boots and 7.5 in shoes, including sneakers, & sandals. I ordered a 7.5 but, struggled to cram my foot into them just to see how they'd look & if it was worth going up a size.  Well, I don't think it is.  I always said Steve Madden must hate women as I've never found a comfortable pair of shoes in that brand.  I was shocked to find he can even design a canvas sneaker to be too painful to wear!  It's too bad because they're super cute with the outfit I ordered them for & even look like they'd be cute with other outfits.  I think they'd be terribly uncomfortable even in a larger size.  There was just no flexibility to them.  Disappointing but reminds me to steer clear of this brand in all shapes & forms!!"
  },
  {
    "user": "Arocr",
    "rating": 1.0,
    "message": "These are the most uncomfortable shoes I’ve ever owned. I’ve worn them once and can’t bring myself to wear them again. They are very narrow shoes so that alone wasn’t fun. Then as your walking your heel slides out causing blisters in the back. Thought about getting a smaller size but knew they would be too small. My friend who has the same pair said the same thing happens to her and she has to wear think ankle socks. So not cute. But I have in due to the pain and had to buy me socks at target while I was out because my no show socks weren’t cutting it. By the time I got home my feet were cramping and in so much pain."
  },
  {
    "user": "Jane",
    "rating": 1.0,
    "message": "They run so small. I can’t walk with them for 10 mins the back of my heels starts bleeding"
  },
  {
    "user": "Taylor Dall",
    "rating": 3.0,
    "message": "Very cute but the shoe is hard where the heel sits. Heel rubs and just not comfy at all."
  },
  {
    "user": "RD",
    "rating": 3.0,
    "message": "I like the look but I ordered a size 10 cause i’m a 9.5 and what came fits like an 8.5 which makes no sense. I cant even wear them with socks. I tried to break them in but no..i’m just going to return them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these on a whim. Ive been wanting white converse, but saw these and absolutely love these. I got them delivered and wore them the next day! They are very versatile, and run a tad big. I wear mine with no show socks and still slipping off my heel a tad."
  },
  {
    "user": "pvw",
    "rating": 2.0,
    "message": "Normally wear a 7 - got a 7.5 and it is very narrow & a bit too short.  I need to return."
  },
  {
    "user": "Carly Duvet",
    "rating": 2.0,
    "message": "These shoes while cute and fitting properly in the front tore up my heels. I had the worst blister in my life and lost all the skin on the back of my ankle about 2 hours into wearing them"
  },
  {
    "user": "Rebecca Weber",
    "rating": 2.0,
    "message": "These shoes look great but they are so uncomfortable that I can’t wear them!"
  },
  {
    "user": "Margaret Holz",
    "rating": 1.0,
    "message": "I wore these shoes 3 times and rubber platform ripped away from the shoe.  I’m disappointed that I barely got any wear out of them."
  },
  {
    "user": "Michaela",
    "rating": 4.0,
    "message": "Definitely invest in some nonslip socks, however, these shoes are super cute and worth it!"
  },
  {
    "user": "Erica Hester",
    "rating": 2.0,
    "message": "These are the most uncomfortable shoes I’ve ever worn!! I was so disappointed cause they are super cute and I love the platform, but they are extremely narrow and stiff and have no cushion at all. After a day of wearing them at work my feet had blisters and were so so sore. I would not recommend these shoes to anyone."
  },
  {
    "user": "Karen Moore",
    "rating": 5.0,
    "message": "Comfortable and true to size! These shoes look great with almost anything you wear."
  },
  {
    "user": "lori",
    "rating": 2.0,
    "message": "My second try,  slightly different style, same issue.  The shoes are too narrow at the toe, while at the same time slipping off my heal.  I didn't know whether to give a star for too small or too large as BOTH are a problem at the same time.  The quality seems nice, but No more Steve Madden shoes for me.  I don't have this problem with other name brands....ever!"
  },
  {
    "user": "Michele MacVicker",
    "rating": 5.0,
    "message": "I almost returned them, but they’re so cute that I really wanted it to work. I realized thinner socks were a must. I love them."
  },
  {
    "user": "Debra Francis-Miller",
    "rating": 3.0,
    "message": "Fit is tight but the left heel slides out. Very uncomfortable"
  },
  {
    "user": "CT",
    "rating": 2.0,
    "message": "Wish I returned these. I feel like I’m going to twist my ankle in them whenever I wear them. There’s no support and the bottom is so heavy and the cloth is flimsy so it’s easy for the foot and ankle to roll in them. They are cute if you’re just wearing them for pictures. Otherwise they are impractical"
  },
  {
    "user": "AC Russell",
    "rating": 5.0,
    "message": "Im in love, super cute! I normally wear a 8.5 but bought a 9 just cause I know their shoes run smaller and they fit perfectly!"
  },
  {
    "user": "sheila",
    "rating": 5.0,
    "message": "Very comfortable for a teenager which is who I purchased them for. Don’t know About my feet but I would try them with an Insole but they are not flexible."
  },
  {
    "user": "ShaynaBMatisohn",
    "rating": 3.0,
    "message": "I suggest getting 1/2 size bigger then you usually would. These shoes are so cute, but leave the WORST blisters!"
  },
  {
    "user": "Gabi",
    "rating": 1.0,
    "message": "I bought these shoes for my bachelorette party in Nashville. Wore them to walk to brunch and I literally had to switch shoes with another one of my bridesmaids because my feet were destroyed (huge blisters on heel and toe and started bleeding). My bridesmaid dresses said she would switch shoes with me because she’s used to that and at least we could make it to the restaurant. By the time we made there her feet were the same as mine. We had to uber the rest of the trip because we were limping and slow following. Really disappointed. Most of my shoes are Steve Madden because the style and comfort are amazing but these were a whole different experience"
  },
  {
    "user": "Jasmine Rodriguez",
    "rating": 2.0,
    "message": "Honestly, 2 stars because they are really cute but I don’t think they’re worth it. They were really painful, I got bad blisters, I couldn’t stand to walk with them anymore that I had to take them off to walk back to car from work."
  },
  {
    "user": "Brenda S.P.",
    "rating": 1.0,
    "message": "So disappointed. Very cute but very, very small. Rivet cuts into my heel. Toe are smashed and painful."
  },
  {
    "user": "kaleo moku-greaser",
    "rating": 5.0,
    "message": "So cute, just like late 90's early 2000 platform tennis shoes, canvas top. Rubber sole. Narrowness but I have wide feet and just went up a size."
  },
  {
    "user": "Emily A.",
    "rating": 2.0,
    "message": "The shoes look really cute and fit pretty true to size but I’ve worn mine for about a day and the lining connecting the sole to the shoe upper is already ripping and the sole had already started to squish in on one side of the right shoe. They are just over all super cheaply made. Which is understandable for the price but I definitely thought I’d get more than one wear out of them before they started falling apart"
  },
  {
    "user": "Felicia Navarrette",
    "rating": 5.0,
    "message": "Matches everything & true to size!"
  },
  {
    "user": "MURTADHA",
    "rating": 1.0,
    "message": "Third time wearing them and the show has really come apart the heel got unglued from the plastic today they’re really not worth it so disappointed."
  },
  {
    "user": "ReddSunnSett",
    "rating": 5.0,
    "message": "I didn't know they were Steve Madden's Evan better the quality of the shoe is great"
  }
]