[
  {
    "user": "Annette Blake",
    "rating": 4.0,
    "message": "I have purchased these shoes many times for my husband in the past, the price keeps going up on this particular color. If you don't need a certain color, I would purchase the cheaper ones. (They are about half the price of this color.) This time when I received the shoes after a few days of him wearing them they began making a clicking sound every time he stepped. (Very annoying and disruptive in the workplace) I thought maybe something had gotten in the tread. We cleaned them and this did not resolve the issue. I could not return them because he had worn them. I had to purchase a second pair within a week of ordering the first pair. Very frustrating since they are over $100 pair. Hopefully you'll have better luck then us."
  },
  {
    "user": "Chuck J.",
    "rating": 5.0,
    "message": "These are nice shoes, and are of typical Nike quality. They fit well and are true to size."
  },
  {
    "user": "Patti F.",
    "rating": 5.0,
    "message": "I bought these for my husband and every-time he wears them for walking he says they are the best pair he’s ever had."
  },
  {
    "user": "Lowbee",
    "rating": 5.0,
    "message": "Looks are great. Very comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very nice sneaker.  Fits well. Lightweight."
  },
  {
    "user": "Juan Camilo Higuera Reyes",
    "rating": 5.0,
    "message": "It’s perfect"
  },
  {
    "user": "Sergio barragan",
    "rating": 4.0,
    "message": "Cheap"
  },
  {
    "user": "700R Prout",
    "rating": 5.0,
    "message": "Was very pleased with the product I recieved"
  },
  {
    "user": "Frank M.",
    "rating": 5.0,
    "message": "For the price, these shoes were very cheaply made, they were worn by a person with a sedentary lifestyle, no hard usage, but in eight months of wear they're falling apart, first the logo started to peel, and now the seam is seperating, very disappointed with serious lack of quality!"
  },
  {
    "user": "Mo",
    "rating": 5.0,
    "message": "Comfortable and lightweight"
  },
  {
    "user": "Deb",
    "rating": 5.0,
    "message": "Comfortable all day long. Perfect for work."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Light weight"
  },
  {
    "user": "Mirna",
    "rating": 5.0,
    "message": "Muy cómodos muy feliz mi esposo ❤️😍"
  },
  {
    "user": "H. Riemenschneider",
    "rating": 5.0,
    "message": "This is my third pair of these shoes.  They last much longer than other tennis shoes I have owned in the past and are light weight and comfortable."
  },
  {
    "user": "james",
    "rating": 5.0,
    "message": "fits fine. good cushioning"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Justo lo que pedí, excelente!! a Tiempo!!"
  },
  {
    "user": "Trinh T Tran",
    "rating": 5.0,
    "message": "Light and comfortable"
  },
  {
    "user": "Pam",
    "rating": 4.0,
    "message": "The upper part of the shoes too hart and hurt the lower leg."
  },
  {
    "user": "Vernon Brady",
    "rating": 5.0,
    "message": "Light-weight"
  },
  {
    "user": "extra money",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "cod",
    "rating": 3.0,
    "message": "This particular Nike is a little on the hard side. Meaning, there is not as much cushion in the heel when walking, jogging or running as other Nike running shoes on the market."
  },
  {
    "user": "JB",
    "rating": 4.0,
    "message": "Tight fit"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These Nikes are good quality, light weight, well made and exactly what I was looking for. The mesh uppers let your foot breathe. The soles provide good traction for walking or working out. I haven't experienced any of the \"popping\" sound some of the other reviewers mentioned. Good shoes for the $$$."
  },
  {
    "user": "Gary Weiss",
    "rating": 5.0,
    "message": "Fit so well I bought a second pair!"
  },
  {
    "user": "Michele",
    "rating": 3.0,
    "message": "While my son is happy with the fit and comfort, the soles are already separating from the body of the shoes after 6 weeks. He wears them for 3-4 hours a day, so I wouldn’t say that the use is out of the ordinary.  I understand that these are a low-price model of Nike, but I  expected them to hold up longer."
  },
  {
    "user": "Ian",
    "rating": 4.0,
    "message": "Overall, it's a good-looking pair of running shoe my kids encouraged me to purchase it. All previous running shoes are size 11 unfortunately Nike 11 squeezes my toes, the front is narrow in hindsight I should have bought size 11.5"
  },
  {
    "user": "Jerry Grimes",
    "rating": 5.0,
    "message": "Athletic shoes are so often overpriced, it’s hard to find a name brand that looks decent, is well made and will hold up. These fit the bill. Not stylish or trendy, but also not homely, these go with most of my workout and casual clothes."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Shoes are light and have good ventilation. Comfy once worn a couple of times. Ordering them in black too"
  },
  {
    "user": "Yvette Grier",
    "rating": 5.0,
    "message": "I like these Nike sneakers this is a good brand I have another pair that I got from JCPenney's so happened I looked up and got these"
  },
  {
    "user": "Eric M. Cavanaugh",
    "rating": 5.0,
    "message": "Very true to size fit.  Very comfortable.  Great shoe for workouts."
  },
  {
    "user": "Mark",
    "rating": 3.0,
    "message": "After wearing the new Nike revolution 5.. I am disappointed  compared to Nike revolution 3. I do like the weight of Rev. 5 but the comfort rating has dropped and the 5 shoe feels tighter on my feet all be it the same size as the 3 was. The Rev 5 has a plastic type bottom sole compared to a rubbery on the Rev 3 which to me was better."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Overall satisfied"
  },
  {
    "user": "Rodolfo Alfredo Hernandez Vasquez",
    "rating": 5.0,
    "message": "I IIKE THAT THESE SHOES ARE COMFORTABLE BECAUSE THEY ARE MESH."
  },
  {
    "user": "Sandra Lanier",
    "rating": 5.0,
    "message": "They fit perfectly."
  },
  {
    "user": "Geraldinecothron",
    "rating": 5.0,
    "message": "Order 2 pairs by mistake need u to mail me a return slip we don’t have a ups around here. But he loved the shoes he kept. So please mail me a return slip. Thanks so much"
  },
  {
    "user": "Rolando P. Castellon R",
    "rating": 5.0,
    "message": "La calidad del producto es excelente, quizás el tema a mejorar son las tallas. Razón por la cual tuve que regresarlos 😭"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "جميل جدا"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "These shoes are hard to find in stores in this color combo. Not able to find size on Nike website. So glad we found them here. Just like shoes bought thru Nike. So everything was as expected"
  },
  {
    "user": "G.",
    "rating": 4.0,
    "message": "I do not use the shoe for running but its everyday durability and comfort are excellent. What's really weird about the shoe is that this tread design (I own three pairs) creates a clicking noise as I walk, perhaps a popping after some suction action on a hard floor. But since I use the shoe for everyday, it is unlikely to be a problem for a runner."
  },
  {
    "user": "Eugene Green 3rd",
    "rating": 5.0,
    "message": "This pair of shoes match well with a track suit that I've had for years. Super lite and comfortable, being my left ankle swells, and I had never tried on a pair before. So comfortable that I forgot I was still wearing them once I was back home."
  },
  {
    "user": "Kevin Marc Roberts",
    "rating": 4.0,
    "message": "After almost year of running over 1300 miles I finally had to replace these bad boys. The photos are after a year of use. I just washed them because they were dirty. Now they will be my daily shoes to wear to the store or work. Great for running. Will buy again when they are back in stock."
  },
  {
    "user": "Foster Donovan",
    "rating": 4.0,
    "message": "Nothing fancy but works very well for running on trails etc. So far they have lasted longer than other running shoes I previously bought."
  },
  {
    "user": "Gian Carlo Molinari",
    "rating": 3.0,
    "message": "Not so comfortable"
  },
  {
    "user": "Lane Orion Cannon",
    "rating": 3.0,
    "message": "They were advertised to be extra wides and when I received them they were too narrow."
  },
  {
    "user": "James Siefert",
    "rating": 5.0,
    "message": "Sneakers is for everyday use, comfortable, very much like the blue color & satisfied"
  },
  {
    "user": "Shenita Johnson",
    "rating": 5.0,
    "message": "Bought these for my Son. He wears them frequently. They were true to size. They fit very well and are comfortable. Good product for the price. Well worth it.  My Son is really getting my monies worth plus some."
  },
  {
    "user": "The All-Seeing I",
    "rating": 5.0,
    "message": "I'm not sure why I care how my feet look as I jog past total strangers, but these Revolution 5 running shoes make me feel like I pop off the page when I pound pavement. They look so good -- so streamlined and uncluttered, with the iconic Nike swoosh, a color scheme that channels the original Air Jordan shoe, and a projection of class and timelessness in an era of obnoxiously loud shoe designs. What I didn't expect at this low price point is a light, breathable, elite-performing running shoe: They offer the ample cushion I now need after a period of conspicuous consumption, and feel spring-loaded as they push back against the road or sidewalk. Fit is true to U.S. sizing with no sore feet in the break-in period. An elite running shoe in every way, and the fact they're half the price of what I'm used to spending is a massive bonus. - (Was this review of use? If so, let me know by clicking \"Helpful.\" Cheers!)"
  },
  {
    "user": "Randy Gooch",
    "rating": 4.0,
    "message": "Overall a good shoe"
  },
  {
    "user": "Busy Mom",
    "rating": 5.0,
    "message": "Prefer this show more for fashion than working out. Looks nice and are comfortable. Quality made."
  },
  {
    "user": "Hope M.",
    "rating": 5.0,
    "message": "The item is in good condition and meets the purpose for which l bought it for."
  },
  {
    "user": "Nianli Sang",
    "rating": 5.0,
    "message": "My feet are naturally wider than regular ones, so it is difficult to find a pair of comfortable fit. This is a great pair! Thanks!"
  },
  {
    "user": "Shauna Garrard",
    "rating": 4.0,
    "message": "I have always had a hard time finding shoes that are supportive for working out.  I also, have wide feet and men’s shoes seem to fit me better than women’s sizes.  When I was younger I injured my tailbone and hip and I have a harder time with not being in back pain when I walk long distances. I liked the look and feel of these shoes because they had a knit cloth, not the leather that pinches my feet together around my toes.  When I received them, I took them on a trial and walked in the for awhile.  These shoes do have some support, however, they have memory foam in them which was not supportive enough for my knees or my back."
  },
  {
    "user": "Alex Pinson",
    "rating": 2.0,
    "message": "I buy the Nike Tanjun almost religiously as a workout shoe. When I couldn't find any in stock in my size I ordered these, as they seem to be the closest shoe Nike offers. They are decent shoes as far as function goes, but they will NOT stop squeaking with every step (even after 6 months of wear). Even on carpet the shoes squeak with each step. I was also sent the wrong size shoe. I noticed some discomfort while wearing these in the first week, and upon looking saw that the right shoe was a 12 instead of a 13. I assumed I got sent a box of 12s, but upon closer inspection I received two shoes of completely different sizes."
  },
  {
    "user": "Heidi",
    "rating": 5.0,
    "message": "Maximum comfort with perfect support and sleek styling for walking on smooth, even surfaces like hardwood floors and looking good. I wear these shoes most of the day- at my desk job, shopping, cooking, airports and flying, commutes, watching kids at sports practice, and so on. These shoes do not have adequate structure/support for working out (tennis, bball, aerobics) or walking on uneven surfaces (trail walking); for those activities I use other more supportive shoes."
  },
  {
    "user": "Des & Rich",
    "rating": 4.0,
    "message": "I ordered a 7 XWide for my son knowing Nike runs narrow, to begin with, and the size 7xw fits him the same as his old pair of Nikes in size 6 with NO extra width to them.  So pointless to order any wide or extra wide. Other than that they're nice shoes and lightweight."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "A bit expensive but it's a comfortable shoe. It's my 2nd pair."
  },
  {
    "user": "Fourth Grade Teacher",
    "rating": 5.0,
    "message": "Ordered for my SIL who works out and lifts.  He previously had a pair of these that he wore until the treads were gone.  True to size.  Great support for running (treadmill), lifting, and other cardio.  His feet are neither narrow or wide."
  },
  {
    "user": "Brandon Ellis",
    "rating": 5.0,
    "message": "comfortable for working on your feet for 10+ hours"
  },
  {
    "user": "Kosmomiles",
    "rating": 3.0,
    "message": "Well, about a month in, there is a clicking coming from the sole of one of the shoes when pressure is put on it.  So that sucks."
  },
  {
    "user": "Christaynium",
    "rating": 5.0,
    "message": "So far day to day use it has been good. I ran them in today after the break in period and so far they are comfortable and have no injuries yet. They have nice air flow and this far have been easy to clean."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These were a birthday gift for my grandson and are too small. We returned to for a refund and are still waiting on refund. How long does it take to get refunded? Ordered another pair and have received that pair and he's enjoying them."
  },
  {
    "user": "Robert D. Matthews",
    "rating": 5.0,
    "message": "Really needed some comfortable shoes and I've bought these before. But, with the two local stores closing that I used to buy from - it was time to go online. Not crazy about buying clothes online in case of picking the wrong size - but these shoes fit perfect !!"
  },
  {
    "user": "Tom",
    "rating": 5.0,
    "message": "Ordered these for my trip to the USVI and they were exactly what I was looking for........Light weight, comfortable and highly recommended.........!"
  },
  {
    "user": "Brent Buell",
    "rating": 5.0,
    "message": "Extremely comfortable"
  },
  {
    "user": "Jason Torres",
    "rating": 4.0,
    "message": "Bought them for my son. He loves them."
  },
  {
    "user": "michael",
    "rating": 4.0,
    "message": "It is a good work out shoes."
  },
  {
    "user": "Shiki Dixit",
    "rating": 5.0,
    "message": "Liked it!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these shoes a couple years ago and loved them! I ended up messing them up and bought the exact same pair again because they fit perfect and you can put your feet in them too"
  },
  {
    "user": "JSO Wood Veneer & Edgebanding Products",
    "rating": 5.0,
    "message": "Surprised how good this shoe is! Love it!"
  },
  {
    "user": "Vince R.",
    "rating": 2.0,
    "message": "The right foot of this particular pair of shoes began to pop and click when I walked a few days after I received them. Other than that, the shoes wore and fit well. I ended up returning for a refund.  A previous pair I had a did not do this."
  },
  {
    "user": "Jim",
    "rating": 5.0,
    "message": "I’m not a marathon runner and in fact I’m far from it, run about 2 miles 4-5 days a week and was looking to replace my current new balances but wanted to try something new because all I buy are NB’s. These shoes, to me, were stunning. Minute I put them on, felt comfortable, light, but the sole is deceivingly thick. But not so much that it feels like your trucking around in some basketball shoes. These also on an aesthetic level...god do they pop. I knew they were fresh as hell the moment I put them on but I got 5 compliments the first day I wore these around just to break them in. Probably going to get another pair just for walking around. I’m not some expert runner so there may be flaws to my untrained eye but I am beyond impressed with these. I go around to different brands with different athletic gear and I always wind up in one way or another going back to Nike. They’ve always had superb products and they are still at the top of their game with these shoes."
  },
  {
    "user": "Kimberly C.",
    "rating": 3.0,
    "message": "These fit well but the shape is a little off. Yes, when I look down at my shows the toe of the left shoe is shaped slightly differently from the right. Also, they squeak. I can’t believe the soles squeak when I walk. Even though they’re comparable in price to the amount I’ve paid in the past for the Downshifter series , I’ve had 7 and 9, these Revolutions aren’t nearly as supportive and comfortable."
  },
  {
    "user": "lil dean",
    "rating": 5.0,
    "message": "My favorite show for anything."
  },
  {
    "user": "crazy chino",
    "rating": 5.0,
    "message": "Love this shoes comfortable and light"
  },
  {
    "user": "Misskey",
    "rating": 4.0,
    "message": "Great price purchase for my 11yr old son he’s in a mens 8.5 n they for great"
  },
  {
    "user": "Kim O.",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Wil from Wimauma, FL",
    "rating": 5.0,
    "message": "The shoes are very comfortable and bring quite a bit of gel support for my arthritic knees for walking and casual wear.  The design is stylish and classy, but not overstated.  In addition, it was great to find pretty good shoes for under $100.  Thanks Nike!  Wil from the Tampa area."
  },
  {
    "user": "Barbie",
    "rating": 5.0,
    "message": "Fits my husband perfectly"
  },
  {
    "user": "Brandon",
    "rating": 5.0,
    "message": "The only thing I wish Nike would do .. make these slip resistant for service industry! Untapped market , I buy slip covers for my nikes but honestly how hard would it be to make the treads slip resistant?"
  },
  {
    "user": "Jay",
    "rating": 5.0,
    "message": "I love the price and size, great shoe"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Let me start with I run a fair amount, usually five times a week totaling approximately 20ish miles. When I first received these shoes I was not happy with what I got. When I put them on there were gaps under the laces where you could see your socks, the tongue didn't cover all the way and it was very visible since they were black shoes. Maybe I have high arches or something but I was less than pleased, and then I went for a run. I can still see my socks but they are now my favorite running shoes, very comfortable, light and the sole design works very nicely for a heel to toe stride. I plan to buy another pair in a different color."
  },
  {
    "user": "Alejandro FAguaga",
    "rating": 5.0,
    "message": "livianos, comodos, muy buenos"
  },
  {
    "user": "Lidia Maldonado",
    "rating": 5.0,
    "message": "These are great. Bought them as a gift for my husband. He’s gonna love them. Comes in original Nike Box."
  },
  {
    "user": "Katrina C.",
    "rating": 5.0,
    "message": "I purchased issues from my husband and the normal size of he wears. They fit him perfectly and I will definitely buy again."
  },
  {
    "user": "carmax1423",
    "rating": 5.0,
    "message": "Se ven cómodos, pero los pedí equivocados, me quedaron súper grandes"
  },
  {
    "user": "PCR25",
    "rating": 1.0,
    "message": "I have been a lifelong Nike customer  - especially for shoes. I purchased these off of amazon as a replacement to a well loved pair of old nike running shoes. I liked them because they had a lot of options in wide sizes and I really liked the black/anthracite color combo. I wore these probably 4-5 days a week doing 4 mile walks on paved roads, and for the first 3 months of ownership they were wonderful. Fit perfect, comfortable, stylish - all that I've come to expect from Nike. However, after about the 3rd month of wearing these both shoes developed holes right at the achilles tendon and there were these razor sharp plastic pieces poking through the shoes (see pictures, hard to see, but there is a white plastic part poking through the back). This pretty quickly made these shoes unwearable as the plastic was digging into my skin. I figured something has to be defective here, why would BOTH shoes develop these holes in the exact same spot from what I would consider light use for running shoes. Unfortunately, 3 months is just outside the amazon limit for returns so I turned to Nike expecting them to remedy this for me, I filled a claim through their customer support system and paid to send them the shoes back. about a week and a half later Nike told me that this was \"wear and tear\" and that they would not return / refund / exchange the shoes - I escalated the issue and asked for another review, which was AGAIN rejected and I was told it's wear and tear. So ultimately, I ended up out 80 bucks for the shoes, 10 bucks to ship them to nike for essentially 3 months of light use. This is NOT how I would expect a brand I've been loyal to for years to handle it's customers or it's products. Needless to say, after nike returned my shoes to me, I promptly threw them (and my 90 dollars) in the trash and order some Under Armour Infinite running 2's. Sadly, this is likely my last nike product, I can't purchase products from a company not willing to stand behind its brand. I'd highly recommend avoiding this shoe, unless u like sharp plastic :)."
  },
  {
    "user": "Jose",
    "rating": 5.0,
    "message": "Para hacer ejercicios"
  },
  {
    "user": "East Atlanta Guy",
    "rating": 5.0,
    "message": "It’s been 30 years since I bought a pair of Nike shoes. I’ve always wanted a pair of fire engine red sneakers, but was never able to find the right color red…… until I bought these. I have multiple pairs of Reebok sneakers, which I love, but I was never able to find the true red I was looking for until I bought these. They are light weight, fit perfect in every way."
  },
  {
    "user": "Miguel Garcia",
    "rating": 5.0,
    "message": "Hacer ejercicios"
  },
  {
    "user": "AJ  Bolino",
    "rating": 4.0,
    "message": "I love these. Train in them every day. But…if you are a 4-5 mile a day person and you run on the street…the tread will wear in about 3-4 months. Light, comfortable, and they fit well, but if you put them to work, they’ll wear out on you."
  },
  {
    "user": "Christopher Webb",
    "rating": 5.0,
    "message": "The wide width is true to size and these shoes are lightweight and comfortable to wear.  Only knock is that there isn't much toe support so when you are kneeling down and your foot is behind you the toe top can scuff easily in that position."
  },
  {
    "user": "Fred Miller",
    "rating": 5.0,
    "message": "I just got the shoes.  So far, so good."
  },
  {
    "user": "Lawrence D. Brown",
    "rating": 5.0,
    "message": "love the way the tennis fits and look."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I run or bike every day for hours. I usually go with Nike or Adidas. Just got these in, tried them on. They look great and are super comfy. Some of the reviews complained about a clicking noise, I have no clue what they are talking about, but I'm buying a second pair for when I'm not working out. I got the all black color."
  },
  {
    "user": "Old Shopper",
    "rating": 4.0,
    "message": "The media could not be loaded. I like them."
  },
  {
    "user": "S Brigham",
    "rating": 5.0,
    "message": "The size, the fit and the look are great"
  },
  {
    "user": "J M Lambros",
    "rating": 5.0,
    "message": "Runs small"
  },
  {
    "user": "CocoLoco",
    "rating": 3.0,
    "message": "These were too small. We had to return. Very tight fit for my hubs and he has a narrow foot. I suggest buying a size up."
  },
  {
    "user": "Jerry Roberts",
    "rating": 5.0,
    "message": "So COMFORTABLE!!"
  },
  {
    "user": "Maria D. Arriaga",
    "rating": 3.0,
    "message": "These are amazing shoes, yet apparently some factory defect and my right shoe has a little “spike” on the outer side that really bothers as it rubs against the ankle bone. I may need to add an extra sole to raise my feet to prevent this, or use very thick socks, unfortunately I live in a tropical hot weather 😅"
  }
]