[
  {
    "user": "ye",
    "rating": 4.0,
    "message": "after only a couple of months the 'leather' is cracking all around and the shoes look very old and worn. they were comfortable for a wider foot but didn't hold up well at all."
  },
  {
    "user": "Rory",
    "rating": 5.0,
    "message": "These were not comfortable at first but they got fine after several times wearing. They’re now comfortable and cute. Still wouldn’t want to wear like a good long walking shoe."
  },
  {
    "user": "Lucía Sosa",
    "rating": 5.0,
    "message": "Ya los voy usando un mes. Súper cómodos. Me encantaron."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very confy and looks great."
  },
  {
    "user": "Zennick",
    "rating": 5.0,
    "message": "Great sneaker and very comfortable. However it does run small so I would recommend going up a size."
  },
  {
    "user": "Denny Rojas",
    "rating": 5.0,
    "message": "The shoe is really nice, great quality for the price. It's a bit small so I'd go half a size up or just chage the insole for a thiner one"
  },
  {
    "user": "Ras Makonnen",
    "rating": 5.0,
    "message": "It's very attractive and affordable"
  },
  {
    "user": "Mozart",
    "rating": 5.0,
    "message": "Although this shoes is not that comfortable, it is so pretty."
  },
  {
    "user": "Clyde Huvler",
    "rating": 5.0,
    "message": "My daughter watches Stranger Things she decided to go full 80’s with these 😂 she loves them and they fit amazingly."
  },
  {
    "user": "BKB",
    "rating": 5.0,
    "message": "Definitely wort the money I spent for it!"
  },
  {
    "user": "Ila",
    "rating": 5.0,
    "message": "Ambos muy cómodos, las botas y los tenis"
  },
  {
    "user": "Titi Santos",
    "rating": 5.0,
    "message": "The media could not be loaded. Súper buenos excelente calidad y comodidades"
  },
  {
    "user": "jm84",
    "rating": 5.0,
    "message": "They are exactly what I was looking for and exactly what Is pictured! I love them!!! I got my size and they fit wonderfully!! Great buy! Not to mention they came less than 24 hours after I ordered them!!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I purchased these exact shoes in white and they were so comfortable that I had to get these in other colors. The black/white ones didn’t fit the same as the white ones although they were the same size but they were still very comfortable!"
  },
  {
    "user": "A. Compton",
    "rating": 3.0,
    "message": "I need a bigger toe box"
  },
  {
    "user": "Traci Woods",
    "rating": 5.0,
    "message": "Perfect for jeans, shorts and sundresses. Love the comfort and style."
  },
  {
    "user": "Margauxr",
    "rating": 3.0,
    "message": "Cute. Leather.  Slight platform.  Run one half size too small.  I am a 7.5 M but these are just too short; they fit like a size 7."
  },
  {
    "user": "Stephanie pipp",
    "rating": 5.0,
    "message": "I wear them with my skirts / shorts and denim!"
  },
  {
    "user": "Amanda B",
    "rating": 3.0,
    "message": "Cute, but on the narrow side so not very comfortable."
  },
  {
    "user": "Ofelia Almeida",
    "rating": 5.0,
    "message": "I love these shoes. They are so comfortable and stylish!!"
  },
  {
    "user": "Angie Rodriguez",
    "rating": 5.0,
    "message": "Muy bellos"
  },
  {
    "user": "Elbayera",
    "rating": 5.0,
    "message": "Espectacular"
  },
  {
    "user": "Rachel Greenblatt",
    "rating": 5.0,
    "message": "Very happy with this purchase! Great price and very comfortable!"
  },
  {
    "user": "Anna Hurdle",
    "rating": 3.0,
    "message": "These shoes are cute, but they are not platform sneakers."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "For a platform sneaker, it is not very platformed. But it is a great sneaker"
  },
  {
    "user": "HappilyEllaAfter",
    "rating": 5.0,
    "message": "Love the classic look. Super comfortable. I wear them everyday, all day and absolutely love them. Fit as expected and price was right."
  },
  {
    "user": "Laura Gomez",
    "rating": 5.0,
    "message": "Tenis muy lindos y cómodos"
  },
  {
    "user": "Monique Camoza",
    "rating": 5.0,
    "message": "Just like I remember"
  },
  {
    "user": "Laura Johnson",
    "rating": 4.0,
    "message": "Well made, comfortable and stylish. Fit as expected."
  },
  {
    "user": "Maria Yrene Sierra",
    "rating": 5.0,
    "message": "They are really comfy"
  },
  {
    "user": "Anna G",
    "rating": 5.0,
    "message": "It fits perfectly and they are so comfortable and stylish. :) Love it so much!!!"
  },
  {
    "user": "Daphne De Flavia",
    "rating": 3.0,
    "message": "I love them on principle, but they are not as comfortable as I'd hoped. The soft foam sole on the pair I got flattens within a short period of time and I don't feel much support which tires my feet more. Awesome looking under cute jeans and dresses... Not amazing for extensive walking or staying on my feet."
  },
  {
    "user": "Nayla Hernandez",
    "rating": 5.0,
    "message": "Recién  me llegan con bastantes días de anticipación.  Son livianos y están hermosos."
  },
  {
    "user": "Hive Nation",
    "rating": 2.0,
    "message": "They run large and have begun to stretch!  I have wanted PUMA's for so long as a change of pace from NIKE... well it is back to NIKE!  These have low support and have stretched to the point of being uncomfortable !  Not even 2 weeks!  The box is gone and I believe I am stuck!  I will need 2 pair of socks to get any wear out of them...  UGGG"
  },
  {
    "user": "Kristin S",
    "rating": 5.0,
    "message": "I absolutely love them except I'm usually a size 8 - 8 1/2 in every pair of sneakers so I ordered a size 8.5 and they are a bit snug. I will order a 9 next time."
  },
  {
    "user": "OlgaAmazon Customer",
    "rating": 3.0,
    "message": "Good looking but it’s not platform. They look just like regular sneakers."
  },
  {
    "user": "Vanessa Taylor",
    "rating": 5.0,
    "message": "These PUMA sneakers were WHITE AND CRISP AND JUST WHAT I WANTED! They look just like what you see on the Zaire. They fit true-to-size too. Their comfortable and the front toe area is not smashing your toes gives you that extra roomy comfort. I am pleased will be ordering more sneakers from this site."
  },
  {
    "user": "Elizabeth Gordon",
    "rating": 5.0,
    "message": "These shoes are really cute and comfortable and also easy to clean. Definitely size up at least a half size though bc that’s what I did and they fit fine but i definitely could have went up another half size for a little more room. They also arrived in only 2 days. 10/10 recommend"
  },
  {
    "user": "My gypsy life!",
    "rating": 5.0,
    "message": "I've used Puma for years but they tend to be small and narrow and sometimes uncomfortable. These are SOOOO comfy and roomy and comfortable. Wish they made more like these! They are my favorite pair!"
  },
  {
    "user": "squirrel",
    "rating": 5.0,
    "message": "Just as described"
  },
  {
    "user": "Jackie",
    "rating": 4.0,
    "message": "Super cute sneakers! I bought my usual size 8 and they felt snug but I thought it was because they're so padded inside. Unfortunately after an 8 hour shift, my toes are hurting. I wish I went with my gut and exchanged them for an 8.5."
  },
  {
    "user": "jennifer",
    "rating": 4.0,
    "message": "Not for people with wide feet."
  },
  {
    "user": "Johanna",
    "rating": 5.0,
    "message": "Es muy práctico. Luce bien con todo. Me encantó, estoy muy satisfecha con el pedido y el servicio de Amazon"
  },
  {
    "user": "Evelyn Jordan",
    "rating": 5.0,
    "message": "Prior review describes a odd smell and they do after a month they still smell.  The shoe runs one size small.  Prior reviews are correct.  Thank you reviewers.  It is a very stiff shoe.  Positive they are cute.  Not for anyone with foot issues my foot doctor said it's not a good shoe because of stiffnesd."
  },
  {
    "user": "Oriana Hernandez",
    "rating": 5.0,
    "message": "These shoes are comfortable and very sleek. Very good shoe especially for the price!!!"
  },
  {
    "user": "GlowGirl",
    "rating": 5.0,
    "message": "These are sooo nice and I personally love ❤️ them more than the Air Force everyone and there friends are wearing ….. soo cute and tons of compliments"
  },
  {
    "user": "Anna MK",
    "rating": 1.0,
    "message": "I had these less than a month and the white coating of the faux leather on one shoe started cracking on the top of the right shoe. I only wore these indoors when working, so they were used gently. The left shoe still looks perfect. Very disappointed because otherwise I loved the shoes. Wish the quality had been better so it had lasted more than a few weeks."
  },
  {
    "user": "Linda O.",
    "rating": 5.0,
    "message": "When I need to, I will order these again."
  },
  {
    "user": "Stephen V.",
    "rating": 5.0,
    "message": "I think that these shoes are great. They fit good and I like the memory foam."
  },
  {
    "user": "Natasha",
    "rating": 5.0,
    "message": "I can wear these shoes with 80%of my wardrobe. Looks great with a sundress or a pair of jeans"
  },
  {
    "user": "Kenzi Mars",
    "rating": 1.0,
    "message": "The media could not be loaded. These came in a nondescript brown box that claimed it wasn't the \"original box\" because the OG box had been \"damaged\". I ordered these new so how was the original box damaged? I've had these exact shoes before that I got at an actual store. So things that make me 95% positive these are fakes are that the toe area is hella tight and shallower than the rest of the shoe. Improperly tapered. Also, the laces aren't properly centered on the shoe. The outside has way more material reach than the inside, causing the uncenteredness. Even the toe itself isn't properly rounded. It is shaped incorrectly. Lastly, the shoe rocks and doesn't rest flat which it should if they were made at the quality they're supposed to be. The reasons I loved these shoes in the past was the eye appealing symmetry and shape, and extreme comfort. All of that is gone in these presumable fakes."
  },
  {
    "user": "Cheri  Duckworth",
    "rating": 5.0,
    "message": "I have a narrow foot. Finding tennis shoes that fit is a challenge. These are comfortable and stylish. I am very pleased with the quality of these shoes.  I wear a 7.5 and this was a true to size fit for me."
  },
  {
    "user": "Tracey Horner",
    "rating": 5.0,
    "message": "I have had so many compliments when i have my Puma's on. they are so comfortable and easy to wear all day. You won't bbe let down , go ahead order them. You know you want too"
  },
  {
    "user": "Christina Vincent",
    "rating": 3.0,
    "message": "Super chunky bottoms,makes it look like I'm wearing shoes from when I was a teenager"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wore these for the first time yesterday.  All day long & no issues.  They’re comfy & stylish."
  },
  {
    "user": "Michelle Fitzsimmons",
    "rating": 5.0,
    "message": "Shoes fit good and comfortable"
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "These sneakers are so comfy and supportive. I love them. They’re also great for working out."
  },
  {
    "user": "Susan B. Palmer",
    "rating": 5.0,
    "message": "The shoes are really attractive, and I was anxious to try them out! However, the inside is not smooth and caused blisters, and they did not provide very much comfort or support! Really disappointed in this sneaker!"
  },
  {
    "user": "Briana Levison",
    "rating": 5.0,
    "message": "These shoes arrived on time. They fit perfectly. They do scuff easily, but that’s expected for white shoes. I have no complaints! It was a great buy."
  },
  {
    "user": "Tracy",
    "rating": 5.0,
    "message": "n/a"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Ashley",
    "rating": 1.0,
    "message": "The sneakers are junk. I have had them since June and with it being Summer I barely wore them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these shoes and are so comfortable! Perfect for any outfit!"
  },
  {
    "user": "Elvia",
    "rating": 3.0,
    "message": "Sadly had to return these. Wore them hoping they would mold to my feet but they didnt. They also messed up my toe. I love the style but they are a little on the heavy side."
  },
  {
    "user": "Sumbul S.",
    "rating": 5.0,
    "message": "Very comfortable leather sneakers. Look great too!!"
  },
  {
    "user": "Sandra bell",
    "rating": 5.0,
    "message": "I love how they accommodate the braces I have to wear on my feet"
  },
  {
    "user": "t0ys0ld1er003",
    "rating": 5.0,
    "message": "My daughter loves these shoes. Great fit and look. Puma always a great choice for quality, fit, and feel."
  },
  {
    "user": "Robncam",
    "rating": 5.0,
    "message": "Crisp white. I love wearing these shoes. So on trend and goes with any outfit."
  },
  {
    "user": "Annette smith McGregor",
    "rating": 5.0,
    "message": "Was perfectly fit, Very comfortable too"
  },
  {
    "user": "jessica",
    "rating": 5.0,
    "message": "Great shoe! Cute and comfy. The go with so many different outfits"
  },
  {
    "user": "A.Bart",
    "rating": 5.0,
    "message": "Fits perfectly,  looks so cute🙌🏽"
  },
  {
    "user": "NYAH",
    "rating": 5.0,
    "message": "Love these shoes!! Very stylish and comfortable."
  },
  {
    "user": "Cooker mama",
    "rating": 1.0,
    "message": "I ordered a half size up. Toe box too flat, toe short, back sloppy. Got blisters on my heel within half an hour, mostly sitting. But they look cute in my closet…. So that could be how they earn the one star."
  },
  {
    "user": "DivineMommy",
    "rating": 5.0,
    "message": "Fit like a glove."
  },
  {
    "user": "David",
    "rating": 5.0,
    "message": "good quality"
  },
  {
    "user": "Mark Coyle",
    "rating": 1.0,
    "message": "I don’t usually write reviews, but I was discounted with the quality of these. I was also under the impression that they would have a platform / lift to them. They did not. They look kinda cheap."
  },
  {
    "user": "Andrea",
    "rating": 5.0,
    "message": "Me encantan y son super cómodos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Shoes they r great thank u"
  },
  {
    "user": "katina wheeler",
    "rating": 5.0,
    "message": "Great fit"
  },
  {
    "user": "Hilary Michelle Solis",
    "rating": 5.0,
    "message": "Muy contenta con mi producto"
  },
  {
    "user": "Anna Webb",
    "rating": 5.0,
    "message": "Perfect fit, perfect condition"
  },
  {
    "user": "Herlen Guimaraes",
    "rating": 5.0,
    "message": "It’s very nice! Super comfortable!!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Love"
  },
  {
    "user": "gabriella",
    "rating": 1.0,
    "message": "shoe was very tight i didn’t enjoy"
  },
  {
    "user": "Jessica Riera",
    "rating": 1.0,
    "message": "It’s not comfortable. My toes and feet got sore"
  },
  {
    "user": "Domenica Nociforo",
    "rating": 1.0,
    "message": "They were comfortable but gave me blisters after about 10 minutes"
  },
  {
    "user": "Queen",
    "rating": 1.0,
    "message": "Return it!!!"
  },
  {
    "user": "Maria",
    "rating": 5.0,
    "message": "Llego en buen estado y me quedo como me lo esperaba"
  },
  {
    "user": "Lawrence E. Graver III",
    "rating": 1.0,
    "message": "I had mailed this as a gift and it didnt fit. I am now trying to return and am not allowed after 1/31/2021"
  },
  {
    "user": "Amazon Customermeomy",
    "rating": 1.0,
    "message": "I disliked that these shoes were not the same shoes that were advertised...they weren't Puma at all, but a terrible attempt at a knock off"
  },
  {
    "user": "TR",
    "rating": 5.0,
    "message": "Love these tennis shoes!!! They fit as expected - from other reviews I was a little hesitant to order in my usual size 7, but I am happy I ordered my usual size! They fit perfectly and are extremely comfortable! The price was such a huge deal!!!! Very pleased!!!"
  },
  {
    "user": "Danielle Watson",
    "rating": 5.0,
    "message": "So happy with my purchase. I ordered a half size up based on reviews and I am super glad I did. They are so comfortable and cute"
  },
  {
    "user": "Cindy Gómez",
    "rating": 5.0,
    "message": "I’m 11 of woman and its really hard to find a fit shoes for my feet, this one was just perfect for it. Really in love."
  },
  {
    "user": "TaNiqua Taylor",
    "rating": 5.0,
    "message": "My mom loves these shoes and the way they fit."
  },
  {
    "user": "Walter Gaitan",
    "rating": 5.0,
    "message": "Good and great service"
  },
  {
    "user": "Elder Alvarez",
    "rating": 5.0,
    "message": "Muy buena calidad!!"
  },
  {
    "user": "Michelle I. Flint",
    "rating": 5.0,
    "message": "Love these Pumas! They were exactly what I was expecting. The fit was as expected. They are cute and comfortable and affordable!"
  },
  {
    "user": "Trisha",
    "rating": 5.0,
    "message": "Love the ol'school look with the added thickness to the sole, just enough to add the height & help make my size 9 look alittle smaller without it being a crazy high platform sneaker...already planning my next color scheme in the same design. Although I would love to see these with the added platform in SUEDE!!!!!!!!"
  },
  {
    "user": "Gillian",
    "rating": 5.0,
    "message": "I've always been a fan of Puma and these are no exception. I bought them for a recent trip to LA where I knew I'd be doing a lot of walking and I wanted one shoe that could go with pretty much any outfit. These fit the bill and were comfy enough to be on my feet all day. I would love if they had more arch support, but for the price I wouldn't complain too much about that and they worked great for what I wanted. They're still my go-to shoe most days here at home."
  },
  {
    "user": "Shai Bunni",
    "rating": 5.0,
    "message": "Love these"
  }
]