[
  {
    "user": "HappyShopper",
    "rating": 4.0,
    "message": "This is a good looking sneaker and the sole is actual rubber which is hard to find these days. The fit however is a little peculiar. The vamp, the part right below the bottom of the laces, is oddly roomy. The toe box isn't so it fits good from the heel through the laces, is too roomy for about an inch or two then fits well again. It would definitely end up creating a crease across that part of the sneaker. It wasn't a fit I felt I would ever NOT notice so I returned them. A bit disappointed  because they do look good and had some decent support."
  },
  {
    "user": "Ria",
    "rating": 5.0,
    "message": "True to size, the model is adorable and super comfy. I was not sure if I'll like the color but it's amazing, even better in person. I'm gonna order it again in another color."
  },
  {
    "user": "Brenda Pitts",
    "rating": 5.0,
    "message": "This is the most comfortable shoe I've worn in years. I wear the everyday and for working out. I brought my 16 year old granddaughter a pair and she love them. It's time for another pair for me, ordering soon."
  },
  {
    "user": "Britt Reisman",
    "rating": 5.0,
    "message": "I work 12 hour shifts in these shoes"
  },
  {
    "user": "Shafer",
    "rating": 5.0,
    "message": "Comfortable, true to size and very wearable."
  },
  {
    "user": "Juan Guacaneme",
    "rating": 5.0,
    "message": "Todo muy bien"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfort and style"
  },
  {
    "user": "KC",
    "rating": 5.0,
    "message": "Exactly what I needed"
  },
  {
    "user": "Elisa",
    "rating": 5.0,
    "message": "Hermosos y super cómodos. Compre medio número mas grande en la talla porque lo necesitaba para correr y quedaron cómodos"
  },
  {
    "user": "Anthgloris Diaz",
    "rating": 5.0,
    "message": "Me encantaron quedan perfectos y son muy fáciles de lavar"
  },
  {
    "user": "David",
    "rating": 5.0,
    "message": "good quality"
  },
  {
    "user": "Imani",
    "rating": 4.0,
    "message": "I like these shoes, relatively affordable and good to get me started running. But they're not helping much with the pain associated with running. The shoe laces are also quite slippery so may be worth it to switch those out."
  },
  {
    "user": "Shimaa",
    "rating": 5.0,
    "message": "I was surprised by how comfortable they really are. Love these on my tennis skirts and sport capris! I normally wear a size 7 but a 6.5 was perfect. Go half a size down. I also consider my feet to be a little on the wider side."
  },
  {
    "user": "Randie Wawrzynski",
    "rating": 5.0,
    "message": "I am extremely pleased"
  },
  {
    "user": "Jessica harper",
    "rating": 5.0,
    "message": "Very glad I chose these shoes. I lcoe the black and white color and they are super comfortable. If you want a style like this go for it because you won't regret it."
  },
  {
    "user": "Denise C. Ahlert",
    "rating": 5.0,
    "message": "These shoes are awesome! I work as a pharmacy tech and am on my feet all day. I wear these to work in.  I have a tendency to roll my feet out while standing and they keep my feet straight, stable and supported. No more knee, hip or back pain since wearing them. I loved them so much, I just bought another pair!"
  },
  {
    "user": "Lisa H Schreiber",
    "rating": 5.0,
    "message": "I was unsure whether to size down after reading reviews, so I got half a size smaller than my usual size and they fit great! They came just as the photo with no flaws and they feel comfortable. Highly recommend."
  },
  {
    "user": "Camila Pierce",
    "rating": 5.0,
    "message": "Love these shoes and I work out hard"
  },
  {
    "user": "Karla Bastidas",
    "rating": 5.0,
    "message": "Lindos zapatos de buena calidad"
  },
  {
    "user": "Mark",
    "rating": 5.0,
    "message": "Ordered these shoes for my daughter for band practice and they do the job great! Will definitely be ordering more in the future."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I like these and it’s perfect for my morning walks.."
  },
  {
    "user": "Athiba Thomas",
    "rating": 5.0,
    "message": "I love the color the fit , movable, comfortable I order a size 11 perfect fit"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "N/A"
  },
  {
    "user": "Sweetheart Seer",
    "rating": 5.0,
    "message": "Great support. Great fit. Exactly as pictured. Comfortable."
  },
  {
    "user": "Valerio  J Asencio",
    "rating": 4.0,
    "message": "Nice Shoe'  Thanks"
  },
  {
    "user": "Linda",
    "rating": 5.0,
    "message": "First time buyer of Adidas.  I am extremely happy with my purchase.  My normal size is a 9M so I did order a 9.5 to compensate for a sock.  They fit perfect, nice style, good sale price, plenty of toe room and comfortable."
  },
  {
    "user": "neeks",
    "rating": 5.0,
    "message": "I have a pair of these shoes already, they fit me the best and support my foot when I got running. I have pain issues with my feet, specifically my toes, and these support the ball of my foot and don't put pressure on my toes. They are light and perfect for running or walking for a long time. Love them so much I bought a 2nd pair."
  },
  {
    "user": "CRISTINA CLAVIJO",
    "rating": 4.0,
    "message": "They aren’t as soft as I expected"
  },
  {
    "user": "CJ",
    "rating": 3.0,
    "message": "Daughters volleyball shoes. Should do the job"
  },
  {
    "user": "ihaveseriousprivacyissues",
    "rating": 5.0,
    "message": "Very comfortable and versatile. May be worn with jeans and dresses."
  },
  {
    "user": "Pamela Newman",
    "rating": 3.0,
    "message": "Almost pink / turbo / white color purchased  Not happy with the color at all. Shown to be light pink with darker pink logo stripes yet in person the logo stripes are in my opinion an orange color and not in pink family at all. I like the weight of them and they seem comfortable."
  },
  {
    "user": "Elizabeth Ruth Arnold",
    "rating": 5.0,
    "message": "I bought these shoes to wear for long trail walks.  They are light, and very comfortable and, for a change, the size 9 fit as expected.  Too often, I find shoes are slightly short, but a half size larger would be too big. A happy customer!"
  },
  {
    "user": "Veneranda Reyna",
    "rating": 5.0,
    "message": "For willing and running they’re very confortable thank you"
  },
  {
    "user": "T Stephenson",
    "rating": 3.0,
    "message": "I only wear Adidas for running shoes because as a brand they fit my feet best.  And for years now I've only ever worn a 9 1/2 in Adidas so that's what I ordered this shoe in but it's huge.  I could probably have sized down to an 8 1/2 maybe even get an 8."
  },
  {
    "user": "sonia",
    "rating": 5.0,
    "message": "Really nice simple sneaker. I use it for working out and it fits well. Don’t go more than half a size down. I went a whole size down it was too tight I had to return and get my right size.Easy for using to work out."
  },
  {
    "user": "VALERIE D BROWN",
    "rating": 4.0,
    "message": "They run big so instead of ordering a woman's size 8 I should have ordered a size 7.5"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Use these shoes for everyday use and they fit perfectly.  I would highly recommend them to anyone."
  },
  {
    "user": "Marcirita",
    "rating": 5.0,
    "message": "I wear these all day at times with total comfort. I love the plain white style that goes with everything."
  },
  {
    "user": "Vivian",
    "rating": 5.0,
    "message": "These shoes made me want to run and jump around! they're fairly inexpensive (I bought mine for around $45) and they're so comfortable. I'm not sure if they have support for intense running sessions but they've been a really comfortable shoe for biking and walking long distances."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes and they are very comfortable. I teach physical education and am on my feet all day long and they have great arch support."
  },
  {
    "user": "Jeannie Jag",
    "rating": 5.0,
    "message": "This particular shoe is the best for heel pain, arch pain, plantar facitis and comfort. I love the dark color because I can wear with dress pants at work. At 60, no more heels for me. Adidas have a heal cup that many shoes don't. These are true to size. Love mine."
  },
  {
    "user": "Megan Rios",
    "rating": 5.0,
    "message": "These sneakers are the best! Very roomy and comfy also very light."
  },
  {
    "user": "Estelle's Home Health Inc",
    "rating": 5.0,
    "message": "Great for Walking and Running"
  },
  {
    "user": "Paula Soares",
    "rating": 5.0,
    "message": "Great for running"
  },
  {
    "user": "Sherry",
    "rating": 5.0,
    "message": "Love them they are very comfortable fit like a glove"
  },
  {
    "user": "Nancy Mucci",
    "rating": 4.0,
    "message": "They seem to be a knock off but I like them a lot.  I thought they may be too light to run in but they have pretty good support.  Just a little less support than I would like.  I wanted a bright white sneaker to wear with my casual wear and these are just fine.  I didn't want to pay $180 for Adidas Boosts so for $90 they do the trick."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great everyday shoes for my teen"
  },
  {
    "user": "Lee",
    "rating": 5.0,
    "message": "I own a few different pairs of Adidas and wear a 9. But I could have gotten an 8.5 in this pair. For some reason they are slightly more loose than my others. Otherwise I love the look and feel of them!"
  },
  {
    "user": "Maria Duran",
    "rating": 3.0,
    "message": "Running errands and working out."
  },
  {
    "user": "Fabiola",
    "rating": 5.0,
    "message": "Got a 6.5 for my mom and it fit perfect. Very nice quality shoes"
  },
  {
    "user": "Cookie Soto",
    "rating": 4.0,
    "message": "Sryle"
  },
  {
    "user": "James Harris",
    "rating": 5.0,
    "message": "I bought for my wife and she loves them. Says they are very comfortable because she walks around her office alot."
  },
  {
    "user": "sabrina C",
    "rating": 5.0,
    "message": "I wear these as my everyday shoe. They are very comfortable. Not sure about the running part since I don’t run but they are really light weight. Fits true to size and is wider than other shoe brands."
  },
  {
    "user": "Nydoctor",
    "rating": 5.0,
    "message": "Good price, and good quality , My wife love it"
  },
  {
    "user": "JohnW",
    "rating": 5.0,
    "message": "My daughter likes the shoes.  She said they are comfortable."
  },
  {
    "user": "Shila Wheeler",
    "rating": 5.0,
    "message": "Very comfortable and goes with practically everything."
  },
  {
    "user": "Bethzaida Perez Gonzalez",
    "rating": 5.0,
    "message": "Es igual al de las tiendas mismo material y calidad bueno , satisfecha con la compra"
  },
  {
    "user": "Michelle Wilson",
    "rating": 5.0,
    "message": "1) it's a pretty footwear 2) I love the color combination 3) The recipient hasn't taken it off since."
  },
  {
    "user": "Davida",
    "rating": 5.0,
    "message": "I really like this particular running shoe. I have been looking for an all white running shoe that was reasonably priced. The shoe does hurt a little where you tie the laces but overall, I am satisfied."
  },
  {
    "user": "Lousha Murphy",
    "rating": 5.0,
    "message": "I love my shoes"
  },
  {
    "user": "LeAnne Lauf",
    "rating": 4.0,
    "message": "Very comfortable"
  },
  {
    "user": "Lateesha S. Maris",
    "rating": 5.0,
    "message": "Great fit and super cute"
  },
  {
    "user": "Alice Wonderland",
    "rating": 5.0,
    "message": "I am taken back with how perfect this shaped around my foot; pleasantly surprised!!!! Thank you !!!!!!"
  },
  {
    "user": "Annette",
    "rating": 5.0,
    "message": "My daughter loved the gift I gave to her. ...like walking on foam. She said they were super comfy. I bought a pair for me because she loved the way they felt. I love them too!"
  },
  {
    "user": "Ricardo Suyon",
    "rating": 5.0,
    "message": "El producto es lo que esperaba"
  },
  {
    "user": "Nowhere man",
    "rating": 5.0,
    "message": "These are great shoes. It had been quite a while since I was satisfied with Adidas as sold online. They still run a bit big, but not as before. I am 8.5 in athletic shoes and though these are a bit longer and wider, they are still a good fit, as opposed to other Adidas which  have felt  like canoes on my feet. I have used them three times for Zumba sessions and they have performed perfectly. However, I think they do not have enough support to withstand the impact of running and even power walking. Still, great shoes for light walking, Zumba-like classes and just being around on your feet."
  },
  {
    "user": "Grace Gonzalez",
    "rating": 5.0,
    "message": "Me encantan, son muy comodas! Me quedaron algo justas en la primera puesta pero luego se van adaptando a tu pie, Sugiero que pidan exactamente su talla o media talla más."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These sre super cute and comfy! I'm very happy with this purchase and would buy again!"
  },
  {
    "user": "Angelo Rasmijn",
    "rating": 5.0,
    "message": "Will use in gym"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Less than two months in and certain areas of the shoes are pulling apart and I am having to glue them back together because I am no longer eligible for returning them since it is past the 30 day mark."
  },
  {
    "user": "jena",
    "rating": 5.0,
    "message": "I needed new shoes to use on the treadmill and these have been great! They are very stylish and super comfortable. I bought my normal size and they are a little big around the toe, but nothing major. I’d definitely recommend these shoes."
  },
  {
    "user": "ChompOgre",
    "rating": 4.0,
    "message": "Adidas have always been my favorites, but this time ASICS left me pain free, whereas the Adidas were not as good to my feet and knee. Still a favorite, though."
  },
  {
    "user": "Bella",
    "rating": 2.0,
    "message": "I bought an 8 which usually fits perfect. But this was way too big. I felt like I was wearing a clown shoe.  Sadly had to return"
  },
  {
    "user": "Kindle Customer",
    "rating": 2.0,
    "message": "The shoes are fine, what I expected. However, the delivery was extremely late from what I was told and the shoe box (not packaging, so this is on the seller not Amazon) was basically destroyed. The box was legitimately being held together by a rubber band."
  },
  {
    "user": "Nova",
    "rating": 5.0,
    "message": "this shoe is perfect if you enjoy walking/running or are on your feet a lot"
  },
  {
    "user": "Manda Grugan",
    "rating": 4.0,
    "message": "I really like these. I’d definitely buy them again. The only reason why I gave them four stars instead of five is that the sole at the heel sticks out a little more than I’d like. I already have “big girl feet”, as I call them, since I wear a size 10. I don’t need more length added to them. LOL"
  },
  {
    "user": "Busy mom",
    "rating": 5.0,
    "message": "cute and comfortable"
  },
  {
    "user": "erin",
    "rating": 5.0,
    "message": "Totally love adidas so I knew these would be amazing and they were.  The color is bright and it’s what I didn’t have.  Love them"
  },
  {
    "user": "Charlesdf23",
    "rating": 4.0,
    "message": "I generally wear an 8.5 and have another pair of Adidas sneakers that are 8.5. I ordered the 8.5 in these and they were a little bit too long. I kept them and wear them comfortably, but have to wear ankle socks since my feet move in them a bit and no show socks get eaten. :) I really like the look of them and the laces hold tight even though they are the sleeker kind of material."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Not sure these are real Adidas. They squeak when I walk. They are about 2 sizes too large.  They say they are size 6 but fit more like an 8. Pretty color. Comfortable, other than too big. Disappointed. Three stars."
  },
  {
    "user": "Ross L Fenstermaker",
    "rating": 2.0,
    "message": "I am shocked at how bad these are. Even bought inserts to try and make them more comfortable and it didn’t help."
  },
  {
    "user": "rosa gonzalez",
    "rating": 5.0,
    "message": "Love, fit was perfect and most comfortable pair of sneakers.  I  highly recommend them."
  },
  {
    "user": "Karissa",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Leonardo Favia",
    "rating": 5.0,
    "message": "Fit has expected"
  },
  {
    "user": "PDavis",
    "rating": 5.0,
    "message": "Walking.  Width is good. Not too stiff. Love the color"
  },
  {
    "user": "Hazel g.",
    "rating": 4.0,
    "message": "I mainly bought these for the looks and they did not disappoint. I really like them. They are still a little stiff but it’s wearing down with each use! Love them love them!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are nice for the job that I do running around with kids all day. They are nice enough."
  },
  {
    "user": "Lady Robin",
    "rating": 5.0,
    "message": "For what you get for the price it's a good shoe. Lacking a bit in the support department. But the sizing is true to size for those wondering."
  },
  {
    "user": "Lady Kay",
    "rating": 5.0,
    "message": "Love my sneakers"
  },
  {
    "user": "TS",
    "rating": 5.0,
    "message": "So comfortable! Fits true to size and excellent  price"
  },
  {
    "user": "Jade j.",
    "rating": 4.0,
    "message": "I bought these for work and I absolutely love them"
  },
  {
    "user": "Diane Donahue",
    "rating": 5.0,
    "message": "I love the look and comfort of this sneaker."
  },
  {
    "user": "Molly",
    "rating": 5.0,
    "message": "AWESOME!! For such an amazing price they are everything I wanted and more! Very happy with this product!"
  },
  {
    "user": "Briana",
    "rating": 5.0,
    "message": "I got these when they were on sale and I love them. The fit is great and I love the color"
  },
  {
    "user": "Debby polozo",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Jaslyn",
    "rating": 5.0,
    "message": "Great for wide feet and so comfy and sleek. Fit is exact."
  },
  {
    "user": "fausto salazar",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Skipjack",
    "rating": 5.0,
    "message": "Love the run falcon design,  we are an adidas family the shoes are great."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Just as pictured. Comfortable. People said it's going to be too big and while it's more roomy than other shoes I'm still fitting in them nicely and not slipping out."
  },
  {
    "user": "Louie R.",
    "rating": 5.0,
    "message": "Better price than the actual Adidas store, nice shoes, very comfortable."
  }
]