[
  {
    "user": "Nina L",
    "rating": 5.0,
    "message": "These sneakers are comfortable, wear very well and fit as expected. They are probably the only pair of \"flat\" sneakers that have a tiny little bit of arch support in them. It's not the kind of arch support you'd get in an athletic shoe, but it's definitely a bit more than you'll get out of many other flat sneakers (most flat sneakers have nothing and feel like you're walking on cardboard!). I am very sensitive to shoes without an arch, and this has just enough that I can wear these out with jeans or shorts and I do NOT come home in pain!  Highly recommend!"
  },
  {
    "user": "Crystal K.",
    "rating": 4.0,
    "message": "I wear a 10 in every shoe, so I ordered a 10. However, I had no choice but to put inserts in as there is a LOT of room for your foot to move around. Some arch support, but not much. Casual wear, yes! Working out, no."
  },
  {
    "user": "Just Ducky",
    "rating": 4.0,
    "message": "Good quality canvas. Sturdy and not a flimsy thin shoe. I ordered 8.5 as my usual size but is definitely too big. Inserted a full sole liner from another shoe to get a good fit. Haven’t worn them outside yet for walking but will update once they are broken in."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "This wore socks the first two times I wore these, then I went without. They felt scratchy for a short period of time. I couldn't walk all day in them but still love them"
  },
  {
    "user": "Lisa Kaster",
    "rating": 5.0,
    "message": "I ordered these sneakers and they were here in 2 days so great shipping. The color was PALE GOLD. I would describe the color more as a very light cream color and almost white. For the fit, I ordered size 9.5 since one for is larger. Let me tell you they fit like a dream. Order with confidence. They run try to size."
  },
  {
    "user": "Teri Colorado",
    "rating": 4.0,
    "message": "I am a size 7. The shoes are a little large in length. Still keeping them, they are too cute!"
  },
  {
    "user": "Michelle Kalisek",
    "rating": 5.0,
    "message": "These trainers are the perfect shoe!  I have dressed them up and down and they go with everything!  Very stylish looking.  They are canvas, so be careful about how dirty you get them.  They are washable.  They are pretty flat, so don't expect a ton of arch support.  They have great laces and stay tied.  The best part of them is that on the first wear they feel broken in and comfortable.  There wasn't that awkward breaking in period with them.  Out of the box and go!  Highly recommend!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have owned this shoe is 4 different colors. Great casual shoe. Not to be used for working out."
  },
  {
    "user": "Vanessa",
    "rating": 5.0,
    "message": "Got them for a good price and looks So Pretty"
  },
  {
    "user": "leatheraddict",
    "rating": 4.0,
    "message": "I came so close to returning these shoes after trying them on because they were pretty large on my feet. I've worn a size 8 in flats and athletic shoes for at least 2 decades, and the sizing on these shoes is different from any other European sized shoes. I didn't realize they were Euro size until I received them and the box read : EU 39 USW(women) 8 USM(ale) 61/2. As far as I've known, an 8 in women's is a 6 in boys or men's and a 39 European size is either an 8 1/2 or 9 translated to US size. I tried them on a third time because making a return is a bit of a hassle, and I decided to keep them. They are a little gappy and wide, but I like the look and style of them otherwise. My advice to anyone looking at these Supergas is do your research on sizing first and maybe get a half size smaller if your feet are not wide. If you've got wide feet, these are possibly the sneaker for you. They're great quality and such a sleek classic style casual shoe, so I still would recommend them!"
  },
  {
    "user": "Virginia Anklin",
    "rating": 4.0,
    "message": "I bought a half size too large because they were out of my size so they are too large. I'm making it work with  heel cushions and pads. I liked them too much to return."
  },
  {
    "user": "Natasha Keller",
    "rating": 4.0,
    "message": "Very cute shoes but the sizing is off according to the size chart. I wear a US ladies 7 and the chart recommended I order a 39.5. Sadly they are just slightly too big, about half a size. And I forgot to return them in time so I will have to learn to deal with it but I wish the sizing was more accurate."
  },
  {
    "user": "Lois Wittas",
    "rating": 5.0,
    "message": "I liked that they fit perfect and I didn’t have to return them."
  },
  {
    "user": "Mellow",
    "rating": 5.0,
    "message": "Honestly I though it was just hype but genuinely these shoes are the most comfortable sneakers I’ve ever owned I’ve had phases of wearing Vans, Converse (Chuck Taylors), Nike, Adidas etc…. None have ever been as comfortable or well built with detail the inner lining embroidered superga logo on the inside of the shoe is a nice touch too…"
  },
  {
    "user": "Susan Kolb",
    "rating": 5.0,
    "message": "These shoes are so comfortable and look great with anything."
  },
  {
    "user": "SisterGoldenHair",
    "rating": 4.0,
    "message": "Hoping this review will help others. I shouldn't have listened to the reviews saying this shoe runs large and to size down. It runs true to length, just on the wide side. I wear an 8/39 in every brand of shoes but since I was unfamiliar with this brand, I second guessed based on the reviews and sized down to a 7.5. It was too short, but otherwise fit well and was surprisingly a little wide (I have a normal width foot). Sending back for the 39. Otherwise, super cute shoe and I can tell it will be extra comfy with the added width once I have the correct size."
  },
  {
    "user": "VH in PA",
    "rating": 4.0,
    "message": "I really want to love these. They are too heavy for a daily kick around shoe. I will buy some Vans or Keds instead."
  },
  {
    "user": "Patricia V.",
    "rating": 4.0,
    "message": "There was a bit of a breaking in period for me bc I wasn't used to wearing canvas sneakers. Also, the soles are not as thick as I thought they might be, but you could always add an insert to make them more cushion-y. (:"
  },
  {
    "user": "Michelina",
    "rating": 4.0,
    "message": "I was so excited to see the everyday casual sneaker that Kate Middleton wears on Amazon. They are so cute and go with everything. They aren’t the most comfortable (and why I gave a 4), but I probably need to wear them longer. I can wear either a 36 or 37 in a Birkenstock sandal and went with a 36.  I’m glad I did. If I could get a half size up, I would have, but definitely size down if you are unsure. They fit on the bigger size."
  },
  {
    "user": "Fran",
    "rating": 4.0,
    "message": "Made well and good looking but hit my big toe in an uncomfortable way. I wish they had worked for me!"
  },
  {
    "user": "Katie",
    "rating": 4.0,
    "message": "They are cute shoes, they’re just way too narrow for me. I wish they came in a wide!"
  },
  {
    "user": "Yolanda Melendez",
    "rating": 5.0,
    "message": "Perfect fit. My new go to shoes."
  },
  {
    "user": "Donald McMullen",
    "rating": 5.0,
    "message": "Personal use. Very satisfied"
  },
  {
    "user": "KC",
    "rating": 5.0,
    "message": "I already own a pair of these sneakers and decided to order another color. Great casual And comfy shoes. Looks good with many outfits!"
  },
  {
    "user": "mkb",
    "rating": 5.0,
    "message": "I had to use my arch support insoles and now they are comfortable!"
  },
  {
    "user": "Jeanie Ryder",
    "rating": 5.0,
    "message": "Good quality as expected."
  },
  {
    "user": "Cee Cee",
    "rating": 4.0,
    "message": "I love the look of these shoes! They are pretty comfortable but they have an annoying squeak I can’t get rid of!"
  },
  {
    "user": "kristen",
    "rating": 4.0,
    "message": "I was so excited to get these as they have such great reviews _everywhere_. They are super cute, but I have a really narrow heel, so they are too wide for me. I make them work with an insert and sock liners, but I have to tie them really tight to keep the socks up, which then hurts my feet. I walked all over D.C. in them and my feet and legs were really sore the next day. Also, they are quite heavy and flat inside. Great shoe if you have the right feet for them!"
  },
  {
    "user": "Kristina R",
    "rating": 4.0,
    "message": "I like these shoes but I followed the reviews and sized down to an 8 (from my regular 8.5 in sneakers) and they were too tight. Ordered my original 8.5 and even now I’m considering sizing up to a 9 because they’re somewhat tight on my big toe. Not sure how people fit into these sizing down."
  },
  {
    "user": "P. Cullen",
    "rating": 3.0,
    "message": "I so want to love these, but they are soooo uncomfortable! There is no inner support for your foot and lack any type of arch!  I have ordered inserts in an attempt to make these work.  Yes, I had high hopes- especially since Kate Middleton has them, but she must have some magic insert to make these work. DO NOT OAY MORE THAN $30 for these…not worth it. DISAPPOINTED"
  },
  {
    "user": "Jo Ann Strosnider",
    "rating": 3.0,
    "message": "I found these shoes to be too wide( I have wider feet) and also too long. Got my usual 7 1/2 size and it is too wide snd too long. Have to find insets and something g for heel area so they don’t just slip around on my feet."
  },
  {
    "user": "AD",
    "rating": 3.0,
    "message": "I do love these. Very cute. I wear them a lot for the “cute factor”. But they are like walking on rocks. You definitely need some padded insoles to replace the rock soles. Come on my Italian familia! Let’s get some comfiness inside these please!"
  },
  {
    "user": "MCha",
    "rating": 4.0,
    "message": "I love this brand but these run large. I was sad to have to return these but will purchase a half size smaller."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I’m not sure about the sizing on these. I read all the reviews and decided to order a half size down (7.5) as suggested but they were too small. My toes were touching the front of the shoe. So I ordered the US 8 which is my regular size and they’re almost a touch too big. It’s confusing. I kept them anyway and have worn them a couple times with little sneaker socks. If you have wide feet then these will be great for you. I’m having to pull the laces in so much to get them to fit the width of my feet that the front of the shoe is folding slightly. They have zero arch support, think flat converse style on the sole, so if you’re looking for that you’ll need insoles. Otherwise I do find them comfortable and they were a great price compared to a white casual leather sneaker I was considering."
  },
  {
    "user": "LM",
    "rating": 4.0,
    "message": "I ordered my actual size even though reviews indicated to order down, that shoe ran large. I found just the opposite to be true. I have returned and reordered 1/2 size larger, but I'm not sure they will be big enough.  Tiny little shoes. I may have to go with a full size larger. Cute shoes otherwise."
  },
  {
    "user": "travelintheusa",
    "rating": 5.0,
    "message": "I am a sucker for sneakers.  I love them and have a lot- all brands, colors, patterns and if I see a deal, I can convince myself that I need them.  I will toss mine into the washer when they get dirty and so they don’t last forever.  When I saw Princess Kate wearing these and they were on sale at Amazon- well I did need a new pair of plain blue, so….. Anyways, they are a perfect little sneaker that fit well.  Hey- if they are good enough for a princess, they are good enough for us, right?!"
  },
  {
    "user": "Joan G",
    "rating": 5.0,
    "message": "Very comfortable. Look very nice.  Great fit."
  },
  {
    "user": "Dennis Peji",
    "rating": 3.0,
    "message": "LOVE the shoe but they had black sharpie marks on the canvas. I bought white shoes but they came with awful stains. One shoe marks were much worse BUT both shoes were damaged. So disappointing!!!! Seller failed to check quality control prior to shipping!"
  },
  {
    "user": "KJ",
    "rating": 4.0,
    "message": "I was looking forward to wearing these, but the shoe was huge!!  Definitely size down."
  },
  {
    "user": "Juanita T",
    "rating": 4.0,
    "message": "Although these look super cute it does have some flaws..First off, I had to return for a 1/2 size smaller than what I normally wear, be aware these shoes are heavy and the canvas is stiff but then again I’ve never owned a canvas made shoe so maybe it’s the norm. With that being said..it is a cute shoe."
  },
  {
    "user": "Romeo",
    "rating": 4.0,
    "message": "Gave it 4-stars...w an arch, could easily be a 5."
  },
  {
    "user": "Les Sheridan",
    "rating": 4.0,
    "message": "Love it. Classic white sneaker look. Really nice, however, runs a little big."
  },
  {
    "user": "D. Moore",
    "rating": 3.0,
    "message": "NEW on top of the pic and OLD on the bottom. Also, attached is their email response to my inquiry today. NEW: Silver rings, Made in Mexico, and the heel logo is not nearly as crisply cut or defined. Also, the shoebox seems a bit wider and the material used is slightly stiffer. The stiffness could be due to them being new shoes though, so not too worried about that since they'll break down. At first, we thought it was a counterfeit product that was both shipped and sold by Amazon, but we emailed Superga and they confirmed they have manufacturing plans in Mexico, Vietnam, and other places of the world that they will pull wholesale inventory from when needed. OLD: Gold rings, Made in Vietnam, and the heel logo is crisp and looks like what you'd expect. These were bought a year ago directly from Superga themselves. All in all, if anyone sees a Mexico brand shoe from Amazon or other companies, so long as it's from a reputable sourced company like Amazon's own inventory it should be 100% legit without issue. Just seems quality control in different parts of the world, as would be expected, varies is all. Hope this helps any future person buying that has the same questions as we did."
  },
  {
    "user": "R. Landry",
    "rating": 4.0,
    "message": "These sneakers fit great, they are comfortable and look really good, however, they squeak when I walk, sounds like I’m walking on an old wooden floor. I decided to keep them and I have worn them 5 different days, hoping the noise stops after I wear them some more. I’m thinking they are probably not authentic Superga, are at least not a first quality pair. I wanted white but they were sold out of my size so I bought black, not sure that I will order the white pair form here now. Nonetheless, I do like the way they look and feel."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes so much that I ordered another pair to replace my first pair after  a seagull made an unusually accurate shot on my first pair.  I wore them exactly 4 times on vacation.  As we were leaving our first hotel, we had our suitcases and other bags on a luggage cart.  The bag of shoes was hanging from a hook on the cart above the suitcases.  These white shoes were on top since I had decided last minute not to wear them on a rainy day.  That night, after we had unloaded and were unpacking at our 2nd hotel stay, I found the shoes soiled with bird droppings!  The gull had to have placed a pinpoint accurate shot on my shoe bag.  Took me a day to surmise how that bird could have gotten the shoe but missed me.  The hanging shoe bag had to have been the scene of the crime.  And after seeing how accurately they hit statues and public landmarks while leaving most of the area around those site unfettered, I don't think it was an accident :-)  !!  Thank goodness my size was still available (with a bit of a savings!). I usually take an 8wide or an 8-1/2 wide.  If I can't get a wide width, going up to a 9 will often work depending on the toe box width.  Toe box width on this size 8-1/2 shoe is pretty wide as is the heel.  You'll need socks that cover the Achilles ankle or these will rub.  I'm not sure that a heel grip would stick to the canvas of this shoe.  I also have a bit of a hammer toe, so I wear gel cushion around my big toe.  The canvas seam is near the big toe joint and could be an irritant for this condition.  But the gel cushions work for me.  The canvas seems to stretch a bit after a few wears."
  },
  {
    "user": "MaryF",
    "rating": 5.0,
    "message": "…"
  },
  {
    "user": "mrs. karen h. green",
    "rating": 3.0,
    "message": "too small. shoe is true to size so recommendation to go a half size smaller is bad advice."
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "This is better than my 3 diget  priciest sneakers.  These are extremely well made, great  side support and toe box room. In all my sneakers I take out insole and put in my own orthotics.  These are tremendous and now the shoe I grab and go.  Looks great, comfortable and  I am in stylish. I  am going to  go back and try to get colors for fall.  I can get 4 pair of these great sneakers  for the price of my ortho recommended clunky sneakers."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoes are heavy for a sneaker. The heel is a little wide, so they slide up and down. I will have to buy heel inserts that stay put. The arch support could be higher. But, I use supports. So, for my money I think they are high price for made in Mexico. Don't know if I will buy them again"
  },
  {
    "user": "S. Hamm",
    "rating": 4.0,
    "message": "Loved the look. Never saw another pair in Italy, France, or Spain but what did I care. Mostly tourists and of course they were wearing American brands.  They certainly looked great with everything I wore from dresses to shorts!"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "message": "I like this shoe. I don't love it, but I like it. I wish I could give it 3.5 stars because it's neither a 3/5 or a 4/5. Few things to keep in mind: - It's a European brand, so it should be expected that it runs a little wide. If you have narrow feeties, expect some wiggle room in the toes. - That being said, I did NOT expect it to run large, too. I typically wear a size 10 US across any brand. For this brand, I had to size down. I sent back a size 10 and got a size 9.5, but to be honest I probably could have gotten away with a 9. - It's a heavy shoe, and it runs loose in the heel area (which is very interesting...). Unless you tie your laces to the point of cutting off circulation, your heel will be moving up and down with each step. Not the greatest, but not so annoying that I'd stop wearing these. Overall, I probably wouldn't go out of my way to order this again. And I certainly wouldn't pay over 50$ for it, so wait for the price to go down before you order."
  },
  {
    "user": "Susie",
    "rating": 5.0,
    "message": "I have worn this style of Supergas for years now and I just love them! They are big enough to fit my orthotics. I recently wore them on a trip where we walked a ton and they were perfect! Sturdy, stylish and comfortable! Doesn’t get much better than that!"
  },
  {
    "user": "Deborah A. Barry",
    "rating": 4.0,
    "message": "Fits true to size. Comfy. Will keep this. But it is a little on the heavy side."
  },
  {
    "user": "HM",
    "rating": 5.0,
    "message": "The media could not be loaded. Looking for a more comfortable replacement for my Chucks.. these have a lot more cushion; but a little loose in the heel… I tend to have this happen occasional with dress shoes- but not sneakers.. anyhow if u are an old runner- ‘locking the laces’  does the trick.. good value.."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "I bought my usual size 8 but these run big and fit awkwardly. To be honest I never really wear them because they feel way too big and weird. Like clown shoes. Disappointed because everyone seems to really enjoy this brand.. they’re stiff and uncomfortable. Bobs brand are way more comfy!"
  },
  {
    "user": "Maria",
    "rating": 3.0,
    "message": "I got them in my normal size, but they are swimming on my feet. I could have gone a full size down, and they make my feet look like boats. The no show socks I got to wear with them kept sliding down my heel and I wonder it it was because of how loosey-goosey these shoes were. I already wore them and I'm too lazy to attempt a return. So I guess I'll just wear giant shoes this summer, I suppose its better than tight shoes. But don't be like me, order at least 1/2 size down, possibly a full size, and try them on immediately so you can return if they are made for giants."
  },
  {
    "user": "Laura Reynolds",
    "rating": 5.0,
    "message": "Superga never disappoints! Fits & great sneaker!"
  },
  {
    "user": "Sproutie",
    "rating": 4.0,
    "message": "I have been wanting to try these shoes for a while, but they were just a bit too expensive.  I decided to give them a try when I found a great price here.  It took a couple weeks for the order to arrive, which was disappointing, but understandable during Covid times.  The weight on the box says 2.5lbs, and they are heavier than your average sneaker.  The canvas is a bit stiff straight out of the box, as is the sole, but once you start walking, you can feel how comfortable they are.  I've worn them several times, and each time I wear them, they get more comfortable, not to mention they look great!  The only reason I give this 4 stars instead of 5, the heel is a bit big, even when wearing no show socks, so there is a bit of slippage, but not enough for me to return the shoe.  Other than the heel, it does run a bit big.  Depending on the shoe style, I wear both an 8.5 and 9.  I ordered an 8.5, and they fit fine (besides the heel)."
  },
  {
    "user": "Gaia",
    "rating": 4.0,
    "message": "Very pretty shoes. At first they're kinda uncomfortable but after a few uses they're okay and they're very good quality."
  },
  {
    "user": "LovemyJRTs",
    "rating": 3.0,
    "message": "If you are used to VANS sneakers, these are nothing like them.  I had another pair of Supergas previously and I remember they are a heavier shoe but they were comfortable.  Perhaps I've changed but these feel much heavier and because I'm a barefoot girl and do not wear footies or socks with my sneaks, these gave me blisters. The fabric is extremely rough.  I can try washing them and using fabric softener... I own VANS too and there's just no comparison. VANS right out of the box are very comfortable, good support and no need for socks/footies.  The look of Supergas is much more \"chunky\".  I probably will not buy another pair and just stick with VANS."
  },
  {
    "user": "Kiwi",
    "rating": 4.0,
    "message": "I love the low profile look of this shoe to wear with summer dresses and Capri pants. While I do like the shoe, I was very surprised at the weight of them on my feet. Not something I'd want to wear for any long stretches of time."
  },
  {
    "user": "yellowduck",
    "rating": 5.0,
    "message": "Perfect for people who want canvas shoes but want something besides Converse. If it’s good enough for the Duchess of Cambridge, it will work for commoners too."
  },
  {
    "user": "Mandy H",
    "rating": 4.0,
    "message": "I love these shoes. I order a new pair every spring. Comfy, casual, fun. I'm so sad that my new pair squeak terribly. I'm no ninja, but I still don't need folks hearing me coming."
  },
  {
    "user": "I Alva",
    "rating": 5.0,
    "message": "I love these. Comfortable out of the box, didn’t need to break them in and they’re very cute with jeans, shorts or even a summer skirt. I had to buy them in white because I like them so much!!"
  },
  {
    "user": "Jayme Ok",
    "rating": 4.0,
    "message": "I like these but they were just a bit large and not as comfortable as I had expected. There is arch support but not a lot. I could wear them 2 hours tops I think. Not all-day walking shoes."
  },
  {
    "user": "mustang annie",
    "rating": 3.0,
    "message": "Liked the sneaker a lot; however, the interior footbed had no support for arch or otherwise.  The one supplied is really glued in, so removing it might not be an option.  I tried adding a thin arch support, but then that made the sneaker too tight.  Dang."
  },
  {
    "user": "SMW",
    "rating": 4.0,
    "message": "Well crafted sneaker. I ordered an 8, my typical sneaker size, but it was to big so I sent it back, no issues with return. I ordered a 7 1/2 (from another website) and they fit perfect! Kind of a heavy sneaker, but great for those fun springtime fashions, dress, capris or shorts."
  },
  {
    "user": "Kelly Wildeman",
    "rating": 5.0,
    "message": "I ordered a couple pairs of these to get the right fit since I was confused about the sizing. I wear a 6.5 in vans, 6 in Tom’s, 7 in Nike, 36 narrow in birks and 7 in Allbirds. The best fit for me was the Unisex 36, wms 6/mens 4.5. I also bought the woman’s 6 but they were too narrow for me. I actually liked the wider toe box and that I could wear socks. Not sure if it makes a difference but the ones I kept were made in Mexico. The ones I am returning were made in Vietnam."
  },
  {
    "user": "sandra l.",
    "rating": 5.0,
    "message": "These shoes are great for me. I was able to wear these all day right away, so comfy and perfect fit for me!"
  },
  {
    "user": "Mrs. Z",
    "rating": 3.0,
    "message": "I think these shoes were awful. I’m not convinced they were authentic because so many people love them and the quality of this one I received was junk. No where comparable to the comfort of Adidas Superstar, Sperry Crest Vibe, Vans Slides or Old Skool. They are worse than Keds Champion Original for comfort and quality. That’s why I am not certain these are authentic. I’ve not owned a paid before but I know people rave about them so I may have gotten a bad pair."
  },
  {
    "user": "P.G.",
    "rating": 3.0,
    "message": "I love the fit and feel of these shoes. But one squeaks even after walking miles in them. The insole don’t come out so I can’t baby powder or WD-40 them. I thought it would go away but it hasn’t. I still wear them but the squeak drives me a little nuts especially if walking alone in the quiet. Other than that I love them"
  },
  {
    "user": "Lisa LaFalce",
    "rating": 5.0,
    "message": "I purchased the white ones with the “gold” lace holes as everything else sold out in my size. An unusual looking sneaker. Very classy looking. Can be worn with a suit on workday “dress downs.”  So glad I purchased them. Very supportive sole and great for walking and or gym days. A bit on the wide side; easily fixed with a sock."
  },
  {
    "user": "Jeudepalme",
    "rating": 4.0,
    "message": "I bought these shoes as I wanted a pair of athletic shoes that I felt were not clunky and looked a little dressier than my other athletic shoes.  I was not disappointed. What was a pleasant surprise was how comfortable and well made they were. I just wish I knew a good way to keep them clean as they are canvas. I have machine washed them twice and set them out in the sun to dry. They look pretty good after cleaning."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I have very wide shapeless feet.  The little toe on my right foot somehow dislocated itself and hangs out. These are great!! No problem with wonky toe, plenty wide and comfortable. I did have to put slide grips in the heel of the shoes to keep them from rising up when I walk. If you have narrow feet these probably won’t work for you, but if you suffer from ugly wide feet shaped like a loaf of bread you will be happy with these I hope the other colors will be available soon as I plan on buying more For reference, Skechers wide is too narrow. I have a pair of proper extra wide which fit well. I ordered these in a 71/2, and they fit!!"
  },
  {
    "user": "Patricia Baessler",
    "rating": 5.0,
    "message": "My daughter-in-law bought these sneakers in Italy on a trip. I admired them and she told me they are sold on Amazon.  I ordered a pair and when they arrived I couldn’t wait to put them on. I LOVE them. Then I saw an article that Prince William’s wife the Duchess wears these too. They are comfortable, fit perfectly and look great. Buy these, you’ll be glad you did!"
  },
  {
    "user": "Ghazal",
    "rating": 4.0,
    "message": "I mostly wear 9.5 of Nike and 9 in other shoes but here in this case. Shoe size 9 was one size large and have to return it sadly.  I would suggest when you choose make sure either to choose the option by prime to try before you buy or go for one size small."
  },
  {
    "user": "RobNCatK",
    "rating": 4.0,
    "message": "So I ordered these 1/2 size smaller than what I usually wear.  They were too small.  I'm a true 8 and I should of ordered an 8.  Maybe even an 81/2.  Super cute though, but had to return.  Bummed."
  },
  {
    "user": "Victoria Oms",
    "rating": 3.0,
    "message": "These shoes look exactly how I hoped they would, unfortunately after several wears they are squeaking relentlessly. I had hoped this would go away as they break in but I think it's actually getting worse. They squeak on wood, on cement, on carpet- every surface, nonstop. I do also have to warn that they seem to be about a half size to a full size too big. I'm usually a 7.5, occasionally an 8 in narrower shoes, so I ordered a 7.5. Unfortunately, these are pretty loose on me. Not unwearable, but definitely not a perfect fit. I'd recommend sizing at least a half size down."
  },
  {
    "user": "kat",
    "rating": 5.0,
    "message": "I didn't know if I liked the fit originally so I padded around my house for a bit.  The toe box is large and I thought my toe brushed the end of the shoe - I switched to normal thickness socks and found them to be perfect.  I have since worn them all day and found them to be rather comfy.  The toe box is rather roomy and they pretty much run true to size.  These are a woman's shoe and not a unisex.  I wear an 8.5-9 so I ordered an 8.5 and that was perfect - not snug, but a roomy 8.5.  I will purchase more in the future as they are a universal shoe that really can be worn with anything"
  },
  {
    "user": "Delaney",
    "rating": 5.0,
    "message": "My shoes sizes ranges between a 7.5-8, after reading reviews i decided to order a 7.5 and they fit perfectly! the shoes are wider than other brands such as vans, and the soles offer good support"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was surprised because I have moderately wide feet and a small bunion on one foot. Despite all of that, the shoes were comfy Day 1. I walked about 4 miles day 1, I little bit of redness at the heal, but that is fairly normal for me."
  },
  {
    "user": "Rose D. Taylor",
    "rating": 4.0,
    "message": "ODERED MY SIZE AND THEY WERE TOO BIG SLIPPING OFF FEET/"
  },
  {
    "user": "jill beatty",
    "rating": 5.0,
    "message": "These came in pretty quick.  I normally wear a size 8 but ordered a 7 1/2 because of the comments.  They fit great.  I really like these sneakers and hope I can keep them clean! And the price was nice!"
  },
  {
    "user": "L. Roberts",
    "rating": 4.0,
    "message": "It took me couple times to get the correct size but I really like these shoes.  I got the sage gray and it's a very pretty neutral color.  The material is a little stiff and rough on bare feet but im hoping it loosens up a bit over time.  I would definitely recommend some no show socks."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Cute shoes if you’re looking for something like the Butterfly table tennis shoe"
  },
  {
    "user": "Teetalow",
    "rating": 3.0,
    "message": "I read to downsize which I did. They were still way big & way too wide. I wouldn’t recommend the shoes if u have a narrow r even B width."
  },
  {
    "user": "AB",
    "rating": 3.0,
    "message": "This is probably the third pair of these I've had, this time they just seem bigger and less comfortable than in previous years."
  },
  {
    "user": "h2odancer",
    "rating": 3.0,
    "message": "This shoe runs wide and is heavy (compared to other brands, similar style). Expect it will last a long time due to thick sole. First European brand I’ve been able to buy due to the half sizes."
  },
  {
    "user": "Phyllis Handly",
    "rating": 3.0,
    "message": "The shoes are great looking however, the sizing is very large, at least a whole size to large."
  },
  {
    "user": "Catherine G.",
    "rating": 4.0,
    "message": "I was excited to receive these shoes but they are too large. I ordered my usual size (US) but I need at least half a size smaller. They seem like great quality and came very nicely packaged. I will most likely order again, half a size smaller."
  },
  {
    "user": "J. Paul",
    "rating": 3.0,
    "message": "I ordered my normal size 8 but my heel slipped out of the sneaker when I walked. Sent them back and I’m hoping a half size smaller works  because I love the way they look"
  },
  {
    "user": "Joanna",
    "rating": 5.0,
    "message": "This is my fifth pair of this sneaker. I have 2  in rose gold, green, red and now white. I like the 5 hole lacing ,which is not too high on my arch. It’s not too narrow and they look great."
  },
  {
    "user": "trixietelemetry",
    "rating": 5.0,
    "message": "I had this show in a 37 and had to go up to 37.5 since my feet grew. The heel is pretty loose but otherwise the shoe is great."
  },
  {
    "user": "PHR1020",
    "rating": 3.0,
    "message": "They are cute and stylish but run big."
  },
  {
    "user": "Maxie S.",
    "rating": 5.0,
    "message": "The sneaker was as advertised and pictured. Very happy with the purchase"
  },
  {
    "user": "Gina",
    "rating": 5.0,
    "message": "These sneakers are very comfortable, slightly wider width than most, and a well priced yet fashionable alternative to converse or a running shoe. You can wear them as a sleeker alternative and chicer."
  },
  {
    "user": "nancy from oregon",
    "rating": 3.0,
    "message": "I really wanted to love these but i have a narrow foot and the heels of these are too large. It’s probably because they are unisex shoes. The length was spot on. They have no arch support so you will have to put in inserts if that is important to you."
  },
  {
    "user": "Ojai Girl",
    "rating": 3.0,
    "message": "I've been reading the reviews that this sneaker runs large and so ordered the 6. I usually wear a 6.5  The 6 arrived and was too short ... my toes hit the front. When I went to exchange them, there was no 6.5 available so tried a 7. Huge!!!! Checked to see if a 6.5 was now available and it was. So ... third time lucky except that the 6.5 is still really big. I have thick Dr. Scholl's inserts and heel grips to stop my heels from coming out of the shoes. I also have to tighten the laces as much as possible as the sneakers are high as well as wide. These wouldn't work for a narrow foot. I'll persevere and I think they'll be OK. They're really retro/cute and make my teeny feet look normal."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "I originally found this brand when I was in Italy and loved them. Very comfy and they really wear well. Reminds me of the quality I used to get from Keds years ago before they got cheap. Canvas is heavy duty and the rubber soles really hold up. The construction is quality also. I washed them in the washing machine multiple times with no damage at all. I do air dry. The white above is my second pair only because I wanted a more summer color. The original pair ( 3 years old) are still great, look just as good as the day I bought them. Well worth every penny."
  },
  {
    "user": "MARIA C C",
    "rating": 2.0,
    "message": "I have had 3 pairs of Superga and have always loved them, as they are comfortable and a bit more dressy than an actual sneaker. I ordered these to replace a pair that was already looking too worn, but I am disappointed with the fit. They feel weird...they are not comfortable and when I walk I feel as if they are coming off. It's a shame. I was going to replace my other pair but now I'm afraid to do so and have the same thing happen..."
  }
]