[
  {
    "user": "Summer Boy",
    "rating": 5.0,
    "message": "Count on Steve Madden for a relevant, stylish shoe that screams comfort. My school teacher spouse loves the added height courtesy of the discreet wedge!"
  },
  {
    "user": "Alvi",
    "rating": 4.0,
    "message": "These are narrow but they stretched to fit my feet after I wore them around the house for few day. Very cute!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these shoes. They are very comfortable and have a hidden wedge that gives you a little lift without being uncomfortable."
  },
  {
    "user": "TaurusVT",
    "rating": 3.0,
    "message": "I have been trying to break these shoes in for a couple of months now because they are super cute! However, I can only tolerate them for a lil while without having to switch my shoes midday. I have a desk job, so it's not like I'm on my feet a lot either. The issue for me is that these shoes hurt the forefoot bone and I have thin feet. Not sure what the issue is but unfortunately they'll just sit in my closet."
  },
  {
    "user": "E. Chiu",
    "rating": 3.0,
    "message": "This shoe looks cute and classy but is very painful on the big toe as well as my pinky. The stitch from the inside keeps on digging into my the bone at the base of my pinky and on my big toes."
  },
  {
    "user": "Trish",
    "rating": 5.0,
    "message": "Love them—-"
  },
  {
    "user": "KristaC",
    "rating": 3.0,
    "message": "I got this in both black and taupe size 9.5. However for some reason the taupe is extra tight and I felt it the moment I slipped my feet in without zipping up. I wore it twice hoping it would stretch but I didn't. Couldn't keep it on for more than an hour. I'm surprised especially since I do not have this problem with the black pair. Update: I did not wear this shoe for a couple of months but decided to try again. I'm wearing at least once a week. In the beginning I have to remove during the day as it was tight. But I am able to wear it for longer periods. It is definitely stretching now. But still tight Update 2: A year and a half later ..... no longer trying to stretch out the taupe one just too painful. Been wearing the black 4-5 days a week for work and its great. But the sole has worn out on the outside heel on both sides (could be because of how i walk) to the point where its uncomfortable. but for a year and a half of use for the price id buy again to replace these. black only tho. wont chance getting any other colour as i live outside of the US and returning isnt possible."
  },
  {
    "user": "Gil",
    "rating": 4.0,
    "message": "After 4 hours or so my feet started hurting. Maybe not wide enough! I work in a office but used the stairs quite often"
  },
  {
    "user": "Jake Erickson",
    "rating": 2.0,
    "message": "They look great but are soooo uncomfortable. I only wear these when I know it’s only for an hour or two. Really bummed by this."
  },
  {
    "user": "Laura Madden",
    "rating": 5.0,
    "message": "Very comfortable and gives you the lift that makes your clothes look better and enhances your posture"
  },
  {
    "user": "Edina",
    "rating": 4.0,
    "message": "Super comfortable, but little tight on the top...might just need to break them in."
  },
  {
    "user": "Jason",
    "rating": 4.0,
    "message": "They are really cute in person."
  },
  {
    "user": "Harvey",
    "rating": 3.0,
    "message": "I am a very healthy, very active 36-year-old and I'm on my feet all day as a teacher. Comfortable, supportive shoes are a must in this industry and these aren't that. If I wear these for any length of time my back hurts, my hips hurt and my knees ache. I don't really know what that means for how these are designed, but it's not for comfort! They're very cute and I wish I loved to wear them but alas... I don't. I wear them for short periods of time but never all day. If you're a spry youngster who doesn't yet care about shoe comfort (you will one day, I promise) then buy these! If you're an elder millennial with old bones and joints, move along. I got an 8.5 because of other reviews and I usually wear an 8. They fit fine."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Shoes fit good and look good"
  },
  {
    "user": "Adrianne",
    "rating": 5.0,
    "message": "I purchased these shoes for my daughter to match a jacket when she went back to school. The shoes fit to her actual size and the pattern matched the jacket. She loves the shoes more now because the teachers gave her wonderful comments."
  },
  {
    "user": "KatieKay1983",
    "rating": 5.0,
    "message": "These are great! So comfy and nicely made. Considering buying a 2nd pair!"
  },
  {
    "user": "lynda kelley",
    "rating": 5.0,
    "message": "This is my second pair and I love them. Love his shoes."
  },
  {
    "user": "T",
    "rating": 5.0,
    "message": "Perfect very confy"
  },
  {
    "user": "Tony Frazetti",
    "rating": 5.0,
    "message": "Love the style and comfort"
  },
  {
    "user": "gina sizer",
    "rating": 5.0,
    "message": "I love the look and fit."
  },
  {
    "user": "Patricia Lewis",
    "rating": 5.0,
    "message": "Thank you 😊"
  },
  {
    "user": "Patty Gramley",
    "rating": 3.0,
    "message": "Pinches outside of left toes, seemes narrow"
  },
  {
    "user": "L. Zaucha",
    "rating": 5.0,
    "message": "Fits as expected, the blue is a true navy and they feel like I’m wearing sneakers!"
  },
  {
    "user": "Jim",
    "rating": 4.0,
    "message": "Very well made, and very cute.  However, they are not true to size.  They run small."
  },
  {
    "user": "Joanne W",
    "rating": 5.0,
    "message": "Super good quality!! I wore them around the house for a few days to \"break them in\" as the canvas was stiff, but that is because the material is not flimsy.  They are very comfortable now.  I am very happy with this purchase."
  },
  {
    "user": "Dorothy DeLorenzo",
    "rating": 4.0,
    "message": "I really like the look of these shoes. My only negative is that they are a little narrow in the toes."
  },
  {
    "user": "Deborah Goldseker",
    "rating": 5.0,
    "message": "Love these. Look great"
  },
  {
    "user": "Nancy S",
    "rating": 5.0,
    "message": "Like this shoe so much also bought in black"
  },
  {
    "user": "Ellie",
    "rating": 5.0,
    "message": "I absolutely love these shoes . They are by far my favorite pair of wedges and I have a lot of wedges. I would highly recommend."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "LOVE. Get compliments on them every time I wear them. True to size. One label rubs the bottom of my foot wrong"
  },
  {
    "user": "Jenni L.",
    "rating": 5.0,
    "message": "Love these! true to size. Took a time or two to get used to the type of shoe, but now is my favorite shoe for work, and comfortable!"
  },
  {
    "user": "Ms Kay",
    "rating": 5.0,
    "message": "Cute shoes! Looks just like the picture and comfortable. Fits perfectly and great for an everyday, casual shoes."
  },
  {
    "user": "V!",
    "rating": 2.0,
    "message": "These looked as expected. Immediately when putting them on, though, I could feel a larger bulk of material pinching and rubbing on the outside of my foot where the bottom of the zipper was. I have thin feet, and pinching shoes is not usually a problem I have. If they were that uncomfortable just putting them on, there was no way I was going to try wearing them for a full day."
  },
  {
    "user": "Brad Kaiser",
    "rating": 5.0,
    "message": "True to size.  I am an 8.5 and they fit awesome"
  },
  {
    "user": "G Mattia",
    "rating": 5.0,
    "message": "Granddaughter’s birthday present was a big hit!"
  },
  {
    "user": "Momof2",
    "rating": 5.0,
    "message": "Love them. Comfortable, they are firm at first. You can tell they're well made. Price is prob about right $59."
  },
  {
    "user": "Jacqueline Maxwell",
    "rating": 5.0,
    "message": "Love the shoes and are very comfortable after getting my right size."
  },
  {
    "user": "djmom",
    "rating": 2.0,
    "message": "I returned this product to Amazon. Looks very stylish. But the inside seam stitching were rough on the feet. Even with socks. Irritating"
  },
  {
    "user": "Shannon",
    "rating": 1.0,
    "message": "So uncomfortable. Skip them! They’re terrible!"
  },
  {
    "user": "Ron Curtis",
    "rating": 5.0,
    "message": "So comfortable and looks great with athletic clothes and jeans"
  },
  {
    "user": "Camilla",
    "rating": 5.0,
    "message": "Look very cute with leggings! Love these shoes! The shoes are a little narrow but not uncomfortable."
  },
  {
    "user": "Robbin",
    "rating": 5.0,
    "message": "Surprised how comfortable the shoe is"
  },
  {
    "user": "smee76",
    "rating": 2.0,
    "message": "It’s up the zipper hurts your foot really bad I had to return these shoes they were otherwise perfect! I wish I could’ve kept them but the zipper is placed really badly and pushes on top of your foot!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these! Goes great with leggings and jeans!"
  },
  {
    "user": "Heather Terwiske",
    "rating": 5.0,
    "message": "Very comfortable!"
  },
  {
    "user": "barbara b. jefferson",
    "rating": 5.0,
    "message": "I like everything"
  },
  {
    "user": "Mariet Ostos",
    "rating": 5.0,
    "message": "Pretty"
  },
  {
    "user": "Shopperess",
    "rating": 5.0,
    "message": "Very stylish wedge sneakers"
  },
  {
    "user": "Rita Rupert",
    "rating": 1.0,
    "message": "The zipper broke in 2 months. 😒 Past return time 😒 Out $70"
  },
  {
    "user": "Brandon Mansfield",
    "rating": 1.0,
    "message": "Very disappointed in these shoes, especially since they are Steve Madden brand. I expected better. There was glue staining the shoes and the seams were uneven. They are also about the most uncomfortable shoes I have ever put on my feet. There is no way I could wear these."
  },
  {
    "user": "Geraldine M Chrils",
    "rating": 2.0,
    "message": "Tight across the top of the toes. Hopefully they will loosen up."
  },
  {
    "user": "Ashley",
    "rating": 1.0,
    "message": "Size was way off!! I wear a size 8 and felt like a size 6 fit. Very disappointed."
  },
  {
    "user": "Patricia Way",
    "rating": 5.0,
    "message": "Absolutely love these. Dress up or down and really comfortable."
  },
  {
    "user": "Danielle",
    "rating": 1.0,
    "message": "Wore these shoes once.  The sides are wearing off already.  I’m very disappointed.  I expected better from a Steve Madden shoe."
  },
  {
    "user": "Lisa S Windorf",
    "rating": 1.0,
    "message": "These run small."
  },
  {
    "user": "Debra A. Jones",
    "rating": 4.0,
    "message": "Marrow at toes but I can manage. Not for a day of walking. I’m a 9 but ordered a 9.5 and they were still a bit too small. Won’t be able to wear socks for sure! May return and get the size 10"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Once I saw these shoes, I knew I had to buy them. I wasn’t sure what size to get because I’m between a 9- 9 1/2 depending on the brand so after reading other reviews, I went up half a size. The 9 1/2 were perfect! These are very comfortable and I wear low no-show socks with them. Unlike many other shoes with a wedge, I didn’t have any issues with blisters or feeling uncomfortable. I bought these in Gray, and want the Black & Taupe."
  },
  {
    "user": "Dorothy Sims",
    "rating": 5.0,
    "message": "Loved the shoes but they run really small so order a larger size"
  },
  {
    "user": "El Nav",
    "rating": 5.0,
    "message": "Love these shoes"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Once I broke them in, they were perfect for our Caribbean Cruise. I walk from a cane becuase of MS. These are my shoes to wear when I walk around Europe and when I wear skirts or dress pants since I’m not capable of walking with heels"
  },
  {
    "user": "Maura",
    "rating": 2.0,
    "message": "Cute shoes and mostly comfy but the zipper doesn’t stay up when you walk a lot, which is obnoxious. Bought them to wear while visiting my sister overseas and knew we’d be on foot mostly. Had to keep zipping them up over and over again so I just left them there. Bummer."
  },
  {
    "user": "cristina sanchez",
    "rating": 5.0,
    "message": "Son muy bonitos y comodos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes."
  },
  {
    "user": "Heather M May",
    "rating": 5.0,
    "message": "Perfect for ankle length jeans! Can be dressed up or down"
  },
  {
    "user": "kellyann delaney",
    "rating": 5.0,
    "message": "Love the style and the fit they were perfect"
  },
  {
    "user": null,
    "rating": null,
    "message": "recebi o produto chegou muito rapido e é lindo perfeito muito obrigado"
  },
  {
    "user": null,
    "rating": null,
    "message": "These shoes are not comfortable and I love Steve Madden shoes.  The zipper buckle digs into my feet and making it hard to walk without feeling it.  Will be returning these shoes."
  },
  {
    "user": null,
    "rating": null,
    "message": "love these shoes"
  }
]