[
  {
    "user": "Maisha",
    "rating": 5.0,
    "message": "These are great. First time I got a new pair of shoes and it didn't hurt when I walked in them on the first day. These are now my everyday shoes. My husband and I went to Toronto and Niagara Falls back in August and I wore these everywhere we walked, which was a lot. I'm writing this review nearly 3 months after getting them, and as much as I'd like to share some photos, I'd rather save myself the embarrassment cause of how dirty they've gotten. I fully plan on getting them in other colors. I've gotten compliments on these from both men and women. Let's be honest, if you slapped a Nike or Adidas or even Balenciaga logo on these, people would be drooling all over them. But for now they're just these underrated shoes off of Amazon. If you like how they look, get them. They're worth it."
  },
  {
    "user": "Linda W",
    "rating": 4.0,
    "message": "I usually wear size 7 1/2 wide but, since it didn’t come in half sizes or wide width, had to order size 8. The shoes are a snug fit, but feel ok. They look nice & make my foot look slender. They are not so easy to slip into - have to work at getting them on but the price is lower than other brands so worth the effort. Time will tell if they hold up after normal wear."
  },
  {
    "user": "Vickie",
    "rating": 5.0,
    "message": "I bought these for a slip on pair of shoes to run errands in and I thought they were a cute color. They are really comfortable and the material is like a sweater but it stretches to your feet.  I am very pleased with purchase and will likely buy other colors. The insert is removeable so you can add your favorite ortho insert depending on your needs. They are very lightweight. Thanks!"
  },
  {
    "user": "Sara Holmes",
    "rating": 4.0,
    "message": "They are really cute and really comfy. I’ll be buying more in more colors. I love the little extra support up around the ankle. There is a little dipping divot right over where my smaller toes sit but it doesn’t stop the functionality of the shoe itself."
  },
  {
    "user": "chris",
    "rating": 4.0,
    "message": "Easy to get on. Very light weight. Fairly comfortable. Fit true to size."
  },
  {
    "user": "Beverly F.",
    "rating": 5.0,
    "message": "Love the shoe. Really comfortable. I got 3 other colors. Not sure how to  keep the back of the shoe from going out of shape after washing. Is it cardboard in the back?"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "These slip ins tick all the boxes for me.  The support is good, comfort is wonderful and they are very light weight.  I don’t think you’ll be sorry if you decide to buy them.  And with Amazon’s amazing return policy, you have nothing to loose"
  },
  {
    "user": "Jessica",
    "rating": 4.0,
    "message": "Picked these for their red color to match my school colors for an event but the red is more orange red. Fit is fine, wish their was more support in the shoe. Will keep because it’s too late to get another pair in time."
  },
  {
    "user": "Nrossboss",
    "rating": 4.0,
    "message": "Nice comfort shoe , Love the shoe it just needs more cushion in the inside , after a few wears shoe gets hard on heels ."
  },
  {
    "user": "Patricia Clifford",
    "rating": 4.0,
    "message": "I was very pleased with these walking shoes.  The delivery was quick, the fit is great but I gave it a 4 star because I received a grey pair, not the navy blue I ordered.  I didn't return them because I like the fit and the comfy feeling on my feet."
  },
  {
    "user": "Karen A.",
    "rating": 5.0,
    "message": "This is my second pair of these shoes.  The first pair has not worn out, I just like them that much.  They are supportive and light weight.  I wear orthotics for serious running and hiking, but the insoles on these are great for regular wear and even walking.  They are easy on and off and can be worn with or without socks.  It's a great product."
  },
  {
    "user": "patricia",
    "rating": 4.0,
    "message": "i wear them all the time very comfortable"
  },
  {
    "user": "Ewingstar",
    "rating": 4.0,
    "message": "Extremely comfortable and lightweight"
  },
  {
    "user": "Alisha",
    "rating": 5.0,
    "message": "These aren't as comfortable and supportive as other shows are. The insole is pretty thin and offers minimal support. The length of the shoe is just slightly shorter than it's described size. I comfortably fit an 11 and in these my toes are hitting the top of the shoe. Definitely not an 11. Style wise they're very cute but that doesn't keep your feet from hurting. If you're not a size 11 order a size up and get a little more room in the toe box."
  },
  {
    "user": "ysaira salas",
    "rating": 4.0,
    "message": "Comodidad y peso ligero"
  },
  {
    "user": "Robin Abresch",
    "rating": 5.0,
    "message": "These fit perfectly and are so comfortable! I am going to buy another pair in a different color. I wear them every day!"
  },
  {
    "user": "Vive",
    "rating": 5.0,
    "message": "I normally wear a 7 1/2 to 8.  I purchased the 8.  TOO snug on my big toes.  Re-ordered a 9.  wore with thin footlet....go bigger, you'll be glad.  Otherwise, a wonderful well constructed product !"
  },
  {
    "user": "FIH",
    "rating": 4.0,
    "message": "Exactly what I wanted, fit well, light weight and really nice"
  },
  {
    "user": "Ron R",
    "rating": 5.0,
    "message": "Always enjoy the fit of this brand of shoe.  Just wish they would produce half sizes."
  },
  {
    "user": "Telling it like it is..",
    "rating": 4.0,
    "message": "I like how easy they slip on and feel so light weight. But I bought an 8 which is a half size up for me..and my toe is at the very tip. I won't wear these for walking..but will wear for style and to go out shopping or for short periods. They may stretch..might do an update as I just got mine today and haven't worn them out. Overall..they look and feel good. Nice style slip on for the price."
  },
  {
    "user": "Maribeth",
    "rating": 5.0,
    "message": "These are just a described - lightweight,  flexible, and very comfortable. First night I wore them to a football game walking the grounds and gravel parking lot.  It felt like I was wearing comfy slippers! Next day I walked 2 miles in them with the same feeling! I'll be ordering more!"
  },
  {
    "user": "Dianne",
    "rating": 4.0,
    "message": "What I liked about these shoes is that they look nice and are comfortable.  I would recommend buying a size up from what you wear or 1/2 size up because these literally are a chore to put on.  Taking them off is really easy however, each time I take them off the insert comes out and needs to be put back in.  Too bad they don't glue it in?  I definitely will buy more of these but just a size bigger next time just to have a little more wiggle room."
  },
  {
    "user": "N.C",
    "rating": 4.0,
    "message": "Liked the fit priced right would buy it again"
  },
  {
    "user": "Joannie",
    "rating": 5.0,
    "message": "Stylish and comfy. I hate shoestrings. These are perfect."
  },
  {
    "user": "Johanna",
    "rating": 5.0,
    "message": "They feel like I’m walking on air beautiful shoes saved the day!!!!"
  },
  {
    "user": "Betty Shipley",
    "rating": 5.0,
    "message": "Exactly what I wanted.  Fit great, feel great and look great!"
  },
  {
    "user": "Nancy B",
    "rating": 4.0,
    "message": "These shoes are very comfortable and very light weight.  The heel could be a little higher, I can't wear them long time, but I do like them I just can't wear flat shoes like I use to.  Would recommend."
  },
  {
    "user": "CD",
    "rating": 5.0,
    "message": "Went on vacation did a lot of walking"
  },
  {
    "user": "jude",
    "rating": 5.0,
    "message": "The mesh is so comfortable.  Great walking shoe."
  },
  {
    "user": "kathy g.",
    "rating": 5.0,
    "message": "Very comfortable and lightweight. Easy on and off Had a lot of compliments on them already. Just don’t walk through wet grass with them on or your socks will get wet."
  },
  {
    "user": "michele wade",
    "rating": 5.0,
    "message": "You cannot beat these as in lightweight, attractive, comfort & ease to put on and fair pricing."
  },
  {
    "user": "Dawn",
    "rating": 5.0,
    "message": "Like walking on air!!!"
  },
  {
    "user": "Terri",
    "rating": 5.0,
    "message": "Loved everything about these. Hopefully get a pair in every color"
  },
  {
    "user": "Lena",
    "rating": 5.0,
    "message": "Very comfortable, light weight, supportive and affordable. Choice of color."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Loved the fit and light weight. Super comfy and they slid right on  Only downfall is you can definitely feel a rock if you step one."
  },
  {
    "user": "lorraine magee",
    "rating": 5.0,
    "message": "i loved them- great walking shoes"
  },
  {
    "user": "D.D.",
    "rating": 5.0,
    "message": "They look great on and they fit fine especially with an insole added in for comfort. Glad that I got them."
  },
  {
    "user": "Marnier",
    "rating": 4.0,
    "message": "Very light weight shoe, exactly what I expected. I walk my dog daily and needed new shoes with quality soles. These are fine and are what I expected for the price. If you need major support, these are not for you. But if you need a comfortable sole these are perfect. I enjoy the \"sock\" fit too."
  },
  {
    "user": "SoonerDuck",
    "rating": 5.0,
    "message": "Super comfy and lightweight. These are my go to for running errands."
  },
  {
    "user": "Jess Dishman",
    "rating": 4.0,
    "message": "I love the color, I love how lightweight they are. I wish I'd gotten a half size bigger. And they're comfortable- but not THE MOST comfortable. Granted, this may have been different had I gotten a half size bigger. Also wish I'd considered how the top part, while very flexible and comfortable- mesh like and breathable..... Is not waterproof and I'm wearing these in a kitchen at work. But great value, I do love them, and I'll definitely wear them to death for the next few years lol."
  },
  {
    "user": "Glynis Lowry",
    "rating": 5.0,
    "message": "No dislike. Casual wear"
  },
  {
    "user": "Randy Lairson",
    "rating": 4.0,
    "message": "These are a great every day shoe. They are extremely light weight. The insoles are lightly supportive - if you need a lot of support this is not the shoe for you. They hug your foot like a sock. If you can't bend down to pull on a shoe these will not work for you - they really do pull on like a sock. The toe and heel of the shoe have a very strange slightly rigid piece in them that reminds me of cardboard - it helps the shoe keep its shape but took a little getting used to as far as comfort. The shoe runs slightly small in length - my toes are at the end of the shoe so I'm not uncomfortable but on longer walks they would cause a lot of friction on the tips of the toes. The color of the shoe is true to the picture choices. I bought red and I really love how the color pops. The shoe does not provide ankle support so if you need that in a shoe this is not the shoe for you. I believe the shoe to be true to what is advertised. The cost of the shoe is exceptional."
  },
  {
    "user": "MinKaren",
    "rating": 5.0,
    "message": "Sooo comfortable! Perfect fit and I love the smoothness!"
  },
  {
    "user": "Cynthia Bullard",
    "rating": 5.0,
    "message": "How light they are also very comfortable"
  },
  {
    "user": "letha evins",
    "rating": 4.0,
    "message": "sadly they got snagged the second time I wore them but I patched them and wear them to work with long pants"
  },
  {
    "user": "Monica Thomas",
    "rating": 5.0,
    "message": "Love these shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They look great and are comfy for the most part. However, if you are a size and half these aren’t meant for you. I’m a size 7 1/2 so I got a 7 at first but they were to small. Then i got a 8 and they are too big. If I wear thick socks then they kinda fit fine."
  },
  {
    "user": "Kelli",
    "rating": 5.0,
    "message": "These shoes are comfortable. I do add inserts for additional support. They fit as expected. I ordered size 10 medium"
  },
  {
    "user": "Pepper Calvert",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Nothing to dislike everyday travel for walking."
  },
  {
    "user": "R. J Ridley",
    "rating": 4.0,
    "message": "These shoes are so extremely comfortable that I hesitate to say anything. But, they are a little difficult to put on. The tops of the shoes are close fitting, with no fastenings, more like socks. What this means is that I can't just slide my feet in. I have to sit with my leg up on the bed or couch, and with a shoe horn to hold the back of the shoe in place, and pull them on. It is a bit of work, but so worth it, because then the rest of the day, my feet feel wonderful, and I have some arthritic toe knuckles. These shoes are so recommended for the wearable comfort, but I do want to be completely truthful and let people know. As for me, I am seriously considering getting a second pair."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They are comfortable"
  },
  {
    "user": "elizabeth",
    "rating": 4.0,
    "message": "I’ve always worn a size 7, but this shoe runs just a little too small.  Love the comfort and they have been a lifesaver after I hurt the back of my foot.  Next time I will order a size larger."
  },
  {
    "user": "sjb  ND",
    "rating": 5.0,
    "message": "Really like this shoe.  The fit is perfect.  They are lightweight."
  },
  {
    "user": "Earthquake Prof",
    "rating": 5.0,
    "message": "My first pair was so cute one of my kids has taken them.  These are fun, easy to put on, supportive, and are durable.  Plus they are super cute."
  },
  {
    "user": "Saundra",
    "rating": 3.0,
    "message": "I had ordered a smaller size bc another brand ran big - I gave the too small pair away and ordered a larger size - for some reason the left sole doesn’t stay in place and leaves about an 1/8” which pinches my toe - if I wasn’t too annoyed and lazy I’d send back - will likely not order again.  Only one shoe had issue so likley defect"
  },
  {
    "user": "teach",
    "rating": 5.0,
    "message": "Comfortable footwear. Easy to slip on and off. Will get another pair"
  },
  {
    "user": "christian",
    "rating": 5.0,
    "message": "These shoes have saved my life. I am on my feet walking and sometimes running around for 10 hours or more a day. I've had them for awhile now and wear them everyday and they still hold up! Must buy very comfortable and easy to slip on!"
  },
  {
    "user": "Elle pea",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "Jacque",
    "rating": 5.0,
    "message": "I like the comfort and it’s very light"
  },
  {
    "user": "Clev",
    "rating": 5.0,
    "message": "Comfortable good fit"
  },
  {
    "user": "Aartie Mahase",
    "rating": 4.0,
    "message": "Runs small. So for wider feet please order a size up."
  },
  {
    "user": "Ollie Mabry",
    "rating": 5.0,
    "message": "Every day wear fit as expected have six pair already"
  },
  {
    "user": "Constance L. Ferguson",
    "rating": 4.0,
    "message": "Easy to get on & comfortable."
  },
  {
    "user": "Kay Butler",
    "rating": 4.0,
    "message": "Size runs small"
  },
  {
    "user": "Blanca E arcemaldonado",
    "rating": 5.0,
    "message": "Están muy buenos y sueves pero muy pequeño"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Only wish they were water proof"
  },
  {
    "user": "Tee",
    "rating": 5.0,
    "message": "Very comfy shoes... stretch like material . May want to do half size up"
  },
  {
    "user": "Dorothy Norals",
    "rating": 5.0,
    "message": "I'm an LPN and I'm on my feet all night.  I purchased these shoes in hopes of finding comfort for my feet. Best decision I made for my feet. Not heavy on my feet, very comfortable and definitely worth it."
  },
  {
    "user": "Marcela Rivanoy",
    "rating": 4.0,
    "message": "Me gusto mucho, quede feliz  son muy comoda el color me encantó, y son muy livianas!"
  },
  {
    "user": "Karen Templeton",
    "rating": 4.0,
    "message": "I already have three pairs of this style in neutrals from another (more expensive) brand, which are the workhorses of my casual shoe wardrobe. I won’t wear bright colors as often, so the price point of these was very appealing. They’re a little stiff, and the toe box came sunken in, but I think wearing them and/or a little steam will take care of both issues. The sole feels substantial, and comfortable enough for store runs and other outings, but not sure about long walks. But the bright colors are gorgeous, and for the price a good value."
  },
  {
    "user": "Vernita",
    "rating": 5.0,
    "message": "Really good"
  },
  {
    "user": "sylvia",
    "rating": 5.0,
    "message": "FIT WELL"
  },
  {
    "user": "agh",
    "rating": 3.0,
    "message": "They arrived with the fabric slightly shredded and after wearing them for 2 weeks they look terrible. They’re very comfortable though."
  },
  {
    "user": "Deborah N. Trapp",
    "rating": 5.0,
    "message": "These are so comfortable.  Just like the write up said they would be."
  },
  {
    "user": "Shoots",
    "rating": 5.0,
    "message": "I love my shoe, it's so comfy. I bought 2, one for my sister who stands long hrs at work. It stretches to fit. Ty and will order in the future for my son and gran-daughter."
  },
  {
    "user": "Dorothy Moody",
    "rating": 3.0,
    "message": "Love the shoes.  Got wrong size. Can I exchange for 8 1/2?"
  },
  {
    "user": "Elizabeth H.",
    "rating": 4.0,
    "message": "I wear 8 to 8-1/2 and ordered an 8. My toes pushed against the tip of the shoe. I really like these shoes, and am going to reorder a pair in a larger size. I need shoes that are light weight and let air in, because my feet get hot in most athletic type shoes."
  },
  {
    "user": "Missy",
    "rating": 5.0,
    "message": "Very comfortable, purchased as a gift. Perfect fit, lightweight & comfortable, don’t hesitate to purchase, you won’t regret it."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "confortable"
  },
  {
    "user": "CoCo",
    "rating": 5.0,
    "message": "These shoes are very comfy and lightweight but they are a little small. I had return the old ones and size up cause they hurt my toes. But they new ones are perfect!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wanted easy slip-on shoes to be worn outside. These are a good value for the price."
  },
  {
    "user": "love knitting",
    "rating": 5.0,
    "message": "just wear thin socks and they are perfect..nice and snug"
  },
  {
    "user": "Belinda Bolden",
    "rating": 5.0,
    "message": "So comfortable"
  },
  {
    "user": "RealBebopMusic",
    "rating": 5.0,
    "message": "If your feet swell or you find marks on you feet caused by the tongue or other parts of your footwear, this is for you. You slip them on like socks and they stay put with minimal pressure. Surprisingly light weight and comfortable, with or without socks. I removed the insoles and replaced them with more substantial ones because my feet are awfully flat. Priced very well and shipped in a minimal plastic bag (yes, I like that too). I purchased the black on black and may have to pick up a few more colors. I highly recommend this product."
  },
  {
    "user": "Janie Cruz",
    "rating": 5.0,
    "message": "Lightweight"
  },
  {
    "user": "Wutangtattoo",
    "rating": 2.0,
    "message": "Ok here the deal. They feel amazing. However it all depends on you. The sole is not stuck to the shoe at all. For me at first I didn’t care at all but after wearing a few times this week now I can feel the sole moving out of place with every step I take. At first it would only move when I took off the shoe. I love how it wraps your ankle but it can look plain and weird when u wear long black pants because it kind of blends and looks boring. I’d suggest leggings so u can see the shoe pop more! The shoe is also kind of bent forward. So u feel like your standing up straight while simultaneously doing a Michael Jackson and leaning forward somehow. Can feel a little weird so I suggest these shoes not be worn by older women especially if they’re already becoming prone to falls and stuff. Even more since the sole moves! I’d be scared to gift these to my 60 year old mom who has gotten clumsier. I’m returning because these aren’t really work shoes they’re just on your feet all day shoes. I stubbed my toe with my ladder and it hurt so bad no protection the shoe feels very thin when u get hurt so it hurts even more since it bounces off nothing! I’ve hit my toe with that ladder and the bottoms of my shoes usually stop it but these shoes are just not that type."
  },
  {
    "user": "Luz marina saavedra",
    "rating": 5.0,
    "message": "Muy cómodos"
  },
  {
    "user": "sharon",
    "rating": 5.0,
    "message": "Machine washable"
  },
  {
    "user": "Sandra",
    "rating": 4.0,
    "message": "Impressed at the comfort and flexibility of the shoe.  I have 4 stars because for my flat foot I need extra support that I had to put in. Other than that, I'd repurchase again."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Comfortable light weight walking shoes"
  },
  {
    "user": "DLD",
    "rating": 5.0,
    "message": "They are the most comfortable shoes I own. I need to wear orthotics due to medical issues so I inserted them and it's like wearing an arch supportive shoe while giving you complete freedom to flex your feet while walking...as if you were wearing only socks.  There is no binding or tight feel anywhere on my feet.  I highly recommend these shoes.  I purchased the black on black and they look great with my capris and jeans."
  },
  {
    "user": "Char",
    "rating": 3.0,
    "message": "Lightweight."
  },
  {
    "user": "EC does it",
    "rating": 5.0,
    "message": "My PT urged me to wear shoes to support my feet while walking inside the house Instead of flip flops or walking barefoot.  I had spine surgery, I wanted shoes to slip on and off easily without bending. These fit like gloves on my feet and give enough support while walking as required by my surgeon.  My feet feels so good not having to wear clunky gym shoes, these shoes I wear inside the house to keep clean and looking stylish!  Easier to slip off then putting on but I can’t bend so I sit.  It is comfy breathable, lightweight,  stylish and well made!  I’m ordering another for outside wear!"
  },
  {
    "user": "Mechelle Jarrett",
    "rating": 4.0,
    "message": "Live them will buy again please please more colors"
  },
  {
    "user": "Sharon L. Hamel",
    "rating": 3.0,
    "message": "Too small"
  },
  {
    "user": "TerryLyn",
    "rating": 4.0,
    "message": "Fits to size very light weight"
  },
  {
    "user": "Judie",
    "rating": 3.0,
    "message": "I HAVE AT LEAST 8 PAIR OF THESE IN OTHER BRANDS IN A SIZE 8 THAT FIT PERFECT. AS SOON AS I OPENED THE BOX I KNEW THESE WERE CUT SMALL. YOU NEED TO ORDER A 1/2 SIZE UP."
  },
  {
    "user": "debbie damon",
    "rating": 4.0,
    "message": "I thought it would have a bit more style but I'm ok using them for my everyday running errands. They are light weight and comfortable. It saves my better sneakers for hiking and walking trails."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Where it for work"
  }
]