[
  {
    "user": "B.Garcia87",
    "rating": 4.0,
    "message": "I bought this as a cheap shoe for work. I work on the ramp at an airport. Shoes are super lightweight, they almost remind of a water shoe… I would definitely consider getting a pair to use in the creek/out adventuring. Size wise I’m normally an 8.5 in womens running shoes so I ordered a mens 7. They are fine for walking, I think if I were going to use them to work out I might go for a 7.5 in mens just so I had a little extra space from the front of the shoe… the shoe is fairly roomy, I have a wide foot so I can manage, wouldn’t get them if you have a very narrow foot. Overall happy with the purchase."
  },
  {
    "user": "hannamand",
    "rating": 5.0,
    "message": "I bought both the Blue and Black versions of these.  I like the black ones very much, the blue ones not quite as much. There are subtle differences such as the loop at the heal being different sized. I would say these run about a half size small, but the fabric stretches, if you like compression socks, you'll like these. I've worn these for a month or so now, and these are the lightest weight, most cushioned sole sneakers I've ever owned.  Almost like wearing slippers, and I really enjoy them."
  },
  {
    "user": "lisam72",
    "rating": 4.0,
    "message": "They weren't quite what I thought they would be but they work for other use."
  },
  {
    "user": "Leo Trotter",
    "rating": 4.0,
    "message": "Product was exactly as described. Great running sneaker"
  },
  {
    "user": "Scott l",
    "rating": 4.0,
    "message": "They work"
  },
  {
    "user": "Brad F.",
    "rating": 5.0,
    "message": "I’m a shoe freak.  Took a flyer on these (because of the price) for weekend knock-arounds.  Unbelievably light and actually feel like water shoes (or aqua socks).  Look good with shorts or khakis.  I have 2 pair now, light tan and light grey.  Looking for another color now.  I do not use these for running.  Only knock I have on these is the insert will come out when the shoes are removed.  Obviously not a deal breaker for me."
  },
  {
    "user": "Chris H",
    "rating": 4.0,
    "message": "If you are looking for a shoe just to knock around in, these are an economical and comfortable option.  They were not the best choice to wear while working due to the support, but otherwise were nice looking and pretty easy to get on."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wanted a shoe that I could just slip on and walk out the door.  I love the slip on shoes."
  },
  {
    "user": "Han Solo",
    "rating": 5.0,
    "message": "at first sight when it arrived, i thought it was a sandal.  so light.  tried it on and was very surprised how comfortable it feels.  thinking about buying two more pairs in different colors for the summer!"
  },
  {
    "user": "James",
    "rating": 5.0,
    "message": "I have a 8.5/9.0 size shoe, depending on the manufacturer. I purchased these exclusively for work, on a slippery (paper dust) concrete floor and a forklift. The main con here is there is NO size 9.0, only 8.5 or 9.5. I think this is odd, but I am sure there is some reason for it. Nonetheless, I ordered the 9.5 in black. I was expecting it to be a little large. However, this shoe fits me perfectly. Thus my reasoning that, for me, these run small. These stretch. They are not constrictive. I despise tight constricting shoes since they usually hurt my feet. I also hate shoes that are too big as they tend to make me trip (I am already uncoordinated). They have a softer rubber/plastic'y sole. I dont know the material, other than \"Phylon\". I have only worn for two weeks and they are comfortable.  I do feel their flexibility. These shoes are not a stiff shoe. For me, that is a plus. However, non slip they are not. In defense, I have not experienced any shoe that is non slip on the floor at my work. The smooth concrete floor is often covered in a finite paper dust. This makes it slippery and no shoe can stand up to my lack of coordination. My biggest like is they are very breathable. My feet sweat! During the hot days, I need my feet to breathe. These do that quite well. Also, I enjoy and actual solid sole. Some other \"fancy\" shoes I purchased were comfortable, but they had a very thin tread and wore out quickly. They did not last long. Time will tell if these last long. Another plus for these shoes, is there is very little text on the shoe. The only text is on the tongue of the shoe. They are also easy to put on, almost like a slip on shoe that does not fall off. Out of the box (and still now) there are no defects. It appears to be well put together. If I can get 8 months use out of these, I will be absolutely buying again."
  },
  {
    "user": "Jose Arizabaleta",
    "rating": 4.0,
    "message": "Livianos. Sin mucho amortiguamiento. Buen precio. Presentación impecable y suficientemente cómodos.  Excelentes para estar en casa u oficina, o en espacios con alguna informalidad."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The running shoes is great. The support is good. The light weight is excellent. I would give 8 from 10."
  },
  {
    "user": "Derek",
    "rating": 4.0,
    "message": "Not bad but also a little large and flimsy. However based on the price it is a pretty good deal"
  },
  {
    "user": "Gavin P.",
    "rating": 5.0,
    "message": "If you buy this for a running or walking shoe you will be wasting your money.  It has no support at all.  The reason I gave it a five star was they are nice in appearance, very light wait, and would be a nice shoe to wear for getting cocktails with a friend or eating out with you better half."
  },
  {
    "user": "Richard R.",
    "rating": 5.0,
    "message": "The shoes delivered as expected they fit just fine, very comfortable and very lightweight. This is my second pair, I got 8months on the last pair and they are my daily drivers. If you require a supportive ankle support these might not be you’re first choice but I’m ok with a loose fit around the ankles, keeps swelling down."
  },
  {
    "user": "Janet Pelton",
    "rating": 5.0,
    "message": "Easy on and off.  Excellent for insid.  Have not used them outside."
  },
  {
    "user": "scheye1",
    "rating": 5.0,
    "message": "Ordered these for doing work outside in the summer. They’re lightweight and breathable, perfect for running errands all day. The sole feels like it’s made of foam, and the rest of the shoe is a thin mesh so there’s really no protection for your toes if you drop something on them. I’ll probably put these in the closet for the cold season, but I think they’ll hold up well for a few years. Good price, too!"
  },
  {
    "user": "Mike",
    "rating": 5.0,
    "message": "Great fit and price"
  },
  {
    "user": "SOG",
    "rating": 4.0,
    "message": "I ordered for support and light weight both are in this shoe could use a little more padding in ball joint area but great shoe for the money"
  },
  {
    "user": "Sib Seven",
    "rating": 5.0,
    "message": "Ultra lightweight, stretchable grip of foot,and a very comfortable soul. Their like dancing on clouds."
  },
  {
    "user": "Jay G.",
    "rating": 4.0,
    "message": "This is NOT a running shoe. It is quite comfortable and looks good as a casual shoe."
  },
  {
    "user": "Dr. Hook",
    "rating": 5.0,
    "message": "Very comfortable."
  },
  {
    "user": "humpert297",
    "rating": 5.0,
    "message": "These fit like a $100.00 plus pair of Skecheers. Just Great Shoes....."
  },
  {
    "user": "Leon Finklea",
    "rating": 5.0,
    "message": "They matched my outfits an the colors are good thinking of getting more pairs"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are lightweight and very comfortable. They don’t offer much in the way of arch support at all. Good for walking but they are NOT running shoes. They run large consistently. I ordered a size US 12 and they send UK 46 which are actually US 13. These are my second pair but my first pair are still lasting nicely after a year or so. Just wanted another color."
  },
  {
    "user": "Robert Willams",
    "rating": 5.0,
    "message": "I bought these shoes because they looked like they would be comfortable and light weight. After wearing them for 17hrs straight I was not disappointed. It's like not wearing shoes at all."
  },
  {
    "user": "JSS",
    "rating": 5.0,
    "message": "I ordered a pair about 9 months ago, and wear them almost daily.  They are very comfortable and lightweight.  When dirty, I just throw them in the washing machine along with my laundry, and they come out looking new.  Will definitely buy again."
  },
  {
    "user": "N. Abbott",
    "rating": 5.0,
    "message": "These shoes are great. Very comfortable and great looking.  They look like tie-ups, but they are actually slip ons. Really no need to spend $100+ on fashion kicks from boutique sites."
  },
  {
    "user": "nick menudier",
    "rating": 3.0,
    "message": "for the money i knew i wasn't getting something with the quality of a new balance, saucony.. i was just looking for a cheap shoe i could wear around the office and as a everyday. the price fits the bill. comfort was there. drawbacks are the laces won't really stay tight and come undone easily which is kind of annoying.  the biggest issue is the sole wears really quick. i'm a heal walker and am hard on shoes/ socks.  these aren't meant to last for sure. when the soles wear like these do the shoes become slippery of smooth or wet surfaces. be aware of that as you will bust your hind end quick. it's like wearing old flip flops on a wet garage floor .. after 2 months of wear the soles are about smooth. i took a grinding disc to the soles and cut grooves in them like you do a dirt track tire. got some grip back and will last a few more months before they are totally done. can't say i'd buy them again, i'd go back to a true athletic shoe. but for the price. no complaints."
  },
  {
    "user": "Kevin B.",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Kenneth Lombardo",
    "rating": 5.0,
    "message": "It’s a good show at a good price!"
  },
  {
    "user": "Douglas",
    "rating": 4.0,
    "message": "They are comfortable at first but do not have long lasting comfort, after about 30 minutes feet started to fatigue. Also material at heel is thin so heel tends to rise up when walking. Shoe looks great and is very stylish to me. will probably purchase again  - price is right  - going to try some shoe cushions & heel grips"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They are very comfortable tennis shoes"
  },
  {
    "user": "Tom Sesame",
    "rating": 4.0,
    "message": "The shoes are surprisingly light weight and comfortable. Good for everyday wear and walking; not durable enough for running, not waterproof. Note that these are slip-ons; the laces are merely decorative. Available in half-sizes, which is rare for reasonably-priced shoes"
  },
  {
    "user": "David Brown",
    "rating": 5.0,
    "message": "LOVE"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "message": "Great knock around shoe for the price"
  },
  {
    "user": "Peache",
    "rating": 5.0,
    "message": "Fit well and they are nice color"
  },
  {
    "user": "KcR",
    "rating": 4.0,
    "message": "not my favorite, but ok for back up shoe"
  },
  {
    "user": "Andrae Burke",
    "rating": 5.0,
    "message": "Great value for the price! And stylish worn the right way! Not built to be worn everyday or heavy-duty activities but you can rock them to the mall or friends house or a little gathering"
  },
  {
    "user": "Starhooven",
    "rating": 3.0,
    "message": "I purchased these in two different sizes for my father who requested non-slip shoes for therapy.  The shoes were very light but I couldn't get either one to fit.  I couldn't get the 10.5 on his foot and the 11, once it was on, was very big (lots of extra room at the toe).  Sneaker seemed to run long and narrow which didn't work.  However, even if they did fit, they were very slippery on a low pile carpet.  Maybe they meant \"non-slip\" for a concrete or linoleum floor?"
  },
  {
    "user": "Keith Bryan",
    "rating": 4.0,
    "message": "Nice lightweight shoe for a good price."
  },
  {
    "user": "HARDIE",
    "rating": 5.0,
    "message": "LOVE these shoes - bought a second pair after 6 months. Why spend a hundred bucks for pricier brands when these babies get the job done & are super comfy???"
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "I ordered two pair, grey and off-white (beige). They are comfortable, well made a a great value for the price. I'll definitely be ordering again."
  },
  {
    "user": "Allen Huebner",
    "rating": 4.0,
    "message": "All good.  Walking!"
  },
  {
    "user": "Erica Burkholder",
    "rating": 4.0,
    "message": "shoes were good"
  },
  {
    "user": "Georgia Gian",
    "rating": 5.0,
    "message": "Easy nice looking slip on shoe."
  },
  {
    "user": "Brewski",
    "rating": 5.0,
    "message": "Easy on and easy off and comfortable!"
  },
  {
    "user": "Kris",
    "rating": 5.0,
    "message": "Great shoes for running. Light and comfortable."
  },
  {
    "user": "Jarold C.",
    "rating": 5.0,
    "message": "About the most comfortable shoes I’ve ever worn. Anxious to see how well they hold up after a few months."
  },
  {
    "user": "John Saggio",
    "rating": 4.0,
    "message": "Shoes are great but the sizes are not consistently accurate, I first ordered yellow zize 8 to sample the sizing. I received a pair labeled 8 but it really was about 6 or 7. I then ordered 2 pairs size 9.5 figuring this would prove to be size 8,5 and sure enough the size of each pair was 8,5. I then ordered two more pairs at size 9.5 ,but this time the size was 9, a bit too large but wearable for my feet. The colors are terrific and the shoes are light and comfortable!!! If only the sizes were accurate!!!"
  },
  {
    "user": "Matthew",
    "rating": 5.0,
    "message": "For casual walking shoes these are fantastic!  They are not made for actual athletics so if you try to play tennis or basketball in them, you will probably twist an ankle.  For standing for a few hours or walking around they are great."
  },
  {
    "user": "Marky Mark",
    "rating": 4.0,
    "message": "Great when you remove and put-on regularly."
  },
  {
    "user": "Brad",
    "rating": 3.0,
    "message": "It's a classy looking shoe that lasts long but it's no Sketchers.  I have been getting blisters left and right and am deciding if I should just buy inserts."
  },
  {
    "user": "Yussuf A Kalib",
    "rating": 5.0,
    "message": "Comfortable shoes, light"
  },
  {
    "user": "heberto gonzalez jr",
    "rating": 5.0,
    "message": "The comfort of these shoes was exceptional. Thumbs up 👍"
  },
  {
    "user": "Jim",
    "rating": 5.0,
    "message": "They do not last long. I’ve had mine three months and they already need to be replaced"
  },
  {
    "user": "eric stottlemire",
    "rating": 4.0,
    "message": "I bought these knowing I'd have to run around a convention center while working for a week. I was on my feet for almost 80 hours in total and many miles walked. My feet never hurt from the shoes. It felt like walking on clouds. These saved my feet this year and I'm looking forward to having them next year in Chicago for our convention."
  },
  {
    "user": "TRaymond",
    "rating": 5.0,
    "message": "the fit is amazing and the style is just right."
  },
  {
    "user": "Jose A Osorio",
    "rating": 5.0,
    "message": "Very comfortable and light weight"
  },
  {
    "user": "Ephrem HIDUG",
    "rating": 4.0,
    "message": "Like the comfort"
  },
  {
    "user": "B",
    "rating": 5.0,
    "message": "I wear them with no laces. They’re my everyday shoes."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very light, used in a gym workout, found them to be very comfortable. I would highly recommend."
  },
  {
    "user": "Valerie L Reaves",
    "rating": 5.0,
    "message": "Comfortable, light, can be worn dressy or casual."
  },
  {
    "user": "Frank Polito",
    "rating": 3.0,
    "message": "They are a little snug and I am worried they will not loosen up and stay tight forever. I wish they were wider."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I've received several comments on how good & comfortable they look on my feet.  I ordered a white pair as well."
  },
  {
    "user": "John",
    "rating": 5.0,
    "message": "Got a pair of the all black ones for work and they were super lightweight and comfortable. Ended up buying a pair of the black and white ones for everyday use. If you are traveling, these are also easy to slide off if you have to take off your shoes at airport security."
  },
  {
    "user": "Ivan",
    "rating": 5.0,
    "message": "Confortable, stylish and there is wide variety of colors to choose from."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "very light and surprisingly comfortable given its cheap price tag.  the sole doesn't look like it would last long with heavy use or as a running shoe but I basically use them as house shoes and they are prefect for that."
  },
  {
    "user": "Christopher",
    "rating": 4.0,
    "message": "So when I first got these shoes they were packed pretty tightly in my rather small mailbox and I was like these can't be the shoes I ordered. But indeed they were. I'll be honest with you, I'm a pretty heavy set guy so these shoes didn't offer an insane amount of support but they get the job done. I wear them practically everywhere: school, malls, and even hiking. I'm not sure how they would hold up for running per se but they are absolutely a great pair of shoes for casual use and I'm pretty satisfied with them."
  },
  {
    "user": "Alex",
    "rating": 4.0,
    "message": "Es muy cómodo pero a mí entender es muy bajo en el talón"
  },
  {
    "user": "Baritone",
    "rating": 4.0,
    "message": "They're great for just light walking/exercise. NOT super supportive but that's fine for me as I'm big into body mechanics, especially observing the way I way. If I'm walking incorrectly and not distributing my weight on my feet well I'll feel it in these. And they definitely must be broken in! At first I was going to return them, but after a week they're my go to beaters. I wear these suckers for running errands and at work. They're cheap, light, and relatively breathable. Cons: Why the hell are there even laces in these??? They don't \"tighten\" they're just there for aesthetics at this point. You could've just made these slip ons honestly. Also there's no \"grip\" in them so don't use them in non stable/slippery environments"
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "Very comfortable but not for sporty running."
  },
  {
    "user": "Jacob",
    "rating": 3.0,
    "message": "Love how lightweight they are, but my feet barely fit and I ordered my usual size."
  },
  {
    "user": "Damir Z",
    "rating": 3.0,
    "message": "Cheaply made and sole doesn’t have much support"
  },
  {
    "user": "Boy64",
    "rating": 5.0,
    "message": "Great buy! Comfortable too and light weight also."
  },
  {
    "user": "Sam",
    "rating": 4.0,
    "message": "I've only had them a week but have worn them everyday.  They are very light.  I hope that they hold up (the tops are \"cloth\") but will update if they start to fail or I change my rating of them.  Interesting:  there are no tongues in the shoes and thus they are slip-ons with shoe strings to tighten them up.  As a slip-on, they have a novel tab at the back of the shoe to help you pull the shoe on."
  },
  {
    "user": "Park",
    "rating": 5.0,
    "message": "I bought these to take to EDC (which is a 3 day music festival in the desert if you did not know) and I forgot to break them in prior. However, I didn't even need to! They are lightweight, super comfortable, and the sleek look fit with any outfit I had on and allowed me to dance and run around the festival comfortably. I was really surprised by how inexpensive, yet perfect they are. To avoid ware and tear, I'm not going to make these my running/gym shoes, but rather save for the many more festivals I attend or traveling vacations."
  },
  {
    "user": "Jeffrey Chandler",
    "rating": 5.0,
    "message": "These were a gift for my youngest child. They like them so much they want several more pairs."
  },
  {
    "user": "Jesse",
    "rating": 5.0,
    "message": "Good shoe for a good price"
  },
  {
    "user": "curtis dettra",
    "rating": 5.0,
    "message": "Finally a great pair of lazy man sneakers. I know there are other ones but these get 5 stars. These jawns are comfortable and light on the feet. Don't get stuck in the rain though, your feet are gonna get soaked! I'm gettin another pair, different color. Whatever size you wear, buy that size. Fits to size."
  },
  {
    "user": "Elgin",
    "rating": 4.0,
    "message": "The shoe is comfortable just as described"
  },
  {
    "user": "Ricky",
    "rating": 5.0,
    "message": "Very comfortable sturdy lightweight your survey is a little misleading did not know where to choose to designate that it fit well receive the product at a timely manner"
  },
  {
    "user": "Antwain Abrams",
    "rating": 5.0,
    "message": "Very comfortable, good support and lightweight what more could you ask for. Going to order the black and the Navy pair next."
  },
  {
    "user": "Kenneth E. Lenard",
    "rating": 5.0,
    "message": "I plan to wear these as street shoes, not running shoes.  There are very comfortable, the sizing is exactly right (I take a 10.5 and they're perfect) and they look good.  I got the black shoe with the white sole.  I would totally get some in other colors as well.  If they're not durable and start falling apart I'll update the review. Update:  I picked up the black and white, the grey and white and also the all-blue.  I am pretty much living in these shoes.  They're super-comfortable, feel good, look good and they're holding up.  I would agree that they're mildly flimsy but mine are not falling apart.  I'm not running, hiking or biking in these.  I'm just using them as street shoes.  A few people have commented on them and asked where I got them."
  },
  {
    "user": "Michael adkins",
    "rating": 5.0,
    "message": "Very good price and very comfortable"
  },
  {
    "user": "Jeanette",
    "rating": 3.0,
    "message": "Love the shoes, but it runs smaller size. Get 1/2 size bigger"
  },
  {
    "user": "Christian B",
    "rating": 4.0,
    "message": "I liked how lightweight the product is and the comfort was better than expected!"
  },
  {
    "user": "Shadow",
    "rating": 3.0,
    "message": "Only lasted a little over a month of daily use, if the bottom was made out of a stronger material that would help."
  },
  {
    "user": "J Nelson",
    "rating": 5.0,
    "message": "That my toes can move freely! Doesn't hurt my feet at all! I can finally go all day an not have to change my shoes!"
  },
  {
    "user": "Jeff Bryant",
    "rating": 4.0,
    "message": "These are great for the price but I have to add a side note. I walk 5-6 miles a day and bought these as a pair to rotate among my others to save wear and tear. They are incredibly comfortable and lightweight, however after one walk with them ( on sidewalks and paved roads ) the bottom began to shred slightly. After a second walk it happened again. They advertise as running shoes but I think they are more suited for treadmill or indoor tracks than outdoor. I wear them as everyday sneakers around the house, as just a comfortable pair they are definitely 5 star but for exercising I’d recommend using them in a gym and not outdoor use if like myself you do any extensive distance."
  },
  {
    "user": "ap1214",
    "rating": 3.0,
    "message": "These are super comfortable and light weight. They are also strong on top part but the sole is a different story only after three days of normal wear. The bottom of the sole is beginning to show signs of cracks in the rubber. This is quite alarming. I am very disappointed because other than that, these are so comfortable and I love them but the quality is just rubbish."
  },
  {
    "user": "Annie",
    "rating": 4.0,
    "message": "You get whay you pay for and I wanted to pay more and couldn't find my old shoes. These are pretty ok. I guess."
  },
  {
    "user": "Eleazar Villagarcia",
    "rating": 5.0,
    "message": "Gym workouts, love the color. I would like them in jet black."
  },
  {
    "user": "Vince",
    "rating": 4.0,
    "message": "for the price, I really have no regret buying these shoes"
  },
  {
    "user": "David Heydt",
    "rating": 5.0,
    "message": "Very nice light weight and breathable shoes"
  },
  {
    "user": "Mark Woollacott",
    "rating": 4.0,
    "message": "Cheap shoes for slipping on and getting out the door."
  },
  {
    "user": "Italiano256",
    "rating": 5.0,
    "message": "For the price and I'm a Mechanic, they've lasted more then most. I was shocked how light they were with the mesh they're also not hot in the summertime as most shoes."
  },
  {
    "user": "Darryl woodruff",
    "rating": 5.0,
    "message": "Great fit and comfortable"
  },
  {
    "user": "J.R.",
    "rating": 5.0,
    "message": "I use to run long distances and this shoe isn't right for that, but I really like them around the house and they breathe great.  Super light and comfortable.  For some reason the laces are crazy long, I had to cut almost 10\" off and took a lighter to the ends to seal them so they didn't drag.  Great for walking and just wearing."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "No Complaints"
  }
]