[
  {
    "user": "Carole H.",
    "rating": 5.0,
    "message": "I have several pieces of French White and love them all. This  size easily fits into IP for recipes that require an insert. Can use trivet with handles that came with pot to insert or remove. Lid is great, leftovers go right into fridge and into microwave for reheating."
  },
  {
    "user": "Robert Mcquillan",
    "rating": 4.0,
    "message": "easy to clean"
  },
  {
    "user": "Carol A.",
    "rating": 4.0,
    "message": "I like Corning Ware especially when there's company for dinner.  It can go right from the oven to the table and it looks nice.  I have a rack that the Corning Ware dishes will fit in. The only thing about the French White is it can't be used on the stove top."
  },
  {
    "user": "Shagrock",
    "rating": 5.0,
    "message": "This should last a few generations, like with all the stuff from CorningWare."
  },
  {
    "user": "M. Nelson",
    "rating": 5.0,
    "message": "Attractive & easy to use, especially on microwave"
  },
  {
    "user": "J. Wohl",
    "rating": 5.0,
    "message": "My original dish got broken when we moved. Looked in the stores and couldn't find just this dish. Went on to Amazon and found it as a single so ordered it right away. Love this casserole dish as its perfect for small meals."
  },
  {
    "user": "Anubhuti Katiyar",
    "rating": 4.0,
    "message": "Great product.. corningware is really a versatile utensil for the kitchen. Simple and easy to use. Always matches any decor theme. Durable and easy to clean. My only issue was the lid of this piece wasn't really aligned properly. The price is a little high but worth it."
  },
  {
    "user": "Blondie",
    "rating": 5.0,
    "message": "Love these casserole dishes.  Great for all occasions. Can go from a refrigerator to a hot oven.  Be careful with the glass lids, they will chip."
  },
  {
    "user": "MaryJo Kamano",
    "rating": 5.0,
    "message": "Very easy to clean! Great value!"
  },
  {
    "user": "Tracy Crump",
    "rating": 4.0,
    "message": "This 1 1/2-quart bowl was just the size I was looking for to heat/reheat food in the microwave. The white scalloped dish is attractive to use on the table, and the clear lid allows me to see the food while heating. My only complaint is that the lid doesn't fit down into the bowl as well as another bowl I've had for years. I expect it will be more likely to slide off and break when carrying to/from the table. Otherwise, I love the bowl."
  },
  {
    "user": "Sue",
    "rating": 5.0,
    "message": "I’ve had the larger casserole forever, but recently I’ve had so many occurrences where I needed a much smaller one also. So I finally did it & love it!"
  },
  {
    "user": "Regina",
    "rating": 5.0,
    "message": "Beautiful to put food on the table."
  },
  {
    "user": "AuntieJ",
    "rating": 5.0,
    "message": "Purchased as a replacement for the covered 1.5 qt casserole one of my cats destroyed (just being a cat).  I thought the cost was high, even for Corningware, but if it lasts as long as the last one (decades) it will be worth it.  This is the go-to size for our meal prep and I look forward to many years of use.  The seller took extra-extra care with packaging and shipped promptly."
  },
  {
    "user": "Ronald W.",
    "rating": 5.0,
    "message": "This is the best dish to have in your kitchen! Many different uses Best price and we have been looking ! This item sells out fast"
  },
  {
    "user": "Sharon Beverly",
    "rating": 5.0,
    "message": "The only thing this wonderful Corning Ware dish and glass lid won't do is to survive a fall on a tile floor.  That's why I bought it to replace its duplicate--about 20 years old.  It goes from the refrigerator or freezer to the oven or microwave without a problem.  Its classic white good looks make this covered round dish a beautiful complement to your fine china or everyday dishes.  And after use at your table, food can be stored in it in either the refrigerator or freezer. I've been using Corning Ware products for four decades and still think they make a high quality product.  That's an incredible compliment in today's world of anticipated 'use/break/replace' thinking.  If you stop to think about it, how many glass items have you received  more than 10 years ago (that you use several times a week)  that are still functioning like the first day you got them?"
  },
  {
    "user": "MLT",
    "rating": 5.0,
    "message": "CorningWare has always been my \"hot\" dish of choice. It seems in the past decade or two that they've become a touch more fragile, a little more prone to chipping, but that could simply be old-age and clumsiness making me a little less careful about handling them. I use these, no only for cooking, but for serving hot soups, casseroles, anything that might heat a thinner-walled bowl past the comfort point. I rarely store in them (I've got lots of cheap plastic for that - I'm not tying up my good ceramic dishes for fridge storage)."
  },
  {
    "user": "Guru",
    "rating": 5.0,
    "message": "After over 40 years of frequent use, a small chip became a long crack and I had to replace my original dish.  Perfectly fitting cover with a use-all-the-time capacity.  Bake stuffing or mac & cheese in the oven; make rice, steam vegetables or reheat soup/stew in the microwave, this is the perfect dish for the job and goes right to the table, fitting in nicely, regardless of your tableware color or pattern. Cleans beautifully in the dishwasher and is tougher than it looks (unless your kids are 'helping').  With its separate plastic cover, available at  https://www.amazon.com/Corningware-F-5-PC-French-White-Plastic/dp/B008XWTX4G/ref=sr_1_3?s=home-garden&ie=UTF8&qid=1484746364&sr=1-3&keywords=corningware+plastic+lids)  it stores easily in the refrigerator."
  },
  {
    "user": "lsal mom",
    "rating": 5.0,
    "message": "This dish replaces one I had for 12 years and got dropped and broken. It is the exact dish I had and I love it for a package of frozen vegetables. Many have complained about the lid or the product being thin and easily breakable. The lid is supposed to just sit on the dish, it does not seal in any way. This does not keep it from working when you cook with it and allows steam to escape like it should. The dish does not seem thin to me and anything that is not made of metal or plastic can be easily broken. Hopefully you take care with breakable plates and glasses so I don't think this should be any harder to take care of than a plate."
  },
  {
    "user": "Hazel Rogers",
    "rating": 5.0,
    "message": "I purchased 3 sets of this CorningWare French White 1 1/2 quart covered dish as replacements for 3 old ones that just didn't heat well in the microwave anymore.  The old ones were at least 5 years old, probably older.  The new sets work as expected and heat evenly in the microwave.  YAY!  I haven't been able to find them in my local stores for some time.  Glad I found them on Amazon.  The only negative I have is the price.  They were $30 each and that just seemed a bit high."
  },
  {
    "user": "Cindi M.",
    "rating": 3.0,
    "message": "I ordered the ROUND casserole dish and the box I received had a label on it that said it was the round one, but when I opened it up it had an OVAL dish inside! 😩 I wanted this to use for “pot in pot” cooking in my Instant Pot and obviously an oval one won’t work for that... With that being said, it IS a nice casserole dish and I’ve decided to keep it and use it for other things, since I don’t want to go through the hassle of returning it. Thus the 3 star rating... But it would have been nice to get the one I actually ordered. I will be ordering another round one (from a different seller) in hopes that I receive the correct one this time."
  },
  {
    "user": "Ken",
    "rating": 5.0,
    "message": "Bought this to use in my instapot when making a quiche. Works great!!"
  },
  {
    "user": "happy camper",
    "rating": 5.0,
    "message": "This purchase was for an identical replacement item.  28 years ago we purchase one of these dishes along with a 2 quart dish of the same design.  We broke our 1 1/2 quart dish and were heartbroken, because we use this 1 1/2 quart version almost daily.  We microwave most vegtables, polenta and rice dishes in this dish.  We were delighted to find that the identical dish was still available from Amazon.  We bought the replacement dish and we were back to business as usual.  Love it!!"
  },
  {
    "user": "rose marie",
    "rating": 5.0,
    "message": "I like the looks  of this Corningware casserole piece.  It is a bit heavy, but it predictably Corningware!"
  },
  {
    "user": "Patrick",
    "rating": 4.0,
    "message": "Holds 1.5 qt. as described but it seems somewhat smaller than the one its replacing.  I think the sides are higher making for a smaller footprint.  Overall I'm satisfied and CorningWare is dependable."
  },
  {
    "user": "mary l johnston",
    "rating": 5.0,
    "message": "Nice to be able to order just this piece. Not a whole set. Matches rest of set perfectly."
  },
  {
    "user": "Jane",
    "rating": 5.0,
    "message": "These ramekins can be used in many ways - desserts, small casseroles and sides or single serving soufflés. The design is simple and elegant and the size is ideal. The glass is lead and cadmium free, quite durable and able to go directly from fridge to oven. The seller sent the ramekins on time and they were well-packaged to avoid chipping or breaking."
  },
  {
    "user": "jan sparrow",
    "rating": 5.0,
    "message": "I bought to use with my instant pot"
  },
  {
    "user": "JoADrum",
    "rating": 5.0,
    "message": "Fits perfectly in 6 qt.Instant Pot using the lift rack that came with the pot.  You MUST use the stainless steel pot liner.  Take care lifting the rack out because the bowl is even heavier with food in it.  It's perfect for steaming (without the CorningWare lid) and makes a nice presentation at the table.  Comfortably held four servings of chicken."
  },
  {
    "user": "L S",
    "rating": 4.0,
    "message": "Only problem is with the packing. My first two came shattered. I got replacements very quickly and not broken. Love these casserole dishes. I ordered them as replacements for ones that I had for years, but had finally broken. I wish they did not break so easily."
  },
  {
    "user": "L L",
    "rating": 4.0,
    "message": "For can of soup or reheating vegetables this is right size. Gets very hot so transfer to consumption dish usually required."
  },
  {
    "user": "Georgia Hyatt",
    "rating": 4.0,
    "message": "This is a basic covered casserole in a very useful size. This was a replacement for one I broke."
  },
  {
    "user": "S. Mitchell",
    "rating": 5.0,
    "message": "This is not a large baking dish but the perfect size for a 1 or 2 person household. Use for baking or a soufflé."
  },
  {
    "user": "jpack",
    "rating": 5.0,
    "message": "I've used these CorningWare French White cookware for years. I like them because they look nice and bake well. They do not cook quite as well on top of the stove, but I reheat food in them and keep the burner low. I also like to be able to store leftovers in them."
  },
  {
    "user": "Pamela J. Peerce Landers",
    "rating": 4.0,
    "message": "Nice for reheating leftovers. Solidly made as you'd expect from Corning. Dinged it one star for a personal reason: can't get two in my microwave like I can do with my old square ones."
  },
  {
    "user": "Yumo",
    "rating": 4.0,
    "message": "Honestly, I was a bit disappointed by the size but the dish and top itself are gorgeous! It arrived in perfect condition and I find myself using it a lot!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have several pieces of CorningWare.  I won't buy any other bake ware.  Amazon has a great variety."
  },
  {
    "user": "Kenton Couch",
    "rating": 5.0,
    "message": "I bought this Corning Ware product to replace the one I had for decades. It finally broke, and I felt like I had lost a good, dependable friend. The new one is just the same. I think Corning Ware Products are some of the very best out there. You can't go wrong purchasing it."
  },
  {
    "user": "Charles E Clopton",
    "rating": 4.0,
    "message": "Very nice, covered microwaveable dish as long as I don't drop it as I did with the one it will replace."
  },
  {
    "user": "tere carole",
    "rating": 5.0,
    "message": "I use this for cooking and storing food.  It’s pretty for the table, too."
  },
  {
    "user": "Bob",
    "rating": 4.0,
    "message": "Good replacement for one that was broken.  Not as heavy as the original purchased many years ago, but it doesn't matter"
  },
  {
    "user": "Lilly",
    "rating": 5.0,
    "message": "I needed this dish so bad! I “lost” my other Corning Ware white dusgesvin a move. I always go back to this one because it is durable and looks great with any plate pattern you have!"
  },
  {
    "user": "M Brady",
    "rating": 5.0,
    "message": "Have to admit, I am a Corning WARE fan. Have never been disappointed in, nor regretted buying corning ware. This was a good buy for the money and excellent durability for its purpose."
  },
  {
    "user": "Bill Esselstein",
    "rating": 5.0,
    "message": "Same as one inherited from my Mom"
  },
  {
    "user": "Nana Rei",
    "rating": 2.0,
    "message": "I did not receive what is in the picture. In fact I was sent the Corning Ware Frech White III round casserole dish 1 1/2 qt. it us the same volume but a different model. If you haven't seen the French White III don't bother buying it. The actual dish is talker and has less of a flailing out on the edges. The lids for the Frech White III are horrible!  They are a thin disk of glass that is about 1/2\" thick and the edges are not nicely molded. There is a cut out in the middle for a porcelain handle but the whole lid looks so delicate. It looks like it can shatter with the slightest bump or tap. I don't trust this product and I have no idea why I was sent this dish. If you receive a Frech White III return it immediately!"
  },
  {
    "user": "mel bielawski",
    "rating": 3.0,
    "message": "I dont know why but the lid does not sit on it exact other then that it is what it says it is"
  },
  {
    "user": "wjm",
    "rating": 4.0,
    "message": "fine"
  },
  {
    "user": "Linda Lu",
    "rating": 5.0,
    "message": "Great for medium sized dishes, durable and the price is right. I use this in my toaster oven. Easy clean up too."
  },
  {
    "user": "TP",
    "rating": 5.0,
    "message": "This was a replacement."
  },
  {
    "user": "Leigh in Texas",
    "rating": 5.0,
    "message": "I live alone and use this dish constantly for simple easy meals for one. It fits in my toaster oven and it's easy to clean. I like it alot and would get another one immediately if this one got damaged."
  },
  {
    "user": "Judy Payne",
    "rating": 5.0,
    "message": "like"
  },
  {
    "user": "L Galina",
    "rating": 5.0,
    "message": "It's a tight fit sitting on the trivet in an inch of water in the medium sized Instant Pot, but a real cleanup saver in that application. Vegan lasagna on high pressure for 30minutes and a 20minute warm-down."
  },
  {
    "user": "RiverRatNmSAW",
    "rating": 5.0,
    "message": "This Corning Ware dish is a replacement for one we broke.  It is up to the standard we have always expected from Corning Ware.  This dish is perfect for heating side dishes of foods for 3-4 people."
  },
  {
    "user": "KPaints",
    "rating": 5.0,
    "message": "perfect size and the baking lid is great.  i also got the Corningware F-5-PC French White 1.5qt Round lid and LOVE the set!  great size for a 1 -1 1/2 pound meatloaf."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love this one and a half quart corning Ware dish. It’s perfect for oatmeal and warming other foods up."
  },
  {
    "user": "Cat Lover",
    "rating": 5.0,
    "message": "This is a beautiful casserole dish.  Just what I needed!"
  },
  {
    "user": "MLH",
    "rating": 5.0,
    "message": "Ordered to use in my Instant Pot"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Yeah.  It's good,  I preferred the earlier stuff, but what is past is past."
  },
  {
    "user": "DBC1944",
    "rating": 5.0,
    "message": "great item just the right size to cook for one  or two people  LOVE IT  got it quick perfect condition"
  },
  {
    "user": "Todd",
    "rating": 4.0,
    "message": "Seemed like agood product, but when I put the lid on , it would not fit in my toaster oven"
  },
  {
    "user": "Hank",
    "rating": 1.0,
    "message": "Lid is very sloppy. Sloped edges. Accident looking for a place to happen. We don't do any eating or drinking out of any plastic or ceramic from China. Should have checked. Also... it's the genocide."
  },
  {
    "user": "Richard Gursky",
    "rating": 5.0,
    "message": "We use it for many things when cooking. Very durable. Nice size."
  },
  {
    "user": "EDP",
    "rating": 5.0,
    "message": "Love this product.  Use all the time.  I bought this one to replace one that I dropped and broke. This size fits in an Instant Pot 8 quart."
  },
  {
    "user": "SBgal",
    "rating": 4.0,
    "message": "I use it in microwave, gets very hot after cooking..."
  },
  {
    "user": "Larry",
    "rating": 5.0,
    "message": "Item as described quick shipping. Nice bowl, we purchased this to replace one we have had for many, many years."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought 2.  These were the only small microwave-safe containers I could find with glass lids that would keep my double-packs of instant oatmeal from crawling out into my microwave."
  },
  {
    "user": "leslie",
    "rating": 4.0,
    "message": "Nice small to medium size. Lid doesn’t fit well"
  },
  {
    "user": "Len  Perreault",
    "rating": 5.0,
    "message": "Broke the one I had for many years. Amazon was the only place I could go find a replacement. Use this size casserole a lot. Love it!!"
  },
  {
    "user": "Rebecca A. Rooney",
    "rating": 5.0,
    "message": "Perfect size, completes my set, matches everything and looks elegant but is sturdy"
  },
  {
    "user": "Chooyo",
    "rating": 5.0,
    "message": "This one replaced one I had for many years (the bottom actually fell out of the other one due to extensive use).  I think the cover is a bit lighter than the old one but since the old cover fits this dish well, there is no problem.  Overall, a great product."
  },
  {
    "user": "Un-Happy",
    "rating": 1.0,
    "message": "Whole point was to not have to go out and shop.  Now I have to go out and ship it back for refund."
  },
  {
    "user": "Dan S.",
    "rating": 5.0,
    "message": "we've owned corningware dishes like this for years and they stand the test of time. constant heating in microwaves, no cracks at all. just great dishes and we use them all the time. don't really use the lid so cant comment on that but great dish, will be ordering more."
  },
  {
    "user": "Karl F. Miller",
    "rating": 5.0,
    "message": "Items were packed very carefully and arrived safely. They are just as described and I love them!"
  },
  {
    "user": "newdaydawning",
    "rating": 5.0,
    "message": "Excellent quality! Delivered on time and well packageD. I would hope they make this in several sizes.  I would like for identical items except smaller."
  },
  {
    "user": "Diane Shaw",
    "rating": 4.0,
    "message": "It's a gift for my daughter-in-law.  Looks like a nice casserole dish but I won't be the one using it so I really can't rate it."
  },
  {
    "user": "me",
    "rating": 5.0,
    "message": "Good size for 2"
  },
  {
    "user": "allen",
    "rating": 4.0,
    "message": "was as expected"
  },
  {
    "user": "Richard",
    "rating": 5.0,
    "message": "Bought as a companion to our other 1-1/2 Quart and it's almost a perfect match. So slight that you really don't notice the difference. Bought the second one because the first one is usually storing something already in the fridge."
  },
  {
    "user": "Miguel",
    "rating": 2.0,
    "message": "The lid doesn't mate well with the dish and tends to slide around. The lid doesn't have much of a lip but is simply angled.  The top view photo shows the typical result which is the lid is off center.  The lid tends to slide around.  Not good if you are taking this dish somewhere.  I guarantee the lid will fall off and end up broken on the floor.  RMA"
  },
  {
    "user": "Terry the Cook",
    "rating": 4.0,
    "message": "Great in the pressure cooker"
  },
  {
    "user": "BB 1939",
    "rating": 5.0,
    "message": "Very satisfied--replaced product I had had for a long time--thanks"
  },
  {
    "user": "Barbara Wagner",
    "rating": 5.0,
    "message": "CorningWare is my go to cookware. This adds to my collection. Love them!"
  },
  {
    "user": "T. Q. Washburn",
    "rating": 5.0,
    "message": "At last, Glass casserole the right size!  I ordered it and it arrived in no time!  I am delighted  Thanks Amazon Prime!!!"
  },
  {
    "user": "JEANO",
    "rating": 5.0,
    "message": "like it now can casarole right size will buy again"
  },
  {
    "user": "W. K. Hutchinson",
    "rating": 5.0,
    "message": "We purchased this dish to replace one that had broken and just love it.  It is just the right size for a small casserole.  With all but one of our children gone, we don't need as large a casserole as we did before.  The quality is excellent and we expect many good years of service from this dish."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Happy I did not have to buy the entire set of French ware to replace this one dish!"
  },
  {
    "user": "Kryserk",
    "rating": 5.0,
    "message": "Exactly what I was looking for. I accidentally broke the top glass and needed to replace asap."
  },
  {
    "user": "TNPathfinder",
    "rating": 5.0,
    "message": "Just right size for one & two cooking or veggies or salad for family. And as always CorningWare quality product!"
  },
  {
    "user": "suzanne",
    "rating": 5.0,
    "message": "Had to replace one I had for years but got broken. Nice enough to put on the table"
  },
  {
    "user": "P Conrad",
    "rating": 5.0,
    "message": "Love it, awesome.  Typical Corning Ware.  Durable, clean up is easy and it is a great addition to my cookware!"
  },
  {
    "user": "J. Caskey",
    "rating": 5.0,
    "message": "Just what I needed. This is a great product line. The piece was packaged well and delivered in perfect condition."
  },
  {
    "user": "Stacey Holland",
    "rating": 1.0,
    "message": ""
  },
  {
    "user": "Joyce Romanski",
    "rating": 4.0,
    "message": "Would like handles on it to make it easier to remove from microwave and drain liquids..Like the style and color."
  },
  {
    "user": "Gayle",
    "rating": 5.0,
    "message": "Great product...bought for my 8 quart Instant Pot."
  },
  {
    "user": "Abi",
    "rating": 5.0,
    "message": "Very durable."
  },
  {
    "user": "sms",
    "rating": 5.0,
    "message": "Love the size of this dish.  I love to do microwave mac and cheese in it just the right size and looks good for serving."
  },
  {
    "user": "Sharon L.",
    "rating": 5.0,
    "message": "I bought this to replace one I had for over 8 years that I dropped and chipped."
  },
  {
    "user": "Sierra Brady",
    "rating": 5.0,
    "message": "My step mom didn’t know I broke her other one!!!"
  },
  {
    "user": "TLB",
    "rating": 3.0,
    "message": "The dish is the size I wanted, but the lid doesn't fit."
  },
  {
    "user": "Jennifer Hayes",
    "rating": 5.0,
    "message": "I received it in excellent condition & I plan to enjoy using ot ."
  },
  {
    "user": "Debby Ann",
    "rating": 5.0,
    "message": "This fits perfectly in my Instant Pot.  Wonderful for pot in pot cooking...  :)"
  }
]