[
  {
    "user": "Rachael",
    "rating": 5.0,
    "message": "These shoes are amazing.  I bought these because my last shoes only lasted a week and I needed shoes right at that moment.  I decided to look on Amazon for shoes so I could get the shoes fast and I ran across these shoes.  The price was affordable and reading the reviews I chose these shoes.  The next day after getting the shoes I went on a walk to break them in and they worked.  My feet felt great.  They still are in one piece and I can't find a complaint about these shoes.  Will definitely be getting another pair when the time comes.  I will be recommending these shoes to people and family."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "These shoes are gorgeous! I was a bit worried about the fit since my feet are a bit wide and some reviews mentioned needing to go a size up. I did not and purchased true to size. I'm glad that I did. They fit me perfectly and are extremely comfortable!"
  },
  {
    "user": "Annie🌻",
    "rating": 4.0,
    "message": "I loved these shoes when I first got them. The color, comfort, and support were amazing. I had no problem working out with them or using them on a more casual occasion. As of last month, the back spring instead of the shoes had popped out and made it extremely uncomfortable to wear. I did try ways to fix it, but there weren't many options at that point. I did have to throw them out, but they were great while they lasted."
  },
  {
    "user": "Gwenie Smith",
    "rating": 4.0,
    "message": "I like the softness of the sneakers my feet do not ache  even after an 8hour shift of moving around"
  },
  {
    "user": "Jennifer Libby",
    "rating": 5.0,
    "message": "I’m on my feet a lot so comfortability is very important to me. These sneakers are very light weight and comfortable. My feet feel so much better! Thank you"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I had these on my wish list for sometime (another color) and they went on sale in a lightning deal.  I was looking for a sneaker I could wear for Cincinnati Bengals games so chose the grey and orange ones. I was pleasantly surprised about how comfortable they are and they are cute too.  I wear them more than I have worn any sneaker in the past. I would buy these again."
  },
  {
    "user": "Joee",
    "rating": 5.0,
    "message": "I wear them at the gym in a variety of different work outs.  They definitely feel like the heel has a cushion and they protect my knees and hips.  Plus, they look great and I always get compliments."
  },
  {
    "user": "Jill Starkey",
    "rating": 5.0,
    "message": "I tried them on and they fit perfectly they got here quickly and I will give them a test run today."
  },
  {
    "user": "patricia partin",
    "rating": 4.0,
    "message": "I like the shoes, the comfort is nice and the light weight is always nice."
  },
  {
    "user": "Paige C",
    "rating": 5.0,
    "message": "I use these shoes for work where I am on my feet all day. Even from the first day my feet haven’t hurt and I’ve gotten so many compliments! Definitely recommend"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I use them for workout i have really good support in the shoes but if you looking to wear them over the years maybe not get a perfect fit get a size up but this will do me until my track season."
  },
  {
    "user": "Robin Daues",
    "rating": 5.0,
    "message": "I love these shoes! They are very soft, which is what I need for my feet, lots of cushion. I can be on my feet all day at work and they do not hurt at the end of the day."
  },
  {
    "user": "Beverly Johnson",
    "rating": 5.0,
    "message": "they fit / walk so good, i bought them for work, thanks amazon"
  },
  {
    "user": "Mariah",
    "rating": 4.0,
    "message": "I was buying shoes so I can workout from home and I have wood flooring and I was wanting a shoe that doesn’t slip and comfortable and fits well.  these are good shoes but there slippery at the bottom on wood floor but work great for anything else!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Comfortable and easy on feet"
  },
  {
    "user": "Lori",
    "rating": 5.0,
    "message": "TRUE TO SIZE & VERY COMFY  I WEAR AN 8 AND I ORDERED AN 8  FIT PERFECT  WILL ORDER AGAIN IN ANOTHER COLOR"
  },
  {
    "user": "Tamara L Reaves",
    "rating": 5.0,
    "message": "Light weight and I'm on my feet all day"
  },
  {
    "user": "Larry Bear",
    "rating": 5.0,
    "message": "Have plantar fasciitis and these shoes helped with the pain when walking!  Glad I bought them."
  },
  {
    "user": "Anita Moore",
    "rating": 5.0,
    "message": "I use the sneakers for everyday, going to work, and walking."
  },
  {
    "user": "Carrie",
    "rating": 5.0,
    "message": "Love the looks and fit! Great support super comfortable!"
  },
  {
    "user": "El ALFA",
    "rating": 5.0,
    "message": "Pedir media talla o un numero menos en relación al tamaño de skechers"
  },
  {
    "user": "JFB",
    "rating": 4.0,
    "message": "Bought these for breathable walking shoe to use during hot summer season of daily walks.  Typical case of you get what you pay for in unknown off brand with $50 price tag.  They are ok.  Not the best for walking, but comfortable enough. Pros are...fit true to size, upper shoe material is decent breathable fabric, look ok if you don't care about brand name, deep jet black color has not faded with use.  Cons are...no support as normal brand name shoe in same price range $50-$60, therefore not good for long walks, definitely NOT a running shoe."
  },
  {
    "user": "Christina Morris",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "tonia beckwith",
    "rating": 5.0,
    "message": "They arrived on time and they're very comfortable."
  },
  {
    "user": "Deb Mag",
    "rating": 5.0,
    "message": "So comfy and sypportive-feel great!"
  },
  {
    "user": "Brenda Richardson",
    "rating": 5.0,
    "message": "Walking and working"
  },
  {
    "user": "Karen, RN",
    "rating": 5.0,
    "message": "I needed a lightweight shoe for the gym, especially the treadmill, and didn’t want to spend $75+ .  The upper is fabric, breathes well, and the arch support is as good as any “air” shoe out there.  I wear them daily and they’re holding up just fine!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "very comfortable"
  },
  {
    "user": "Christina Fredrick",
    "rating": 5.0,
    "message": "These shoes are very light, not as good quality as like Nike, but functional for a decent time. I don't expect them to last over a year of daily use but good for price."
  },
  {
    "user": "Andrea",
    "rating": 5.0,
    "message": "I like everything about them I will be disappointed if they bust on the bottom"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoes fit as expected. They look nice and people actually mistake them for Nike because of the style and the air logo on the side. The only complaint I have is that within a week the white on the side sole began to break and is noticable. I'm afraid to wash them as I think it would make it worse."
  },
  {
    "user": "C. Byers",
    "rating": 4.0,
    "message": "Needed a show who's insole could be replaced with an orthotic one. Like how they stated on website this feature. The tongue needs to be just a bit wider so it will lay a little further under the lace area and not potentially fold there. Purchased as a walking shoe so cannot comment on other areas and also just received shoe, so need more time to evaluate better."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I likectge shoes very comfortable an true to size. Very light weight. Happy with them"
  },
  {
    "user": "Bonnie",
    "rating": 5.0,
    "message": "I love the look and fit of the Sneakers.  Also, they are the most comfortable sneakers that i have purchased in the past.  Will be purchasing more!"
  },
  {
    "user": "Alcira Duarte",
    "rating": 5.0,
    "message": "Son cómodos para caminar"
  },
  {
    "user": "Jill",
    "rating": 5.0,
    "message": "I bought this before but since I lost weight I lost a shoe size"
  },
  {
    "user": "meldrape",
    "rating": 5.0,
    "message": "I use these shoes to walk in every day, so I cannot attest to running in them."
  },
  {
    "user": "Natalie Clarke",
    "rating": 4.0,
    "message": "I bought these for shoes to wear in the gym and they work great! I don’t suggest them for running (I usually invest in good running shoes). Great price and they look good too!"
  },
  {
    "user": "Aura María Castellanos",
    "rating": 4.0,
    "message": "Mi hija es talla 9 y están un poquito más grandes"
  },
  {
    "user": "Coconut",
    "rating": 5.0,
    "message": "I purchased these for my GF and she loves them. They are not just a walking shoe, but they are great for running as well."
  },
  {
    "user": "maria santacruz",
    "rating": 4.0,
    "message": "Todo aceptable"
  },
  {
    "user": "Tina Giorgetti",
    "rating": 5.0,
    "message": "Used to walk at Disney world. Amazing comfort"
  },
  {
    "user": "Alaafia",
    "rating": 5.0,
    "message": "Light weight"
  },
  {
    "user": "William Thompson",
    "rating": 5.0,
    "message": "They are so comfortable and fit perfectly. The color is exactly as seen in picture. I have calluses and my feet don’t hurt at the end of the day!"
  },
  {
    "user": "CAA",
    "rating": 3.0,
    "message": "The color is much more like a fuchsia. And when I walked around the living room in the shoes, the right foot felt very weird and like the material under my foot was crunching up. I returned them. They are not for me and ordered a new pair which I really like and they are truly purple."
  },
  {
    "user": "Gus",
    "rating": 5.0,
    "message": "No o dislike about the shoe"
  },
  {
    "user": "ticia10",
    "rating": 4.0,
    "message": "Love the look and comfort, still testing the quality.  Some of the white shows some cracking.  Overall, great value for the money spent.  I would buy again."
  },
  {
    "user": "Darline Zidor",
    "rating": 4.0,
    "message": "These sneakers are Beautiful and comfortable. Feet hurt A little bit after 13hrs shift, but for the price I paid for them, I can’t complain much. I would buy them again."
  },
  {
    "user": "Tina",
    "rating": 4.0,
    "message": "Comfortable but the air pocket does not last and after it pops it makes noise when you walk"
  },
  {
    "user": "TheNomadOne",
    "rating": 4.0,
    "message": "These shoes are very confortable for the price!"
  },
  {
    "user": "NotMyName",
    "rating": 5.0,
    "message": "These look great, I’ve even gotten compliments. A few weeks in, and with lots of walking every day, they are quite comfortable as well. I use my shoes pretty hard and this is my first experiment w/buying…idk “off-brand” (I guess) sneakers, so we’ll see how they hold up over time. When I spend $100+ on a pair of Nikes or whatever I usually get about 2 summers out of them, so I’m interested to see how these compare. Anyway, for the price they r really great and my normal size fit perfectly."
  },
  {
    "user": "Amber N Bradner",
    "rating": 4.0,
    "message": "Make shoe laces that doesn't break"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Good looking walking/running shoe. Good padding, but shoe hurt my big toe on each foot. Toes felt squeezed in because shoe runs very small/short. Not true to size. Unfortunately, I will have to return them."
  },
  {
    "user": "Debbie",
    "rating": 5.0,
    "message": "These feel great.  I work in a doctors office and I have plantar fasciitis in both feet.  These shoes help my feet.  Great comfort."
  },
  {
    "user": "Hammed S. Neckles",
    "rating": 4.0,
    "message": "Love the design and fit"
  },
  {
    "user": "Rachael F.",
    "rating": 4.0,
    "message": "If you have narrow feet prob not a very fashionable shoe but overall good for the 1/2 off price. The toe area had alot of extra cloth, and I wish it was a little more snug of a fit."
  },
  {
    "user": "Julia jackson",
    "rating": 3.0,
    "message": "these sneakers are not true to size, I ordered a 9  1/2 the size is small"
  },
  {
    "user": "Holly Purcell",
    "rating": 5.0,
    "message": "Nothing i dislike about these shoes. Super comfy!"
  },
  {
    "user": "Richard Johnson",
    "rating": 5.0,
    "message": "the look"
  },
  {
    "user": "teresa herszman",
    "rating": 5.0,
    "message": "Support & comfort"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "bonnie sutton",
    "rating": 5.0,
    "message": "It fits snug on my feet, cute and comfortable"
  },
  {
    "user": "darla",
    "rating": 4.0,
    "message": "Shoes run large!!"
  },
  {
    "user": "marcia",
    "rating": 5.0,
    "message": "Very comfortable shoes. For the price very stylish and comfortable. True to size."
  },
  {
    "user": "Dawn Spivey",
    "rating": 5.0,
    "message": "Highly recommended"
  },
  {
    "user": "Amazon customer",
    "rating": 5.0,
    "message": "I have already had a few compliments on these shoes the first day I wore them to work."
  },
  {
    "user": "Tamala",
    "rating": 5.0,
    "message": "Comfortable, great for walking and working out in, is one of my favorite and satisfying purchases this year"
  },
  {
    "user": "Donna",
    "rating": 5.0,
    "message": "Nice fit comfortable"
  },
  {
    "user": "f marks",
    "rating": 5.0,
    "message": "Love this shoe, will order more !"
  },
  {
    "user": "madi",
    "rating": 5.0,
    "message": "I really love these shoes. They are cute. I needed some good cushion shoes, but I wanted them to be stylish too and these are great for that. I have short wide feet and I read that if you have wide feet order up. I ordered 1/2 size up and wished I hadn’t. These shoes have a lot of give in them from the meshy fabric. I didn’t send them back because I had worn them for a day. I just have to wear really thick socks with them which defeats the purpose of the airy mesh fabric. I will probably order more in the correct size but I have to wear these for a while first."
  },
  {
    "user": "Krystal Washburn Baroutas",
    "rating": 3.0,
    "message": "The shoes are very comfortable, but the material the soles are made of are loud, squeaky, and not slip resistant so unfortunately I can’t wear them for work like intended"
  },
  {
    "user": "Yolanda Porter",
    "rating": 5.0,
    "message": "This is exactly great for traveling or everyday use. Easy to carry around. You can place in a pocket or purse."
  },
  {
    "user": "Courtney Whitford",
    "rating": 5.0,
    "message": "Keeps your feet cool throughout your work out."
  },
  {
    "user": "Lisa Praglowski",
    "rating": 4.0,
    "message": "Very comfortable, stylish, and be ready for all the. Compliments."
  },
  {
    "user": "CrystalB",
    "rating": 4.0,
    "message": "This is a nice pretty shoe. My only dislike is that they have a smooth shiny bottom.  I have balance issues so I don't want to slip and fall."
  },
  {
    "user": "ThisIsBatman",
    "rating": 5.0,
    "message": "Good for people with bad ankles and can fit an ankle brace"
  },
  {
    "user": "J. Dorner",
    "rating": 5.0,
    "message": "I used to always buy Nike shoes, but they are pricey, yet they do usually last a while. I decided to give these brand/pair a chance after reading other people's review and I'm glad I did. For half the price of what I usually spend, these shoes fit as expected (except if you wear thin socks, your feet feel a little loose in there, but regular socks make the fit fine), perform great, non-slip, and are super light weight. The colors are cute as well. As a woman, I like to pick bright colors for safety purposes, but I'm also one where I like the plain black or gray and this color combo was perfect. I would definitely buy again after I wear these out."
  },
  {
    "user": "Fawn T Palmen",
    "rating": 5.0,
    "message": "Great price would definitely buy another pair"
  },
  {
    "user": "kristie mosley",
    "rating": 4.0,
    "message": "The shoes provide much support. They are comfortable."
  },
  {
    "user": "VAmomof2",
    "rating": 4.0,
    "message": "I've been wearing these to work 12 hours in an ICU and they are pretty comfortable and match my uniform.  Glad I didn't have to spend $100 for shoes I might need to throw in the wash or throw away at some point in the future.  Plus the colors are super cute."
  },
  {
    "user": "Danigayle Harris",
    "rating": 4.0,
    "message": "These sneakers are comfortable and lightweight.  I walk 3-4 times a week, so I need comfortable, lightweight sneakers.  These sneakers fit the bill and an added bonus is the style and look of the sneakers.  Never in my life had I ever gotten any comments or asked what type sneakers I was wearing until I started to wear these sneakers. I will now only buy this brand sneaker, unless it changes how they are made or cheapens its quality, comfort, and style."
  },
  {
    "user": "MOE",
    "rating": 5.0,
    "message": "Use for everyday use. Very comfortable  I was looking for a white shoe and this fits the bill nicely.  Thank you!!"
  },
  {
    "user": "Solin Lee",
    "rating": 5.0,
    "message": "Very comfortable sneaker nice sturdy bottom size 6."
  },
  {
    "user": "Babbs",
    "rating": 4.0,
    "message": "The media could not be loaded. Like the color and comfortable get alot of compliments on them"
  },
  {
    "user": "Nancy E. Tolosky-Heine",
    "rating": 5.0,
    "message": "I am on my feet 8 - 12 hours a day. These shoes are comfortable. I bought a pair a year ago and they have held up to the challenge. They still oil brand new."
  },
  {
    "user": "Susie",
    "rating": 5.0,
    "message": "One of the best sneakers I have purchased. Normally when I switch brands my feet ache for a bit getting used to the new brand. These sneakers are so soft and comfortable - felt great from day one. I normally take an 8.5 which I ordered they are a little big so something to consider when ordering."
  },
  {
    "user": "Laverne",
    "rating": 5.0,
    "message": "Good walking shoe"
  },
  {
    "user": "Maurice J. Gover",
    "rating": 4.0,
    "message": "I like the product especially the comfort. I use it for walking and just casual everyday use."
  },
  {
    "user": "Isadora",
    "rating": 5.0,
    "message": "I’m nurse working 12 hours shift needs lot of support walking a lot in the hospital 🏥"
  },
  {
    "user": "judy",
    "rating": 5.0,
    "message": "Love the comfort style and colors"
  },
  {
    "user": "Jim Carey",
    "rating": 5.0,
    "message": "My wife loves these shoes."
  },
  {
    "user": "jonathan drake",
    "rating": 5.0,
    "message": "I was iffy about buying shoes online. I did research on shoes that had good ratings for hospital floors. These were on this list and at an affordable price. I bought them and have been loving them! My heels felt like I was stepping on cushions all day. My feet stopped hurting at night when I took my shoes off, it was awesome. The only negative thing I have to say, the shoes only lasted me about 5-6 months. With that being said, I have put about 2500 hours on the shoes. I will buy again."
  },
  {
    "user": "Andrea M Wallace",
    "rating": 5.0,
    "message": "Receive complements. Very comfortable."
  },
  {
    "user": "Kristina",
    "rating": 5.0,
    "message": "These feel and fit great! My go to exercise shoe. I have a large toe box so the wide fits well in the toe area without the rest of my foot swimming in the shoe like other wide versions."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I'm not a tennis shoe wearer, I needed a quick shoe for a brace on my ankle, didn't want to spend a lot, but I did want a little support, but a light weight shoe.  I liked the look of theses and it had purple, of course I bought them, but I was very surprised just how supportive and comfortable they are!! I had to wear them to an event and got a lot of compliments on the comfortable look and style of the shoes.  They are very light weight and breathable.  Buying a pair for my granddaughter too."
  },
  {
    "user": "C-",
    "rating": 4.0,
    "message": "I needed a new pair of shoes, but didn't have a lot of money to spend. I bought these just to get me through until I could afford a name brand pair I usually buy (I have a bad ankle and have had several surgeries). These far exceeded my expectations! They were true to size & are very comfortable. There is not as much support as the name brand shoes I normally buy, but they are still very comfortable 8 months later. And they have lasted very well (no ripping at the sides of the toes like some cheap shoes do). I liked these so much, I ordered what I thought was the same brand. They looked almost identical to these. I wish I could rate those, but Amazon has blocked reviews.  I say this so if you decide to order, look at the name. THESE are comfortable shpes and fit well for a less expensive shoe. The 1s that look similar are HORRIBLE! Overall I'm extremely happy I tried these and am here to order another pair."
  },
  {
    "user": "Lu Ro",
    "rating": 3.0,
    "message": "This shoes has a lot of support but in all the wrong places for my feet , feels like I’m wearing heels , I don’t think it will work for me … I have flat feet and it’s really hard to find shoes that will work for me ."
  },
  {
    "user": "Zelma Jones",
    "rating": 5.0,
    "message": "I purchased this item for my niece. She felt it was as too tight on her. Then I tried it on and it fit perfectly."
  },
  {
    "user": "Terri R",
    "rating": 4.0,
    "message": "They look nice and are just a little bigger than expected."
  },
  {
    "user": "donna sapp",
    "rating": 5.0,
    "message": "I purchased shoes for work as I am teacher.  Good color scheme and comfortable."
  }
]