[
  {
    "user": "Ma'Shay",
    "rating": 5.0,
    "message": "Shoes are very nice and seem to be of good quality, the color is just like the picture. They run a little small, I wear a size 6 but this size 6 was too snug so I’m ordering a 6.5."
  },
  {
    "user": "Nita",
    "rating": 4.0,
    "message": "These shoes are really light weight. The color is just how it looks in the pictures. This shoe runs small I usually wear a 8 1/2. These are a 9 and my toes are hitting the front of the shoe. If you are looking for a lot of support you need to pass on these. But overall I like the way they look I should have went up another size."
  },
  {
    "user": "Sierra",
    "rating": 4.0,
    "message": "They were comfortable walking around in the house, but had to return because the tongue doesn't separate from the shoe and they are very difficult to get on.  Too much work!"
  },
  {
    "user": "Gina Leach",
    "rating": 5.0,
    "message": "These shoes are so comfortable and cute I love the hot pink color of them. Great quality for the price I will be buying other colors of these soon . Only thing I regret is not getting a bigger size they still fit just a little snug ."
  },
  {
    "user": "Alma Jimenez",
    "rating": 4.0,
    "message": "Love these shoes after 2 hours of breaking in you don’t realize you have them on! But they leave scuff marks on white floors at my work…."
  },
  {
    "user": "angella1120",
    "rating": 4.0,
    "message": "I got a larger size thinking it would be too tight but it was loose enough, at first, it felt wobbly underneath my feet like I put on a pair of roller blades, but now after wearing them for a while they are the most comfortable shoes I ever owned"
  },
  {
    "user": "michelle",
    "rating": 5.0,
    "message": "These shoes are awesome. They feel great. Fit really nice. They look good on my feet. I like the way they look. I will buy more. I love these shoes. I took a chance. I am glad I did."
  },
  {
    "user": "Jacqueline Garza Lara",
    "rating": 5.0,
    "message": "I loved the shoes! So comfy. The only thing that left me a bit upset was that they were shipped so carelessly. I opened my mailbox to find that they were in there in a clear ziploc kind of bag and it was opened. I'm thankful that the pair arrived together and damage free."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Color party 🥳"
  },
  {
    "user": "Cynthia Field",
    "rating": 4.0,
    "message": "Give good support"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Super comfortable"
  },
  {
    "user": "Rose Marie",
    "rating": 4.0,
    "message": "I’m on my feet most of the day and I feel like I have on sandals they are very comfortable."
  },
  {
    "user": "Tami",
    "rating": 5.0,
    "message": "Love the color!!"
  },
  {
    "user": "Lynnette26",
    "rating": 5.0,
    "message": "I will buy these in every color, these shoes are so light weight and looks awesome. Everyone asks where I got them. I love these shoes!!!!!!!!!!"
  },
  {
    "user": "Jeannie Jordan",
    "rating": 5.0,
    "message": "I'm a CNA and work  12 hr shift  these shoes are so comfortable"
  },
  {
    "user": "Jennifer D.",
    "rating": 5.0,
    "message": "Comfortable especially after the 3rd wear and they were broken in. The bottoms do wear down even though the description said they didn’t. However  I wear them every day 12-13 hours a day and I only sit down when I drive or use the restroom. I don’t fault the show for the wear. I stand and walk a lot all day. For the price and comfort and look I will buy again. This shoe is a great choice for people like myself who wear their shoes to the extreme and want to have comfort and style. I don’t get this much comfort and use out of the big name brands that cost $60,$80 and up."
  },
  {
    "user": "Chelsea Mallory",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "j",
    "rating": 4.0,
    "message": "Styled for the gym or a cute active wear look- these sneakers are gorgeous.  Comfortable and have a good grip on the sole!  Nike who???  LOL!  They run just lightly over size- like I would not size down b/c it’s not truly a full 1/2 size difference- mabey 1/4 or less.  I tightened the laces and worked out with no issues"
  },
  {
    "user": "Crystal Anne Cox",
    "rating": 5.0,
    "message": "They are light weight, good support  and even though I'm on my feet most of the shift, my feet feel good at the end of the shift."
  },
  {
    "user": "SassyRed",
    "rating": 4.0,
    "message": "She is a 9.5 I am a solid 10.  They fit her well and she loves them."
  },
  {
    "user": "Bonnie Ard",
    "rating": 5.0,
    "message": "They are a great looking shoe for the price.  I run in on clouds but I wanted a light shoe to wear for fun and these are perfect.  I will definitely order another white pair."
  },
  {
    "user": "Marc Smith",
    "rating": 4.0,
    "message": "They aren’t quite skip on sneakers but close. They feel constable when walking in them. They look nice ace are well made."
  },
  {
    "user": "Livin Life",
    "rating": 5.0,
    "message": "Great color .. very good for walking and running"
  },
  {
    "user": "Cathy Nelson",
    "rating": 5.0,
    "message": "Great fit, color and comfort!"
  },
  {
    "user": "Sheri Richards",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Anastasia Rivodeaux",
    "rating": 5.0,
    "message": "I thought they would be cheap and flimsy but they look and feel so good! Will see how they will be wearing, but first impression: Why will I pay $150 for Nike ever again?!"
  },
  {
    "user": "Charry Ngo",
    "rating": 5.0,
    "message": "Great shoes but run small"
  },
  {
    "user": "Sonia Martinez Hernandez",
    "rating": 3.0,
    "message": "Están cómodos, pero muy resbalosos con el agua , me caí y me quebré mi mano,"
  },
  {
    "user": "MCWILD",
    "rating": 3.0,
    "message": "These shoes are cute but not for people with any physical limitations with putting them on."
  },
  {
    "user": "Toyin58",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "LT",
    "rating": 4.0,
    "message": "I like em, they could use a little more cushion but they aren't bad. Easy to put on, lightweight, and comfortable. I'm a nurse and I've been wearing them to work with no issues. Might add insoles for a lil more support down the road."
  },
  {
    "user": "linette helling",
    "rating": 4.0,
    "message": "I like the shoes but because of the way they are made it's a struggle to get my heals into the shoes. If I'm in a hurry I will wear something else."
  },
  {
    "user": "Peterson",
    "rating": 4.0,
    "message": "I like these shoes but don't love them. I wish they were the normal lace up, not the one-and-done slip on kind. I don't have wide feet or anything, but these are difficult to get on. Because of the design of the sole, they are very stiff while walking which makes them kind of loud (clog-like) which isn't ideal. However I have plantar fasciitis and these seem to have helped quite a bit. My feet are still a bit sore after being on my feet all day, but not like how they were months ago, where I could hardly walk at the end of the day."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "If you like the Just So So, you will like these as well."
  },
  {
    "user": "Yvette Morris",
    "rating": 5.0,
    "message": "I usually wear a 8.5 but I decided to size up to 9 and it’s a perfect fit"
  },
  {
    "user": "Lissa Bryan",
    "rating": 4.0,
    "message": "I bought these shoes because I'm just a tad bit too short for my bicycle and needed about an inch of extra height to stand over the frame. These shoes give me that small boost in height I was looking for without being too \"platformy\" and making walking awkward, or turning my ankles. The shoes are not as flexible or springy as they appear. The webbing is stiff plastic that has rubber pads on the bottom. Perfect for my purpose, but if you're looking for a soft, flexible shoe, you might want to keep looking. They're of decent comfort level. I usually wear a size 7.5, though that can vary based on brand. I bought an 8 in these and they fit snugly -- not overly tight, but snug when wearing a cotton jersey sock. I'm not planning long walks in them, so I can't testify to that aspect of comfort, but for biking long distances, these shoes were perfectly comfortable. They didn't have any rough edges on the interior to rub the foot. The rubber pads were nicely non-slip on the pedals. They don't need the laces. In fact, I took them out. They fit like a \"sock shoe,\" completely enveloping the foot. I bought the red for high visibility and the color is bright as I'd hoped."
  },
  {
    "user": "summer michalski",
    "rating": 5.0,
    "message": "Comfort and support"
  },
  {
    "user": "Mrs.Bee",
    "rating": 4.0,
    "message": "These sneakers are really cute. However, I take a 10 and had to order a size up and it fits. The shoes do run small so be aware. All the I ordered an 11, the shoes were a bit of a struggle to get on. Once on, the traction does not have that non slippery resistance.  It is comfortable after fighting to put on my shoes. Lol."
  },
  {
    "user": "Jordan P",
    "rating": 3.0,
    "message": "They’re nice but pretty hard to put on"
  },
  {
    "user": "elisa",
    "rating": 4.0,
    "message": "Sole is a bit stiff. Hoping it will relax as I break it in with more use"
  },
  {
    "user": "Jo Jo",
    "rating": 5.0,
    "message": "I like the available colors and the shoe is quite comfortable."
  },
  {
    "user": "stephanie thomas",
    "rating": 5.0,
    "message": "I like everything about the shoe, I dislike there's no box.."
  },
  {
    "user": "Staceykillingbeck",
    "rating": 5.0,
    "message": "I love these sneakers. They’re lightweight and comfortable for bringing on your feet for long hrs. Only thing you might want to size up."
  },
  {
    "user": "Shannon S.",
    "rating": 4.0,
    "message": "True to size, pretty comfortable and love the color!"
  },
  {
    "user": "CMK22",
    "rating": 4.0,
    "message": "They’re great for everyday wear. Loved them so much I bought them in yellow. I get so many compliments on them!"
  },
  {
    "user": "Ramona Freeman",
    "rating": 5.0,
    "message": "My daughter school shoes fits like a glove"
  },
  {
    "user": "Wells",
    "rating": 5.0,
    "message": "I love these shoes. They are very comfortable, with great support, and stylish. I have received numerous compliments and questions about where to purchase. Love these shoes!!!"
  },
  {
    "user": "Thequestionofme",
    "rating": 5.0,
    "message": "Love this shoe! I have very flat feet and struggle to find shoes that don’t hurt or rub somewhere on foot, but I haven’t had any issues with these. I also like that they slide on easily, and they are so cute. My ONE tiny issue is that I don’t get why they would put “TM WILL 5,400 lbs Weight Securing System” on the band on the back of each shoe. I might just cut them off."
  },
  {
    "user": "ada casillas",
    "rating": 5.0,
    "message": "Amazing,  better than I expected, I'm very rough on my sneakers, do workout alot, support is great and comfortable as well"
  },
  {
    "user": "LaToya Matthews",
    "rating": 5.0,
    "message": "These are so cute on my feet. I definitely want more colors."
  },
  {
    "user": "Angelique Anese",
    "rating": 5.0,
    "message": "The media could not be loaded. I absolutely love them they look exactly like the pictures and they r so snug and comfy I can’t wait to show everyone at work ❤️"
  },
  {
    "user": "jordann",
    "rating": 4.0,
    "message": "Love the color & the style! Shoes is a bit snug could definitely go a half of a size up and its not very comfortable which is very disappointing."
  },
  {
    "user": "Karen",
    "rating": 5.0,
    "message": "These shoes are great but they do run a half size smaller so definitely get a half size bigger then your normal shoe size. They are at a great price and look like Nikes. Also delivered b4 the ship date"
  },
  {
    "user": "Melissa Shaffer",
    "rating": 5.0,
    "message": "They fit perfectly, lightweight & give me the much needed support I need without the huge price tags I usually pay for shoes. I'm on my feet 8-14 hours a day, & have health problems so I need comfort & support,  by the end of the day my feet, legs, hips & back are usually killing me from being on them so long. I have Osteoarthritis,  fibromyalgia,  RA,  Lupus & back issues so finding a good shoe is very important. I put these on today before shift just to \"break\" them in before I wear them for an event I'm going to.( walking around Pittsburgh  & going to a Steelers game). My feet didn't hurt all night & when I took them off my feet still felt wonderful. I'm normally very picky about my shoes & pay a lot for comfort & only have a few kinds that give me the support & comfort that I need. I bought these to go with my steeler stuff primarily,  but was told by a nurse how comfortable they are & affordable so I figured I'd try them even if I only wore them a handful of times. I'm  definitely impressed with these & am going to be ordering more.  I got them faster then I thought I would too. Definitely on my list of top shoes."
  },
  {
    "user": "Myrna Cruz",
    "rating": 5.0,
    "message": "I love these sneakers so much I purchased three pairs!  I initially bought a black pair then decided I needed a white pair for spring and summer and I'm now contemplating the yellow. I got my true size (6.5) and they fit perfectly with ample room in the toe area.  They are a bit difficult to get on initially but after a few wears they're fine - they are worth the effort. They are super lightweight and don't provide maximum support but that's not an issue for me.  I purchased an extra pair of the black as a backup as I don't want to risk that they sell out or are discontinued."
  },
  {
    "user": "Rebecca Berg",
    "rating": 3.0,
    "message": "They are really comfortable but too small, I wear a 5 and so I got 5.5 and they barley fit my feet. So just go up 1 size maybe :)"
  },
  {
    "user": "Vidi J",
    "rating": 5.0,
    "message": "Love these shoes. I wanted a pair of white sneakers to wear with shorts / jeans for the summer and these were it. Look cute, very comfortable, and a value for the price!"
  },
  {
    "user": "Tina B",
    "rating": 5.0,
    "message": "I love these!!!!!! I want another pair!!!!"
  },
  {
    "user": "connie hickson",
    "rating": 4.0,
    "message": "I expected the bottom to be softer."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fits Perfect"
  },
  {
    "user": "Charlene Diaz",
    "rating": 5.0,
    "message": "Sobrepaso mis expectativas, el calzado es  muy cómodo trabajo mas de ocho horas de pie y no llego con dolor de pie a la casa."
  },
  {
    "user": "Jackeline Marrero",
    "rating": 4.0,
    "message": "Perfect"
  },
  {
    "user": "PsychoSniqers",
    "rating": 5.0,
    "message": "Shoes look great and I’ve gotten many compliments on them. I typically walk in a “heel toe” kind of way and since wearing these my feet have felt much less sore after being on my feet all day. I would recommend using a shoe horn to get them on if you have long nails as that can be difficult."
  },
  {
    "user": "Jennifer turner",
    "rating": 5.0,
    "message": "They are very cute on but I originally bought these to wear in a restaurant for wet floors however they are not at all non slip but they are cute so ordered a second pair to wear out and the others I use in the yard to mow lawn because at this price its way cheaper than ruining a pair of my name brand sneakers. I get tons of compliments on them!!!!!!"
  },
  {
    "user": "Zandria white",
    "rating": 5.0,
    "message": "Nice stylish comfortable"
  },
  {
    "user": "Cynthia",
    "rating": 5.0,
    "message": "Perfect, muy comodo"
  },
  {
    "user": "Ludin Murillo",
    "rating": 5.0,
    "message": "La calidad solo que muy estrecho"
  },
  {
    "user": "Anjanette Jotie",
    "rating": 3.0,
    "message": "Wore twice and 2 lace holes tore.  Can fix them seems to be made cheap"
  },
  {
    "user": "fitnessforlife",
    "rating": 4.0,
    "message": "I normally were a size 10 in any shoe and it fits me well... But this shoe hits me right on my big toe. If I do not wear any socks I will be okay but it is still right on my toe. But it's not so uncomfortable that I would send it back. Thinking about ordering another color but just get it in a size 11 to see if it makes a difference. The shoe itself I love the color and it's cute on. ..Even got my teenage name brand w**** of a daughter wanting a pair and she don't wear no name shoes SMH"
  },
  {
    "user": "sherolyn murray",
    "rating": 4.0,
    "message": "I really like the fit, color, and most everything else.  I think I'd like for them to have more colors and for the outside sole to be a little softer. But I definitely LOVE them."
  },
  {
    "user": "miles",
    "rating": 5.0,
    "message": "The media could not be loaded. Wonderful and comfortable.  Great feeling."
  },
  {
    "user": "Chere",
    "rating": 5.0,
    "message": "I absolutely love these shoes. I will definitely be buying all the colors!!!"
  },
  {
    "user": "Von",
    "rating": 4.0,
    "message": "So right out the pack they are pleasing to the eye. They fit like ankle compression socks so for me the right kind is snug but not tight. The con would be that they have no grip. So yes your feet looks good but if your walking on wet or polished flooring your going down no matter how you try bracing yourself."
  },
  {
    "user": "Wanda Brown",
    "rating": 3.0,
    "message": "The shoes do not fit two small"
  },
  {
    "user": "Gamma",
    "rating": 4.0,
    "message": "Have tried various low cost Asian made shoes and this brand, model are the best made and correct fitting of them all. A very good gym, walking, exercise class shoe. If you are a runner, you already know this tier of shoes are not  suited for serious runs."
  },
  {
    "user": "VP",
    "rating": 5.0,
    "message": "I get a lot of compliments on these fashion sneakers. They are very comfortable, and I love the variety of colors. I bought 8 pairs of these sneakers. Eight different colors for various out fits. Highly recommend."
  },
  {
    "user": "Julie J.",
    "rating": 3.0,
    "message": "I love they way they look and feel once you get them on. I definitely needed a shoe horn. Part of the reason I got them was that I thought they slipped on. But they did not! No matter how much I loosened the laces and manually stretched out the shoe opening, still no way it was going on easily. I’ve never had a problem with a shoe like this before. Would have never considered that to be an issue. So I have to return them."
  },
  {
    "user": "binboo",
    "rating": 5.0,
    "message": "I need an purple pair."
  },
  {
    "user": "Kim",
    "rating": 5.0,
    "message": "Every time I wear these shoes I get stopped for compliments or to ask what kind of shoes they are. Evey. Time. I've pulled up and shared this product so many times I had to come write a review. But not only are they show stoppers, they are hella comfy. I have a pair of $169 sneakers that are sitting in my closet collecting dust now. I'd much rather wear these for everyday wear. I haven't tried them at the gym yet but I would. I just haven't been to the gym in 3 months, lol. I have these in yellow and black. Waiting for the green to come back in stock. Considering the blue as well. Can't beat the price, the style or the comfort. Highly recommend."
  },
  {
    "user": "Johann Sintima",
    "rating": 5.0,
    "message": "I love itttt, many compliments"
  },
  {
    "user": "Elizabeth Caro",
    "rating": 5.0,
    "message": "I am very hard on my shoes. I work 12 he shifts on my feet all night long. These shoes are amazing on my feet. Not one time hav I thought about inserts since I started wearing these. Thank you!!"
  },
  {
    "user": "Di",
    "rating": 4.0,
    "message": "Bought these for my wife to exercise in, she said they were very light, and comfortable. She did not care for the elastic around her ankles, but she got used to it.. overall very good for the price"
  },
  {
    "user": "GASTON",
    "rating": 5.0,
    "message": "Look greats lightweight and comfortable"
  },
  {
    "user": "k.sanc",
    "rating": 4.0,
    "message": "I think these shoes are great for the money. They are lightweight, flexible, supportive, and breathable. The only exception to this from giving it five stars is that you can feel the soles of the shoe. To help me from not feeling them I inserted an insole. It gave me more cushion, made the feeling of the outer sole go away, but did make the shoe fit tighter. If you are going to insert a insole go a half size larger."
  },
  {
    "user": "robert",
    "rating": 5.0,
    "message": "Wife says there are very comfortable and she gets alot of compliments on them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are literally the best sneakers every. I wear them when I work bottle service at the night club I wear them to clean uhaul at my day job I wear them to work out in and they last for months!! Totally worth it!"
  },
  {
    "user": "michelle",
    "rating": 4.0,
    "message": "One the right shoe, there were two white spots on the front. I tried to clean with off with soap and water but didnt work. I took a black marker and colored it in. Know one will notice it but that was the best I could do. Did want to waste time  sending it back. Just need to be looked over before sending them out."
  },
  {
    "user": "Shelley",
    "rating": 5.0,
    "message": "Well just a sums it up these shoes are amazing I work on concrete floors all day and my feet do not hurt it feels like they mold right to your foot they’re amazing I can’t say it enough for 38.99 you can’t beat it and I’m gonna get me some more but different colors and different styles"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Bought the shoes for work and they hold up so great to 8 to 10 hour stand time. Feet feel great not anywhere as sore as other shoes. And the complements on the vivid color and style just keep coming even after months of owning them. People think I have a high end name brand shoes and when I tell them I bought them for the price lol eyes get big in disbelief. IF YOU HAVEN'T BOUGHT THIS YET STOP THINKING ABOUT AND BUY THEM!!! FANTASTIC PRODUCT!!"
  },
  {
    "user": "L. Bean",
    "rating": 4.0,
    "message": "I like the style and color of sneaker"
  },
  {
    "user": "Shadoe Turner",
    "rating": 5.0,
    "message": "The shower tongue doesn't separate from the shoe. Hard to get on my feet. Also, no half sizes."
  },
  {
    "user": "Tanya Ryan",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Kristen vickers",
    "rating": 5.0,
    "message": "At first I didn't have much faith in these bc of the price being so awesome...MAY I SAY WOOWWWW, I am used to nike shox how hard they are when u first get them and this is NOTHINGGGGG compared to those! These immediately felt comfy and formed to my foot! I will say the back by the ankle is a little tight so u may want to get a half to full sz bigger, But I ordered my normal sz and they fit snug. I will post another update when I have worn them at least a month!!! great choice! also the back when u grab to put your shoes on is a little shorter then I am used to, SO with a wider ankle or some one who needs ankle support,you may need the higher back/ankle shoes"
  },
  {
    "user": "Candida Royster",
    "rating": 5.0,
    "message": "Style, comfortable w vibrant colors"
  },
  {
    "user": "Jane Brown",
    "rating": 4.0,
    "message": "Love color. Comfortable. Very light weight"
  },
  {
    "user": "LORI",
    "rating": 5.0,
    "message": "So comfortable, light weight & airy."
  },
  {
    "user": "Tynehl Antonio",
    "rating": 3.0,
    "message": "The inner foot bed isn't as comfortable as you would expect looking at the shoe.  While the shoe is lightweight you can feel the break in the sole design. I work long hours on my and so far haven't had any concerns."
  },
  {
    "user": "Mercedes",
    "rating": 5.0,
    "message": "I really like these, I get compliments. Lightweight and comfortable"
  },
  {
    "user": "Swann",
    "rating": 3.0,
    "message": "Normally wear 6.5 women's ordered 7 after returned 6.5 ...should of kept 6.5..... they run slightly big"
  },
  {
    "user": "S. McKnight",
    "rating": 4.0,
    "message": "Work"
  }
]