[
  {
    "user": "Mallocrunk91",
    "rating": 4.0,
    "message": "This is actually a really great shoe! I used to own a pair of the moto sport pumas back in high school and loved the pair. I have a large foot that is wide so it’s difficult to find shoes that actually fit me and I end up having to get men’s sizes instead. It was a little tight the first few days wearing which made me nervous about the size I chose but it’s been almost 2 weeks and they are so comfortable! I work in a hospital and am on my feet a lot so these shoes I highly recommend for a face paced work environment."
  },
  {
    "user": "Caitlin",
    "rating": 5.0,
    "message": "It's a very nice solid black shoe. I did have to get a half size bigger. When I ordered my normal size shoe it was way too small so I recommend you go at least a half size bigger when ordering this shoe. The shoe is waterproof which is exactly what I was looking for. Very happy with my shoes."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The tennis shoes fit nicely, but the insole was loose not attached to the shoe, not a big deal but it wasn't  glued to the inside of the shoe. I have insoles of other tennis shoes that are loose and I can take out, but that's after I've worn them for awhile."
  },
  {
    "user": "Anna",
    "rating": 5.0,
    "message": "Me quedo perfecto me encanta"
  },
  {
    "user": "Andrew Maynard",
    "rating": 5.0,
    "message": "I was a bit scared as I'm from Barbados and wouldn't be able to return these easily. However they fit perfectly. My daughter loves them."
  },
  {
    "user": "So sa",
    "rating": 5.0,
    "message": "It was so comfortable and really really light"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "It’s very comfortable, but the style is not that great"
  },
  {
    "user": "Angie Chambers",
    "rating": 5.0,
    "message": "I Love My  Puma"
  },
  {
    "user": "Heather",
    "rating": 4.0,
    "message": "These shoes look great, are well made and very comfortable.  The only flaw is that the comfort foam insole isn't actually attached to the bottom of the shoe.  It doesn't slide around, I just don't like that it is removable (there isn't anything underneath to provide support, so the insole is necessary)"
  },
  {
    "user": "katie",
    "rating": 5.0,
    "message": "Love them! Fit great. Very comfortable for a shoe that seems to be super thin. They are incredibly light weight."
  },
  {
    "user": "Cassie Stoner",
    "rating": 5.0,
    "message": "Great for narrow feet.  I anyways size up half a size in puma shoes and did that here.  Normal a 9.5 and got a 10. Comfortable,  cute,  and nice color"
  },
  {
    "user": "Vee",
    "rating": 4.0,
    "message": "Love these shoes!! Just what I was looking for and fits perfectly!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Cute for the spring and summer.  Look forward to wearing them.  Feel comfy."
  },
  {
    "user": "Yvonne H.",
    "rating": 5.0,
    "message": "Comfy and light"
  },
  {
    "user": "AirForceMom",
    "rating": 4.0,
    "message": "This brand never fails.  Perfect fit time and time again.  These are super lightweight, the silver is perfect and i'm looking forward to ordering another color."
  },
  {
    "user": "Efrain",
    "rating": 3.0,
    "message": "Muy bonitos pero quedan muy ajustado, recomiendo comprar medio número más al que calza"
  },
  {
    "user": "Sarah LeAnn",
    "rating": 5.0,
    "message": "Y'all, these are hands-down the greatest sneakers I've ever had. 10/10 would recommend. Super duper lightweight and so incredibly comfortable. I cannot sing their praise loud enough."
  },
  {
    "user": "Angie Macon",
    "rating": 3.0,
    "message": "I didn’t like the inside seam it was hurting my toes  They looked very nice. Had to get rid of them."
  },
  {
    "user": "Anabadrina",
    "rating": 5.0,
    "message": "Se ven cómodos"
  },
  {
    "user": "Cristy Land",
    "rating": 5.0,
    "message": "At first I wasn't sure about ordering 10.5 because normally I buy shoes size 10, but when I tried them on for the first time, they looked a little big. I started using them at work and they don't look too big anymore and they are super comfortable. Even my mom got ones for her too!! Love them and the price was perfect!."
  },
  {
    "user": "D. L.",
    "rating": 5.0,
    "message": "I like Puma shoes because they always hug my feet and give good arch support.  These are a 6.5 and fit as expected.  Lots of cushion."
  },
  {
    "user": "Fahyat Mornix",
    "rating": 5.0,
    "message": "Great shoes, very comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Son muy bonitos, calzan bien pero no sé confíen en caminar en áreas mojadas o húmedas, lasyela no tiene adherencia al suelo y es fácil resbalarse y caerse."
  },
  {
    "user": "510Girl",
    "rating": 5.0,
    "message": "Love them. Wore them all over Europe in October 2021. Very comfortable and true to size."
  },
  {
    "user": "Ejaymac",
    "rating": 5.0,
    "message": "I have narrow flat feet and this is the ideal shoe for me."
  },
  {
    "user": "LadyLouise",
    "rating": 5.0,
    "message": "Absolutely L.O.V.E. them.I’ve been wearing an older version of these Pumas for many years and came across these. I didn’t expect them to be as comfortable as the ones are that I’ve had for years but as it turns out they are MORE comfortable. I’ll be ordering the other colors. They are soooo soooo cute, stylish and truly are comfortable and unexpectedly supportive."
  },
  {
    "user": "Kittykat",
    "rating": 5.0,
    "message": "I’m using this shoe because I’m a ballet dancer and needed something, soft, sturdy, with plenty room for sore toes. And they’re super cute"
  },
  {
    "user": "Mrs. Tee",
    "rating": 5.0,
    "message": "I love the look of shoe, but they fit a tad small. I'd recommend a half size to a size larger for people with wider width feet. I use them for casual wear."
  },
  {
    "user": "Paul",
    "rating": 5.0,
    "message": "Purchased these I'm my size in women's as Puma doesn't make a sneaker like this for men. They are incredibly light weight and breathable. Great summer sneaker. They look super slick and have just the right cushion and sole flexibility. I love these. May buy some other colors now"
  },
  {
    "user": "Shana D",
    "rating": 5.0,
    "message": "These are stylish and really comfortable.  Wish they had more colors.  So light and not bulky -they are perfect!"
  },
  {
    "user": "Stacy Ann thawe",
    "rating": 5.0,
    "message": "Love this sneakers"
  },
  {
    "user": "Theresa",
    "rating": 5.0,
    "message": "I love the look. They are comfy. I’m not a fan of the exaggerated laces but I just tucked them into the shoe and that looks good. I might buy different laces at some point. Great price."
  },
  {
    "user": "Marcos Baez",
    "rating": 5.0,
    "message": "Excelente calzado, bonito y ligero, envío rápido."
  },
  {
    "user": "Christy Gray",
    "rating": 5.0,
    "message": "These shoes fit perfectly and are absolutely the most comfortable shoes I’ve ever owned!"
  },
  {
    "user": "Gunit",
    "rating": 5.0,
    "message": "So many people said run small so I ordered 1/2 size up. Guess what..had to return. My regular size (9) fit great."
  },
  {
    "user": "Julie A. Wines",
    "rating": 5.0,
    "message": "I love them!!!"
  },
  {
    "user": "Pinky consumer",
    "rating": 5.0,
    "message": "Love them! They fit well, are comfortable and match every outfit. Nuff said!"
  },
  {
    "user": "R.M",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Carlos C. Garay",
    "rating": 5.0,
    "message": "The media could not be loaded. Love that shoes"
  },
  {
    "user": "Patriot",
    "rating": 1.0,
    "message": "Looks too child like"
  },
  {
    "user": "Jeanne P",
    "rating": 1.0,
    "message": "Unsatisfied loyal no more customer."
  },
  {
    "user": "Charles Clinton",
    "rating": 1.0,
    "message": "2nd pair I ordered and inside is damaged"
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "I believe this is a counterfeit item. The shoe is entirely flat. There is glue showing all around the the rim and the insole is completely loose inside. Do not order."
  },
  {
    "user": "Marie C. Joyce",
    "rating": 5.0,
    "message": "These shoes offer support, comfort, and style. They are super lightweight, too. Definitely will buy again."
  },
  {
    "user": "Kathie D Brazil",
    "rating": 5.0,
    "message": "I have problems finding shoes that are comfortable and can truly saw these are wonderful. Light weight and no high arch to deal with."
  },
  {
    "user": "Lianycis castillo",
    "rating": 5.0,
    "message": "Lo recomiendo súper comodo"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are exactly what I expected they’re comfortable and cute"
  },
  {
    "user": "C King",
    "rating": 5.0,
    "message": "I am very happy with this white puma Bella  shoe. It’s light weight and a perfect spring and summer shoe. Fits great, and comfy."
  },
  {
    "user": "Z.T.H.",
    "rating": 5.0,
    "message": "These are so stylish and comfortable I love it.."
  },
  {
    "user": "Mabel Hernandez",
    "rating": 5.0,
    "message": "Muy bonito y cómodo lo recomiendo chica"
  },
  {
    "user": null,
    "rating": null,
    "message": "La couleur est très belle et les souliers sont très confortables. Vraiment contente de mon achat !"
  },
  {
    "user": null,
    "rating": null,
    "message": "Son de tela tipo dry, son cómodos, yo compré 7.5 soy 24 cm y en la etiqueta interna viene marcada como 23.5, me quedan muy bien sin plantilla, ya que la plantilla viene muy gruesa"
  },
  {
    "user": null,
    "rating": null,
    "message": ""
  },
  {
    "user": null,
    "rating": null,
    "message": "Me encantaron"
  },
  {
    "user": null,
    "rating": null,
    "message": "Nice would buy in another colour ps if you’re wanted added comfort buy a foam insole"
  },
  {
    "user": null,
    "rating": null,
    "message": "Great comfort and size specs as per usual.  Worth the buy"
  },
  {
    "user": null,
    "rating": null,
    "message": "J'ai commandé la grandeur que je porte habituellement chez Puma et ces espadrilles sont parfaites! Je crois que c'est la première fois de ma vie que je n'ai pas à \"casser\" une paire de souliers neufs pendant des semaines avant de m'y sentir bien!! Ceux-là, en dedans d'une marche de 1km c'était réglé ❤️"
  },
  {
    "user": null,
    "rating": null,
    "message": "Travail"
  },
  {
    "user": null,
    "rating": null,
    "message": "Quality shoes. Love em. I'm a 9.5 wide, but they only had a 9.5, it was a bit tight the 1st day I wore them, now they're fine!"
  }
]