[
  {
    "user": "Kim Perrino",
    "rating": 4.0,
    "message": "So comfy, done with expensive shoes that fall apart, these are sturdy and lasting longer than brooks"
  },
  {
    "user": "Ruthann",
    "rating": 5.0,
    "message": "I am constantly going through shoes and footwear. I have four dogs and our newest one has an affinity for chewing on my shoes, so between walking 2 mi a day and having a destructive pet I am always looking for inexpensive quality shoes. I have purchased shoes that are similar to these before so I pretty much knew the style. What I like about these is some of the issues I experienced previously have been corrected. My heel doesn’t slide out of the shoes and the inserts stay in place, but I can also take them out and wash them if I need to. Details: Size: I have seen a couple of comments on the size of the shoe. I wear a size 9 in most shoes and that includes going to a retail store and trying some on. With most shoes the size tends to vary slightly depending on the brand. My advice is if you own shoes that are slightly tight on your foot then go a half size up, for instance I have a pair of shoes that are somewhat uncomfortable and they are 8.5, I ordered a size 9 and they fit perfectly. Sole: The sole of the shoe is a thick rubber and provides a “bounce” that makes it absorb enough shock to be comfortable while running. It is half an inch thick to give you an idea of the thickness and the rubber is soft, wear-resistant, and elastic making it suitable not just for running but for all kinds of sports. Insole: The insole of the shoes is soft and the cushioning is comfortable, breathable and lightweight. I noticed that this shoe seems to be better than previous because it is excellent at dampening the shock of your stride and allows for anti-skid performance. From using them I have noticed it can effectively absorb part of the reaction force, and reduce the burden of your foot. The material is a type of woven material that is soft and lightweight, it has a mesh type material that encloses the insole and seems to help with moister absorption. The breathability prevents the shoe from maintaining unwanted smells and if you take care of the shoe odor will not be an issue. Packaging: The shoes come in a canvas type bag that I appreciate because it helps reduce waste on the environment, but the bag is really helpful if you are taking the shoes to the gym in your gym bag. Uses: I am no fashion icon, but I have used these to walk my dogs, workout in the gym, run, play sports as well as wear them to go shopping at the mall. They are aesthetically pleasing whether you are in shorts or pants. I have the peach colored shoes and I love them; they are inexpensive and have a high quality to them. They are perfect for everyday use and if you take care of them, they will last you longer than many name-brands."
  },
  {
    "user": "McIntosh",
    "rating": 5.0,
    "message": "Nice looking shoe and great fit."
  },
  {
    "user": "Kimberly",
    "rating": 5.0,
    "message": "I’ve paid a lot more fore shoes that were not near as comfortable"
  },
  {
    "user": "Tesla",
    "rating": 5.0,
    "message": "Cute, light weight, for well! I think they need to be worn quite a bit cause they are a little tuff"
  },
  {
    "user": "Shortie",
    "rating": 5.0,
    "message": "These are great sneakers for the price  enter than my Nike I paid 85 dollars for"
  },
  {
    "user": "Rebecca L. Carver",
    "rating": 5.0,
    "message": "They are great"
  },
  {
    "user": "Andrés Quiroz",
    "rating": 5.0,
    "message": "Excelente!."
  },
  {
    "user": "L&H",
    "rating": 4.0,
    "message": "comfortable walking shoe"
  },
  {
    "user": "Lennie",
    "rating": 4.0,
    "message": "They were a little bigger than I thought they would be, but they are pretty comfortable and very light weight. I got them for my job which I'm on my feet most of the time. All in all they are pretty good for the price."
  },
  {
    "user": "Karen C.",
    "rating": 3.0,
    "message": "My feet and didn't know I should have ordered one size up!!"
  },
  {
    "user": "Rose H",
    "rating": 4.0,
    "message": "Good"
  },
  {
    "user": "Shannon Shane",
    "rating": 3.0,
    "message": "Wasn’t Quite As Happy As I thought I’d Be with this Product… There Ok!!"
  },
  {
    "user": "nicole",
    "rating": 5.0,
    "message": "I’m in love with these shoes. They are Comfy. I’m on my feet all day. I’m going to buy more colors !"
  },
  {
    "user": "Jack Allen",
    "rating": 5.0,
    "message": "Love the shoes & the color"
  },
  {
    "user": "Sunshine",
    "rating": 5.0,
    "message": "Soft"
  },
  {
    "user": "bridget miller",
    "rating": 5.0,
    "message": "I like the lightness and comfort doesn't weighs my body down"
  },
  {
    "user": "Donna Starnes",
    "rating": 5.0,
    "message": "Fits perfect"
  },
  {
    "user": "gardner.leighton",
    "rating": 5.0,
    "message": "Excellent fit and comfy"
  },
  {
    "user": "Lindsay Robbins",
    "rating": 5.0,
    "message": "These are my go-to shoes now! They are SO COMFORTABLE! They are more comfortable than my Nikes or Pumas! I just wish they didn't say \"Air\" on them because it makes them easily recognizable knockoffs."
  },
  {
    "user": "Jeanette George",
    "rating": 3.0,
    "message": "I like the look of the sneaker.. But they do not have enough support for me.. The fit is fine, and they are light weight. Which is great when you are on your feet for many hours in a day… I just wish they had more soul support.."
  },
  {
    "user": "Gregory Monteiro",
    "rating": 5.0,
    "message": "I use these sneakers to do my 5 mile walk, after walking 5 miles for a week my feet are not tired like before, sneakers are not hot feet are not sweaty."
  },
  {
    "user": "Rosetta hunter",
    "rating": 5.0,
    "message": "I love the color went perfect with my outfit  Definitely A Good Investment"
  },
  {
    "user": "JM",
    "rating": 3.0,
    "message": "Shoes are comfortable and color is as expected. But why is the sole so smooth and slippery ? It's basically like walking with plastic bags under your feet. Extremely unsafe. Is there anything to stick to the sole to give the shoes a safer grip ?"
  },
  {
    "user": "kay",
    "rating": 5.0,
    "message": "Got these to match my scrub uniforms.  Great match.  Comfortable. Even with wide feet."
  },
  {
    "user": "Dalia",
    "rating": 5.0,
    "message": "The media could not be loaded. The shoes is comfy and suitable for long cardio workouts I'm fitness instructor I use to do 2 to 3 hours of cardio classes these shoes are the best I bought 2"
  },
  {
    "user": "Angela Chalmers",
    "rating": 5.0,
    "message": "They fit perfect and are very light weight."
  },
  {
    "user": "Priscilla Blanchard",
    "rating": 3.0,
    "message": "Uncomfortable, poor support. Starting falling apart after a month"
  },
  {
    "user": "Ashraf Awad",
    "rating": 5.0,
    "message": "Very good"
  },
  {
    "user": "Nilda e Guerrero vargas",
    "rating": 4.0,
    "message": "Didn't like after paid ,wait and finally get my sneakers ,won't fixed me,too big. But like to learn how to make a return and have the UPS return places very close to my house. Thank you.!"
  },
  {
    "user": "Kelly Kelly",
    "rating": 3.0,
    "message": "After wearing these shoes for three months I noticed the bottom of the shoe looks worn out and the rubber is peeling. I have customized insoles in each shoe and my foot still hurts. The front of my shoes irritates my big toes. Do shoes does not feel comfortable to me."
  },
  {
    "user": "Kathryn Zboyovski",
    "rating": 5.0,
    "message": "Bought as a gift for a young girl. These are her second pair. Wear very well for an every day sneaker."
  },
  {
    "user": "María Emma Herrera Sanchez",
    "rating": 5.0,
    "message": "Los uso para trabajar camino mucho y son muy cómodos"
  },
  {
    "user": "TammyWPB",
    "rating": 5.0,
    "message": "The most comfortable tennis shoes for avid walkers. I ordered a pair last year and just replaced them this year with the exact same. I walk ALOT, between 5-10 miles per day. These give comfort right out of the box. No need to break them in- never had a blister, soreness, etc. as with most new shoes. I did buy lock laces (also on amazon) for ease in putting on/off and so I didn't have to fuss with shoelaces constantly coming untied since I walk so much."
  },
  {
    "user": "Megan Brown",
    "rating": 3.0,
    "message": "Were a bit big for my shoe size and the shoe felt heavy. Did not like them when I put them in and walked around the house, I need shoes a little more lightweight and less thickness on the fabric of the shoe."
  },
  {
    "user": "Thomas G",
    "rating": 5.0,
    "message": "Great sneakers!!! Thanks."
  },
  {
    "user": "Black Diamond",
    "rating": 4.0,
    "message": "These kicks are very nice! The beautiful blue color pops and they're very comfortable. I put additional insoles into them because I have an arch and needed more support. If your feet slide to the front like mine does, apply supportive insoles or your toes will be hurting. Just not took thick of an insole. These Sneakers are not really supportive, but what do you expect for $40.00. These Sneakers are stylish and lightweight. It's like walking on clouds. I walk a lot and needed a soft Sneaker. I love them. They look great with leggings as well as jeans. Happy with this purchase."
  },
  {
    "user": "Sol Cocco",
    "rating": 3.0,
    "message": "Es comodo pero la calidad no es bueno, en menos de 1 mes que lo compre ya cuartiados o agrietados en ambos pies."
  },
  {
    "user": "Melanie LeBrun",
    "rating": 5.0,
    "message": "These shoes are so dang comfortable and lightweight! After working a 16hr shift of mainly being on my feet, running around like crazy, my feet still don’t hurt. Definitely worth the price!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "These are very comfortable, cute shoes. I have DDD and with my old shoes my back was hurting really bad after my shift. The price on these shoes were a little unbelievable but I bought these shoes and you know how online purchases can go. These shoes worked great! They are super comfortable and they are stylish too! I like them a lot and I will buy different colors too! I wear a 7.5 but I bought an 8 and they still feel good. Great buy!"
  },
  {
    "user": "Bernada Gill",
    "rating": 5.0,
    "message": "The product was just as expected I have no dislikes and no pictures as of yet"
  },
  {
    "user": "karen fors",
    "rating": 5.0,
    "message": "Comfortable, airy"
  },
  {
    "user": "Kindle Customer",
    "rating": 3.0,
    "message": "Great shoe but no support"
  },
  {
    "user": "Shirley A. Schmehl",
    "rating": 5.0,
    "message": "Love them 💗"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Got them for my granddaughter she loves them"
  },
  {
    "user": "Jackie",
    "rating": 5.0,
    "message": "Used for work."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love them for work because I’m on my feet all day and these sneakers are so comfortable."
  },
  {
    "user": "Ms Nora",
    "rating": 4.0,
    "message": "I was disappointed that there is no design on the heel and side area of the shoe like the blue/pink I brought before. It looks plain and cheap"
  },
  {
    "user": "Lori Smith",
    "rating": 4.0,
    "message": "Not enough comfort or support for 8 hours on concrete floors."
  },
  {
    "user": "marjorie makara",
    "rating": 5.0,
    "message": "They are fashion worthy and fit perfect"
  },
  {
    "user": "Deborah J. Green",
    "rating": 5.0,
    "message": "I was skeptical about what the quality of this shoe would be because it was so inexpensive, but the reviews were good so I thought I'd give them a try. I found they ran a little small in the toe ( I have slightly wider feet) so I returned for a 1/2 size larger. Another review said they were slippery and when I looked at the sole I was worried that would be the case because the sole was very shiny. Not like any rubber sole on a sport shoe I have owned  before.  Because of that I wore them around the house all day on hardwood floors and surprisingly they were not slippery and in fact very comfortable. I suffer from intermittent plantar fasciitis and I had no pain wearing these shoes.  They felt great.  I think they are more comfortable than the more expensive shoes I bought 6 months ago. They appear to be made well.  I like the small pop of color too. Time will tell how they hold up with more strenuous outdoor walking but for now I give them 2 thumbs up for comfort."
  },
  {
    "user": "E. Conway",
    "rating": 5.0,
    "message": "I really really love my new sneakers. I was having knee pain in my left knee at night for months and would have to wrap my knee in a ace bandage. After wearing my new sneakers for just 2 days, my pain has stopped. I am so thankful and elated to the thought of no more pain. Plus, they are so cute!! Thank you!! ❤ A ++++++"
  },
  {
    "user": "Janet Yancey",
    "rating": 5.0,
    "message": "I love these sneakers!  The lilac color is so pretty, and they are super comfortable and light.  The price is very affordable, especially if you've priced name brands lately!"
  },
  {
    "user": "Betty Ragland",
    "rating": 5.0,
    "message": "They were very comfortable, pretty and I run in them . Good support."
  },
  {
    "user": "Melissa",
    "rating": 3.0,
    "message": "They looked better in the picture. I should have compared more before buying. They aren’t horrible. Just disappointed. I must have had higher expectations. I don’t feel like there is support on my arch. That would have made the difference for me. Also the back on Achilles heel is too stiff for me. They are light but I’ve definitely had lighter weight sneakers. I’m just going to have to spend a little more and get my new balance runners I had before"
  },
  {
    "user": "Wanda Burton",
    "rating": 5.0,
    "message": "Very comfortable and being a nurse on my feet all day, that is very important"
  },
  {
    "user": "ST",
    "rating": 4.0,
    "message": "I bought these for work, as my job has me walking or standing 90% of my 10 hour shift. The first 4 or 5 hours were pretty good, these shoes are lightweight and offer some support. I have to supplement with gel inserts for better arch support though. These shoes are absolutely great for minimal walking (like usual day to day walking), but for my workday, they work great for the first half of my shift. Second half, not so much. Probably just my feet being tired and not necessarily the shoe. I like the style, colors, and feel. Would definitely recommend for general walking around. Good product."
  },
  {
    "user": "Lorri Terrier",
    "rating": 5.0,
    "message": "These shoes, I would give a 10 star if I could.. these are literally the best comfort shoes I can remember ever having. They are like walking on air, nicely cushioned and at a great price. Not often you can get all these great features in one! I would recommend these shoes to anyone that wants great looks, comfort and affordable."
  },
  {
    "user": "Brenda",
    "rating": 5.0,
    "message": "These sneakers are great! This is my 2nd pair."
  },
  {
    "user": "Phantom",
    "rating": 5.0,
    "message": "These shoes took me a little getting used to at first but they are very comfortable and I have been getting a lot of compliments. The only thing for me is that even the comfortable they don't have any support. The shoes insole is very thin and foam like. I put new insoles in them for support."
  },
  {
    "user": "ben johnson",
    "rating": 3.0,
    "message": "I work as a CNA in a hospital and these shoes have only lasted 4 months. I expected with running shoes I'd be fine. I literally am just on flat surfaces and not bumpy. I'm disappointed that they haven't lasted as long"
  },
  {
    "user": "debra thornhill",
    "rating": 5.0,
    "message": "I will buy them again"
  },
  {
    "user": "Buyer",
    "rating": 2.0,
    "message": "These shoes are for someone looking for inexpensive price.  I rated a 2 star bc for me they are not comfortable for my standing all day job. I would give it a 5 all the way but its based on what i do in my job. But they are cute tho."
  },
  {
    "user": "Mimi K",
    "rating": 3.0,
    "message": "i loved the look of this shoe, i really wanted it to fit! Im an 8.5, and length wise it worked - a tad bit long, but certainly going down to an 8 would be too short. the problems are that the shoe is meant for a wide foot - Im more on the narrow side, no Fred Flintsone feet here! The other thing is the type of foam/PV bottom it has the shoes SQUEAKS like when you've walked in a puddle! thats a no-go for me. I have no desire to have my sneakers announce my presence anywhere. Returning these cute things."
  },
  {
    "user": "Angela smithson",
    "rating": 5.0,
    "message": "The value is incredible I usually buy name brand sneakers but after reading the reviews I had to try for the price. The size was true to description. No complaints. I use these for walking and they are amazing and sturdy. Much better then the designer brands. I will definitely be a repeat customer!"
  },
  {
    "user": "Raven H.",
    "rating": 4.0,
    "message": "I really love the shoe. It has a sleek, clean look and could almost be confused for Nike for a brief second. I have only worn them a couple of times but they are fairly comfy. The only thing bad I have to say is that they feel a bit heavy."
  },
  {
    "user": "Jen",
    "rating": 4.0,
    "message": "Received today really fast. Put on right away they feel lite and comfortable so far. I always get a size nine. They feel like I have a little room at the toes. But time will tell I’m on my feet for 10 hours a day. So I will come back and let you know how they feel then. But as of right now they feel comfortable. Good price if I like them I’m gonna get me some pink ones. The only thing my package was opened when I got it out of mailbox."
  },
  {
    "user": "Elizabeth Nasternak",
    "rating": 5.0,
    "message": "I was very pleased to find such a great price and product."
  },
  {
    "user": "debbie",
    "rating": 5.0,
    "message": "They are extremely comfortable"
  },
  {
    "user": "L Vandermeer",
    "rating": 3.0,
    "message": "The shoe runs a bit big but mostly way too wide, despite the horrible pointy tip. I am an 8.5. I normally buy Sketcher shoes size 8.5 and although they are a bit roomy, your feet don't swim in them and they offer support which was lacking in this shoe. Looks wise, they look nice from the side only! When you put them on and you look down on them, they look like old lady shoes to me with a pointy toe. Weird! If you're buying this shoe, order a similar shoe from Sketchers of the same size, and return the pair you like the least. I can guarantee that you will keep the Sketchers, especially with only a small price difference. I can envision smacking your head on the ground with these shoes. To me they feel unsafe! The Sketchers look cute on top! These don't!"
  },
  {
    "user": "Valeria Vasquez",
    "rating": 5.0,
    "message": "Es ligero,  súper confortable, lo puedo usar por horas y mi pie sigue cómodo. Además,  se ve muy bien !"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I use it to work in and it’s help my back and my instep. It is very paded  it has high heel . Which is Even good."
  },
  {
    "user": "Melissa V",
    "rating": 4.0,
    "message": "Love the design and they are pretty comfortable for casual wear. I got these for work, which I am on concrete all day every day. After the first week my feet would be sore more often after work and increasingly so as it got later into the week. After a month I had to get new shoes because the pain seemed to increase each week. I still wear them out casually, but if you're intending to wear them for 10 hour days on the job these might not be the right shoe."
  },
  {
    "user": "Margot L. Strunin",
    "rating": 5.0,
    "message": "Great sneakers at a great price!"
  },
  {
    "user": "Lo",
    "rating": 4.0,
    "message": "I was worried buying these because I was not able to try them on, but when they arrived they fit perfectly! They do rub the ankle a little bit but after about 2 weeks, they stopped rubbing. The color is super cute!"
  },
  {
    "user": "Fashion First",
    "rating": 4.0,
    "message": "Pleased with the color. Ordered this same shoe in a different color. The second pair feel softer."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these not knowing what to expect. I have larger feet and they fit perfectly. They are so comfortable!"
  },
  {
    "user": "Julia",
    "rating": 5.0,
    "message": "I will be honest I was hesitant to buy the shoe because i didnt know the brand but im glad I did it has air support and it feels amazing to walk on it. Im really happy that I got it."
  },
  {
    "user": "Jessie",
    "rating": 4.0,
    "message": "These sneakers are super comfortable but I though they might have a little more support around the foot and ankle area. The body of the sneaker is not as structured as I expected (easy for me to roll my bad ankle) but overall a decent pair of inexpensive sneakers."
  },
  {
    "user": "Queen EnVogue",
    "rating": 4.0,
    "message": "Runs true to size and very well made. Worth the price point."
  },
  {
    "user": "Malynda M",
    "rating": 3.0,
    "message": "Outside of the size issue very lightweight and nice comfortable shoe. This shoe fit much larger than it states. Typically I find that Nike runs narrow and or smaller than normal, that said, I still order true to size and I find this she was a lot more “loose” so I do not feel the form & fit as I should. If I had not needed a shoe immediately for work I would have taken the time to return them for a smaller size."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "I have bought this several times during the pandemic, and I've gone through three pairs already.  The shoes split right at the ball of the feet...both sides...and I find out when I'm walking through a puddle.  But for the cost, I don't expect these to last forever...so that's that."
  },
  {
    "user": "debra milano",
    "rating": 5.0,
    "message": "Just like Nike. Just a little angry by toe"
  },
  {
    "user": "hnb16",
    "rating": 5.0,
    "message": "I ABSOLUTELY LOVE THESE SHOES!!! I've got many compliments on them. They are true to size! They are super comfortable!! ABSOLUTELY love the color. Definitely a GREAT buy!!! Would pair another pair no question asked!!"
  },
  {
    "user": "Dolores",
    "rating": 5.0,
    "message": "The shoes are real comfy!"
  },
  {
    "user": "Angie B",
    "rating": 5.0,
    "message": "Usually I takes few days for my feet to adjust but this pair was so comfy and light ,I wear them all day and also my back did not complain .I will be getting other colors ."
  },
  {
    "user": "Pamela Strauss",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Melissa",
    "rating": 2.0,
    "message": "Nice looking running shoe. Fit as expected. My complaint is that they have more of a heel with the “air” chamber. This makes my feet feel slanted toward the toes which is something to get used to."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "After a long day on my feet, my feet ached."
  },
  {
    "user": "regina osborn",
    "rating": 5.0,
    "message": "Omg..these shoes are amazing..I have neuropathy..and plantar fasciatitis..my feet no longer hurt..I'm on my feet 14 hrs.a day..absolutely love them"
  },
  {
    "user": "David",
    "rating": 5.0,
    "message": "I wore these for five days walking 6+ miles (per day!) in Disney world and my feet were floating! I usually blister pretty badly breaking in shoes, but I didn’t have any issues with these. They’re very light weight and fit true to size."
  },
  {
    "user": "Robyn Bonin",
    "rating": 5.0,
    "message": "Comfortable and stylish. A slight but big but just need to change insole. Perfect for what I need.."
  },
  {
    "user": "Austin Parsons",
    "rating": 3.0,
    "message": "These shoes were very comfortable. After 6 months of occasional wearing I noticed that the bottom of both feet felt wet after walking through a small puddle.  I then took my shoes off and there was a crack in the ball of my foot area of the shoe on both feet.  I just threw the shoes away.  A good price and comfort but they don't last. Bummer."
  },
  {
    "user": "tessie",
    "rating": 4.0,
    "message": "They shoes fit like I wanted them to very comfortable very stylish got a lot of compliments"
  },
  {
    "user": "J",
    "rating": 4.0,
    "message": "This is a great shoe if you're looking for cute, athletic-leisure look. There is no tread so it can be slippery on certain surfaces. I plan to get another color of this style but I would not use it for exercise or athletic purposes."
  },
  {
    "user": "Carey",
    "rating": 3.0,
    "message": "These are exactly what you expect for the price you pay. They are cheaply made but doable. Perfect for my set of working scrubs"
  },
  {
    "user": "MEM",
    "rating": 4.0,
    "message": "Color as pictured. They are a little bulky looking but feel comfortable on my feet after using them for 9 hours. Great non skid soles. I ordered a 7.5 and I’m usually a 7 or 7.5, but since they are for work I want to be comfortable even when feet swell after a 12 hour shift."
  },
  {
    "user": "The Ice Man",
    "rating": 4.0,
    "message": "Comfortable and stylish"
  },
  {
    "user": "Christina",
    "rating": 3.0,
    "message": "I love how light weight these shoes were.  It was like carrying air.  My only issue was that the outer areas on the sole part inside the shoe were really hard and hurt my feet.  I tried to break it in and wear it for a bit to see if maybe it was just me being a sensitive sally, but even after a week of wearing it every day, my feet were really sore.  Overall great concept, and super lightweight, but not very comfortable."
  }
]