[
  {
    "user": "Karen Malaga",
    "rating": 4.0,
    "message": "I just received mine in the wine color and love them. I am not a gym shoe person but I saw this color combination and had to have them. They are true to size. I am a 7M and fit just right.  I look the sole being kind of thick as I am rather short (5.1) and feel super short without shoes lifting me up a bit. 😉 The only thing I am not super crazy about is the tongue of the shoe has an unfinished look…but I can live with it. Totally recommend them and will update once I have had a chance to wear them! 😊"
  },
  {
    "user": "Gus&Erin",
    "rating": 4.0,
    "message": "These are great looking retro sneakers, but I returned them because I have high arches and they lacked support for me."
  },
  {
    "user": "Elisabeth",
    "rating": 4.0,
    "message": "Cute shoe. Comfy. Seems a bit small. Since I wasn't planning to run in them,  I ordered my regular size. The 9 was too small so had to return"
  },
  {
    "user": "m. crabtree",
    "rating": 5.0,
    "message": "These shoes are super comfortable and I can walk around in them all day. As a high school teacher, this is super important. But they are also sporty and still work with skirts/dresses or slacks/jeans. I always receive compliments on them when I wear them out. They were also comfortable right out of the box. I plan to order another pair in different colors. Highly recommend if you’re looking for the vintage kicks that are cushy too."
  },
  {
    "user": "S. -delgado",
    "rating": 5.0,
    "message": "Very comfy runs little big could of taken 1/2 size smaller but kept them ."
  },
  {
    "user": "monica brumit",
    "rating": 5.0,
    "message": "These are so cute! The quality is amazing and the colors are spot on! I have gotten so many compliments on them already. I can’t wait to wear these going into fall and winter!"
  },
  {
    "user": "Jill",
    "rating": 4.0,
    "message": "Cute shoes to wear while being functional"
  },
  {
    "user": "Margie",
    "rating": 4.0,
    "message": "Really liked the shoe but it was a half size too small.  I normally wear a 9 in athletic shoes, but needed a 9.5."
  },
  {
    "user": "Ann-Marie",
    "rating": 5.0,
    "message": "I like these shoes a lot! This is my 4th pair, I want all the colors! They are super comfy!"
  },
  {
    "user": "María Aguirre",
    "rating": 5.0,
    "message": "Súper cómodos , lindos y talla perfecta"
  },
  {
    "user": "Anabel Torres",
    "rating": 4.0,
    "message": "The box came torn."
  },
  {
    "user": "Daniel Dunbar",
    "rating": 5.0,
    "message": "The media could not be loaded. Love the shoe, fits as expected! Can’t wait to order more. Also don’t know if these are sold by an actual seller because I ordered them prime and they took 2weeks to get to me."
  },
  {
    "user": "Margarita V.",
    "rating": 5.0,
    "message": "La comodidad es poder usar con media gruesa de algodón, sin embargo estos zapatos solo me permiten usar con media delgada. Tengo exámenes los mismos en beige con rosado y son más cómodos que los negros. En estos específicamente color NEGRO elegiría 1/2 talla más. Por lo demás son hermosos y muy muy versátiles"
  },
  {
    "user": "Patricia munoz",
    "rating": 5.0,
    "message": "Lindo y me entregaron súper rápido"
  },
  {
    "user": "Sng",
    "rating": 5.0,
    "message": "Great look but they run a little on the smaller size."
  },
  {
    "user": "Vitaliy",
    "rating": 3.0,
    "message": "sneakers of good quality, but too soft, they don’t fix the heel very well, the size corresponds to the table."
  },
  {
    "user": "Ria Cayer",
    "rating": 5.0,
    "message": "Soft insoles. Cute style. You won’t regret buying a pair of these gems."
  },
  {
    "user": "Edgar Benavides",
    "rating": 5.0,
    "message": "gooooddd"
  },
  {
    "user": "Diana kanki",
    "rating": 5.0,
    "message": "The media could not be loaded. Me gustaron, pero son casuales, para largas caminatas no los recomiendo, pero están lindos."
  },
  {
    "user": "Sfr",
    "rating": 5.0,
    "message": "Comfy for working on feet all day in busy medical clinic"
  },
  {
    "user": "Kelsey",
    "rating": 5.0,
    "message": "Love these shoes. Super comfy!"
  },
  {
    "user": "Cliente Amazon",
    "rating": 5.0,
    "message": "Loved loved and loved!!! I’m in love!!! They are super comfortable. Definitely buying more!! THANK YOUUUU 💜💜💜"
  },
  {
    "user": "Angie M. Wood",
    "rating": 5.0,
    "message": "These are fantastic and stylish. Very comfortable too."
  },
  {
    "user": "Gladis Mariela Duarte",
    "rating": 2.0,
    "message": "Mala terminación , parece una confección falsa"
  },
  {
    "user": "Laura sanchez",
    "rating": 5.0,
    "message": "The media could not be loaded. Super lindos y cómodos"
  },
  {
    "user": "OompaLoompa43",
    "rating": 1.0,
    "message": "I have never seen a New Balance sneaker with exposed foam before. This unfinished tongue really looks terrible in person. I'm guessing they are fake and wish I could get a refund."
  },
  {
    "user": "Maria Acosta",
    "rating": 1.0,
    "message": "I ordered a pair and they were comfortable, but the fabric on the top was bunched and stained. I ordered a replacement and the second pair was even dirtier."
  },
  {
    "user": "Sarah",
    "rating": 1.0,
    "message": "These shoes are poorly made. Your feet sit up to high so it feels like the shoes are going to fall off. The soles also slide out too. Awful"
  },
  {
    "user": "Kaylee",
    "rating": 1.0,
    "message": "I am very disappointed with these shoes. I am a long time lover of the 574’s, so when I saw these I knew I had to try them. VERY cheap feeling and looking. Your foot also sits very high up in them, making the back not tall enough to stay on your foot. Constantly feel like they are going to rip apart or fall off. DO NOT BUY!!!"
  },
  {
    "user": "cancan",
    "rating": 1.0,
    "message": "Just didn’t like them in person."
  },
  {
    "user": "Laura",
    "rating": 1.0,
    "message": ""
  },
  {
    "user": "Gabby",
    "rating": 1.0,
    "message": "Material not that great and not comfy"
  },
  {
    "user": "Jena B.",
    "rating": 1.0,
    "message": "Really poor material. REALLY regret purchasing :/"
  },
  {
    "user": "Denise Mastrangelo",
    "rating": 3.0,
    "message": "These shoes are so cute but unfortunately not as comfortable as they look. The fit seemed a bit large, and the soles were extremely flat. They ended up getting returned"
  },
  {
    "user": "orangebowl95",
    "rating": 2.0,
    "message": "I did the prime “try before you buy” and it was a really simple process and I’m glad I ended up not purchasing these. The fit was definitely tighter than expected so I would recommend sizing up. Other than that they were cute shoes but cheaply made in my opinion. Around the laces of the shoes there was exposed foam material and it made it look unfinished and cheap. These shoes aren’t for me and I would’ve expected them to be a lower price for the quality received. They’re also not comfortable to wear for a long period of time."
  },
  {
    "user": "taylor meyers",
    "rating": 1.0,
    "message": "Very cheap quality."
  },
  {
    "user": null,
    "rating": null,
    "message": "Un superbe confort taille normale j'ai du 38 et je les aies pris en 38"
  },
  {
    "user": null,
    "rating": null,
    "message": "Muy cómodas y bonitas"
  },
  {
    "user": null,
    "rating": null,
    "message": "j adore mes baskets elles sont top 😉"
  },
  {
    "user": null,
    "rating": null,
    "message": "Son cómodas el color pega con todo y no se manchan como unas más claras. Son diferentes a otros modelos más comunes"
  },
  {
    "user": null,
    "rating": null,
    "message": "Amazing trainers. They look really cool and they are SO comfortable. Well worth the money. The only thing I would say is to order a bigger size as they are a small fit. I am usually a 6.5/7  UK and I needed an 8."
  },
  {
    "user": null,
    "rating": null,
    "message": "Really comfortable and look very cool. Product arrived on time. Great service and value."
  },
  {
    "user": null,
    "rating": null,
    "message": "Belle scarpe old style"
  },
  {
    "user": null,
    "rating": null,
    "message": "Están muy cómodos, son originales, sin duda volvería a comprar"
  }
]