[
  {
    "user": "Cheryl kalbfleisch",
    "rating": 4.0,
    "message": "I wear an 8.6 and I ordered a size 40 which is the conversion. It was slightly too big. If I order another one I will order an equivalent to an size 8 instead. I can probably fix the issue by purchasing a heel pad for the back of the shoe and maybe some arch supports that I usually but anyway. I'm going on a trip where I may be walking 10 miles a day and needed good walking shoe"
  },
  {
    "user": "Shorty Spice",
    "rating": 4.0,
    "message": "I love the look of the shoe. First day I wore them, felt good. As the day went on my feet began to hurt. I think they need more support. My socks were slipperyso as I walked my foot went forward too. I have worn them again a few times but not all day with alot of walking. Shoe does feel better as if I am not wearing shoes at all."
  },
  {
    "user": "Ms.TeeBee",
    "rating": 4.0,
    "message": "It's kind of a struggle to get on and you'd have to have a really thin sock or stocking unless you go barefoot in or go up a half size if possible."
  },
  {
    "user": "Donna McAllister",
    "rating": 4.0,
    "message": "This sneaker/boot is great.  Very stylish.  It runs small.  I bought it a half a size larger."
  },
  {
    "user": "Katzenboots",
    "rating": 5.0,
    "message": "I wear a 6 1/2 in any other shoe but I had to buy a 6 in this shoe. They were so loose and long in the heel. The 6 is perfect. The insole is not padded and they do not have a significant arch support. BUT, they are extremely comfortable, like wearing socks with a sole. The height of the heel makes walking pleasant, and they're no problem for someone who stands all day."
  },
  {
    "user": "Corina Andras",
    "rating": 4.0,
    "message": "I like the comfort"
  },
  {
    "user": "maria e mendez",
    "rating": 4.0,
    "message": "👍🏼"
  },
  {
    "user": "Amanda",
    "rating": 4.0,
    "message": "I’m seriously sad that I can’t wear these all day at work because they aren’t that great for long wearing times. They feel off balance in the soles if that makes sense. After a long period of time in them.  They are very narrow and I have more of a wide base. They aren’t bad they just aren’t for me to wear while I am working. I am returning the pair of them in grey that I bought along with these the red/black. I think they’re super cute so I am keeping them as “quick trip shoes” just a run to the store and back a trip to the dog park these are great. Happy overall"
  },
  {
    "user": "Patti Saltzburg",
    "rating": 5.0,
    "message": "I like these shoes because I do a lot of walking at work and by the time I got home, my feet did not hurt. Gives me extra cushion as well from the hard floors"
  },
  {
    "user": "Gloria",
    "rating": 5.0,
    "message": "So nice and compfy for stand and taking walks. I got these on a flash sale and what a buy. These look like name brand shoes and so many people ask me about them. I bought blue and gray."
  },
  {
    "user": "Lillie",
    "rating": 4.0,
    "message": "These are comfortable but not like my first experience with the first pair that I bought"
  },
  {
    "user": "Tera Howard",
    "rating": 5.0,
    "message": "These are awesome shoes. I have a lot of trouble with my left ankle, and these shoes give a lot of ankle support. I will buy again, but maybe a 1/2 size smaller."
  },
  {
    "user": "d.dowdy",
    "rating": 4.0,
    "message": "But I still like them, and that’s just because I’m clumsy."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I absolutely love these shoes they’re so comfy and I have them in every color"
  },
  {
    "user": "Rodney",
    "rating": 5.0,
    "message": "Ademas de su comodiad realmente lucen elegantes como para vestir no solo con jean, sino con cualquier otro tipo de pantalon"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Very light weight, and good fit. Had some very similar to these and these to fit alittle snugger yet not to a too much but need more comfortable insole, I don't feel getting the comfort and support I need. Which in other pair I did start off with and extra insole to make it fit right. But heel does hurt after wear them, I do walk hard on my heel and this are my work shoes that I wear all day in surgery"
  },
  {
    "user": "Mydelight",
    "rating": 3.0,
    "message": "These shoes actually look pretty nice.  I thought they might look really cheap but they are not bad.  The problem is, the sock part on the ankles is too big and mine did not come with real laces.  The lace up area does not go up high enough and the heel area is too big.  Therefore, my feet tend to come up out of the back when walking.  I just received these and tried walking around the house in them.  I really need something for my feet as my feet hurt all the time due to some health issues.  Wearing a good comfortable sneaker helps and I needed a new pair a.s.a.p.  I am debating on whether to send these back or not.  I need something now and I hate sending things back from Amazon because I always seem to get screwed out of part of my money somehow.  The inside of these shoes are comfortable, I will give it that.  I just think the ankle area should be smaller with better stretch for those who have large ankles and I am not sure if it's just me but the heel area is way too big for a normal (not wide) size sneaker.  I am older and have to worry about falling and tripping.  So I am going to buy some shoe inserts and try that but if it doesn't help with keeping the shoe on my foot, I will sadly have to return these."
  },
  {
    "user": "Barbara",
    "rating": 5.0,
    "message": "Ever day use"
  },
  {
    "user": "tamika powell branch",
    "rating": 5.0,
    "message": "Other nurses were raving about them, I believe them now!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very confortable!"
  },
  {
    "user": "Sylvia",
    "rating": 5.0,
    "message": "Balance, comfortable and fashionable been stopped 5 times to where I got the sneaker"
  },
  {
    "user": "WhoDatAngel4Life",
    "rating": 5.0,
    "message": "It was a very cute shoe, but I should have order a size up because they run small. I wear a 8.5 and should have order a 9."
  },
  {
    "user": "Esther",
    "rating": 4.0,
    "message": "I find these shoes hard to get on. Once they are on, they fit alright and are comfortable.  The insole comes lose every time I take my foot out."
  },
  {
    "user": "Lisa harrison",
    "rating": 5.0,
    "message": "Most comfortable shoes I've bought these are my third pair I just love the way they fit I work in the nursing field and they are perfect for what I do my socks don't get wet my shoes dry up quickly"
  },
  {
    "user": "Jennifer  Dillon",
    "rating": 5.0,
    "message": "There is nothing that I dislike about the shoe!"
  },
  {
    "user": "April Manzano’s",
    "rating": 5.0,
    "message": "I was scared to order some shoes online but I order a size 5 and they fit really good use and For Work they are very comfortable"
  },
  {
    "user": "Pam",
    "rating": 5.0,
    "message": "Great fit.  Fix my siatic issue"
  },
  {
    "user": "Brenda L Thocker",
    "rating": 5.0,
    "message": "These shoes fit great they are very comfortable and help with my heel pain. Highly recommend."
  },
  {
    "user": "BJ Wallis",
    "rating": 4.0,
    "message": "Great, except ran small"
  },
  {
    "user": "Elizabeth Perez",
    "rating": 3.0,
    "message": "Los compre para mi caminata matutina de 3 millas al llevar la primer milla ya me molestaban los talones no tiene comodidad tube que comprar plantillas compre 2 pares tendre que regresar un par o si  todabia puedo regresare los 2 pares"
  },
  {
    "user": "Alice Marsupi",
    "rating": 3.0,
    "message": "I bought these from Amazon Warehouse for work in a warehouse after reading so many reviews claiming they were blissfully comfortable. Well, they were bearable but I’ve gotta wonder what people wear other than these to describe these to the heights I’ve read. I’d give these 5/10. I’ll wear them around for running errands but they are not shoes you’d want to wear if you’re on your feet for 8-12 hours a day. Cheap Chinese products are cheap Chinese products and Amazon has become the AliBaba of the US. I miss the old Amazon of the millennium before Bezos got greedy."
  },
  {
    "user": "Shelley S.",
    "rating": 4.0,
    "message": "Need a little more arch support. Sold as being non-slip, but in restaurant kitchen beware!"
  },
  {
    "user": "LP in TX",
    "rating": 5.0,
    "message": "I needed comfortable walking shoes.  These are great."
  },
  {
    "user": "C",
    "rating": 3.0,
    "message": "I love these because you can just slip them on and they give me a little extra height. But, my feet kept sliding forward and my toes would be so sore after a few hours of wear. I ended up buying some inserts with better arch support to replace the cheap ones these come with and that made a big difference. Hoping the laces won’t wear out and the shoes won’t stretch out too much over time."
  },
  {
    "user": "Patty g.",
    "rating": 5.0,
    "message": "I’m very happy with purchase can stand all day at work with these 😃"
  },
  {
    "user": "Cassie pass",
    "rating": 4.0,
    "message": "I got a size bigger then what I usually get but these are not easy to get on since they do not have a tongue maybe I just have to get used to them other wise they are fine."
  },
  {
    "user": "Dcor",
    "rating": 4.0,
    "message": "Great price and comfortable!  I bought them for easy off and on while going through airport while traveling.  I now also wear them for work, they have a firm support."
  },
  {
    "user": "Maritza Lantigua",
    "rating": 5.0,
    "message": "Excepcional"
  },
  {
    "user": "Ivelisse Gell",
    "rating": 4.0,
    "message": "The media could not be loaded. I'm a size 6.5 and they agree a litter small even size 7 and after a few hours I feel them very tight. But I live them anyway and decided to keep them."
  },
  {
    "user": "perfume lover",
    "rating": 4.0,
    "message": "Very comfortable"
  },
  {
    "user": "Ernesto Quevedo",
    "rating": 4.0,
    "message": "these shoes were amazing for price since i am a man wearing these shoes is going to be a bit different but overall amazing shoes"
  },
  {
    "user": "Cynthia B.",
    "rating": 4.0,
    "message": "Now that I have the correct size, they are very comfortable."
  },
  {
    "user": "Margaret Williams",
    "rating": 3.0,
    "message": "I loved the shoes they are really cute they are light weight, but with some padding and arch support they would be wonderful. I would buy them in every color."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect and comfortable"
  },
  {
    "user": "mike l.",
    "rating": 5.0,
    "message": "I really enjoy these shoes and they’re nice for both daily walks and wearing to work with jeans !"
  },
  {
    "user": "imswtcrln",
    "rating": 4.0,
    "message": "I purchased these because I have been happy with a nearly identical pair of Sketchers in another color. I am recovering from a broken ankle and they've been most comfortable in spite of foot swelling as well as providing stability."
  },
  {
    "user": "Cat Fiend",
    "rating": 5.0,
    "message": "Of this style, Mishansha is producing the best.  Others have cheap insoles,  the upper woven fabric is too soft and wrinkles even when walking.  This brand has amazing insoles and the fabric has a tight weave and structure, holds it's shape.  I have 3 pairs now. I bought 2 others from Alibaba, and gave 1 pair away, and returned another.  Poor quality with those.  This Mishansha brand is the best.  And true to size too."
  },
  {
    "user": "SM",
    "rating": 5.0,
    "message": "Muy cómodo para el trabajo"
  },
  {
    "user": "Kimberly Maiden",
    "rating": 3.0,
    "message": "Bought because wanted some slipon shoes, but these were hard to put on due to non-rigid back of shoe."
  },
  {
    "user": "Chit Cabral",
    "rating": 5.0,
    "message": "I like it much"
  },
  {
    "user": "Darleen",
    "rating": 4.0,
    "message": "Love the color!  I purchased an 8.5 (normal size), but it fitted a bit larger.  I had to put a shoe insert for the proper fitting."
  },
  {
    "user": "Colleen ciappara",
    "rating": 3.0,
    "message": "Thought they were for orthopedic support, as advertised but they are not, I had to add another insole for more comfort, without added insole it felt like I was walking on rounded nail heads, also no real arch support."
  },
  {
    "user": "Charli",
    "rating": 3.0,
    "message": "I was really bummed when it didn't work out because i was really looking forward to a nice pair of walking shoes however these hurt my feet. i felt the heel was too high and the elastic was too tight on my left  foot (disclaimer, i do have issues with my left foot bc of previous injury) however after standing in these shoes for just a few minutes i felt discomfort on both feet. but again this is just one person's review, it may work for you."
  },
  {
    "user": "Corvonoir",
    "rating": 3.0,
    "message": "The shoes are comfortable. I bit loose"
  },
  {
    "user": "peacemaker",
    "rating": 3.0,
    "message": "I got these as slip-ons for when I work with pottery.  The price is great and the fit is nice/comfortable but I feel like I have high-heeled sneakers on. Too high in the back."
  },
  {
    "user": "MM",
    "rating": 3.0,
    "message": "The shoes are larger than the shoe size of the the customer and they are not easy to put on."
  },
  {
    "user": "Lisa C.",
    "rating": 5.0,
    "message": "I love this shoe , it is so comfortable and easy to put on.  You feel like you are walking on air.  I have them in three different colors."
  },
  {
    "user": "Nancy M. Hamilton",
    "rating": 5.0,
    "message": "Shoes were a gift to my granddaughter.  She really likes them!"
  },
  {
    "user": "Yolanda Brown",
    "rating": 3.0,
    "message": "Length"
  },
  {
    "user": "Adiva S.",
    "rating": 2.0,
    "message": "I work in a warehouse. I'm an area Manager so there's a lot of walking and a lot of running. Even more standing. When I wear these shoes, it feels like I'm wearing wedge heels with socks. My feet slip to the front every time and the heel part of the shoe is a lot higher than usual. If you're particular of how you look all the time like I am, then your hate that the tongue of the shoe is fabric folded in, and it pops out when you put the shoes on. I would like a refund. Just so you know I am not a picky person. I just bought a dress that I wasn't happy with from Amazon, but luckily I know how to sew so I made the necessary adjustments. Still didn't fit like I wanted to but it looked better than it did before. These shoes need serious manufacture adjustments."
  },
  {
    "user": "Jill Cain",
    "rating": 5.0,
    "message": "Great shooed for walking love them"
  },
  {
    "user": "Doreen A Verity",
    "rating": 3.0,
    "message": "They look nice. I just couldn’t get my heel in which defeated my purpose of an easy on walking/shopping shoe"
  },
  {
    "user": "Pulgarin’s",
    "rating": 5.0,
    "message": "Me agrado mucho utilizo para trabajar y caminar my recomendó."
  },
  {
    "user": "Kat",
    "rating": 4.0,
    "message": "Shoes look nice as pictured and very comfortable. BUTTTTT they squeak when you walk 🤦‍♀️"
  },
  {
    "user": "Light Fit",
    "rating": 3.0,
    "message": "Look is good but not soft"
  },
  {
    "user": "AK",
    "rating": 5.0,
    "message": "These shoes are very comfy and looks great with any kind of dress! I get so many compliments too!"
  },
  {
    "user": "krn",
    "rating": 3.0,
    "message": "Super cute shoes. They are lightly glittered in a not-too-flashy way. They are lightweight and supportive. But, these would best for folks with wide feet. My feet are not narrow, but they move all over the place in the toe box and mid-foot areas the most. Also, the tie area was uncomfortable on the top of my feet. I returned them, but if my feet were wider I would have loved them."
  },
  {
    "user": "Barbara",
    "rating": 4.0,
    "message": "The shoes fit true to size; however, I was skeptical and ordered half size up. They are too big but I'm not returning them. I wear size 8 in a close-toed shoe and ordered size 8 1/2, so I'll just wear a thicker sock. I'm sure I'll want a roomier shoe for days when my feet are sore or swollen. No blisters or discomfort wearing them on the first day. I was so pleased to feel air coming into the shoe around my toes. I stand and walk for 13 hrs. a day at work (two jobs, different shoes for each), plus I stand more while at home without shoes--so I do a lot of standing. They are easy to slip on over a sock, no straining, and quick! The top is soft around your toes and arch, so if you need no pressure at the toes, like me, these are for you. I like that there are no shoelaces to trip over if they become untied. My only complaint is that the heel is higher than the toes so that may bother my back after a few days but I plan to alternate with other shoes. If you need protection from falling objects, this shoe isn't for you. I have a high arch and do not need support, so I'm not sure about that area, yet."
  },
  {
    "user": "pete",
    "rating": 3.0,
    "message": "too wide and then my foot slipped"
  },
  {
    "user": "Cindy",
    "rating": 4.0,
    "message": "I like them"
  },
  {
    "user": "Sadie M Davis",
    "rating": 4.0,
    "message": "More like a 11M"
  },
  {
    "user": "Jennifer Newsone",
    "rating": 3.0,
    "message": "I was so excited to get the shoes do used to work in and they were way too narrow and I couldn’t even get them on and it was a size 11 and I normally wear a 10 10 1/2"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "did not like the fit"
  },
  {
    "user": "Linda Walsh",
    "rating": 3.0,
    "message": "Wanted to travel with this shoe, however insole cut to high and cuts into bottom inner side. Going to try and add an additional insole for comfort!"
  },
  {
    "user": "Kerri F.",
    "rating": 3.0,
    "message": "I like the color and fit,  but the bottom of the sole started coming apart after wearing only about a dozen times."
  },
  {
    "user": "Cindy",
    "rating": 5.0,
    "message": "If you need a hard sole shoe that is affordable, these fit the bill. They are breathable and provide good support. They are a little “tall” so it adds about 2.5 to 3 inches to your height and take time to get use to, but may feet do not hurt after my long walks."
  },
  {
    "user": "leslie w.",
    "rating": 3.0,
    "message": "I love the looks of these shoes. However they run on the large size, so I definitely recommend ordering down a size.  Since my local UPS is pickup only and they won't recognize the QRS code I'm sorta stuck with them ( nearest UPS is 110 miles round-trip). I'm going to also add some inserts for arch support as these have minimal support. I'm hoping the inserts also take up some of the extra space and I can make them work"
  },
  {
    "user": "Cynthia McClain",
    "rating": 5.0,
    "message": "I fully like this  tennis shoes. No complaints."
  },
  {
    "user": "Karen Hoffman",
    "rating": 4.0,
    "message": "Nice"
  },
  {
    "user": "KatKel.",
    "rating": 4.0,
    "message": "I’m normally a size 8.5 but after seeing sizing feedback and reviews I went down to a size 8, I still have a tiny bit of wiggle room. I have a standard width food and the hug across the top and under my arch is perfect! Also not snug around the ankle. I got the maroon ones and they are true to color. The heel is pretty high, but unlike some reviews I don’t find my feet sliding toward the toe. That might be from people that drag their feet more when they walk(?). There’s a very slight squeak noise when walking but I’m sure after a few days it will lessen. Doesn’t bother me. The toggle laces when cinched do help a bit but they became too long after tightening so I knotted, cut and seared the ends to prevent fraying. You can see in my pics. All in all, great shoe for the price! I look forward that wearing these!"
  },
  {
    "user": "James D. Eaton",
    "rating": 3.0,
    "message": "This is light and comfortable, but as a walker I felt no support as it’s like a sock with a shoe sole. Unfortunately this item was a waste for me."
  },
  {
    "user": "Miss Lovely",
    "rating": 4.0,
    "message": "The shoes are very comfortable. I didn't purchase them for walking but for working.  I guess they will be comfortable for walking as well."
  },
  {
    "user": "Language Lady",
    "rating": 4.0,
    "message": "Versatile and very comfortable.  I purchased them for a non labor intensive nursing assignment and they were perfect. Added a slightly polished look to ordinary scrub ensemble more than sneakers but so comfortable that I did sometimes wear them outside of work cause they can go either way. Size 9"
  },
  {
    "user": "NetteGhm-todos",
    "rating": 2.0,
    "message": "I wanted them to be the shoe for me, but for me it's 95% functional and 5% style.  On a scale of 1-10, lightweight = 10 (never mind the height, which of course you don't feel unless you're NOT used to wearing high heels); comfort = 5 (they're not heavily padded; can't see me wearing them to work on a concrete floor because I'm challenged with calluses.  Support = 2.  By the way, not only for this shoe but all others with that \"shock-absorbing looking\" bottom - 0 negative.  If the shoe does NOT give that bounce when you walk, run away from it (i.e. my Oofos has the bounce, on my second pair now) - Like the regulation tracks from high school running (ran track in high school/college/post college races, 5k, etc.)  The design is nice though."
  },
  {
    "user": "Shelly Gautreaux",
    "rating": 3.0,
    "message": "I liked these shoes they were very cute but hurt my back"
  },
  {
    "user": "me",
    "rating": 4.0,
    "message": "I have to wait for them to open up."
  },
  {
    "user": "O Begaye",
    "rating": 4.0,
    "message": "comfortable shoe, but heel is a little high for me."
  },
  {
    "user": "linda janssen",
    "rating": 5.0,
    "message": "I am a nurse and needed a shoe that was going to give me support and comfort. This shoe does both. I wear a Size  6 and it fits true to size. It is the only shoe I reach for whether I'm just running errands or going to work. Absolutely the best shoe I ever purchased."
  },
  {
    "user": "Fa’amasino",
    "rating": 5.0,
    "message": "I am so impressed with this shoe. For a no-name brand, this shoe is fantastic. I usually wear brand-name shoes and pay a fortune, and after a full day of standing and walking, my back, knees, and ankles hurt. I have no pain or discomfort after a full day wearing these shoes. They are lightweight with great support all-around your foot. Beautiful sleek design. Goes perfectly with sweat pants, jeans, shorts, and capris. I bought the white ones, but I'm thinking of buying another color. Definitely, worth the $36.99 price tag; you won't be disappointed."
  },
  {
    "user": "Michelle Hessler",
    "rating": 3.0,
    "message": "Uncomfortable at first. Starts getting better after a few days."
  },
  {
    "user": "shannon r case",
    "rating": 5.0,
    "message": "So comfortable.. and give support to my ankle that is needed. I have Achilles tendinitis and would recommend these to anyone with this or any foot problem like mine"
  },
  {
    "user": "Shellise Bacchus",
    "rating": 4.0,
    "message": "Very comfortable and i love the color"
  },
  {
    "user": "Rick",
    "rating": 5.0,
    "message": "Great support, comfort and very light in weight.  Do they come in any other colors beside black & white?"
  },
  {
    "user": "Denise Williams",
    "rating": 5.0,
    "message": "Nice"
  },
  {
    "user": "Kaydian",
    "rating": 3.0,
    "message": "nice shoes but where too small for my wife and thankfully me and her wear the same size so I can use them for work later"
  },
  {
    "user": "Mrs Hart",
    "rating": 4.0,
    "message": "I wasn't expecting to actually like theese sneakers. I am a \"plus size\" women and I walk heavy on my heels so all my shoes wear out fast especially on the heels. So when I saw these I specifically was buying them for work so it would be easy in my feet with all the walking I do. Surprisingly they are super heel supporting. The heel is like a shock absorbing heel that feels like I am walking on a zero impact cloud. However I will say if you are wide foot person. You will hate the shoes. They are very narrow. I had to stretch the material to not feel like my circulation in my was dying. But now that I have done that they are great. Also, I have arch issue in my feet so I added my own sole insert on top of the shoe provided insert for my extra support and I am walking awesome! I will buy another pair."
  },
  {
    "user": "Debbie",
    "rating": 3.0,
    "message": "True to size . Not much cushion in heel area . Very light weight"
  },
  {
    "user": "Ivette chavarria",
    "rating": 5.0,
    "message": "I had an operation on my foot  and  it fits me great n soft everything is great."
  },
  {
    "user": "Lorrie",
    "rating": 3.0,
    "message": "The heel is WAY too high!! Ruins the whole shoe. These shoes are pretty much a high heel tennis shoe."
  },
  {
    "user": "Edna",
    "rating": 5.0,
    "message": "Wow.. so comfortable.  Highly recommended. Amazing color."
  }
]