[
  {
    "user": "AngelinaAmazon Customer",
    "rating": 4.0,
    "message": "These are very comfortable and unique. I did not size up so had to return first pair. Second pair fit better but the heal started to look like a marshmallow that has been squeezed after wearing a total of 8 hours. I am 120 pounds and was disappointed that happened so fast. I can't imagine what the heel would have done in 3 months. Had to return yet again😏 I'm going for a 3rd time in hopes that last pair was just a fluke of some kind. Anyone else experience that before I try one last time? I didn't see one other review with same experience.....ALSO the price just dropped on Sorells website 10 dollars cheaper than here on Amazon!"
  },
  {
    "user": "Karen",
    "rating": 5.0,
    "message": "Bought these for work (bartender) and they did not disappoint.  I will absolutely be buying another pair. They are the best and most comfortable sneaker I’ve ever had. Very flexible sole which is perfect for moving about a bar since I’m practically running everywhere. My feet do t get sore when I’m standing around either.  They do come pretty narrow but it feels more like a “sock” fit if that makes sense."
  },
  {
    "user": "Cecile Encarnacion",
    "rating": 4.0,
    "message": "Love Um !! They run extremely small be warned."
  },
  {
    "user": "Laura A.",
    "rating": 4.0,
    "message": "Very cute and seem well made. Too tight in the width to be a shoe specifically for walking distances comfortably.  Not sure if fit to be a cross trainer. And I don’t understand Amazon pricing. I’m not paying $35 more for next half size up!"
  },
  {
    "user": "ChocRidge",
    "rating": 5.0,
    "message": "Wore these shoes walking around Italy every day for 2 weeks.  They were comfortable and held up great.  Highly recommended if you have a lot of walking to do."
  },
  {
    "user": "Kimberly B.",
    "rating": 5.0,
    "message": "They fit so well right out of the box. They're like a hug for my feet and they're so light! I love the unique look. Easily the most comfortable shoes I own."
  },
  {
    "user": "Troy Zernzach",
    "rating": 4.0,
    "message": "I love these shoes, but for some reason with Sorel's I have to size up a size.  I do have wide feet and need the size up, but I do love them and find them very comfortable with an increase in size."
  },
  {
    "user": "lbrowning",
    "rating": 4.0,
    "message": "These were great until they weren’t. I recently wore them on a trip to Europe for the first time. They only socks I can wear with them Are the small peds. While out for a day trip, I felt a bunched feeling in my heel only to find out the foot lining had peeled away. There is no fixing this other than to take liners out and try to find one’s thin enough to fit into the shoe. As expensive as these were I would have expected better quality."
  },
  {
    "user": "Gucamole2608",
    "rating": 5.0,
    "message": "This is my fourth pair. I love them all. They hug my foot and offer plenty of cushion and support. Not for a wide foot. The laces loosen and adjust but it works as a slip on for me."
  },
  {
    "user": "ALane",
    "rating": 4.0,
    "message": "Looks great and super stylish! The top of the shoe doesn’t lie flat so it digs into my foot, so not the most comfortable fit."
  },
  {
    "user": "Christine Dayton",
    "rating": 5.0,
    "message": "Best shoes ever!!! I wear them anywhere I know I’m going to walk a lot. They are amazing. No blisters, no uncomfortable spots. NOTHING! And cute with any outfit."
  },
  {
    "user": "Sydnie McGuire",
    "rating": 4.0,
    "message": "Made well, stylish, but very narrow. If they were wider, I wouldn't have returned them"
  },
  {
    "user": "Valerie",
    "rating": 5.0,
    "message": "Love them. Cozy and fit great!!"
  },
  {
    "user": "Lorien Lucas",
    "rating": 5.0,
    "message": "I love the slip on quality of these shoes. They are stylish and very comfortable. Would buy again."
  },
  {
    "user": "Sasutam",
    "rating": 4.0,
    "message": "They don't stay tied and when ran under the shoe. the laces are too short to double knot properly. They are snug on the top of my foot and not as comfortable as the og kentic sorels. Would not recommend as a running shoe."
  },
  {
    "user": "Catherine",
    "rating": 5.0,
    "message": "I’m on my feet most of the day. Sorrels make a huge difference not only for my feet, for my arthritic knees and back. Worth every penny!"
  },
  {
    "user": "Marilyn Nales",
    "rating": 5.0,
    "message": "Good buy and the sneakers is very comfortable"
  },
  {
    "user": "Aura Cruz",
    "rating": 5.0,
    "message": "I can’t ever find shoes that fit. Fit great! For most it may run small. So size up."
  },
  {
    "user": "shoegirl",
    "rating": 4.0,
    "message": "Great fit, very supportive and comfortable but had to return as price was just too high."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love how this shoe looks. Wouldn’t recommend for working out. Could definitely spend the day walking in though!"
  },
  {
    "user": "angelika",
    "rating": 4.0,
    "message": "Good ,stylish comfy ,but have questions to those parts and glue ,shows at the picture. Not cheap shoes for such a quality"
  },
  {
    "user": "Kimberly",
    "rating": 5.0,
    "message": "Nothing to dislike"
  },
  {
    "user": "Angie Hopper",
    "rating": 5.0,
    "message": "Shoe is very comfortable, fits perfectly, and very stylish"
  },
  {
    "user": "Lisa S.",
    "rating": 5.0,
    "message": "Comfy, light weight and breathable"
  },
  {
    "user": "Allison B.",
    "rating": 5.0,
    "message": "This is the first athletic shoe that feels good and fits perfectly! They are lightweight and O comfortable!"
  },
  {
    "user": "JS",
    "rating": 5.0,
    "message": "Comfortable + stylish!😁"
  },
  {
    "user": "Chicago",
    "rating": 3.0,
    "message": "I ordered this shoe size 8 in March and loved them, color black. Loved them so much I ordered the cream pair for the fall, same size. They run much smaller. Disappointed the sizing wasn’t the same."
  },
  {
    "user": "Beth J.",
    "rating": 5.0,
    "message": "The sneakers came wrapped nicely and they fit perfectly. They are exactly as they appear and are the most comfortable sneakers I own. I have them on all day and there’s no need to take them off. Room for all my toes and I get many comments about how fashionable they are."
  },
  {
    "user": "LaVerne's Review",
    "rating": 4.0,
    "message": "Could use a little more arch support.  Great for walking or just styling. Cute comfortable sneaker. True to size."
  },
  {
    "user": "Hunter",
    "rating": 5.0,
    "message": "Bought these for workouts.  They are so good. They are great support and really cute. The brand is known for their quality boots and shoes. I own several pairs of Sorels. I going to purchase more in different colors."
  },
  {
    "user": "Kim Turner",
    "rating": 5.0,
    "message": "I rarely write a review even if I love a product. I just seem to never quite get around to it. But these shoes… I can’t tell you enough how much I love them. I’ve had them three days now and I’ve worn them to walk every day. Twice a day yesterday. I think these are probably the most comfortable sneakers I have ever owned. Not only when I’m wearing them, but I have NO foot pain when I take them off. Or the next morning - I can’t wait to put them back on my feet. I’ll be 65 soon and my feet hurt when I wake up each day. Especially if I’ve been for a walk the day before, but not after I walk in these. I usually wear a 7 1/2 (sometimes 8) in athletic shoes and I got a size 7 in these. They fit perfectly. I wear thin no-show socks (like really no-show - like you’d wear with street shoes) because I can’t bring myself to wear them without socks. You could though - they’re that comfortable. I too worry about about the laces going under the shoe. I’ll just try to avoid puddles and mud - the shoelaces do go up in the “waves” of the bottom of the shoe quite a bit so, for the most part, it shouldn’t be an issue. Worse case, I can wash the laces. I know everyone’s feet are different, but I can’t recommend these shoes enough. I’m already looking at other colors! (And the laceless ones - wonder if they’d be as comfortable?) Get these shoes!"
  },
  {
    "user": "Janice Raber",
    "rating": 5.0,
    "message": "Great shoes, comfortable, I have 3 other pair in different colors. When I saw the price of these I couldn’t pass up purchasing them!"
  },
  {
    "user": "Lauren B.",
    "rating": 5.0,
    "message": "Comfy and super cute! But not for working out"
  },
  {
    "user": "yabbadabbado",
    "rating": 5.0,
    "message": "So much cushion. I needed these!"
  },
  {
    "user": "Jeffrey Plotts",
    "rating": 4.0,
    "message": "these are wonderful my mom and i both have a pair and we love them they’re super easy to just slip on and go to work the only complaint i have is the shoe laces come untied even with a double knot :/ other than that they’re fantastic"
  },
  {
    "user": "Jo",
    "rating": 4.0,
    "message": "Very nice & comfortable shoe, but I think they run small. I have to send back for a half size bigger."
  },
  {
    "user": "Becky R.",
    "rating": 2.0,
    "message": "The media could not be loaded. I own 5 pairs of shoes from sorel… but I wanted to try something different so I decided to try out tennis shoes. I like how the look a lot… but I put them on and they are so tight. I felt like these would run small… so I ordered an entire size up than usual… but that did not help. I can only walk in them for 1-2 hours before my feet hurt sooo bad. The top of the shoes and seam is so tight that it hurts to walk and it leaves red marks/indents on the top of my foot. I now have blisters on the top, and back of my feet from these shoes. I am DYING to get out of them by the end of the day. I am so so sad about this because this is NOT how someone should feel in expensive tennis shoes. I am so displeased and wish I could get a refund. I cannot “break in” the shoes because there is no stretch to them. Also.. I cannot even wear normal socks, I have to wear half socks that slip down because the shoes are so low on your feet. I would not recommend at all because they hurt so bad and get dirty/creased at the bottom fast too… not to mention how my foot does not feel supported in the middle since there is no bottom part of the shoe there. 😢"
  },
  {
    "user": "KHosley",
    "rating": 3.0,
    "message": "Very stiff sneaker"
  },
  {
    "user": "nicole",
    "rating": 5.0,
    "message": "I first tried the “all birds” wool sneaker. All birds are also expensive but come with a 30 day no questions asked return. I returned mine after trying them for 2 weeks. I bought these sneakers instead and I’m so happy with them!! I was nervous at first because of the mixed reviews, but they definitely more comfortable than all birds. And they look way nicer too!! No more knee pain for this girl! 100% recommend!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Shoes do not stay tied."
  },
  {
    "user": "Lesa Parry",
    "rating": 5.0,
    "message": "Absolutely love these shoes. Lightweight and comfortable!"
  },
  {
    "user": "Charlene M. Riberdy",
    "rating": 3.0,
    "message": "The lace that surrounds your heal too tight and digs into back of ankle"
  },
  {
    "user": "Aaron Medaris",
    "rating": 5.0,
    "message": "These shoes are light and comfortable but also look great on. They are one of my favorite casual shoes."
  },
  {
    "user": "Jeffrey R. Buse",
    "rating": 4.0,
    "message": "The laces under my arch are felt. Perhaps because of the space between foot pad and heel pad. Very. Comfortable especially in the heels."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "The older color ones are perfect! They are the absolute best shoes ever made! I have bought every pair! All the new release colors are beautiful, but the \"tounge\" are is cut differently and they roll down and put pressure on the tops of the feet... and no I don't have big, swollen feet or ankles... I NEED THEM TO CHANGE THE CUT BACK PLEASE!!!!"
  },
  {
    "user": "Jojov",
    "rating": 5.0,
    "message": "Love everything about this sneaker. I ended up returning it because I also purchased another color to compare and ended up keeping the other one. Simply because it will go with more things for me.  I loved this color but didn’t make sense for me."
  },
  {
    "user": "K.C.",
    "rating": 3.0,
    "message": "I wanted to like these SO bad. The pics look great, the shoe in person does as well.  Then you put it on and it’s..meh. For that price, I don’t want “meh” sneakers. I had to keep sending them back and size down over and over again, til I was a whole size smaller. (I’m usually an 8). There’s just something about the cut where the ankles are that just didn’t do it for me, plus they’re like wearing a sock. I should also mention that when I put them on, my feet almost instantly fell asleep in them.  (I have narrow boney feet)- it was weird.  So, before I shipped them back, I asked my teenage daughter to try them on..she loved the looks of them too. I got the same underwhelmed reaction out of her as soon as she turned to look at the side profile. She also commented that her feet were tingly and falling asleep almost instantly.  For the price, I just couldn’t justify keeping them. I’m a person that stands on their feet all day for work, and was hoping they’d be a stylish addition to looking good, and also being comfortable....it was a hard pass, which was sad because I own a bunch of Sorels."
  },
  {
    "user": "Twinning",
    "rating": 5.0,
    "message": "At fist I purchased them for the look…they’re different. Then I wore them during my workout on the stair master and I was pleased.  I also purchased several pairs (5) to wear with dresses at work."
  },
  {
    "user": "Barbara B",
    "rating": 5.0,
    "message": "Fit perfect and modern style"
  },
  {
    "user": "Buyer",
    "rating": 3.0,
    "message": "These have a good look and the design gives the impression that they are comfortable but they dig into the back of your foot, the lacing is a bit tight and hurts while a half size is a bit too big and right size is too snug. I wish I had not with then because I would return them and if it is cool outside .. forget it. Even with socks this is a shoe for summer because the holes allow cold air to hit your docked foot like nobody’s business."
  },
  {
    "user": "Hilleary Jordan",
    "rating": 2.0,
    "message": "The back of the heel curls in and gives me insane blisters. For a mesh shoe, they are extremely uncomfortable. Also the grooves in the soles make it impossible to walk over wet ground without picking up gobs of mud. If I could go back in time, I would not buy these shoes."
  },
  {
    "user": "N. Damali-Cathie",
    "rating": 3.0,
    "message": "I really like the look of this shoe.  However, I have wide feet and bunions and the stretchy nature of this shoe is not flattering on my foot at all.  I don't like for shoes to take the form of my foot but rather have a shoe wide enough to accommodate the width of my feet.  For this reason, I had to return them."
  },
  {
    "user": "Debra B.",
    "rating": 3.0,
    "message": "They were ok, just couldn't justify the expense, for the money wasn't worth it."
  },
  {
    "user": "Anderson",
    "rating": 3.0,
    "message": "I have a few other pairs of Sorel sneakers but these slide on one's fit for length but the top pushes down hard on the top of my foot. I've worn them for 5 minutes and impressions were left on my skin. I was very sad because I love the style but these are not comfortable or easy to slide on. Return has started."
  },
  {
    "user": "Crystal S.",
    "rating": 5.0,
    "message": "I love they way they look, so unique. the stretch mesh on the shoe top is breathable and comfortable. The sole is supportive and fashionable. Highly recommend"
  },
  {
    "user": "Jordyn",
    "rating": 5.0,
    "message": "so comfortable and cute! planning to wear them for a trip abroad"
  },
  {
    "user": "james casner",
    "rating": 5.0,
    "message": "The media could not be loaded. I was hesitant to pull the trigger because of price and some mixed reviews, but I’m so glad I did because I’m SOOO obsessed with these sneakers! They are so freaking cute and totally take my outfit to the next level! The insole is leather which is a nice touch, and so is the tan band around the heel 👌🏼 I have slightly wider than average feet so I fluctuate between 8.5-9, but I sized down to 8.5 in these and they fit perfectly! The arch support is perfect, the width is perfect, and the way the laces strap, you could tighten them for narrow feet. Between form and fashion, these are my favorite pair of tennies I have ever owned."
  },
  {
    "user": "Sherri Schmid",
    "rating": 5.0,
    "message": "The fit is perfect and the shoes were comfortable on the first wear! I wish I had a pair in every color!"
  },
  {
    "user": "courtney",
    "rating": 5.0,
    "message": "These came with 2 different sized shoe laces. I love the shoes tho. So I’m not sure how to get the right shoe laces. I might just contact sorel directly and ask for a replacement lace. Cuz I love the shoe"
  },
  {
    "user": "kate v.",
    "rating": 3.0,
    "message": "I wanted to love these so badly. The color is amazing I love that pop of neon yellow. However I have 2 issues with their fabric choice for the front of the shoe. 1) you can tell your toe is gonna pop though after 1 hike. 2) it isn’t fashionable enough. The shoe is so trendy but the fabric looks like it belongs on orthopedic shoes. Just my opinion. Also I’m a 7.5 and like some room in the front so I got an 8. They fit like the 7.5 would so if you like a little room size .5 up. So sad these have to go back, those colors 😍"
  },
  {
    "user": "Socorro Bacon",
    "rating": 3.0,
    "message": "Beautiful looking shoe for eve day wear, however not appropriate for working out or exercising. To bulky and heavy also not a great way to adjust shoe laces."
  },
  {
    "user": "brenda aguilar",
    "rating": 5.0,
    "message": "I'm a hairdresser, I'm always trying to find the most comfortable tennis shoes out there, and I took a chance to order these, I've had them for about a month now and they are very very comfortable, at the end of my work day I don't feel tired, or my feet don't hurt!! I love them."
  },
  {
    "user": "sisterkate",
    "rating": 3.0,
    "message": "These shoes are SO cute. I got the black ones. They fit as expected....people said to go 1/2 size smaller so I went with 7.5 and they fit perfect. They are slide ons...didn't know that. The laces going underneath is a little bit of a pain but that is part of the look! There is essentially no arch support and no support for working out. I'm going to keep 'em because they look so cool and are mostly comfortable for kickin' around."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are the best sneakers ever!  I had knee surgery in February and have been on crutches and have lived in these shoes.  I have 2 pair and will be ordering more."
  },
  {
    "user": "Dawn M. Solideo",
    "rating": 5.0,
    "message": "These shoes are amazing So comfortable Fit perfect Highly suggest"
  },
  {
    "user": "Mercedes Hernández",
    "rating": 5.0,
    "message": "Is to big for me"
  },
  {
    "user": "Anna",
    "rating": 5.0,
    "message": "Extremely comfy , everyday wearing :) even not feel their weight , high quality and design amazing !"
  },
  {
    "user": "Sarah Griffith",
    "rating": 5.0,
    "message": "As usual sorel are the most Comfy shoes to work in for this busy salon owner… I’m usually a solid 10 but wanted these so much I got a 9.5 and they are perfect!"
  },
  {
    "user": "Elizabeth Jenkins",
    "rating": 5.0,
    "message": "This shows are enjoyable to wear.  It’s like walking on springs.  Also, fits my wider foot well!  Would buy again."
  },
  {
    "user": "Mimma Cammarata",
    "rating": 5.0,
    "message": "They run small .. at least for me .. I bought a half size larger"
  },
  {
    "user": "Natalie",
    "rating": 4.0,
    "message": "These are just too darn big. I normally wear a 6 1/2 or 7 but decided to go with a 7. Not wise. They're so big and I'm so sad."
  },
  {
    "user": "Hannah",
    "rating": 2.0,
    "message": "I received these shoes several weeks ago and was initially very happy with them. I have worn them twice so far and for short periods. I noticed yesterday that the sides have this wear to them that I would not expect after two wears especially on the outside of the shoes. The price was too much for this type of quality. I am very disappointed and would not recommend."
  },
  {
    "user": "Luisa Steckler",
    "rating": 5.0,
    "message": "Worth every penny"
  },
  {
    "user": "Michelle Forcey",
    "rating": 5.0,
    "message": "Be open to various colors. I got my second choice color for a super discount. Worth every penny."
  },
  {
    "user": "Danielle L.",
    "rating": 5.0,
    "message": "They fit your foot like a glove and feel like a slipper. I have received many compliments on their appearance also!"
  },
  {
    "user": "Melissa",
    "rating": 5.0,
    "message": "I love these. My feet never hurt in them and they are very stylish"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I wanted to love these shoes. They’re sporty but after wearing them 8-10 times they started coming apart. Disappointed due to the price I spent on them. They’re super comfortable for the short time I was able to wear them."
  },
  {
    "user": "ag",
    "rating": 3.0,
    "message": "Not sure how I feel about these shoes. They look exactly as pictured, which I like. They are unique and stylish, but they definitely run big. Also there is little to no arch support. I thought it was bc shoe is big, but I feel “flat-footed” in the shoes. My foot slaps the ground bc there is little support in the middle of the shoe. For the price of the shoe ($100+ -on sale-) I feel it should have a better overall quality. Unfortunately I don’t think I will be keeping."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I am in love with these!!!  My new go to!  So lightweight and amazing arch support!  Well worth the price tag! Working, running… everyday… these are great!  Highly recommend these!"
  },
  {
    "user": "a new comer",
    "rating": 3.0,
    "message": "Still a little on the long side. But the center of the shoe is snuggle so I couldn't go two sizes down. More of a fashion shoe for sure."
  },
  {
    "user": "SBoo",
    "rating": 5.0,
    "message": "I normally don't like wearing tennis shoes all day because my feet tend to sweat in them, then swell when I take them off.  These are the best brand of tennis shoes I have ever owned.  They feel wonderful on my arthritic feet, and my feet breathe in them all day, so they never sweat and don't swell up when I take them off.  I bought a 2nd pair in white.  Well worth the money.  All my other tennis shoes are going to Goodwill."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Walking and workout"
  },
  {
    "user": "Eve Johnson",
    "rating": 2.0,
    "message": "I purchased these shoes for the long hours on my feet. (Nurse) Ive tried breaking these in, in hopes that they would become more comfortable. The toe box is narrow, the heel has no cushion or support, they are so incredible uncomfortable. Clearly I was expecting more especially for the price . I have several Sorel tennis shoes. These are horrible. They easily smudge which you can clearly see in the picture, another reason I will not be wearing these for work. A sad Sorel purchase indeed."
  },
  {
    "user": "L. Coop",
    "rating": 5.0,
    "message": "I’m usually between a 6-6.5 in shoe I got the 6.5 but could have sized down to 6 I have a little room but it’s ok not too noticeable and still very comfortable shoes. I love walking in them every day"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love that they can slip on and can be worn with or without the show laces. They are comfortable but really look fantastic. They run big. I could/should have gotten a half size down."
  },
  {
    "user": "Audrey",
    "rating": 5.0,
    "message": "Comfortable but I do not think for running. I just bought it to wear occasionally. I am 81/2 and this are truth size."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Comfortable shoe, light and breathable. I love the color and that they just slip on. I ordered a half size down from what I normally wear and I’m glad I did. If I ordered my normal size it would have been too big."
  },
  {
    "user": "lightening",
    "rating": 3.0,
    "message": "Now a month in so here are my take aways.  I like the shock absorption of these sneakers.  As far as the fit, I found when I wear socks they don't feel supportive, my feet slide around and forward, the mesh upper is stretchy.  So, I wore them without socks which did give me more of a supportive feel and my feet didn't slide.  The downfall .. 3 blisters after a 2 mile walk. The insert has good arch support but I am struggling with the sliding issue.  Not sure on the value, these weren't cheap to be on the fence."
  },
  {
    "user": "Sunshine",
    "rating": 4.0,
    "message": "Look great, only complaint is that they don't stay tied."
  },
  {
    "user": "bg94",
    "rating": 5.0,
    "message": "Just a wee bit larger than I expected, a bit of heel slippage, but not enough for me to not give these five stars!  Sorel hits another home run for me. Long time devotee to their boots, these have increased my love of the brand. It’s like walking on air!  Light, comfy, springy. They do come untied easily, but again, not enough nuisance for me to ding them."
  },
  {
    "user": "Melisa",
    "rating": 5.0,
    "message": "Love these shoes! Super cute and comfortable. Purchased 2 pair ❤️"
  },
  {
    "user": "Chris",
    "rating": 5.0,
    "message": "Go and buy these shoes! Quickly! Super comfortable and great for running short or long distance. Now I need to buy another pair!"
  },
  {
    "user": "CJC",
    "rating": 5.0,
    "message": "I really like them.  Feel great and different for Sorrel to do a shoe like this."
  },
  {
    "user": "Lynn hart",
    "rating": 5.0,
    "message": "Best walking shoes I own. Great for every day life."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love them! Left my hikers home & hiked throughout Sequoia & Yosemite with them! Then through in wash & they are so light weight they dry in no time. Definitely be buying another pair 👍🏼"
  },
  {
    "user": "KRBM",
    "rating": 5.0,
    "message": "Sorel, the maker of this sneak, is ultra high-end. They make the some of the best qualities shoes, boots, etc. on the planet. These are SO well-designed, 90's trendy, comfortable, yet interesting and innovative! You could wear these with any leggings, anywhere. Fabulous!"
  },
  {
    "user": "Christy",
    "rating": 5.0,
    "message": "Shoes are super comfortable & fashionable.  I bought them for casual wear with yoga & sports pants."
  },
  {
    "user": "carla paz",
    "rating": 5.0,
    "message": "El material muy suave y muy cómodos para caminar."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They are so comfortable! I workout abs walk in them! Love them!"
  },
  {
    "user": "Paige Leslie",
    "rating": 2.0,
    "message": "I bought these shoes because they looked so nice and Sorel is a well known quality brand. For the price, I expect the shoe to look finished. When it arrived, it already looked like the sole was coming off. I’m hoping the return them and get a better pair. The shoes itself is comfortable and light weight and that’s why it got 2 stars."
  }
]