[
  {
    "user": "Shuntandra",
    "rating": 5.0,
    "message": "I needed a pair of running shoes, but didn’t want to spend a lot of money while not having to go without comfort. Read the reviews which were mostly good so I jumped in head first and was not disappointed. They are so beautiful and the brightest shoe I ever seen. I can go hours on my feet and never feel any type of discomfort and I also workout and run in them and they perform with no failure. I also get a lot of compliments and I’m quick to tell them I got them from Amazon. My son likes them so I found a similar pair in his size and he loves his shoes and wants them in every color so we are currently collecting every color."
  },
  {
    "user": "tenderfoot",
    "rating": 4.0,
    "message": "I only gave them 4 stars because they didn’t have half sizes and I use orthotics so the comfort portion is dependent on my orthotics. I absolutely loved the colors and they are definitely well made!"
  },
  {
    "user": "karen schwartz",
    "rating": 5.0,
    "message": "Fits as expected order your usually size. I was skeptical of massaging insoles. Putting your feet in these and standing for long periods or walking long distances these shoes are a dream !!! They are balanced in such a way there are no pressure points on your heels or the ball of your foot and they look great too!"
  },
  {
    "user": "Kharinne Shinaul",
    "rating": 5.0,
    "message": "I was told by my co-workers at Home Depot, in Brunswick, OH, that these shoes would provide much needed relief from standing on concrete all day. They were right! I highly recommend them to anyone who needs to stand on their feet for 4-8 hours a day. I purchased the red pair, and I plan to purchase at 2 more pairs in different colors. Congratulations!"
  },
  {
    "user": "Ruddy A Jaquez Jr",
    "rating": 5.0,
    "message": "Ordered these for a concert. They served their purpose for the night. The shoes themselves are not comfortable. The soles are bumpy. The design on the side of the shoes are starting to peel off. BUT they served their purpose for the outfit I wore for the concert."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "There’s not a ton of support, but comfortable. The soles are hard which work well for where I walk on gravel. And they look nice. So far I’ve walked about 8 miles in them and they’re still feeling good."
  },
  {
    "user": "Kathy Reddin",
    "rating": 4.0,
    "message": "Gym"
  },
  {
    "user": "Teri S Hinman",
    "rating": 5.0,
    "message": "Wide for my foot and not quite enough support.  I will put in inserts.  Seller shipped fast and would buy from them again"
  },
  {
    "user": "KLS LLC",
    "rating": 4.0,
    "message": "This shoe is comfortable, especially if you're going to be on your feet for more than 8 hours. However, on the sides, the rub is starting to separate from the shoe. I've only had them for about a month or less than."
  },
  {
    "user": "tim m.",
    "rating": 4.0,
    "message": "returned for a different style"
  },
  {
    "user": "Maryfran Vetrino",
    "rating": 4.0,
    "message": "Fit okay.  Little looses in the back."
  },
  {
    "user": "CAROLYN M CAIN",
    "rating": 5.0,
    "message": "Order your true size. These shoes are stylish and comfortable. I have bought several colors and I get compliments every time asking where did I get them. Buy them and you will be back to buy other colors."
  },
  {
    "user": "A. Bush",
    "rating": 5.0,
    "message": "I really like these, I needed something comfortable for everyday wear and these fit the bill."
  },
  {
    "user": "Vanessa King",
    "rating": 4.0,
    "message": "Since i purchased this pair of shoes i have wore twice; they're comfortable and cute, but the arch support are not as good as i would've  like them to be, however; my co-worker really like them."
  },
  {
    "user": "Rebecca Linscott",
    "rating": 4.0,
    "message": "I should’ve ordered a smaller size"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "A little too big. Used them for work."
  },
  {
    "user": "Shandra Dyess",
    "rating": 4.0,
    "message": "I purchased these to try out at work and help with the pinching in my toes that was giving me blisters with my other ones. These are *amazing* they help provide extra cushioning for my back problems, I've gotten multiple compliments on them at work and have since had several coworkers ask me for the information on them and they've purchased them as well. The only downside is they're not actually slip resistant. I work in an OR at a local hospital. If there is any type of dampness/wet floor/fluids on the floor (which happens often in an operating room for sure!)? I will slip and almost die if I'm not wearing those blue slip covers you see people wearing often on TV. But that's a small price to pay for not having blisters and no longer feeling my age when I put roughly 10-15miles of walking in during my 10hr shift. These shoes are life savers and I'll absolutely be purchasing them again!"
  },
  {
    "user": "Dave Homberg",
    "rating": 5.0,
    "message": "Very comfortable - second pair I own!"
  },
  {
    "user": "Theresa knox",
    "rating": 4.0,
    "message": "I ordered these shoes without reading the reviews because I absolutely loved the look.  I have to admit I was a little skeptical because of the price.  I pay 100 to 200 dollars for my walking shoes.  It was after ordering the shoes that I decided to read the reviews.  After reading most of the negative comments , I felt I had made a mistake and would probably be returning the shoes.  Wrong!!!!!  The shoes arrived in two days of course (that’s Amazon for ya).  I wore them today shopping to test comfort…they passed!  I’m a perfect size 9…they passed.  The plastic sole that some complained about!  If you check out the style of the sole, you will see why it has to be plastic and not rubber.  The material is strong but design makes for comfortable heel to toe steps .  The heel flares enough so that if you don’t have very weak ankles, you don’t have to worry about support.  Moving about today…so far my feet feel very comfortable.  But, I have not given them the big test yet.  I walk at least 2 miles everyday…rain or shine…25 to 85 degrees.  I do not expect these shoes to withstand that kind of pressure long term.  But if and when they do wear out I will be replacing them, because they are some sharp looking shoes. I have the black and red.  Allow me to take this opportunity to encourage you to indulge regularly in the most underrated exercise…walking!!!  Take it from an 84 year old female😀"
  },
  {
    "user": "saceventz",
    "rating": 4.0,
    "message": "Vibrant color. Got lots of compliments."
  },
  {
    "user": "Phyllis Clark",
    "rating": 4.0,
    "message": "This sneaker looks and feel comfortable. But, the fit was way too tight."
  },
  {
    "user": "Amanda Pearson",
    "rating": 4.0,
    "message": "Bought these for work and I’m on my feet all day as I work in a hospital. A coworker had a pair in a different color, so I thought I’d give them a try. Had them about a week now and I’m enjoying them. They have good arch support for me, which is a plus because I have high arches, so finding a good shoe can be the difference between a good and bad day. I’m hoping they hold up over time, but so far I really like them."
  },
  {
    "user": "Rebecca",
    "rating": 4.0,
    "message": "I love these. I get compliments all the time for them. My only negative (the reason I gave four instead of five stars) is the pink part on the side of the school is slowly starting to peel away. I'll probably super glue it down but other than that, awesome shoes"
  },
  {
    "user": "Andrea",
    "rating": 4.0,
    "message": "I bought these for work and I’m on my feet all day  they are good sneakers the support is good and dosing is cool only thing I didn’t like about it was the amount of dust that accumulated in between the design on the bottom … and since I did wear them all the time including the gym the bottom or the sneakers started to peel off I’ve had these for about 2 months .. so if you’re not planning to wear them everyday they will last otherwise you’ll need another pair in 2-3 months"
  },
  {
    "user": "Sandra Benes",
    "rating": 5.0,
    "message": "I would order 1/2 size larger they are perfect my feet, legs , hips and back don’t hurt near as bad"
  },
  {
    "user": "Gelena",
    "rating": 5.0,
    "message": "These were cute and I loved the support, but they just didn’t fit my oddly shaped foot. My heels are very narrow, so the shoe slipped up and down, and since there was no “locking” eye for the laces, I could not lock-lace them to prevent the slipping. I was disappointed since I really liked them."
  },
  {
    "user": "S. Smith",
    "rating": 3.0,
    "message": "I've had these just over 60 days.  I run 3-4 times per week.  I was optimistic from the reviews these shoes would check all the boxes.  So far, they are at least 1 size too big, confirmed by having my mother, a size 9 try them on and they fit her pefectly.  I have an 8 wide foot amd still these shoes slip, I had a full two weeks of new blisters, which I expected wearing them in, but now the designs are starting to crack and split."
  },
  {
    "user": "Rosalie Densmore",
    "rating": 4.0,
    "message": "They're light weight, built good as far as we can tell so far, my 16 year old daughter loves them. No complaints yet and she's been wearing them for a week now"
  },
  {
    "user": "mercy",
    "rating": 5.0,
    "message": "I love wearing this shoes"
  },
  {
    "user": "Angie Manning",
    "rating": 5.0,
    "message": "Love these shoes!  I have worked in the ER for many years and these are the first pair of shoes that I can wear for a full shift with not foot pain!  Amazing!  3 of my peers have purchased them also!  Love them!!"
  },
  {
    "user": "Anita J.",
    "rating": 4.0,
    "message": "The sneaker is really cute. Good quality but not has comfortable has I hoped."
  },
  {
    "user": "Rykendra Brunson",
    "rating": 5.0,
    "message": "Super cute! Wore these for my lupus walk. I changed the laces. Would recommend, I got my true size an 8. These are white and not grey btw"
  },
  {
    "user": "Brenda Hutchins",
    "rating": 5.0,
    "message": "color perfect"
  },
  {
    "user": "Sarah Humes",
    "rating": 4.0,
    "message": "I’m a waitress so I’m constantly running around during work and have worn these once so far and they did good thus far! My feet weren’t aching at the end of the shift and they aren’t even broken in yet…I don’t see them holding up for more than a year probably with my usage but for the price they will do! Plus they’re super cuuuute."
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "It looks amazing get another in different color"
  },
  {
    "user": "Joanne C. Hale",
    "rating": 5.0,
    "message": "Purchased for a trip to Washington DC very comfortable. Needed no breakin time Cleaned up nicely after we returned home"
  },
  {
    "user": "HoffmanTeacher",
    "rating": 4.0,
    "message": "I liked the support, colors are suitable for work. I am disappointed that there wasn’t a size 10 in any color. Will continue to check but I don’t think they make them in a 10. I gave the shoe 4 stars because of the sizing issue otherwise it would’ve been a 5-star rating ."
  },
  {
    "user": "Wendy Guillén",
    "rating": 4.0,
    "message": "Me los mandaron una talla más, y me quedaron grandes. Los e pedido 2 veces y en las 2 me los mandan grandes. ☹️"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I ordered a 9 bc there wasn’t an 8.5, they are a little bit big, but I like them so much! I get so many compliments. I love the purple."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Cute sneakers. Very stylish. Comfortable enought to wear for a few hours but not all day. Get a half size up. I wear a 10 and ordered 10.5. I recommend."
  },
  {
    "user": "Kenzie Rae",
    "rating": 5.0,
    "message": "it does run just a bit big, i’m usually a 7 but could’ve gotten a 6 and it would’ve fit perfect. i’m in the medical field and these are amazing though!"
  },
  {
    "user": "Zombyz1",
    "rating": 4.0,
    "message": "I love these shoes they are comfy and I grt lots of compliments on the bright yellow color, but they lose a star because the plastic flames are starting to peel away from the shoe. They are difficult to keep clean too but wash up nicely in an open drum washer on a gentle cycle and then just sat out to dry, they looked brand new. Despite the peeling g I would buy them again for the comfort alone, I did a couple of 40,000 step days in them at Knotts Berry without any problem at all."
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "I didn't know what to expect so I took a chance and I am glad I did. I will be odering another pair so I can change them out regularly. Fun colors too."
  },
  {
    "user": "Veronica",
    "rating": 4.0,
    "message": "I originally ordered a size 6 as that or a 6.5 is usually what fits best. It was really comfy and I had a little extra room. Only problem was the hole at the front of the shoe was pressing into the balls of my feet and hurting. I figured if I got a size smaller they'd fit properly. Put them on and they were just as comfy and snug like I like. I could still feel the hole though. I decide to try a short walk down the street and I didn't even get a quarter of a mile before the balls of my feet were hurting. I really wish these were comfortable for me to walk in and stand in like they are for others, but this style of sole isn't for me."
  },
  {
    "user": "msgrnbay",
    "rating": 3.0,
    "message": "Not the most comfortable walking on hard surfaces.  Since Nike discontinue their REAX style of shoe (my favorite shoe of all time), I've been looking for a replacement.  I found this shoe and liked what I read and it looked nice.  My disappointment is except for the thin memory foam pad there isn't any additional padding or cushion that will sustain comfort all day.  I'm a massage therapist and on my feet all day and I need strong support all around the shoe.  Initially when you first step into the shoe it feels great, but then it becomes more of a harder surface feel on the bottom of my feet.  I know it said memory foam (which I hate) but thought this shoe would have extra substantial support underneath the foam.  It did not.  The bottom of the shoe is really cool to look at, but it's a hard plastic like substance with zero give.  I wear a medium width and found this shoe to be a tad wider which wasn't a factor in me liking this shoe or not. The foam padding is removable which is good because I will need to add more padding underneath, and so the wider shoe will hopefully accommodate this.  One thing I thought really odd is there isn't a company logo or name of the shoe company anywhere, and there isn't a shoe size listed on the shoe either.  Who wouldn't want to advertise their product?  Strange."
  },
  {
    "user": "C.K",
    "rating": 5.0,
    "message": "I like the way these look and for the price, great pair of shoes!"
  },
  {
    "user": "Shyshadow",
    "rating": 4.0,
    "message": "I love these shoes their comfortable & light weight. Great for being on my feet all day and running around everywhere at work, however I've only had these shoes a couple weeks now and they are already falling apart on me."
  },
  {
    "user": "MARSHAUN OLANIYAN",
    "rating": 4.0,
    "message": "I’m giving these a 4 as they slip off a bit due to the sizing being a bit off."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Very lightweight and comfortable"
  },
  {
    "user": "Jo A. Lykins",
    "rating": 5.0,
    "message": "I love these shoes and this particular color has gotten a lot of attention when I wear them.  Fun to wear and the sole is excellent.  I have Plantar Fasciitis and it helps with that problem.  Because of that problem I do put extra support in.  The inner sole comes out easily which helps.  At any rate, I find this shoe to be excellent in comfort and just plain fun to wear.  I am thinking of ordering another smashing color!  :)"
  },
  {
    "user": "Samaneh",
    "rating": 4.0,
    "message": "Beautiful"
  },
  {
    "user": "Irina",
    "rating": 5.0,
    "message": "Didn’t expect they would be so comfortable! Great arch support!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Very comfortable, got lots of compliments."
  },
  {
    "user": "Elyse fetcko",
    "rating": 4.0,
    "message": "I like the shoes; however, this is the second pair I have ordered. The initial pair the stripes immediately began to come off, so I sent them back. I received another pair and the stripes stayed on a little longer. (Long enough not to be able to return them) I rated them a little lower because of the stripes coming off."
  },
  {
    "user": "Meadors",
    "rating": 4.0,
    "message": "NOT FOR WET FLOORS BY ANY MEANS."
  },
  {
    "user": "lynn kee",
    "rating": 4.0,
    "message": "Love the style and the color"
  },
  {
    "user": "Arch Hooks",
    "rating": 4.0,
    "message": "Great comfort and support!"
  },
  {
    "user": "Patricia Williams",
    "rating": 5.0,
    "message": "Very comfortable but runs a little big."
  },
  {
    "user": "Sharon Day",
    "rating": 5.0,
    "message": "This shoe is so light weight an comfortable...just ordered another pair"
  },
  {
    "user": "Yasmin Fitzpatrick",
    "rating": 5.0,
    "message": "I live these 👞  shoes"
  },
  {
    "user": "jillian r renner",
    "rating": 5.0,
    "message": "Use for the gym. Ordered my size and worked perfect. They are lightweight and comfortable. Seem sturdy so far, only been cpl months of casual wear but so far so good. The best part for me is the arch. I have a fairly high arch and it's hard to find support. These have a perfect arch to add to the comfort. I ordered to orange and they are bright and fun"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "The shoes are comfy and fit true to size...but I have only been wearing mine for about 2 months and they are falling apart. I think they should last longer then 2 months. I have shoes that have lasted 10 years. I would recommend if you're not going to use them on a daily basis. And I'm not even running...I'm standing in place at my job. Should not be falling apart."
  },
  {
    "user": "Kevin Flett",
    "rating": 5.0,
    "message": "I loved these shoes from the moment I put them on my feet.  Excellent support,  super comfortable and light weight.  I normal need to slowly start to use new tennis shoes, but not with this time.  Just what i was wanting."
  },
  {
    "user": "Jennifer H.",
    "rating": 4.0,
    "message": "These shoes were more comfortable than I expected. They're very odd. The bottoms are hard, solid plastic, and shaped so that they'll flex comfortably when you walk. But the sole itself is so hard and unyielding, it's a little like wearing steel toed shoes."
  },
  {
    "user": "L W",
    "rating": 4.0,
    "message": "These are cute and fun. Ordered my size and fit great.  Maybe not the best for all day work if you are on concrete but otherwise love them."
  },
  {
    "user": "Chanya Middleton",
    "rating": 4.0,
    "message": "I would say these are good for the price. If you’re actually going to run or jog  in them I’ll say no, if you’re going to do yoga or stretch tie the laces really well and you should be fine. If you’re walking short distance, everyone will complement you and you should be fine. If you’re going grocery shopping, yes! If you’re walking in the mall for a while maybe not. My point is that any serious training or distance in them will begin to bother your feet but because they look so good if you keep light and short you’ll be a hit. The shapes you see at the bottom of the sneaker actually are what start bothering you and I thought they would create a bounce. Nope. Chanya"
  },
  {
    "user": "Devon Martinez",
    "rating": 4.0,
    "message": "Very good support and comfortable all day long but they Tearing up already and I haven’t had them for that long"
  },
  {
    "user": "LaDonna Holt",
    "rating": 4.0,
    "message": "Very comfortable and light weight.  Can't really comment on the support. I have to add my own Orthotics to my shoes.  Doctor's prescribed."
  },
  {
    "user": "janice dalton",
    "rating": 3.0,
    "message": "These shoes are sized larger thwn regular shoes and they aren't very comfortable"
  },
  {
    "user": "Party Girl in Big D",
    "rating": 5.0,
    "message": "I really like these sneakers. Bought another pair in white & purple!"
  },
  {
    "user": "Just Jo",
    "rating": 5.0,
    "message": "I ordered the wrong size somehow but they seem quality and comfortable!"
  },
  {
    "user": "Greg M.",
    "rating": 4.0,
    "message": "Comfort, good for her comfort and stability as my wife is a nurse and is on her feet anywhere from 10 to 16 hours a day"
  },
  {
    "user": "denett leisek",
    "rating": 5.0,
    "message": "Recently went back to work and needed a comfortable pair of shoes. Bought these and wore them as soon as I got them. Didn’t spend time to break them in, just put them on and  wore them!"
  },
  {
    "user": "mrickman",
    "rating": 5.0,
    "message": "I purchased these for my new job as teacher for special needs children. I knew I'd be on my feet all day.  When i first put them on they felt too big but after little bit they fit like a glove.  The memory foam in the shoes are amazing like walking on clouds."
  },
  {
    "user": "Teena Barner",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Osvaldo Mesa",
    "rating": 5.0,
    "message": "Nice shoes, my wife love it"
  },
  {
    "user": "Seashell1994",
    "rating": 3.0,
    "message": "I've worn these lightly over 5 months- maybe once a week at my desk or out running errands and they are falling apart. They were really comfortable- not great for stone with the hollow heel but I'm a little disappointed that both shoes are falling apart."
  },
  {
    "user": "Haely Diane",
    "rating": 5.0,
    "message": "Very nicely made. Great quality. True to size"
  },
  {
    "user": "Wallflower",
    "rating": 3.0,
    "message": "The tongue is cut a little narrow. Soon it will gather in a bunch under the laces and I will have sores on my insteps. As for support: it has the firm footbed that aids therapy for plantar fasciitis. If you don't have plantar fasciitis: got stand on bricks -- it will be like standing on clouds"
  },
  {
    "user": "Kindle Customer",
    "rating": 3.0,
    "message": "The shoes are lightweight, but are very narrow in the toe area."
  },
  {
    "user": "Brittny Spampinato",
    "rating": 4.0,
    "message": "Very comfortable and always get complements. Unfortunately the bottom of the shoes have not been holding up well and started falling apart after only a few months of daily wear."
  },
  {
    "user": "ABG",
    "rating": 3.0,
    "message": "They work and seem durable, but not very comfortable. They run slightly large and the back of the shoe really irritated my ankle. The sole is durable but not flexible which keeps the foot stiff. They’re fine in a pinch and I bought them when I just needed some sneakers."
  },
  {
    "user": "georgia dileo",
    "rating": 4.0,
    "message": "They are a little big"
  },
  {
    "user": "fulgencia guillen",
    "rating": 5.0,
    "message": "Muy comodos y ligeros"
  },
  {
    "user": "Joyce Evelyn Houston",
    "rating": 5.0,
    "message": "I have five pairs of April Spring running shoes. I gave one pair to a friend. They are very comfortable and I can wear them all day and have no foot pain. Very good for standing."
  },
  {
    "user": "Uiguria Kutlan",
    "rating": 4.0,
    "message": "I love the shoes don't me wrong and you will probably like them too, they are comfortable and lightweight but because of the price you can't expect a good quality shoe thats going to last you for years. I give the shoes a year and i'll probably replace them. Still very good product and will definitely purchase again."
  },
  {
    "user": "Teenamarie Ortiz",
    "rating": 5.0,
    "message": "I bought this for my daughter who is 11, has Juvenile Rheumatoid arthritis and starting middle school. These shoes looked comfy and once received and she tried them on...she said it was beyond comfortable and loves it so much I may buy these in all colors haha"
  },
  {
    "user": "Trish Neal",
    "rating": 3.0,
    "message": "They are comfortable and even though they say they are not slips for work they are not."
  },
  {
    "user": "Amazing Maisie",
    "rating": 4.0,
    "message": "Size: fits as expected. Style: I'm not terribly fussy, but all of the giant writing on the sneakers, which looks a bit ridiculous online, looks absolutely absurd in real life. And the sneakers make my feet look a bit huge... All that said, I have problems with my feet (plantar fasciitis and being on them consistently, so my feet are hardly ever not sore in some way) so I don't give a much of hoot about style if the shoes are comfortable and the price is right. Comfort: ~~ Soles: The soles of these sneakers are really quite solid; given their open and airy design. I was hoping they'd have a bit more give and spring and impact absorption to them. But they do not have any spring, and very little give. They're also a bit noisy until broken in. They aren't uncomfortable; they just not aren't anything like as cloud-like to walk on as one might suppose. ~~ Insoles: soft, comfortable, supportive. ~~ Sneaker body: Light weight, breathable, comfortable. No nasty sweaty hot feet problem here. ~~ Personal problem: I can't wear sneaker/ankle socks with these sneakers because my right sock will begin to be pulled down under my foot inside the sneaker and I will spend a lot of time stopping to remove the sneaker and pull my sock back up. Solution: wear higher topped socks, or sew pompons onto the heels of all of my sneaker socks, or don't wear socks."
  },
  {
    "user": "Serena Woodard",
    "rating": 4.0,
    "message": "I decided to give this product a 4/5 because they do indeed provide amazing support, but when you first wear them they are a bit uncomfortable. I know people say you have to \"break you shoes in\" but the first week of wearing these made my feet sore on the sides due to the cushion like effect that is added on the insides of the shoe. Once my feet got used to that though I had no issues!"
  },
  {
    "user": "Elsa M. Hernandez",
    "rating": 4.0,
    "message": "I like that the toe box is big enough that my toes aren’t squished."
  },
  {
    "user": "Lorie",
    "rating": 3.0,
    "message": "I am on my feet 8 hours a day and thought these would perfect. 4 hours into my shift I ended up buying new shoes and taking these off."
  },
  {
    "user": "Brandi",
    "rating": 4.0,
    "message": "These were very comfortable, but I have only worn them around 15 times and the plastic by the toes are already cracking."
  },
  {
    "user": "Sharon",
    "rating": 5.0,
    "message": "Great shoes"
  },
  {
    "user": "Joyce Heuer",
    "rating": 4.0,
    "message": "Love the comfort it gives when walking"
  },
  {
    "user": "Brittany",
    "rating": 3.0,
    "message": "I got this specifically because there suppose to be slip resistant for work and they are more slippery then regular tennis shoes."
  },
  {
    "user": "Sarah and Dj Swope",
    "rating": 5.0,
    "message": "I have a really high arch, so finding shoes that fit and are comfortable has been a fight all my life. I read the reviews on these shoes, I crossed my fingers and hoped that I was in the category that also fit these shoes, but figured I was not. As I usually never was. They arrived on time. They looked as described (love the color!) So I went to try them on. I was so surprised that they actually fit in all the right places and the arch was in the right place and was high enough. There is even little arches behind my toes! The whole shoe is comfort! My feet are not quite used to them yet. But they are getting used to them! I will be buying more in a few more colors!!"
  },
  {
    "user": "Lori Smith",
    "rating": 3.0,
    "message": "Not good for gym workouts.  Shoes slippery on gym floors."
  },
  {
    "user": "Katherine Gonzales",
    "rating": 5.0,
    "message": "Very comfortable, love the color and affordable. Highly recommend for those on there feet alot like me and skid proof."
  },
  {
    "user": "LuAnn Biggy",
    "rating": 4.0,
    "message": "The fit well were light weight but not has comfortable as I had hoped"
  }
]