[
  {
    "user": "Jack",
    "rating": 4.0,
    "message": "fit a little loose but easy to put on and like the way they looked..."
  },
  {
    "user": "cleo smith 3rd/Masotankagaming",
    "rating": 5.0,
    "message": "Let me start by saying these shoes are a blessing. I have to bad knees and with I tell you they help they really do. Whenever I go out anywhere now I wear them. I am going to order more of these Athletic Shoes. The shoes help with taking pressure of my knees, which makes so I can walk longer and farther distance. So yes, these are a 5 star for me."
  },
  {
    "user": "Will Hartzel",
    "rating": 4.0,
    "message": "My first Amazon shoe purchase…they look cool and feel fine. If you’re used to a running style shoe, these are super heavy…no way I’d use these for running. Otherwise they look great and the comfort is average."
  },
  {
    "user": "roy chapman",
    "rating": 5.0,
    "message": "i love em"
  },
  {
    "user": "Eduardo A.",
    "rating": 4.0,
    "message": "Muy grande 10/5"
  },
  {
    "user": "John Monahan",
    "rating": 4.0,
    "message": "So far so good."
  },
  {
    "user": "RL",
    "rating": 5.0,
    "message": "The quality of these shoes is excellent for the money.  They look good, feel good and are an excellent price for the shoe as compared to others.  I have sneakers that are 3 time the price of these and are not any better.  Strongly recommend!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfortable bright fun make you feel good shoes"
  },
  {
    "user": "Marvin Taylor",
    "rating": 5.0,
    "message": "All's well got lots of compliments"
  },
  {
    "user": "JAY RUFFIN",
    "rating": 5.0,
    "message": "AWESOME"
  },
  {
    "user": "Nasimullah",
    "rating": 5.0,
    "message": "I got it thanks"
  },
  {
    "user": "Michael A. Norris",
    "rating": 4.0,
    "message": "I like the color choices. The price seems fair. Comfortable shoe."
  },
  {
    "user": "Lynn Taylor",
    "rating": 5.0,
    "message": "I got these for my grandbaby and he loved them. The color is nice the shoe is comfy and hip. Grandma gets cool points for these"
  },
  {
    "user": "Garry Dorgan",
    "rating": 4.0,
    "message": "The Shoe is Good looking but they were to tight fitting"
  },
  {
    "user": "Ed",
    "rating": 5.0,
    "message": "Great price and fit."
  },
  {
    "user": "mynizzel",
    "rating": 5.0,
    "message": "Nice color"
  },
  {
    "user": "James Kim",
    "rating": 3.0,
    "message": "The size, design, and comfort factor are amazing. The issue is that I have been wearing these for less than a week, but the soles are already starting to actually fall apart. These shoes have only been actively used once on a gym treadmill, walking around an arcade, and walking outside the streets of New York for several hours. The point is, I had expectations that the soles would be more durable."
  },
  {
    "user": "Joe David  Castillo",
    "rating": 5.0,
    "message": "I really them. They look great 😊"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "These are a Christmas present. I order early. I have no idea abt the fit but These are very nice looking well made shoes. They’re for our 9 yr old grand."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Little heavy and not so comfortable , for that price I will use them to run to the store and back 👍"
  },
  {
    "user": "Angela Miller",
    "rating": 3.0,
    "message": "Bought for my husband, he loves them! Gotten so many compliments on them. He's been wearing them for 4 days and the soul is separating from the shoe. Not very durable if they fall apart within 4 days."
  },
  {
    "user": "Ricardo Searles",
    "rating": 3.0,
    "message": "Gets worn out quickly at the sole of the shoe! Also hurts when doing long walks"
  },
  {
    "user": "ulrich woelki",
    "rating": 3.0,
    "message": "The soles wear very rapidly,but very comfortable shoe"
  },
  {
    "user": "K. Mills",
    "rating": 4.0,
    "message": "Shoes wear great, second pair I bought. My husband is hard on shoes but these held up. Only thing I could find wrong was the color. They were supposed to be neon green but were neon yellow"
  },
  {
    "user": "Hardy",
    "rating": 3.0,
    "message": "Nice color"
  },
  {
    "user": "JXCKXL",
    "rating": 5.0,
    "message": "Awesome...."
  },
  {
    "user": "Steve",
    "rating": 5.0,
    "message": "These shoes are great! I have problems with plantar fasciitis. The pain in my feet has greatly reduced. I think I am going to get a second pair."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love the vibrant color. Arrived quickly."
  },
  {
    "user": "Pete",
    "rating": 5.0,
    "message": "Super comfortable I ended up buying 2 more pairs for my daughter and son in law"
  },
  {
    "user": "Rob",
    "rating": 5.0,
    "message": "The media could not be loaded. Okay y’all! You know these shoes caught your eye and that is why you are looking at them in the first place. They look cool as you know what. Despite what a small number of reviewers who described these as incredibly uncomfortable, maybe the manufacturer  changed some thing because these are some of the most comfortable shoes I’ve worn. They felt a little stiff when I put them on but over the course of an hour of wearing them, they completely relaxed and I didn’t want to take them off. They are extremely light, yet supportive. And have you seen the price? It’s unbeatable!  I highly recommend these to anyone! ……and did I mention they look cool as you know what?!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "N/A"
  },
  {
    "user": "Magil",
    "rating": 4.0,
    "message": "These shoes are light, comfortable and they really add spring to your step. Not sure about durability of course because they’re new. I wear a 10.5 US and the shoe comes a little bit larger than other 10.5 shoes I’ve purchased in recent years. The shoes were delivered in a bag which I thought was somewhat strange. The styrofoam toe inserts had completely disintegrated inside both shoes and it was quite a task to clean out those tiny clingy styrofoam chards. One of the shoes was delivered with dirt on the soul and side.  Clearly they’d been returned by a previous purchaser and weren’t cleaned before repackaging.  That was most annoying…..but at this price point I decided to keep the shoes and give them a thorough cleaning before wearing."
  },
  {
    "user": "William",
    "rating": 3.0,
    "message": "The look really good and are pretty comfortable  but the soles fell apart within a week the tread wore down as well. Granted  I do walk a lot for work but don’t drag my feet. Great look cheaply made but inexpensive so can’t expect to much."
  },
  {
    "user": "BJROB",
    "rating": 3.0,
    "message": "I love these the colors is my favorite there Vibrant where is very comfortable, I just don’t like the way you have to put them on that opening to slip your foot and it’s kind of hard getting the shoe on my only con on this shoe other than that it’s great"
  },
  {
    "user": "Tim lokay",
    "rating": 3.0,
    "message": "Red!!!!!"
  },
  {
    "user": "gary p. kendrick",
    "rating": 5.0,
    "message": "Quite Comfy...Good Material and Great Color Combos. My 2nd pair...1 Red (CHIEFS) And 1 Blue, My Favorite Color"
  },
  {
    "user": "Betty LeClaire",
    "rating": 4.0,
    "message": "They are a good shoe... However since recieving the shoes my son has only wore them to school and home and in that process the rubber on the bottom of the shoe is coming off."
  },
  {
    "user": "Maria Carter",
    "rating": 5.0,
    "message": "My step dad is very happy with the fit, comfort and quality of these shoes. I will definitely be buying other colors of this same show for him"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Fits true to size even for wider feet. Very light weight."
  },
  {
    "user": "ruthie",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Ria",
    "rating": 5.0,
    "message": "Purchased for my son-in-law for his birthday.  He loves them and wears them all day at work.  Very comfortable."
  },
  {
    "user": "Shamean Bibbs",
    "rating": 5.0,
    "message": "My son pass away and I put me and him on one side and him and his son on the other side"
  },
  {
    "user": "Keith Johnston",
    "rating": 5.0,
    "message": "I drive an auto transport and I use this shoe for comfort and safety because I walk a lot of car dealerships and auto auctions."
  },
  {
    "user": "Faith Inez Cain",
    "rating": 5.0,
    "message": "My husband loves this shoe. The color is perfect as is the fit. The design of the shoe makes his feet feel great especially in the heel"
  },
  {
    "user": "Michael Wilcox",
    "rating": 3.0,
    "message": "fit is very loose,can a sneaker be baggy!? what do you exspect for $42"
  },
  {
    "user": "G. Santos",
    "rating": 5.0,
    "message": "These shoes look great, love the color! They fit perfect and are very comfortable! Love it!"
  },
  {
    "user": "Denise Blaney",
    "rating": 3.0,
    "message": "If you’re a serious runner, and I’m not, I can’t imagine trying to run in these. Not real soft but they seem durable. Everything is a hard plastic which makes them heavy."
  },
  {
    "user": "Lawrence Jhons",
    "rating": 3.0,
    "message": "like"
  },
  {
    "user": "Jeffrey Connors",
    "rating": 4.0,
    "message": "I get tons of complements on these sneakers!! They look great and the fit is perfect. I work in a hospital and am always running around, these sneakers have not even begun to wear out yet. The laces work great and do not come undone easily as other cheap laces do. My only real gripe about these sneakers is the complete lack of comfort. They have zero cushion in them ands don't provide any arch support whatsoever. That said, a pair of Dr. Shoals inserts took care of most of that problem. What's the best here is the price. They are extremely affordable if you're like me and want to get multiple pairs in different colors to match scrubs!"
  },
  {
    "user": "Laverne",
    "rating": 5.0,
    "message": "Light weight and comfy. Good walking shoes."
  },
  {
    "user": "gema torres",
    "rating": 5.0,
    "message": "Súper bonitos , cómodos y tal cual la descripción , 10 de 10 ✨"
  },
  {
    "user": "justin k murillo",
    "rating": 2.0,
    "message": "Let’s start with the positives: I wasn’t barefoot. Now to the negatives: Shoe fit was the only reason I rated it 2. Shoe was flimsy with no support, way to hard for walking much less running. Caused foot pain in the sole and the pinky toe just walking the lawn. I know people ignore reviews when they see the price but save your money for one more week and get something better."
  },
  {
    "user": "Kateyez",
    "rating": 5.0,
    "message": "Great shoe. Took me 3 tries to get the right size. Not only ate the men's sizes but they still run a little big. Other than lat, I love them. Will be ordering more colors."
  },
  {
    "user": "Yuriy Bihusyak",
    "rating": 4.0,
    "message": "Great shoes for amazing price. The only negative is if you have kids and they like to step on you feet impossible to wash"
  },
  {
    "user": "angela",
    "rating": 5.0,
    "message": "My career (RN) requires me to be on my feet alot throughout the day so I tried this brand because of the talk about comfort. I can honestly say the reviews were right. One of the best comfortable footwear purchased I made in a long time. THANKS for a great product"
  },
  {
    "user": "Jorge Almiron",
    "rating": 5.0,
    "message": "Bueno"
  },
  {
    "user": "Rovina",
    "rating": 2.0,
    "message": "I love the color but these are the most uncomfortable shoes I've ever purchased."
  },
  {
    "user": "Daniel M Brown",
    "rating": 5.0,
    "message": "They feel very comfortable to walk in.."
  },
  {
    "user": "Cathy B.",
    "rating": 4.0,
    "message": "I like the bright colors of the shoes. They slip on. They are comfortable but I haven’t walked very far in them. They are a little short as my toe presses against the end of the shoe. I ordered the size I wear. I’m afraid if I order a larger pair they will be too big. Overall if you like funky and colorful shoes you’ll enjoy these."
  },
  {
    "user": "Rajiv batra",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Cornelius Williams",
    "rating": 5.0,
    "message": "Love these shoes.  I do a lot of walking at work so I needed light & comfortable.  These shoes are it !!!"
  },
  {
    "user": "RavenofaBat",
    "rating": 2.0,
    "message": "I just wanted stylish arch support (even as a flat foot, it was docs orders) that will eventually take me far as a jogger. Then I got them. Not only have they been comfy, easy to get on and off, but they’ve been absolutely GAWKED at. Everyone from walkers, runners, drivers, neighbors, grocery store clerks, guys with little to obviously more “street cred”, and of course… girls. These shoes could make Apollo sign up for Amazon Prime. Satisfied? I would be if the black sole didn’t come off while I was walking to the store. It was day 2. Barely 5 miles on them. Had to return them."
  },
  {
    "user": "Zeab70",
    "rating": 3.0,
    "message": "Now, I am not a runner but I do a lot of walking, especially with the kind of work that I do. After some time,  I started noticing some things about my feet. One was an old heel spur on my right foot had returned . Then the left sole started to hurt. I thought if inserted a pair of orthotics , it would help. Nope. Pain was worse than ever. Honestly, maybe because of my feet issues, the shoes weren’t a right fit for me so I don’t want to blame the shoes. Give them a chance and Try them. On a positive note: They are comfortable and stylish."
  },
  {
    "user": "Zanobia",
    "rating": 4.0,
    "message": "The color was perfect they wasn't as comfortable as the just so so's."
  },
  {
    "user": "Nightshade716",
    "rating": 5.0,
    "message": "My son loves them and they haven’t broke after three weeks of my 10 year old son wearing them"
  },
  {
    "user": "DW",
    "rating": 4.0,
    "message": "Narrow and long for US comparable sizing. Comfortable and I would say a more Neutral shoe but I use Good Feet arches. Glow in the dark green has several strangers making comments and asking where to get them!"
  },
  {
    "user": "Chris",
    "rating": 5.0,
    "message": "Shoes fit very well and the colors online are exactly as they look in person.  Very satisfied with this purchase.  Shoes are very comfortable."
  },
  {
    "user": "nathan kurisu",
    "rating": 3.0,
    "message": "VERY LIGHT WEIGHT.  WOULD LIKE A SOFTER FEEL ON THE BOTTOM.  I WILL PROBABLY PUT INSERT AND WILL BE FINE."
  },
  {
    "user": "Perceptowave",
    "rating": 5.0,
    "message": "Comfortable and would buy again. Very vibrant purple!!"
  },
  {
    "user": "josi",
    "rating": 5.0,
    "message": "The shoes feel great! The insoles are very comfortable and the shoes allow your feet to breathe. The shoes were slightly heavier than expected though. I’d recommend buying them for sure."
  },
  {
    "user": "Scott Phillips",
    "rating": 4.0,
    "message": "I think these are great shoes they are a little too stiff and a little off on being true to size but overall enjoy them"
  },
  {
    "user": "montrez",
    "rating": 5.0,
    "message": "Enjoy them"
  },
  {
    "user": "Yolanda D. Diva",
    "rating": 5.0,
    "message": "I have wide feet, so when purchasing a pair of sneakers, I go for the men's shoes.  These are SO COMFORTABLE, breathable, and supportive.  I barely notice them on my feet.  Upon putting these on, I just KNEW they would be tight.  Nope!  I was pleasantly surprised, while speed walking to my bus stop.  Barely noticed them on my feet.  Time will tell, how long they last but for $30, it's worth purchasing!"
  },
  {
    "user": "C",
    "rating": 2.0,
    "message": "I like the shoes but the stitching is coming apart."
  },
  {
    "user": "Joshua",
    "rating": 3.0,
    "message": "I got these because I was looking for something inexpensive for the gym. They were ok. They seemed heavy to me and were narrow. Not very comfortable but not awful. Not bad for the price."
  },
  {
    "user": "Trey",
    "rating": 3.0,
    "message": "These are great, but if you have wide feet...look somewhere else. I'm a 10W or 10.5 so I ordered an 11 cause others said it was narrow. These fit the width, but they of course are longer. I wear them to teach in and they are comfortable. If you have wide feet order a size up and don't try and use them to workout in, but are worth a buy for the price."
  },
  {
    "user": "Tiffany",
    "rating": 5.0,
    "message": "I bought these shoe's for my 13 year old son to try out. He has very wide feet. If you have wide feet then you know how hard it is to find a pair of comfortable shoes let alone a pair that look \"Cool\". These shoes did not disappoint. I bought him a pair of these and his Dad bought a pair of Adidas. He has only been wearing these ones. Always says how comfortable they are. Win win! I definitely recommend getting a pair!"
  },
  {
    "user": "Gregory A Baker",
    "rating": 4.0,
    "message": "Gets dirty easily"
  },
  {
    "user": "Deborah White",
    "rating": 5.0,
    "message": "I liked the colors of the shoes and the prices."
  },
  {
    "user": "AmazonGuru",
    "rating": 3.0,
    "message": "If you desire a cement bottom shoe than these are for you. Looking at the picture you would think that the sole is a rubber soft bouncy material..... Nope!! It's a hard plastic type of material that offers little comfort. I think my concrete patio has more comfort. If you're used to wearing Sketchers or Nike than these are NOT for you. If you're upgrading from bare feet then maybe. The look is great, the construction is good, the fit is exact but the comfort.....hell to the no in the 5th degree. I would give a negative star for comfort if I could."
  },
  {
    "user": "Maria Vallejo",
    "rating": 3.0,
    "message": "They are great if you want a slip on slipper"
  },
  {
    "user": "📝⭐️⭐️⭐️⭐️⭐️",
    "rating": 5.0,
    "message": "True to size. I thought I should go a half size bigger, based on reviews, but had to return and reorder exact size.  Very cute and comfortable, have to wait a week for my reorder. Definitely recommended, so far. Will update when I receive the actual size needed. Fast refund!! Slow and delayed shipping even though I have Prime. Shipping has drastically slowed on many items. UPDATE: I received the correct size, they fit, feel and look great! Highly recommended, will buy more (FYI, no incentives for this review)"
  },
  {
    "user": "JG",
    "rating": 5.0,
    "message": "It was good soft inside but I return mine due to the size so big …"
  },
  {
    "user": "C. Roseborough",
    "rating": 4.0,
    "message": "I love then once I was able to get them on. There is no give because of the attachable tounge. I had to wait until my foot went down (it was swollen) to wear them."
  },
  {
    "user": "Dorian Turpin",
    "rating": 5.0,
    "message": "Product use my suggestion if you are on your feet all day for your 9 to 5 job get yourself a few pairs and start enjoying your time at work"
  },
  {
    "user": "TM",
    "rating": 5.0,
    "message": "Way more comfortable than I would ever expect for the price. I've never paid more for a shoe than 100 or so for nike but these absolutely feel great. Tougher heel than I'm used to but I got used to it quickly. I'm buying 2 more pairs after writing this. They've solved my running shoe variety for years"
  },
  {
    "user": "Jaye 417",
    "rating": 5.0,
    "message": "Long work days is hard on my back, these shoes are the answer! Comfy, breathable and amazing back support. Totally recommend these! Plus they are very stylish"
  },
  {
    "user": "J Solberg",
    "rating": 4.0,
    "message": "For the price they seem good"
  },
  {
    "user": "sandi",
    "rating": 4.0,
    "message": "It is very cushiony and comfortable, after you get used to the fit..... Like I mentioned...they are a little bit small...So I just ordered 2 more but a 1/2 size bigger and they fit great!!!!! I Love the look but most of all the feel!!! My feet don't hurt!!!!"
  },
  {
    "user": "todd estes",
    "rating": 5.0,
    "message": "I am a very picky sneaker shopper. And this product has an excellent price. It’s a quality product very nicely built. Extremely happy will be buying more no doubt."
  },
  {
    "user": "BigT",
    "rating": 5.0,
    "message": "These fit great!!  Look sweet too"
  },
  {
    "user": "Luvinwazy",
    "rating": 5.0,
    "message": "My grandson loves jumping. These tennis shoes are great for him. He likes them."
  },
  {
    "user": "Henry97",
    "rating": 2.0,
    "message": "These shoes are pretty good for running probably but I used them to play basketball and volleyball and badminton and the bottom part of the sole is starting to come off after using them twice causing me to trip all over the map lol. Probably good shoes but not for the gym."
  },
  {
    "user": "ricardo",
    "rating": 5.0,
    "message": "I tried these on right away because I ordered a 6 in men's. I wear a 7 1/2 in women's but couldn't find them in a women's size. They fit. just a tad wider than the women's, but I expected that, and I will just wear my thicker socks with them. I ordered the dark green with yellow. They looks just like the picture. Great shoe for the price."
  },
  {
    "user": "Angela Walters",
    "rating": 2.0,
    "message": "These shoes were for my 12 year old son. They are very heavy shoes. He doesn’t wear them very much because of this. Otherwise ok."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Not the best fitting shoes I own. The length fits but the width is a bit wide and I have wide feet. Not the best purchase."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is a great workout shoe for the average gym goer !"
  },
  {
    "user": "Bonita Rideaux",
    "rating": 3.0,
    "message": "To Big need size women size 10"
  },
  {
    "user": "victoria michaele spears",
    "rating": 5.0,
    "message": "This shoe fits perfect! I’m a female size 9 and I bought a size 7 in mens and very true to size! If you are wide foot get mens shoes womens are narrow they are very comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Purchased for my husband. Very picky about his tennis shoes. We ordered a 9.5, arrived very quickly, sooner than stated on amazon. Hubby put on, great fit, wide enough in the toe box to give him a fantastic fit and they have good arch support. I'm happy the the fit was perfect for him. He decided after about 2 weeks of wearing the shoes that he wanted another pair in a different color."
  }
]