[
  {
    "user": "M.M.",
    "rating": 5.0,
    "message": "These are classic sneakers and they run pretty true to size. I wear a size 8 and these were a little roomy in the toe box, for my slightly narrow foot. So if you have wider feet these would probably work. They aren't super cushioned so I filled the extra space with a gel cushion to improve them. I like them very much now. They look to be well made and I expect they will last through the winter and am so happy to have found a winter sneaker at an affordable price, which is half the price of most I've seen."
  },
  {
    "user": "Shoeaholic",
    "rating": 5.0,
    "message": "I bought these Keds sneakers and risked wearing them brand new to do A LOT of walking.  I walked around  Edinburgh in Scotland for two days (cobblestone streets and all) days without so much as a hint of a blister or discomfort.  The first day, we walked for about 5 miles.  I would totally recommend these as being very comfortabl for walking.  I boght the black suede and waterproofed them before this trip.  I wish I could get them in grey sued too."
  },
  {
    "user": "Truds",
    "rating": 5.0,
    "message": "Comfy sneaks! I wish the laces were a little longer but that's easily fixed. These are my first keds since I was a kid. Definitely will get more. The only thing is they might be too narrow for people with wider feet."
  },
  {
    "user": "Erin OConnell",
    "rating": 5.0,
    "message": "I ordered my usual size and they fit is perfect.  They are very comfortable, look great, and the price is extremely reasonable.  I am very pleased with this purchase.  They were shipped fast and arrived sooner than expected.  I am going to order another pair before they are gone!"
  },
  {
    "user": "Laura E.",
    "rating": 5.0,
    "message": "I love these shoes and would own every color and material if I could afford them they look so cute without socks."
  },
  {
    "user": "Melissa",
    "rating": 3.0,
    "message": "You know that episode of Friends where Monica buys a cute pair of boots and tells Chandler they’ll go with everything and she’ll wear them all the time, but when she actually does wear them, they hurt her feet so badly that Chandler has to piggyback her home? Yeah, these Keds are to me what those boots were to Monica. They’re so cute and they go with everything, but dear lord are they painful! I’ve had them for a month and have worn them every 2-3 days, thinking I’d eventually break them in or develop the callouses to make them tolerable. Oh how wrong I have been. I didn’t realize it was possible for blisters to develop on top of each other, but my pinky toes show that it indeed is. My heels have open wounds that hurt when I put on socks. I have tried toe covers for blister prevention. I have put inserts along the backs of the shoes that’s supposed to keep my heels from rubbing up against the shoe. I have tried thick socks. I have tried baby powder. Literally every tool one can use to protect their feet, I have tried. Thank god for blister seal bandaids! I live in a city where people walk everywhere, and I have - on more than 1 occasion - had to take a taxi home b/c I couldn’t walk any further in the shoes. I wasn’t going to write a review, but this morning I was wearing the Keds while walking my dog to doggy daycare and suddenly felt a tremendous pain on my foot and noticed that a surprise blister (aka blisters I didn’t know I had formed) on my heel had started bleeding. It’s really difficult to get a cab when you have a dog, and Uber Pet rides are ridiculously expensive. So in order to make it the rest of the way to his doggy daycare, I had to hobble my way to the closest CVS and buy more bandaids. (Side note: shout out to the workers at CVS who let me bring my dog inside). It was while I was in the checkout line with my bloody, throbbing foot that I realized I should probably warn other people about this. Now like I said, these Keds are super cute and go with any outfit. Are they also excruciatingly painful? Yes. Have they ripped my feet apart? Also yes. But am I going to keep wearing them when my outfit calls for them? Yes. But only when walking short distances or am with someone who I can get a piggyback me everywhere, and I’ll make sure to bring a backup pair of flip flops and a stash of bandaids."
  },
  {
    "user": "Daclerk",
    "rating": 5.0,
    "message": "I love that they are so comfortable. Makes shopping a pleasant experience."
  },
  {
    "user": "Roger W Ellsworth",
    "rating": 5.0,
    "message": "This is my second pair and they never disappoint. Fast delivery"
  },
  {
    "user": "Violet Johnson",
    "rating": 4.0,
    "message": "I really like this shoe"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They fit well, look nice.  I like them."
  },
  {
    "user": "Ashlee Webb",
    "rating": 5.0,
    "message": "These are so cute and comfy! I’m a teacher and they are perfect to wear with dresses, khakis, and jeans! Great addition to any outfit."
  },
  {
    "user": "Paula H",
    "rating": 5.0,
    "message": "This shoe was a great replacement for the same brand that I had worn holes in the soles. Similar in color and style made this a perfect purchase."
  },
  {
    "user": "Michelle Howe",
    "rating": 5.0,
    "message": "Mom loved them!"
  },
  {
    "user": "Valerie Floyd",
    "rating": 4.0,
    "message": "Alittle to wide at the ankle but fit ok"
  },
  {
    "user": "Gerry",
    "rating": 5.0,
    "message": "The shoes were a birthday gift for my mother who is now 98. She was very happy with our purchase."
  },
  {
    "user": "Ann Nonymous",
    "rating": 4.0,
    "message": "I'd say these are overall good shoes. They have decent padding, at least for this style shoe. Of course they are no New Balances but they have more padding than like a plain Converse canvas shoe. I usually get blisters on my heels in new shoes but haven't had any issues with these which is great. They do run slightly large as other reviewers are saying but not much. I'm usually a 9 or 9.5. Got a 9 in these and they fit on the roomier side. I'm deducting a point because the laces are barely long enough to tie them and the shoes also make a bit of a plopping sound with every step. Maybe it's because they're a little large but it hasn't gone away after a few weeks of wearing them."
  },
  {
    "user": "Hereinmyhead",
    "rating": 5.0,
    "message": "I love everything about these shoes. The fit is perfect, they're comfortable, and the color is fantastic. This shade of plum/purple is also surprisingly versatile - not quite neutral, but darn close. I wear them with way more things than I expected. Leave it to Keds. That's why I've owned at least 1-2 pairs since I was 5."
  },
  {
    "user": "B.S.",
    "rating": 5.0,
    "message": "These are very comfortable! I would add an insole to help with my diabetic neuropathy."
  },
  {
    "user": "Betty L. Maddox",
    "rating": 5.0,
    "message": "Like the style and fit."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I loved the color, but the fabric was a bit too stiff for me. It felt smaller than my canvas ones, but that may have just been the difference in material. I returned it."
  },
  {
    "user": "McKennah Matson",
    "rating": 5.0,
    "message": "I'm super hard on shoes and these have been durable and comfortable for everyday use as a preschool teacher who's always on her feet."
  },
  {
    "user": "Pam V",
    "rating": 5.0,
    "message": "These are the most comfortable sneakers and long lasting. This is my 2nd pair in a different color and ordered a 3rd pair in black. Take a chance and give them a try. I wear an 8.5,these were snug but stretched out to a perfect fit."
  },
  {
    "user": "PAM",
    "rating": 4.0,
    "message": "I love the style and love the fit. I have narrow feet and Keds always work for me. These keds are slightly less comfortable that othe models that I have, but I would buy them again."
  },
  {
    "user": "Lu in CT.",
    "rating": 5.0,
    "message": "adjust laces for perfect fit according to your foot needs"
  },
  {
    "user": "Mcb",
    "rating": 5.0,
    "message": "I had a pair of the tan striped ones and loved them.  Problem was my dog ate the insoles out of them.  I had to get another pair. This time I purchased the blue stripe ones.  Immediately put them on when I got them and they fit perfect.  These shoes are so comfy and look more stylish than wearing regular running shoes.  I wear these for 3 seasons — spring, summer and fall.  I have narrow to medium width feet and they are perfect for me.  Buy them, you won’t regret it."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fit as expected.  Very comfortable for light walking shoes.  They look good with shorts also."
  },
  {
    "user": "Militza G.",
    "rating": 5.0,
    "message": "I have been wearing these shoes for a bit now and they are super comfortable; literally the first pair of shoes that I own that have a comfy insert. These are not only stylish but they fit true to size, I ordered an 8 and they couldn't have fit better. So far the suede has been nice and easy to clean. Definitely recommend these!"
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "Good fit, good quality"
  },
  {
    "user": "Susan F",
    "rating": 5.0,
    "message": "Wore them on vacation and was able to walk alot without them killing my feet. I love the style."
  },
  {
    "user": "Sarah M",
    "rating": 5.0,
    "message": "Look exactly as pictured, and are super comfy"
  },
  {
    "user": "Susan Brooks",
    "rating": 5.0,
    "message": "Looked like the picture.  Getting through Amazon I didn't have to pay for shipping.  Love Amazon"
  },
  {
    "user": "nmilliec",
    "rating": 3.0,
    "message": "Cutest shoe! Fit perfectly. Large knot of some sort at the seam near the toes where the tongue is sewn in made impossible to wear. Wanted to try an exchange because I purchased on a deal, and they were sold out. 😭"
  },
  {
    "user": "abigail flynn",
    "rating": 5.0,
    "message": "I am always wary about buying shoes online. It's a little difficult. I have wide feet, I usually wear a size 7 but look for shoes that have a wide toe part. I ordered a 7.5 size, because I know I have wide feet, and they fit perfectly. So if you have wide just go up a .5 and they will fit!"
  },
  {
    "user": "Paige",
    "rating": 5.0,
    "message": "I'm a nurse and wanted some 'different' work shoes, which can be dangerous to your poor feet. Luckily these turned out amazing! All I would change is to add a tiny bit more color to them, so I'm ordering some bright pink laces. Anyway, buy them!"
  },
  {
    "user": "Cheryl Gonsalves",
    "rating": 5.0,
    "message": "What i liked best was the numerous compliments on my Keds comfort and stylelish Look and solid quality👍 Go Keds❣️"
  },
  {
    "user": "JoyJoyJoy",
    "rating": 5.0,
    "message": "I hadn't bought a pair of Keds in years (they were my primary shoe during college - I think I had every color they made) because my wide post-pregnancy feet no longer fit comfortably. I love the way these feel. If you like longer shoelaces, plan to buy a pair to use because the laces that come with them are, IMO, too short."
  },
  {
    "user": "amy short",
    "rating": 4.0,
    "message": "Runs small.  Color is not true burgundy.  More a brown red"
  },
  {
    "user": "Brenda B",
    "rating": 5.0,
    "message": "I really like these shoes. They are very well made and very comfortable. A must buy!"
  },
  {
    "user": "karen zimmerman",
    "rating": 5.0,
    "message": "Very comfortable and well made! Wore this all day right out of the box and they stayed comfortable. Size 9.5 fit perfectly and I’m usually a 9.5-10 depending on brand. Would recommend buying your usual size"
  },
  {
    "user": "Stacey goff",
    "rating": 3.0,
    "message": "Not the best but cute"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The padded sole is super comfortable, I bought a half size up only because it looked a little tight, but it fits me well. That half size was not necessary, but I can wear them with thick socks too, it will be perfect."
  },
  {
    "user": "Scott Martin",
    "rating": 4.0,
    "message": "Really happy with purchase. Super cute, very comfortable but they do absolutely run large. If you want an accurate fit, size down. I don’t mind a little room so it’s fine. Will be buying another pair for sure."
  },
  {
    "user": "C Berry",
    "rating": 5.0,
    "message": "I love the shade of red! Not too bright and very elegant!"
  },
  {
    "user": "Carrie Emmons",
    "rating": 5.0,
    "message": "These shoes go with everything! They’re super comfy and don’t rub the ankles."
  },
  {
    "user": "Gabrielle Wise",
    "rating": 5.0,
    "message": "I absolutely love these shoes! The only disadvantage is the back of the shoe being stiff but you can expect that on any Keds."
  },
  {
    "user": "Margaret Austin",
    "rating": 3.0,
    "message": "They are not very comfortable"
  },
  {
    "user": "Robin",
    "rating": 5.0,
    "message": "Very comfortable shoe, fit is a little narrow over the arch of the foot."
  },
  {
    "user": "Tory B.",
    "rating": 5.0,
    "message": "My new fave! Rose, blue, black, and kaki. 'nough said. Looking for another color."
  },
  {
    "user": "Janet Cembalski",
    "rating": 2.0,
    "message": "sneakers fit ok but very uncomfortable and no support I was hoping for.  I'd like to return these.  There was no paper work received in the package and I really forgot where they were coming from."
  },
  {
    "user": "gracie_gust",
    "rating": 3.0,
    "message": "I love Keds this is my 2nd pair, though I only had these for 3 months and the rubber sole already came Detached."
  },
  {
    "user": "Sarah Schrader",
    "rating": 5.0,
    "message": "Love these shoes! They look so nice and they are very comfy."
  },
  {
    "user": "Alyssa",
    "rating": 5.0,
    "message": "Fit perfect and have just the right amount of support.  I used suede protector on them to keep them nice."
  },
  {
    "user": "Heather Wagner",
    "rating": 5.0,
    "message": "Love the color and style"
  },
  {
    "user": "I’m not a Karen",
    "rating": 5.0,
    "message": "Very thick canvas with a sturdy foot bed and perfect width!"
  },
  {
    "user": "William Rowe",
    "rating": 3.0,
    "message": "I've worn keds before and they've never been too narrow, but these are. Length and heel are good, but across the widest part of my foot it's uncomfortable narrow."
  },
  {
    "user": "Mikayla H",
    "rating": 5.0,
    "message": "Cute and comfy! Goes with every outfit"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "I bought these because I thought Keds would be a quality shoe but after 2 months, and wearing them 5 times, they are falling apart. I do not recommend wasting money on these. In fact, I will never buy another pair of keds"
  },
  {
    "user": "Hannah Marsh",
    "rating": 5.0,
    "message": "LOVE LOVE LOVE 🖤🖤🖤"
  },
  {
    "user": "mercedes",
    "rating": 5.0,
    "message": "Great and comfortable...fit as expected"
  },
  {
    "user": "liv",
    "rating": 5.0,
    "message": "Got exactly what I expected"
  },
  {
    "user": "Dannett Canady",
    "rating": 5.0,
    "message": "This product 👌 was a gift for myself"
  },
  {
    "user": "Joe T. Hazel",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Red",
    "rating": 5.0,
    "message": "I ordered two new pair of Keds. They are so comfortable and stylish. I love the colors. Extremely pleased!"
  },
  {
    "user": "C Beta",
    "rating": 5.0,
    "message": "$ and look"
  },
  {
    "user": "Liana",
    "rating": 5.0,
    "message": "Son muy comodos y lucen bien"
  },
  {
    "user": "Julia A. Williamson",
    "rating": 2.0,
    "message": "I couldn't take the constant clomping sound coming from the shoes.  I tried an insert but that didn't help."
  },
  {
    "user": "Lisa Stottlemyer",
    "rating": 3.0,
    "message": "I purchased two pairs in different sizes because I wasn’t sure how they’d fit. Sometimes I wear a 9 sometimes a 10. I returned the 9W but kept the 10."
  },
  {
    "user": "Katharine H yant",
    "rating": 3.0,
    "message": "Liked the color. Dislike the fit. Hurts my heel."
  },
  {
    "user": "Ecoee Rooney",
    "rating": 5.0,
    "message": "Folks are giving me lots of compliments when I wear these.  I love them.  No arch support but I’ll buy an insert.  Comfy otherwise!  Loooove."
  },
  {
    "user": "It's not me, it's you",
    "rating": 5.0,
    "message": "I bout a shoe from Keds directly simular to this one. No comfy and unreliable shipping from the site. I was able to return and decided to buy this style instead. Very good choice. And reliable as always with Amazon delivery. Buy from Amazon. Not the company website."
  },
  {
    "user": "Angela G. Marino",
    "rating": 5.0,
    "message": "I love my new shoes!"
  },
  {
    "user": "Lisa Sidlow",
    "rating": 5.0,
    "message": "I love them!"
  },
  {
    "user": "CM",
    "rating": 5.0,
    "message": "These were true to size, comfortable and soft. Friends commented on how great they look."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "They are nice looking but the way the rubber is formed around the toe area makes them a tripping hazard.  I have  and have had many rubber soled shoes that do not do that .  Am returning..."
  },
  {
    "user": "Julie",
    "rating": 5.0,
    "message": "Great shoes! Fit great!"
  },
  {
    "user": "SmithParents",
    "rating": 5.0,
    "message": "I ordered the white leather and they are really stylish! I love them and so far they are very comfortable. Fits true to size"
  },
  {
    "user": "Jan M.",
    "rating": 2.0,
    "message": "Nice color. But shoe is bulky looking - see above."
  },
  {
    "user": "Kindle Customer",
    "rating": 2.0,
    "message": "Daily wear. Does not fit"
  },
  {
    "user": "Starr Hardee",
    "rating": 2.0,
    "message": "These shoes are stiff and wider than normal."
  },
  {
    "user": "Steph",
    "rating": 1.0,
    "message": "Shoes are comfy and cute, but the canvas tongue clicks/crinkles when your foot bends at your toes when you walk and is so annoying I cannot wear them anymore.  Save yourself some $ and try another shoe."
  },
  {
    "user": "Katie C.",
    "rating": 1.0,
    "message": "maybe they're only for indoor use, after a few walks outdoors, (in good weather), they fell apart."
  },
  {
    "user": "lunchboxangel",
    "rating": 3.0,
    "message": "These shoes are so cute but there is something about the design that the back of the heel rubs very painfully on my Achilles tendon. I bought these a year ago and just haven’t been able to break them in. Waste of money."
  },
  {
    "user": "BeHappy",
    "rating": 5.0,
    "message": "These are awesome shoes. They are literally the best."
  },
  {
    "user": "Bio",
    "rating": 2.0,
    "message": "Cute and comfortable but not durable. Worn handful of times and the sides of the shoe are coming apart after three months."
  },
  {
    "user": "Cathy",
    "rating": 5.0,
    "message": "These sneakers look great with just about any summer outfit. A great addition to anyones closet."
  },
  {
    "user": "Sandra mejia",
    "rating": 5.0,
    "message": "Uso personal"
  },
  {
    "user": "Wendy M.",
    "rating": 3.0,
    "message": "I like the shoes - but I ordered gray and these are definitely brown."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect for a fresh, light look in the summer. They are an upgrade from the plain Keds my children wore. Although they are comfortable, I wear them with arch support inserts. So cute!"
  },
  {
    "user": "Sadie",
    "rating": 5.0,
    "message": "This is a different color than all of my other Keds summer shoes.  I cant wait to get into them this summer...Keds...all the way for me always....Fit Great always."
  },
  {
    "user": "KittyChick",
    "rating": 5.0,
    "message": "I’ve been wanting a pair of (light) brown shoes for awhile, and I found the perfect pair.  These Keds shoes fit very well, are very comfortable, and the color is exactly what I was looking for!"
  },
  {
    "user": "Lori Rourke",
    "rating": 5.0,
    "message": "This my second pair of Keds. I bought the canvas one too and love them both!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is my second pair of this style keds . I find them very comfortable."
  },
  {
    "user": "B. Nelson",
    "rating": 5.0,
    "message": "I love these shoes! I wear them to work in my casual office and will probably wear them everywhere. Love the cream color and fit very true to size, I have other Keds I wear a 6.5 in these fit at the same size."
  },
  {
    "user": null,
    "rating": null,
    "message": "Comfy and cute"
  },
  {
    "user": null,
    "rating": null,
    "message": "First time buying Keds and I am very happy. Fit perfect and are very comfy. Will be buying more in the future"
  },
  {
    "user": null,
    "rating": null,
    "message": "Comfort, qualité-prix !"
  },
  {
    "user": null,
    "rating": null,
    "message": "J aime la couleur choisi et va bien avec mes vêtements 😊"
  },
  {
    "user": null,
    "rating": null,
    "message": "Great looking sneaker. The soft burgundy suede is really beautiful."
  },
  {
    "user": null,
    "rating": null,
    "message": "Wish I could return. They are brand new and I can't wear them. Only one day past return window date."
  },
  {
    "user": null,
    "rating": null,
    "message": "I like the grey colour, the fit is comfortable, good for walking and versatile with different outfits."
  }
]