[
  {
    "user": "Lacey Hobson",
    "rating": 5.0,
    "message": "Prior to ordering, I read reviews and many of them stated that these shoes run big.  A few did say they run to small.  I wear a size 12 in womens and hoped the size 11 would be big enough since it is the biggest they come in.  I would say that they do run about a half-size large because I was able to put my foot in them.  Unfortunately my toes were right up against the end of the shoe and so there is no way I would be able to walk in them.  While I had them on, they did feel a bit narrow around the ball of the foot.  I had on a very thin pair of no-show socks with them so if I had thicker socks they would have been even tighter on both length and width.  Otherwise, these shoes look great, very nice red color, the white was white.  Definitely could pass for a Converse! Those are the breaks for me, I have no choice but to send them back."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I ordered this not expecting anything great because it was for just one time wear but was I surprised. This shoes fits better than Converse which I have couple of pairs. Even though I have a narrow feet, my pinky toe hurts when I wear Converse but this shoes feels much better and it doesn't bother my toe. And the color looks great. Looks like Converse without an brand name tag. Love it."
  },
  {
    "user": "Kay Jay",
    "rating": 5.0,
    "message": "I’ve heard many say that Converse are uncomfortable. These dupes are very comfortable! I purchased them in 2 colors. I normally order 1 size up in sneakers, and that’s what I did for these as well. One of the reviewers posted side by side pics of the Converse and the dupes and they’re very similar.  I strongly recommend these shoes!"
  },
  {
    "user": "Anne Maree Connick",
    "rating": 5.0,
    "message": "I absolutely love these shoes.  From the colors and styles to the low prices,  they are amazing.  I have a black pair,  a navy blue pair, a red pair,  a gray pair, a metallic tiger striped pair and a wish to get many more colors in the near future.  My only suggestion would be to make these shoes available in half sizes as well.  That would be even more awesome."
  },
  {
    "user": "Purple chick",
    "rating": 4.0,
    "message": "They are cute & comfy, however the run big. I usually fit a 8 1/2, I ordered these in a 8 they were too big. I returned for a size 7 now they fit perfect"
  },
  {
    "user": "Braeden Wessinger",
    "rating": 5.0,
    "message": "When we moved I lost one black Converse and did not want to spend another $60 on solid black Converse.  I found these and took the chance.  I am so glad I did!  I love these shoes!  They look exactly like my Converse for 1/3 of the price!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have bought every color, they are very comfortable, and fit perfect. I just would like to know the best way to wash them since there are no instructions on how to do it."
  },
  {
    "user": "R J",
    "rating": 5.0,
    "message": "I have these in about 15 colors. They are so perfect!  They are very comfy and look good with jeans, leggings or even a sun dress! I throw them in the washer once a month and air dry them and they come out like new. I am normally a 7 1/2 but I’m these I take a 7 and they fit absolutely perfectly."
  },
  {
    "user": "Dawn in Maryland",
    "rating": 4.0,
    "message": "I wear a 9 to 9 1/2 wide shoe so I was concerned about which size to order.  Went with the 9 and they fit perfectly.  I have wide feet with a bunion and they didn't pinch at all.  Plenty of room in the toe area.  Only minor complaint is there is minimal padding on the bottom (like Converse shoes) so these are not going to be my go to shoes for a day of walking.  But I've gotten several compliments on them and I LOVE the color!"
  },
  {
    "user": "Theresa (Rotolo) Howard",
    "rating": 5.0,
    "message": "These shoes are exactly what I have been looking for. They are true to size (US sizes Anyway) and very good quality -especially for the price point! Love them already."
  },
  {
    "user": "Norkis Perez",
    "rating": 5.0,
    "message": "ESPECTACULARES, HABÍA COMPRADO LOS COLOR ROSA, Y ESTOS... TAL COMO LOS SOLICITÉ FABULOSOS... AHORA VERÉ K OTRO COLOR🙏🏻🙏🏻🙏🏻💜 MIS FAVORITOS! GRACIAS X SER HONESTOS EN CUANTO A TODO! BENDICIONES!"
  },
  {
    "user": "Heather Quinn",
    "rating": 5.0,
    "message": "Looks exactly as pictured!  Beautiful color and very sturdy, good quality shoe!"
  },
  {
    "user": "antoinette moore",
    "rating": 4.0,
    "message": "These are cute and can be worn with many outfits !The support is fair, stretch, good, however , be mindful when ordering as they run a bit large."
  },
  {
    "user": "daisyj1",
    "rating": 5.0,
    "message": "They arrived quickly and my students thought they were AWESOME!  Be bold!  Wear tie dye shoes to school! These shoes were very comfortable; I wore them all day with no discomfort, even though I was \"breaking them in.\"  Several people asked me where they could buy them!"
  },
  {
    "user": "Alissa R Lillebo",
    "rating": 5.0,
    "message": "I volunteer in these shoes and my feet never get tired or sore after so they’re really good support. I get lots of compliments on them too! I wear a 8.5 and ordered a 9. I could have gotten by with a 8 but I have wide feet so they still work."
  },
  {
    "user": "Sophie Sadie",
    "rating": 4.0,
    "message": "I like to wear these to my grandkidlets' games. Their school colors are orange and blue, so I switched out the shoe laces from white to blue. The kids really like them too. These are comfortable enough for short walks but don't have enough support for extended distances."
  },
  {
    "user": "cherylle mcauley",
    "rating": 4.0,
    "message": "They’re very cute and comfy but I really wish they made half sizes. I read the reviews and normally wear a size 8.5, the reviews suggested going up to the next size rather than sizing down and they are a bit too big. They are stylish though, I will just keep them rather than returning but probably won’t wear them on trips involving a lot of walking since my feet slide a little in them. These are a size 9"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The shoes are so comfortable to walk in and it’s just like the Converse shoes but better and a better deal"
  },
  {
    "user": "Keledina",
    "rating": 4.0,
    "message": "I have waited for these shoes to restock in my size.  I love them. Very comfortable with plenty of toe room. I gave it 4 stars only because the rivets caused black marks on the shoe laces after only wearing them once"
  },
  {
    "user": "Jeanette",
    "rating": 5.0,
    "message": "I would recommend anyone the shoes they feel exactly the same way as the converses and look the same 🫶"
  },
  {
    "user": "Happy Knitter",
    "rating": 4.0,
    "message": "These fit like sneakers...not much support but they look great!"
  },
  {
    "user": "Karen Ramseur",
    "rating": 4.0,
    "message": "The size is obviously  wrong.  Ordered  my size as I was encouraged  to do. Too small! Very cute shoe."
  },
  {
    "user": "Nichole Porras",
    "rating": 5.0,
    "message": "I’m a converse addict! But I couldn’t find a brown color in kids size 3 (what I wear).. so I took the chance and ordered a size 5 in these and they fit okay! Although they are not a coffee color as advertised.. they are taupe, which is still pretty and I like them, but just not what is advertised! Also the toebox is more roomy than converse! I high recommend these shoes.. great price and cute too!"
  },
  {
    "user": "Claudia Zeidler",
    "rating": 5.0,
    "message": "Bright red, great quality"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Looking for an alternative shoe for a Halloween costume. I wanted something I could wear again. Thanks"
  },
  {
    "user": "Sybel Harrelson",
    "rating": 4.0,
    "message": "Bought for my daughter that wears a 9. Shoes are large must wear at 1 pair or really thick socks maybe 2. She says they ok but I am not so ok about it."
  },
  {
    "user": "L. Pierce",
    "rating": 4.0,
    "message": "I have received many compliments on them. Most reviewers seemed to say to order up a size, so I did. I'm a 7-7 1/2 so I ordered an 8. They are a bit too big. I wish there were 1/2 sizes."
  },
  {
    "user": "michelle",
    "rating": 5.0,
    "message": "They look as pictured in ad, fit perfectly as labeled, and look great!!!"
  },
  {
    "user": "Paul",
    "rating": 5.0,
    "message": "Summer  comfort in the Caribbean."
  },
  {
    "user": "from Wyoming",
    "rating": 5.0,
    "message": "Purchased a 7. Left one was too small. So I ordered an 8. Fits like a 10.  So disappointed. Thank goodness for free returns."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Cute shoes"
  },
  {
    "user": "NM102478",
    "rating": 5.0,
    "message": "Unboxing ... it is an 8 in women's but I was afraid it came in 8 men's...looked larger but it was an 8 woman. I'm an 8.5 and ordered down to an 8 and could have even gotten a 7.5 but they don't offer that. U may have been too small. I can say they are super cute and wearing for the little time I did they were very comfy. Will update once I wear them to a ball game as intended with the purchase. Update # 1 -- 8/10/22: wore them for about 4 hours and standing on feet most of these hours. They were comfortable and NOT like Converse where they hurt by the sides of big and little toes. Still happy with purchase. . . . One more Update coming after 8/13/22"
  },
  {
    "user": "Mary",
    "rating": 5.0,
    "message": "Haven't worn them yet but I Ike them match with what I was gonna wear it with"
  },
  {
    "user": "Sally Dehnert",
    "rating": 5.0,
    "message": "I like Everything They fit well.  I have had many compliments."
  },
  {
    "user": "Jill B.",
    "rating": 5.0,
    "message": "Perfect color!! For Cleveland Browns season! 🏈🙌🏻 👀😝"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these shoes because they are pink, but I found them to be not only cute but extremely comfortable. So pleased with my purchase!"
  },
  {
    "user": "RBD",
    "rating": 4.0,
    "message": "I wear. 7.5 so I got an 8 My feet swam in them"
  },
  {
    "user": "JG",
    "rating": 5.0,
    "message": "I have wide feet and have a couple pairs of Converse in 8 wide. They are plenty roomy to add a full length insert. I have tried several knock offs and they are always too narrow in the toes. These run a hair longer than my Converse but that allows me to have enough toe room plus room for a full insert. They look great and I love the rich red color. It isn’t orangish like other reds are. Only complaints I have: one of the shoe laces looked like it had a run and fray in it. Not overly noticeable but I noticed it. The toe cap one of the shoes has a slight bubble. It isn’t overly noticeable and I can live with these flaws for the price. Depending on how well these wear, I may be purchasing more colors!"
  },
  {
    "user": "Olga Teran",
    "rating": 5.0,
    "message": "Good shoes"
  },
  {
    "user": "missy",
    "rating": 5.0,
    "message": "The sneakers are Supa cute, bright tangerine orange, love the color, the sizing was off I normally wear a 7 1/2 or 8 they don’t come half sizes so I went up one they were big, normally I would’ve just returned them but I liked them so much I reordered a size 7 , they fit just right."
  },
  {
    "user": "Magilmore",
    "rating": 5.0,
    "message": "I’ve had my eye on these for awhile and finally my usual size was available! They were too snug! I had to order a larger size and those fit great!!"
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "I have wide fat feet.. so they were snug but I like them. I won’t be returning them. They will look awesome for my Chucky outfit I’m wearing for Halloween and then I can still wear them everywhere else too!"
  },
  {
    "user": "Shelly",
    "rating": 4.0,
    "message": "These shoes are very cute and fit great! The only thing I would like is more cushion inside the shoe."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "The reviews are true- these are a great pair of copy cat converse shoes. I have wider feet and converse always rub until broken in but so far I haven't had that issue with these. They do run a bit small so size up. I had to return the first pair I ordered in my regular size for a size larger, but since then no complaints! I will definitely purchase in other colors."
  },
  {
    "user": "Renee",
    "rating": 5.0,
    "message": "They are comfortable, and it was easy for me to bling."
  },
  {
    "user": "Cynthia Jordan",
    "rating": 5.0,
    "message": "Fits great"
  },
  {
    "user": "Jgale",
    "rating": 5.0,
    "message": "I discovered I only had one pair of shoes I ever wore during the summer time and those were getting a little....too much love. I saw these on sale and grabbed them hoping for the best and was pleasantly surprised. I was a worried when I saw the packaging(picture) but they were not damaged or worn.  The bottoms of the shoes are kind of sticky but I'm sure that goes away with use. Fits as these shoes should but it feels a little snug towards the tips of my toes. I typically wear anywhere between a 10 to 11 size shoe depending on the type and these fit well as a 10. Pretty comfortable for the price and surprised there is a bit of an arch in the shoe, though not much.  I have not been able to test extended wear yet but if anything crazy happens will update post. Thinking of buying another color if all goes well!"
  },
  {
    "user": "Rossanna",
    "rating": 5.0,
    "message": "Cómodos y lindos"
  },
  {
    "user": "Lady Thax",
    "rating": 5.0,
    "message": "Comfortable all day long!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Vibrant colors and perfect fit. True to size."
  },
  {
    "user": "Charlene T. Wicks",
    "rating": 4.0,
    "message": "The flatness of the sneakers takes some getting use to.  Bought for style."
  },
  {
    "user": "Joel Minton",
    "rating": 5.0,
    "message": "These are so cute and comfy! They are true to size and a great dupe for Converse at a great price!"
  },
  {
    "user": "Tamara Gordon",
    "rating": 5.0,
    "message": "The media could not be loaded. The shoes were perfect for what I wanted them for which was to bling out for a sneaker ball. With that being said they didn't have a lot of give so by the end of the night I was ready to take them off. If you have narrow or regular size feet they are probably pretty good but for wide feet don't expect to be able to walk around in them all day comfortably"
  },
  {
    "user": "Kelli O'Neill",
    "rating": 4.0,
    "message": "I love these shoes.  I ordered the white pair through another company and when I found out Amazon had a selection as well I was thrilled.  Next on my list will be the Navy color. Comfortable and stylish."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very happy with my purchase, looks really good"
  },
  {
    "user": "Maria L",
    "rating": 4.0,
    "message": "Me lastimaran seriamente los lados de mis pies, pues son un poco duros:( Además yo tengo pie plano y no me sirvieron. Si tu tienes un piecito normal seguro te sirven:)"
  },
  {
    "user": "Jerri Drabek",
    "rating": 5.0,
    "message": "I love them because they are not pointy like converse yet very comfortable."
  },
  {
    "user": "Gina Lepisto",
    "rating": 4.0,
    "message": "I like that they fit well and look pretty good!"
  },
  {
    "user": "Felix",
    "rating": 5.0,
    "message": "Love the shoe fit and color! Will definitely order more colors!"
  },
  {
    "user": "Diane Ryan",
    "rating": 5.0,
    "message": "Ordered  a half size smaller and they fit great"
  },
  {
    "user": "LMG",
    "rating": 4.0,
    "message": "I like these sneakers , very comfortable. Love the color."
  },
  {
    "user": "LaTia Williams",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "KISHORE Salla",
    "rating": 5.0,
    "message": "Great shoes at great price. Will watch out their longevity."
  },
  {
    "user": "Andrea Fair-Hall",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "Norma J. McKnight",
    "rating": 4.0,
    "message": "The shoes are very cute and mostly comfortable.  There is one spot inside the left shoe that is rubbing the top of my foot but that can be easily corrected.  I love the color and fit!"
  },
  {
    "user": "cswilson",
    "rating": 5.0,
    "message": "I have been wearing Converse for years> Pleased to find these in so many colors. The fit is better than Converse,  The price means more shoes.WOOHOO>"
  },
  {
    "user": "Bookworm67",
    "rating": 4.0,
    "message": "These fit a bit narrow on me, which bummed me out because I wanted to wear them for walking and sight seeing on a trip with skirts. Otherwise, fit great and are comfortable."
  },
  {
    "user": "SS",
    "rating": 5.0,
    "message": "I like everything about these sneakers and they came sooner than expected.  When I wear them I get compliments."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My new favorite shoes. Comfortable and cute. Look just as pictured. Fit normal. I have gotten lots of compliments on them."
  },
  {
    "user": "Monica Celestine",
    "rating": 5.0,
    "message": "Order size bigger than what you normally we’re order my size did not fit it all"
  },
  {
    "user": "Jenny",
    "rating": 4.0,
    "message": "Me encantan los colores pastel"
  },
  {
    "user": "Kathleen Osborn",
    "rating": 5.0,
    "message": "Cute, and comfy"
  },
  {
    "user": "Lucy G",
    "rating": 4.0,
    "message": "Really nice and comfy. They are bigger than I hoped, I’m a size 5.5 in women's ordered a 5 and it feels like a 6 but still enjoying them just wearing thicker socks."
  },
  {
    "user": "Linda S",
    "rating": 4.0,
    "message": "These are super cute especially for the price! I will be buying more colors!"
  },
  {
    "user": "Elizabeth Henry-Hooker",
    "rating": 4.0,
    "message": "I love converse sneakers, I’ve been wearing them for 25 years. These $20 shoes are all the things I like about converse, for 1/3 the price. I got these today, happy with them so far. I will probably order another pair in black."
  },
  {
    "user": "debbinwa",
    "rating": 5.0,
    "message": "You’re very cute and comfortable I would consider buying more"
  },
  {
    "user": "AB",
    "rating": 5.0,
    "message": "I love the fall look of these shoes! A good canvas shoe with a fall flair! Perfect!"
  },
  {
    "user": "Janet E. Runyon",
    "rating": 4.0,
    "message": "Cute & appear to be well made. Just be sure to order a size down."
  },
  {
    "user": "Kiki",
    "rating": 3.0,
    "message": "Color is much much lighter than pictured but it’s true to size and fairly comfortable. I wish the doles were a bit thicker though."
  },
  {
    "user": "Packer Backer",
    "rating": 5.0,
    "message": "Absolutely love the colors! They fit perfectly but since imported I ordered a size up. It was the right decision."
  },
  {
    "user": "Diane Headley",
    "rating": 4.0,
    "message": "I normally wear a 7.5 and bought a 7 still to big. It's ashame they are so cute."
  },
  {
    "user": "Marcia Martin",
    "rating": 4.0,
    "message": "These are so darn cute I got a second pair highly recommend them very cute fit well comfortable"
  },
  {
    "user": "lalala",
    "rating": 4.0,
    "message": "Ther is no arch support but I have walked many miles in these shoes and no blisters"
  },
  {
    "user": "FireFly",
    "rating": 4.0,
    "message": "Color is exactly as pictured. I got a 9 they fit pretty well Just a bit tight for a slightly flat foot. i wish there were half size because I feel a 10 would be too big. I'll be buy others."
  },
  {
    "user": "Angelito M.",
    "rating": 3.0,
    "message": "Sizes are big. It is like 2 sizes bigger than the standard size. So if you are size 8  i suggest you order size 6."
  },
  {
    "user": "Austin",
    "rating": 3.0,
    "message": "I'm not sure why people are saying it runs larger because the size 10 female fits like a 9.5 female. Not much room and definitely do not get these if you have a wide foot. The color and style was why I got them. It did come with black dirty spots on the top too which was disappointing. I probably will not buy these again. For the price.. its decent. Oh and also they dont come in a box, they're smushed in a bag."
  },
  {
    "user": "MsMary",
    "rating": 5.0,
    "message": "Can't beat the price for the \"look\".  I wouldn't want to walk in them all day as there's no support, but they're super cute!"
  },
  {
    "user": "Truda West",
    "rating": 4.0,
    "message": "A tad big but it's not enough to consider sending them back. They are so cool. Everyone loves them. I get compliments everywhere I go."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The support and stretch is what I wanted"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love these Sneakers! I wear them with everything! Summer dresses, shorts, jeans they all look better with these Perfectly Pink sneakers. There is no arch support but there’s plenty of room to add your own. I wear an extra wide shoe and these fit fine because I can loosen the laces all the way down to the toe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great converse look alike.  Lots of compliments!"
  },
  {
    "user": "Melanie Alston",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Sue Brehm",
    "rating": 4.0,
    "message": "To big see above."
  },
  {
    "user": "Jeremy Colwell",
    "rating": 5.0,
    "message": "These shoes are amazing and so cute.  Fits great"
  },
  {
    "user": "Keu1",
    "rating": 5.0,
    "message": "The media could not be loaded. Cute shoes that are a fraction of the price of others. So many colors. I will size down next time I order. My foot measures 10.1 inches and the 9 was too big but I will make it work; with socks on they are ok."
  },
  {
    "user": "Yolanda Nash",
    "rating": 4.0,
    "message": "I bought cause color first my favorite then the style love that type"
  },
  {
    "user": "david",
    "rating": 4.0,
    "message": "Size 8 was at least a half too big as compared to normal  size 8. Reordered a 7 and it was too small. Would be great if half sizes were available"
  },
  {
    "user": "Alisha Gadsden",
    "rating": 5.0,
    "message": "These shoes are absolutely perfect! They feel better that name brand, great because I care more about the style that I care about paying extra money for the opportunity to advertise a company or brand for free. But the other thing I wanted to share is that because there are no half sizes, and I wear a 6 1/2, I debated over ordering the 6 or 7. I decided on the 6, and it fits exactly like a 6 1/2!!! So pleased 😀 They appear to have good support and they are so comfortable!"
  },
  {
    "user": "Natasha Bass",
    "rating": 5.0,
    "message": "Very cute and comfy."
  },
  {
    "user": "B. Angry",
    "rating": 3.0,
    "message": "These are nice sneaks, but I don't believe that they're good for people who have flat feet, and mine are really flat. So, sadly, I had to return them, for they really hurt my feet. I wore them out shopping, and I couldn't wait to get home and take them off. I'm not faulting the sneaker, or the seller, it's just that these sneaks just weren't for me. I wish that they had worked out, for I had wanted to buy these sneaks in several other colors. Please don't let my review deter others from buying this sneaker, for it's well made, with a nice thick sole; it just wasn't the right sneak for me, so all of the ratings are about my feet in the sneaks. I'm sure that others will have a different, more positive experience with them, so please give them a try."
  }
]