[
  {
    "user": "Kathy",
    "rating": 4.0,
    "message": "These are not as comfortable as Rocket Dog Jazzin sneakers. They also run a little smaller than the Jazzin sneakers."
  },
  {
    "user": "julie holaway",
    "rating": 5.0,
    "message": "Comfortable fit, some support. Light weight, great with any summer look! Great value for the money!"
  },
  {
    "user": "CookeFamily07",
    "rating": 5.0,
    "message": "These shoes are so much more comfortable than the sneakers you get at Walmart or Target and they don't cost much more than those stores. I had a pair of Rocket Dog shoes several years back and I loved them. They are some of my favorite shoes!"
  },
  {
    "user": "Denise DeGaton",
    "rating": 4.0,
    "message": "Not enough cushion on the inner soles for me -if they felt like this at first try on they would be worse after I wore them-even though they were nice looking & good quality I regretfully had to return them"
  },
  {
    "user": "Marci CM",
    "rating": 4.0,
    "message": "If you want something cute and you don’t need to walk around or be on your feet, this is the shoe"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Loved everything about these sneakers except that they are a little narrow across the top."
  },
  {
    "user": "Kayla W.",
    "rating": 3.0,
    "message": "Super cute and exactly what I wanted. However the stitching is coming apart on the sides with the logo. If there weren’t another layer of cloth under it, it would show my socks. If I knew they wouldn’t last at least a year or more, I wouldn’t have paid the price I did."
  },
  {
    "user": "Charlene",
    "rating": 4.0,
    "message": "Very comfortable it a beautiful shoe, it reminds me of my favorite shoes growing up, they where kin rose wall, I’ve been looking for this look for sometime now, anyway it’s a great shoe, very well made, reasonably priced, and very comfortable."
  },
  {
    "user": "MsNicole",
    "rating": 4.0,
    "message": "Cute...wish they came in white!"
  },
  {
    "user": "Eva Saxon",
    "rating": 5.0,
    "message": "Comfort"
  },
  {
    "user": "Lori J. Lang",
    "rating": 4.0,
    "message": "I love the comfort and fit of these shoes. The only negative was one shoe came w/ bright white shoe laces, and the other a pale yellow tone. I’m still wearing them hoping nobody notices."
  },
  {
    "user": "Joyce",
    "rating": 5.0,
    "message": "Would purchase these again!"
  },
  {
    "user": "Emilia",
    "rating": 4.0,
    "message": "Really cute shoes. Im a size 8 so lenght wise they were perfect. The sole has memory foam which is lovely. The only problem I found was that the width of shoes is sort of small so they are not the most comfortable at first, this really gets better with use (I've stretched them in a couple of days). For the price they are pretty good."
  },
  {
    "user": "je",
    "rating": 2.0,
    "message": "We really like these sneakers to start off with. But, after only a few weeks of wear many of the grommets starting getting loose and sliding up the laces making it difficult to tie the laces and they look old and junky already. Disappointed in my daughter's back to school shoes :( Of course the return window is 1 month and we are just a couple days past that..."
  },
  {
    "user": "A.Buono",
    "rating": 5.0,
    "message": "Ordered on Wednesday and received on Friday - no prime too! Not only did this purchase come super fast, but they literally feel like you are walking on clouds!! I LOVE ROCKET DOG, to this day they are the only fashion brand that actually cares about your comfort in every step.  Easy to wear and super easy to wash and keep clean so they always look fresh.  Highly recommend anyone to buy these sneakers if they care about the comfort of their feet while still looking good!"
  },
  {
    "user": "iconcertmom",
    "rating": 4.0,
    "message": "After a month and a half of wear, The bottoms of the shoes were completely worn out. For the price that shoe did not last. Disappointing because it’s very comfortable."
  },
  {
    "user": "Heather M",
    "rating": 5.0,
    "message": "I wanted to leave a review since I seen a lot of bad reviews on these. I feel like they run true to size maybe a tad small but not small enough to justify a bigger size. I think if I went up a half size they would be too big. I have narrow to normal feet and I did not feel like these run narrow like others have said. They are actually really comfy on the bottom. They are nice and squishy! I honestly really like them and am surprised many didn’t. The only problem I had was that they sent me the wrong color."
  },
  {
    "user": "Margaret La Huis",
    "rating": 5.0,
    "message": "I’ve only wore them a few times but love them and even got compliments on them."
  },
  {
    "user": "JA",
    "rating": 5.0,
    "message": "I have wide feet. These fit perfect out the box. I have three pairs of this style and they are all very comfy."
  },
  {
    "user": "barbara",
    "rating": 5.0,
    "message": "I love rocket dog sneakers, have a good size of a collection.  This pair will be more versatile than others, I see myself wearing them all the time.  They are very comfortable, can put a lot of miles on them."
  },
  {
    "user": "Qingyang Z.",
    "rating": 2.0,
    "message": "I just got my normal size. These shoes run too narrow for me but weirdly there is too much space in the front. Maybe they are better for people with narrow feet. For the price they look good quality though."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "So comfortable! Great for everyday use."
  },
  {
    "user": "Shawna LaRocque",
    "rating": 2.0,
    "message": "These shoes felt like they were bruising my feet. I purchased rocket dogs before and they fit alot different."
  },
  {
    "user": "Heidi",
    "rating": 4.0,
    "message": "These are really cute and sturdy but have no arch support. They run a smidge big. Don’t wear them if you’re going to walk a lot. They are absolutely fine for wearing at work while I sit at a desk though."
  },
  {
    "user": "froggyfee",
    "rating": 5.0,
    "message": "Love these comfortable moon great. & not over priced"
  },
  {
    "user": "RcmlJ",
    "rating": 3.0,
    "message": "I really wanted to like these shoes. They’re really cute, but I found them uncomfortable. The bottom of the shoe felt very flat to me and lacked arch support. So unfortunately, I had to return them."
  },
  {
    "user": "Sharon",
    "rating": 5.0,
    "message": "These are super comfy and needed no breaking in!"
  },
  {
    "user": "Tracey Riedy",
    "rating": 5.0,
    "message": "I work on concrete floors and I’m always on my feet.  These are so comfortable from the start of the day till the end of the day.  I would highly recommend"
  },
  {
    "user": "Diane B",
    "rating": 5.0,
    "message": "Love how comfy these are! They are like sweatshirt material! Other reviews mentioned sizing up, I think my regular size would have been fine."
  },
  {
    "user": "GigiTerTer",
    "rating": 5.0,
    "message": "Very comfortable and not narrow! Love the black on black.  I bought several pair because they actually fit and are comfy."
  },
  {
    "user": "Dawn",
    "rating": 5.0,
    "message": "Perfect versatile, comfy & sturdy shoes! I love them!"
  },
  {
    "user": "DGardner",
    "rating": 5.0,
    "message": "Fits as expected...very comfortable...happy with the purchase!"
  },
  {
    "user": "deana",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "D. Johnson",
    "rating": 4.0,
    "message": "The shoes are comfortable and cute, but when I washed them the glue around the rubber part of the shoes turned yellow and discolored the material."
  },
  {
    "user": "Melinda",
    "rating": 5.0,
    "message": "I bought these for my daughter. She adores them"
  },
  {
    "user": "Stephanie L.",
    "rating": 2.0,
    "message": "I had a different pair of rocket dog shoes that were great, so I was happy to find these. But I'm not happy with these shoes. They rub the sides of my toes even though they are the correct size. My feet end up hurting after wearing them for the day. Wearing them for hikes, forget it. I'm pretty disappointed because they aren't even that old and the other shoes I have by this brand are comfortable but for whatever reason these ones just are bad."
  },
  {
    "user": "Christy",
    "rating": 5.0,
    "message": "I love these shoes. Very comfortable  stylish. True to size."
  },
  {
    "user": "Crystal Grubb",
    "rating": 4.0,
    "message": "Bought these for my daughter, she loves them very comfortable, would buy again"
  },
  {
    "user": "Emma Fitzgerald",
    "rating": 2.0,
    "message": "I normally wear this size shoe in most other brands but I couldn't even squeeze my foot in them. I have liked this brand in the past but this style is not like their other products."
  },
  {
    "user": "Laura A DeRose",
    "rating": 5.0,
    "message": "Great for spring, summer and vacations!"
  },
  {
    "user": "Jennifer Elgethun",
    "rating": 5.0,
    "message": "Super comfy and cute!"
  },
  {
    "user": "Loved it!!",
    "rating": 5.0,
    "message": "So happy with these!"
  },
  {
    "user": "Kimberly S",
    "rating": 2.0,
    "message": "These would've been great BUT they were SO narrow in the toes."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes. They are so comfortable and they fit perfectly. I will buy these again!"
  },
  {
    "user": "Thamara A. Munoz",
    "rating": 1.0,
    "message": "The shoe is very cute style, looks great with summer styles. Unfortunately, it has very little support for walking longer distances and after just a couple of wears the foam soles have torn at the arch area. As a result I got blisters."
  },
  {
    "user": "Michele Craig",
    "rating": 5.0,
    "message": "I love these shoes. Plenty of room for my orthotic on top of the cushy gel pad inside the shoe. Super comfortable. I wear them a lot with long dresses and for my work baking."
  },
  {
    "user": "camy",
    "rating": 3.0,
    "message": "Shoe was very sturdy and supportive,  liked the quality.  However, I ordered my regular size 6,  but it was too big.  It was advertised as being true to size."
  },
  {
    "user": "Kara Utech",
    "rating": 1.0,
    "message": "The shoes are very comfortable however the sole of the shoe wore out to the base of the shoe within 2 weeks of buying. 4 months later: these shoes are destroyed. I do an average amount of walking daily and the bottom of the shoe is worn out and lets water in."
  },
  {
    "user": "Katelyn",
    "rating": 2.0,
    "message": "These fit about as expected, I'm usually a 7.5 and that size fit well in the length. However, these shoes felt oddly narrow to the point that I felt like I would end up with blisters. This is very unusual for me because I have narrow feet to begin with. The sole has some cushioning, but still feels pretty stiff and hard. The style is cute and exactly as pictured, but I'm returning them because they were nowhere near as comfortable as I was hoping for an everyday shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is exactly what I was looking for. Fits comfortably."
  },
  {
    "user": "Aggie",
    "rating": 1.0,
    "message": "The shoe on the image is all black but what I received was not the same shoe. It looked the same but the bottom rubber part was white. If you are looking to buy an all black shoe do not order. It was black and white."
  },
  {
    "user": "Sally Tuna",
    "rating": 2.0,
    "message": "Are these legit rocket dogs? Uncomfortable and I own a lot of rocket dogs and never had an issue.."
  },
  {
    "user": "Jersey Peach",
    "rating": 5.0,
    "message": "I feel that it's very important that I write this review because I have no complaints at all. Before I made my purchase I was leery because of some of the bad reviews. I'm glad I didn't listen. I'm in the healthcare field, on my feet all day. I wore these to work and normally take my shoes off when I come home. I've been home for 20 mins and I still haven't taken them off. I will say that I do have narrow feet but average narrow. They fit very well and extremely comfortable for me. I will also say that there is no arch support but I have strong arches, so that didn't matter to me, my get feel great If I could give them 100 stars I would. Give them a chance, you'll love them. Also I'm usually a size 9, but purchased a 9 and a half because of the review. They are slightly too big."
  },
  {
    "user": "KaySctlndlady",
    "rating": 4.0,
    "message": "I purchased these on a clearance sale for $15 and I am very happy with them."
  },
  {
    "user": "Shibumi",
    "rating": 4.0,
    "message": "Got this via prime wardrobe came a day early it's a nice shoe I feel that the soul is thicker than appears in the picture had to return it was a size too big. @amazon packaging that box for the shoes was too small. If this is a prime wardrobe selection that most likely has a 50/50 chance of being returned not sure why you would not put it in a bag big enough for me to use the return option on the packaging that you guys have. You stuffed this shoebox into a small bag. This is being placed here because there is no way to tell you otherwise and I'm not calling Amazon for this."
  },
  {
    "user": "robochick",
    "rating": 4.0,
    "message": "These fit true to size.  I wear a 9 and these fit just like my other shoes. These do have extra comfy padding inside you can fill it.  I'm really glad I got these and look better than wear my running shoes all the time.  My kids told me I look stylish. :)"
  },
  {
    "user": "Heather",
    "rating": 5.0,
    "message": "These Rocket Dog Cheery canvas shoes are so comfortable! The cushioned insole allows for all day wear. The color is jet black and the shoes come pre-laced, which is nice. Sizing is TTS- I wear a size 8, ordered a size 8 and they fit perfectly."
  },
  {
    "user": "Terry in SA",
    "rating": 5.0,
    "message": "These Rocket Dog Women's Cheery 12a Canvas Cotton/Black Foxing Sneakers are like Converse but more feminine and they are insanely comfortable. These are 6 eyelet, low top, basketball-style, shoes. They feature thick, rubber, soles with a protective, rubber, toe cap. There is a padded heel collar. The insole is made of memory foam, I think, and it's super comfortable under your foot. The laces are wider than usual and give the impression of ribbons, which gives the shoe a more feminine look. They are completely black - even the soles. The sizing is accurate and they are just wonderful. I like them better than Converse Chuck Taylor's in all black because they are much more comfortable."
  },
  {
    "user": "Mother Nature",
    "rating": 5.0,
    "message": "These fit as expected - I ordered my usual size 6 and it was a comfortable fit. I was pleased that the shoe included some padding for added comfort, soft/thick laces, as well as a sturdy/durable design, at a good value! Overall happy with these."
  },
  {
    "user": "M. Hill",
    "rating": 5.0,
    "message": "Styled like a classic lace-up sneaker these black Rocket Dogs not only look good but are also comfortable to wear right-out-of-the-box. There are 6 metal eyelets used, the collar is padded and there is light padding in the tongue. The memory foam innersole is soft and comfortable and while there is moderate arch support depending upon the user’s needed it may need to be augmented. The rubber sole is lightly textured which should provide some help maintaining footing on wet and slippery surfaces. I wear a size 8 1/2 shoe and with a pair of light/medium socks the fit in the same size shoe is perfect so they are true-to-size. Excellent."
  },
  {
    "user": "Te-Te",
    "rating": 5.0,
    "message": "I love the comfort of Rocket Dogs!"
  },
  {
    "user": "Lindsey Lozano",
    "rating": 5.0,
    "message": "I love these shoes! Cute and comfortable. Fit true to size."
  },
  {
    "user": "Quisqueya Tejeda",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Amy S.",
    "rating": 5.0,
    "message": "These are the best shoes if your feet are a little on the wide side. Super comfy and durable. Cute enough too."
  },
  {
    "user": "Mandi",
    "rating": 5.0,
    "message": "So cute and comfortable !"
  },
  {
    "user": "Judy L Williams",
    "rating": 5.0,
    "message": "Love these shoes. Fit perfect. Will look good with anything this summer"
  },
  {
    "user": null,
    "rating": null,
    "message": "Perfect fit, just as described. Arrived earlier than expected. 😊"
  },
  {
    "user": null,
    "rating": null,
    "message": "From first wear, the pumps fit perfectly and were very comfy."
  },
  {
    "user": null,
    "rating": null,
    "message": "These look great but feel awful. I have small narrow feet and these were pressing against each side of my foot making them very uncomfortable to wear. Sadly once worn I don’t believe you can return so now I’m stuck with a pair of shoes I can’t wear and out of pocket!"
  },
  {
    "user": null,
    "rating": null,
    "message": "I love Rocket Dogs as they fit a bit wider. I have been disappointed in the past ordering Rocket Dogs with a narrow cut. These are not those! These are the most comfortable ones yet and fit my insoles well!"
  }
]