[
  {
    "user": "J. Thompson",
    "rating": 5.0,
    "message": "The last pair of 515's I bought was from Amazon in Feb 2019. They were V1 and I love them. I saw these V3 in black and team red and had to have them. I ordered the same size 11 - but when they were delivered they was way short in the toe. I returned them and got the replacements yesterday in size 11.5 US men. I am wearing them today for the first time, and I honestly could have gone to size 12 primarily based on my big toe on both feet. If you're moving from an older version, consider sizing up. But Amazon is awesome and will sort you out if you need to exchange. I did not deduct a star since I bought a new model without trying on (but I own more than a couple of New Balance all in size 11)."
  },
  {
    "user": "David Gonzalez",
    "rating": 4.0,
    "message": "I love the style and fit of these shoes but the insole that comes with the shoes are garbage. They are literally paper thin. I thought ahead and bought myself a pair of memory foam insoles to go with the shoes because I’ve been having heel pain, and I’m glad I did. They are not comfortable at all, at least not for me without a good pair of insoles. Once I put my fave insoles in them they are good to go. I love the colors of these shoes. We’ll see how long they hold up but for now I am happy with my purchase."
  },
  {
    "user": "nasreen a.",
    "rating": 5.0,
    "message": "Great for wide feet!!! But make sure you chose the wide option. They were a gift for someone. I just received a call thanking me for buying these due how comfortable these are and perfect for wide feet."
  },
  {
    "user": "Chelsea",
    "rating": 5.0,
    "message": "My husband works for a school whose school colors are purple and yellow. He bought these for some school spirit and they’ve so far been a hit. Not only has he gotten lots of compliments, but he’s even had to share the direct link with others so that they could go and buy themselves a pair too! And it’s no surprise, because they really are a sharp looking shoe. Also unsurprisingly, these shoes are excellent quality and great comfort right out of the box."
  },
  {
    "user": "Joel Olson",
    "rating": 5.0,
    "message": "I like that they have 4E in my size."
  },
  {
    "user": "Michael K",
    "rating": 5.0,
    "message": "They are what I expected. No surprises"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I bought these sneakers for my brother as he couldn't find what he liked in the stores.  He was very pleased with them.  The fit was true to size and comfortable."
  },
  {
    "user": "Consumer",
    "rating": 5.0,
    "message": "I love these shoes and have multiple different pair. This pair fits a bit tighter than the previous. Still love the shoe and will buy more!"
  },
  {
    "user": "Raymond",
    "rating": 5.0,
    "message": "They fit perfectly and helped with the pain in my feet so much more than I expected!"
  },
  {
    "user": "David Lewkowicz",
    "rating": 5.0,
    "message": "They came in on time and they fit my son perfect for school we actually bought another pair in all black I would totally recommend these sneakers and the seller shipped on time thanks again🙏"
  },
  {
    "user": "Malik",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Tray",
    "rating": 5.0,
    "message": "At first I only wore these as a cosplay of a '90s guy. But man, I really forgot how comfortable New Balance shoes can be. Now I wear them everywhere, while getting compliments about this its neat colors."
  },
  {
    "user": "Ray Paseur",
    "rating": 4.0,
    "message": "I buy NB for the generous fit of the wide toe box.  These seem a little \"close\" compared to other NB shoes I've owned. Not returning them, but would not buy again."
  },
  {
    "user": "Ernstal08",
    "rating": 5.0,
    "message": "Purchased these for my son. They run about a half size bit bigger than his previous pair of NB shoes. Since my sons foot is still growing have a show to grow into isn’t an issue. Over all great solid shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "fit was good would buy again"
  },
  {
    "user": "Laura N",
    "rating": 4.0,
    "message": "I got these for my boyfriend and he's happy with them. They looked a little cheap but he says there comfy and are holding up well. He's on his feet 12 to 20 hrs. sometimes depending on his shift."
  },
  {
    "user": "Michael Due",
    "rating": 5.0,
    "message": "Love these shoes. Super comfortable. Very lightweight. Feels like walking on air."
  },
  {
    "user": "Randi",
    "rating": 5.0,
    "message": "Durable and comfortable. Will buy again and again"
  },
  {
    "user": "Victor",
    "rating": 5.0,
    "message": "Like NB, light weight, comfortable"
  },
  {
    "user": "Douglas Rowan",
    "rating": 4.0,
    "message": "This NB #515 is a Tried and True design . It is a no frills shoe but with Good Glue . Some competitors products of comparable pricing will be completely unusable in half the time . The reason for not 5 stars is minor toe jam which still persists after 50 miles , the break is longer than I recall ."
  },
  {
    "user": "Ats",
    "rating": 4.0,
    "message": "These shoes are comfortable. May get dirty easily due to light color."
  },
  {
    "user": "Aziz",
    "rating": 5.0,
    "message": "New Balance is awesome as always!"
  },
  {
    "user": "Qaasir greeb",
    "rating": 5.0,
    "message": "Nun else to say u getting what’s on the picture fits nice"
  },
  {
    "user": "Kimberley Moore",
    "rating": 5.0,
    "message": "Fantastic quality and comfortable sneakers"
  },
  {
    "user": "Deb Posey",
    "rating": 5.0,
    "message": "Husband is a teacher at 70 and is on his feet all day.  He has good luck with new balance"
  },
  {
    "user": "MC",
    "rating": 4.0,
    "message": "I have bought these in the past and really like them for my wide feet. However,  I had to order a 1\\2 size bigger this time.  There great for walking."
  },
  {
    "user": "Phillip Trujillo",
    "rating": 5.0,
    "message": "Great price, perfect fit and swift delivery!"
  },
  {
    "user": "Juan Pablo",
    "rating": 5.0,
    "message": "Me encantó el l estilo, los colores y súper cómodos."
  },
  {
    "user": "john c garrett",
    "rating": 5.0,
    "message": "I’ll e these sneakers"
  },
  {
    "user": "Mariano Pérez Garce",
    "rating": 5.0,
    "message": "Me gustó el tenis por la comodidad y la calidad que posee."
  },
  {
    "user": "Jeffyg75",
    "rating": 5.0,
    "message": "Fits as expected.  Look awesome!"
  },
  {
    "user": "twin2",
    "rating": 4.0,
    "message": "A especially like the look. Used for casual wear."
  },
  {
    "user": "heatherbutt",
    "rating": 5.0,
    "message": "Great shoe durable and nice colors"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Modelo conveniente para caminar y uso continuo"
  },
  {
    "user": "César Iván",
    "rating": 5.0,
    "message": "El color idéntico a las fotografías y el tamaño es exacto a mi número. Los compraría nuevamente sin pensarlo."
  },
  {
    "user": "Doubleagle26",
    "rating": 5.0,
    "message": "Fits as expected. Great classic look from NB there never gets old"
  },
  {
    "user": "Fernando López",
    "rating": 4.0,
    "message": "Muy buena descripción y materiales aunque el pie derecho venía un poco arrugado de ahí en en fuera todo súper bien"
  },
  {
    "user": "rosekrystofolski",
    "rating": 5.0,
    "message": "Good Sneakers, I bought them for my son and he was happy with them and they fit well- even considering that my son has wide feet"
  },
  {
    "user": "CHRIS SLADE",
    "rating": 5.0,
    "message": "Nice fit"
  },
  {
    "user": "D Reiss",
    "rating": 5.0,
    "message": "Should have ordered the ones that were wide because of my left foot that is flat footed, but overall a very nice shoe. I also have a green pair of the samething, that's why I ordered this pair."
  },
  {
    "user": "D. Daily",
    "rating": 5.0,
    "message": "Really like the 515! The Amazon Warehouse had my size for only about ~$50 which made it even better - I had been looking for a few 'go-to' sneaker that I could wear on walks, trips to the store, dropping kids off at school...and I think I found it. I've never had a pair of New Balance before, but was impressed with how the shoes felt comfortable so soon after receiving them...not really a long breaking-in period which was nice. I also like that there is a wide range of color choices so I'll probably grab another pair in the near future when I see them pop up in the warehouse!"
  },
  {
    "user": "Luke Lavell",
    "rating": 5.0,
    "message": "Probably the best 50 bucks I ever spent. I feel like I’m walking on baby kittens."
  },
  {
    "user": "TennRev",
    "rating": 4.0,
    "message": "I bought these for everyday casual wear. These are not intended for a serious amount of running or walking---far less cushioning than the dozen or so other New Balance shoes I've worn over the past 20 years. They also run a little longer than other shoes in this brand. Overall, they are good for casual use so long as you're not going to be walking too far or standing for a very long time."
  },
  {
    "user": "johnny",
    "rating": 5.0,
    "message": "Good quality and comfortable"
  },
  {
    "user": "Andrew Foster",
    "rating": 5.0,
    "message": "Fits as expected, looks really good."
  },
  {
    "user": "Bob",
    "rating": 4.0,
    "message": "Product was as described and fit as expected."
  },
  {
    "user": "john n lockner jrar15223",
    "rating": 5.0,
    "message": "What we expect from new balance shoes"
  },
  {
    "user": "Robert Walker",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Tia Tif",
    "rating": 5.0,
    "message": "Great in person.  Good deal"
  },
  {
    "user": "Jeffrey C.",
    "rating": 4.0,
    "message": "Besides a scuff on the right shoe… They are perfect 👍🏾"
  },
  {
    "user": "Duckman38",
    "rating": 5.0,
    "message": "NB shoes fit my feet better than any other brand.  Good looking, comfortable walking around casual sneaker.  There are cush-ier and fancier styles in the NB lineup but this one is a great value."
  },
  {
    "user": "BD",
    "rating": 3.0,
    "message": "The reviews looked good and I have rarely been disappointed by New Balance, but these didn't work out. Despite ordering my typical size for NB these were a bit snug but more importantly they just felt cheap. For the price I wasn't expecting the top of the line, but these just were uncomfortable beyond being tighter than I expected, the foot bed felt hard, and I didn't have confidence they would last very long (my pair of 1540s last more than a year despite me being a very heavy set guy). If they had fit I might have tried a different insert, but overall, I decided to go with the more expensive New Balance."
  },
  {
    "user": "chobbs42",
    "rating": 5.0,
    "message": "Favorite brand of and style running / walking shoe for everyday activities.  Cool and light weight with a variety of colors.  Machine washable when needed.  Great value for the money."
  },
  {
    "user": "John Davis",
    "rating": 5.0,
    "message": "The media could not be loaded. Colors in the shoes more design colors that will get peoples attention but these shoes that are a size 14 Are Way better can’t go any higher than that"
  },
  {
    "user": "srfrbro",
    "rating": 3.0,
    "message": "Toe box is small / tight. Firm soles."
  },
  {
    "user": "Matt",
    "rating": 5.0,
    "message": "Fit great, love them"
  },
  {
    "user": "Chaka Lumumba Cox",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "cju747",
    "rating": 5.0,
    "message": "The s colors and fit were perfect! Buying more of these in different colors! Highly recommend"
  },
  {
    "user": "Linda",
    "rating": 3.0,
    "message": "These are fine for walking around. Not good at all for working in."
  },
  {
    "user": "Golfer",
    "rating": 5.0,
    "message": "New balance has great shoes for wide people and great styles and colors"
  },
  {
    "user": "Todd",
    "rating": 5.0,
    "message": "Was an outstanding buy way beyond expectations"
  },
  {
    "user": "jose alejandro botero",
    "rating": 5.0,
    "message": "exelente producto como lo esperaba"
  },
  {
    "user": "MarkMc",
    "rating": 5.0,
    "message": "It was next to impossible to find this color in wides, but finally found these.  They fit well, very comfortable.  Match my son's baseball team colors perfectly"
  },
  {
    "user": "The Great Farthing",
    "rating": 3.0,
    "message": "These look great but the insoles are horrible. I had to add a memory foam insert so that I couldn’t feel the ridges from the stitching in the soles"
  },
  {
    "user": "Sj",
    "rating": 5.0,
    "message": "It's gonna be perfect for dodgers games and the gym!! I love 515s"
  },
  {
    "user": "Amazons MVB",
    "rating": 5.0,
    "message": "Shoes fit relatively well and they look sharp. I can wear them for nights out or running! But I remember when New Balance was half this price."
  },
  {
    "user": "José Escobar",
    "rating": 5.0,
    "message": "Excelente calidad. Llegaron bien y son muy cómodos"
  },
  {
    "user": "BAHA",
    "rating": 5.0,
    "message": "Best snickers! Very comfortable and nice design!!!!"
  },
  {
    "user": "kennetn coston",
    "rating": 5.0,
    "message": "The shoes are comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "This shoe tends to not be as comfortable as other New Balance shoes that I've purchased in the past.  I ordered a 14 wide and thought that maybe I just needed to break the shoes in.  After wearing them for a couple weeks I've had to put the shoes on the shelf as the comfort level isn't there.  It almost seems as though it's a size 14 and not a 14W.  The box indicated 14 wide, but I can't see anything on the shoe other than size 14, so maybe it was packaged and marked incorrectly."
  },
  {
    "user": "bbowner1",
    "rating": 5.0,
    "message": "Good shoe, the markings and tags all look correct. Only thing this time (I’ve ordered about 4 diff pairs from Amazon) is these are a little roomy. They feel like they are a wide, although they’re marked regular. Not sure what the deal is this time but I’ll just wear bigger socks, it’s almost wintertime anyway."
  },
  {
    "user": "Crucialsol",
    "rating": 5.0,
    "message": "Love these kicks, exceeded my expectations!"
  },
  {
    "user": "William McGuire",
    "rating": 5.0,
    "message": "Comfortable fit out of the box"
  },
  {
    "user": "Victor",
    "rating": 5.0,
    "message": "My son loves them so I’m happy!  Got them on sale so that was a plus."
  },
  {
    "user": "Douglas Mills",
    "rating": 5.0,
    "message": "Just what I ordered!"
  },
  {
    "user": "David",
    "rating": 2.0,
    "message": "As a long time NB purchaser I was excited to purchase these sneakers. I even purchased a second pair wanting to have these when the first pair wear out. I did not expect to need the spares in just a couple of months.  The soles are separating prematurely. The quality appears to have really gone down hill on NB. I will be looking elsewhere for my next sneakers. I contacted the seller multiple times in hopes of a warranty replacement to no avail. They have not responded."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was very skeptical that these would not fit properly. New Balance offers a wide and I was shocked on how well they fit and felt on my feet. You have a new customer New Balance, thank you."
  },
  {
    "user": "Shayne",
    "rating": 5.0,
    "message": "I like NBs 😁"
  },
  {
    "user": "Keonna",
    "rating": 5.0,
    "message": "I purchased these for my High Schooler, at 14 with the same size foot as his age. It's hard to find a shoe that fits, but he adores the fit, comfortable and his words \"amazingly well\" and \"sturdy\""
  },
  {
    "user": "M. Koontz",
    "rating": 3.0,
    "message": "We walk an average of 3 miles per day.  Nevertheless, I would have expected the soles to be good for a year or more.  If they were $40 shoes I'd probably buy them again, but not at $80."
  },
  {
    "user": "Yeniczek",
    "rating": 5.0,
    "message": "Exactly what on photo, size precise."
  },
  {
    "user": "Doug Shaw",
    "rating": 5.0,
    "message": "Good fit, very comfortable, looks well constructed, look good."
  },
  {
    "user": "Justin Neidinger",
    "rating": 5.0,
    "message": "Shoe fits as expected and is really comfortable to walk/run in."
  },
  {
    "user": "MEL",
    "rating": 5.0,
    "message": "I liked the colors but my son didn't. So we returned them. He did say they were comfortable though."
  },
  {
    "user": "Amazon Freak",
    "rating": 5.0,
    "message": "These shoes are the best fitting for my feet. Very comfy; fits just right and suitable for long walks."
  },
  {
    "user": "DAD",
    "rating": 5.0,
    "message": "The best shoe for my feet at my age of 50"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I really enjoy wearing this new balance shoes I can recommend to a my friends and family too."
  },
  {
    "user": "pnw1975",
    "rating": 5.0,
    "message": "I am really surprised at how comfortable these shoes are! I have worn tons of different brands, everything from minimalist shoes like the Merrell Vapor Gloves to highly cushioned shoes like the Hoka Challenger. These shoes are absolutely as comfortable as anything else I've worn, most of which cost substantially more. They are breathable, lightweight, and have just the right amount of cushion. Not a lot of support in the shoe which I prefer, but somehow they seem to keep my feet feeling engaged and ready for whatever I'm doing. I purchased the EE width because I have wide feet and they have a great fit with plenty of toe space, not pointed like a lot of other shoes out there. Highly recommended."
  },
  {
    "user": "Lester",
    "rating": 5.0,
    "message": "These make the perfect work shoes! I know NB released a Figs edition for healthcare workers but these are just as nice. I stand most of my day too and these are comfortable enough for me to avoid having sore shins and feet. I bought these 5 months back and look for yourself! Still as good as new. Worn 5 days a week, 8+ hours a day."
  },
  {
    "user": "Kathy",
    "rating": 5.0,
    "message": "I'm a big person with wide feet, so getting a quality shoe for good price isn't easy for me. But these shoes did the trick. I get all kinds of compliments on the colors of these shoes. That's just a plus to the comfort of the shoes. We're definitely a good buy for me."
  },
  {
    "user": "Ralind Elmore Davis",
    "rating": 5.0,
    "message": "Great shoe!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This NB shoes are very comfortable and look good."
  },
  {
    "user": "monte joe lutterman",
    "rating": 5.0,
    "message": "Great deal, new without tags. Came in an Amazon box brand new for cheaper price. Trust the deals."
  },
  {
    "user": "Denise holt",
    "rating": 5.0,
    "message": "Style"
  },
  {
    "user": "Sandro",
    "rating": 5.0,
    "message": "this shoes are the original and fit perfect, I dont have any issues with them"
  },
  {
    "user": "SC Zimmerman",
    "rating": 2.0,
    "message": "I’ve never had this issue with New Balance before, but the size 12 sneakers I received are at least a half size too small, maybe more."
  },
  {
    "user": "D'Varius",
    "rating": 5.0,
    "message": "I've always liked New Balance teenis shoes. I wore them alot as a teen back in the 90's and early 2000's. I didn't really want this color, but I made it work. Hopefully they'll have the other colors I want in stock soon. They are a bit pricey now, but what isn't nowadays. Overall good shoe, comfortable and you can style it up or down to something casual."
  },
  {
    "user": "Latonia akins",
    "rating": 5.0,
    "message": "Nice buy"
  },
  {
    "user": "Ben bolejack",
    "rating": 5.0,
    "message": "Fit as should worth the money"
  },
  {
    "user": "Louise V.",
    "rating": 5.0,
    "message": "Loved everything about them from price to color to comfort. THANKS"
  },
  {
    "user": "Melmap",
    "rating": 4.0,
    "message": "I have normally been wearing a regular width but these shoes seem extra tight."
  },
  {
    "user": "Andrew",
    "rating": 5.0,
    "message": "These are probably the best work horse shoes I’ve had in a decade. New Balance is a brand you can trust. Shoe construction is solid, fashionable but not flashy like you’re trying too hard. Wear these shoes for long walks, workout and long shifts on your feet. Size is true to fit and plenty of space in the shoe without allowing your foot to move around so much it causes blisters and irritation. I never write reviews, but these shoes are worth it. I bought for around $50 which easily in a retail store would have spent $150."
  },
  {
    "user": "Samuel Rodriguez",
    "rating": 5.0,
    "message": "Very comfortable sneakers  👍👍 great summer sneakers 👟"
  },
  {
    "user": "Malcolm Calder",
    "rating": 5.0,
    "message": "Very happy with purchase"
  },
  {
    "user": "Wilson",
    "rating": 4.0,
    "message": "The media could not be loaded. Me gusto el articulo pero me quedaron pequeñas...gracias por su atención e información"
  },
  {
    "user": "Mayra I. Pacheco Candelario",
    "rating": 4.0,
    "message": "Es medio size más del que se ordena, son muy bonitos"
  },
  {
    "user": "Alan Rosenquist",
    "rating": 2.0,
    "message": "The shape of the shoe is much more narrow, the style has also slightly changed. Make sure you inspect the shoe closely. I didn't open the box and it's too late to return. Dropping them off at Goodwill."
  },
  {
    "user": "Vic Villont",
    "rating": 4.0,
    "message": "Wait wait, comfortable, great color also."
  },
  {
    "user": "Zachary Cook",
    "rating": 3.0,
    "message": "Highly unexpected colors even if they look good on the picture. Had to be much cheaper and honestly, incidentally, look mighty cartoony. Not made for edgy fashion wearing grown men."
  },
  {
    "user": "Florin Ciobanu",
    "rating": 5.0,
    "message": "Great fit and lightweight"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This shoe fit as it should and is very comfortable. I am please with my purchase 😊"
  },
  {
    "user": "israel mendez",
    "rating": 5.0,
    "message": "Love this sneakers exact fit and very comfortable."
  },
  {
    "user": "King",
    "rating": 5.0,
    "message": "Real nice,"
  },
  {
    "user": "Ira P. Brown",
    "rating": 5.0,
    "message": "Fit perfectly, just order regular size. Incredibly light weight and super comfortable. Already  (3 days) one of my all time (I’m 78) favorites."
  },
  {
    "user": "miguel angel muñoz morillo",
    "rating": 3.0,
    "message": "Lo que no me agrado de este producto es que corren pequeño."
  },
  {
    "user": "Drew",
    "rating": 3.0,
    "message": "Looked small when I took them out of the box. I used to own a pair of these that were light grey and size 10.5. Was shocked how tiny they were when I took them out of the box, but thought maybe they would stretch. Not sure what changed, but very stiff cheap material. Maybe they sent me a woman’s 10.5"
  },
  {
    "user": "Richard Christopher",
    "rating": 5.0,
    "message": "Price and quality"
  },
  {
    "user": "Christina Pohl",
    "rating": 2.0,
    "message": "Really had high hopes for this shoe. Fit and feels great but sole is separating from the body of the shoe after only a month of wear."
  },
  {
    "user": "Will Riggs",
    "rating": 5.0,
    "message": "Love these shoes!  They've been hard to find locally so I took the gamble and ordered them online.  Glad I did!  They fit great, are comfy, and I really love the look.  I've been dealing with plantar fasciitis lately and I really appreciate the stiffness but also comfort of the sole on these.  We'll see how they hold up, but I've always had good luck with New Balance kicks."
  },
  {
    "user": "Bob Steinman",
    "rating": 5.0,
    "message": "This looks as good as it feels!  One of the most comfortable shoes I have bought in a long time. The extra wide is perfect!  I am going to buy another pair once I can decide on a color!!  They all look good!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They are very light and fit well, I do not like the shape of the toe as well as on the model 481 that I had but am satisfied the shoe"
  },
  {
    "user": "Rafael Rodriguez Rodriguez",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Rhonda Hill",
    "rating": 5.0,
    "message": "Fit well and comfortable!"
  },
  {
    "user": "Bryant Taylor",
    "rating": 5.0,
    "message": "Look great. Very comfortable. Fit true to size."
  },
  {
    "user": "Gerardo Garcia Marcano",
    "rating": 5.0,
    "message": "Un estilo casual que combina con todo “vistiendo” un poco más que los zapatos de este estilo sin sacrificar comodidad. Son muy cómodos!"
  },
  {
    "user": "Joshua Atchley",
    "rating": 5.0,
    "message": "These shoes are so much better than I expected. I had mixed emotions with the idea of purchasing shoes online, but it was the last resort because all shoe stores in my area have been consistently out of my size or have terrible choices. Glad I found these on Amazon."
  },
  {
    "user": "Scar",
    "rating": 4.0,
    "message": "The style is and colors are 100% as the image online."
  },
  {
    "user": "AC",
    "rating": 4.0,
    "message": "Nice kicks!"
  },
  {
    "user": "Van",
    "rating": 4.0,
    "message": "Very comfortable shoes for walking and running"
  },
  {
    "user": "karen goard",
    "rating": 5.0,
    "message": "5*"
  },
  {
    "user": "John Jolly",
    "rating": 5.0,
    "message": "Happy with purchase."
  },
  {
    "user": "Janice Barnes",
    "rating": 5.0,
    "message": "Great"
  },
  {
    "user": "Billyfong",
    "rating": 5.0,
    "message": "Very nice in style, and extremely light on feet. I very like this shoe"
  },
  {
    "user": "frank egbo",
    "rating": 2.0,
    "message": "Going to work"
  },
  {
    "user": "Richard L Turner",
    "rating": 5.0,
    "message": "Good fit. Good support."
  },
  {
    "user": "Nick Casey",
    "rating": 2.0,
    "message": "Ripped within 20 wears. Comfortable and nice, but not durable."
  },
  {
    "user": "Zach",
    "rating": 5.0,
    "message": "I love these shoes. I do a decent bit of walking and new balance seems to be pretty popular on campus. fit is great and super comfy plus they look amazing"
  },
  {
    "user": "April",
    "rating": 5.0,
    "message": "Wore these on my recent trip so comfortable!! Feet were on cloud nine !! A must buy…"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Okay. New balance has gone downhill. The material is thinner and the insert have half the cushion they used to."
  },
  {
    "user": "Lumpy",
    "rating": 2.0,
    "message": "Ad copy shows a GREEN shoe. It's pretty far from green. There's a bit of green trim and the insoles are \"zombie green\". But the outside is just plain GREY to me. The SOLES are very hard. Very uncomfortable to walk on hard surfaces. Feels like they are made of wood or like walking on cheap, thin, flip flops. The rubber lugs \"KLONK\" when I walk on our hardwood floors. Leather soled shoes are quieter. Not at all like my 160 dollar pair of NB shoes. So I guess you don't get what you don't pay for. I notice the color description problem in ALL the NB shoes I've bought in the last ten years or so. One of the colors they seem proud of is called \"Pigment\". Really? You name a color \"Pigment\"? I think that means \"All the left over dye we had left in the vat, mixed to a general dark grey/purple/brown."
  },
  {
    "user": "Worawudh",
    "rating": 5.0,
    "message": "I use these shoes for walking."
  },
  {
    "user": "cuchin1950",
    "rating": 5.0,
    "message": "La invercion fue muy buena."
  },
  {
    "user": "Saddam Bienvenido",
    "rating": 5.0,
    "message": "Para mi uso personal"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "It’s the perfect dad shoe!"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "They would be perfect if my size 13 was not a half inch short."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My son likes them"
  },
  {
    "user": "Big Rocky",
    "rating": 5.0,
    "message": "Nice shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great when you have to be on your feet all day!"
  },
  {
    "user": "Katty Yuxely Vargas Romero",
    "rating": 5.0,
    "message": "Tal como lo esperamos"
  },
  {
    "user": "Christopher Boylan",
    "rating": 5.0,
    "message": "These shoes fit just right and are so comfortable."
  },
  {
    "user": "Reynaldo Marrero",
    "rating": 5.0,
    "message": "Comfortable,  good looking and design."
  },
  {
    "user": "Josh M",
    "rating": 3.0,
    "message": "Nice looking shoe, but the toe box is too narrow and uncomfortable to wear if constantly on your feet."
  },
  {
    "user": "Get it done",
    "rating": 5.0,
    "message": "Nice looking ad comfy!  Great for being on feet all day."
  },
  {
    "user": "Claudia",
    "rating": 5.0,
    "message": "I actually bought these shoes for my husband after he picked them out.  According to him, they are very comfortable and fit great."
  },
  {
    "user": "Sergey",
    "rating": 3.0,
    "message": "Invalid description. There is not even a hint of suede. Synthetics only."
  },
  {
    "user": "Dan B",
    "rating": 5.0,
    "message": "I am so impressed with these tennis shoes.  They are just as described!  I have gotten a few complements already.  Thinking of buying different color as well"
  },
  {
    "user": "James Gaither",
    "rating": 5.0,
    "message": "They were for my son. THEY fit great & are super comfy!"
  },
  {
    "user": "Ryan Farmer",
    "rating": 5.0,
    "message": "I like these New Balance shoes a lot. Looks nice and very comfortable."
  },
  {
    "user": "Carol",
    "rating": 5.0,
    "message": "Great for walking 4-6 miles - comfortable fit!"
  },
  {
    "user": "James Meeks",
    "rating": 5.0,
    "message": "Love these shoes, look great dressed up or down"
  },
  {
    "user": "Sultan31",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Swoopes033",
    "rating": 1.0,
    "message": "I have only had these shoes for 2 months and they are failing apart. I washed them as one does with sneakers when they get dirty and they shrank and are now failing apart. This was my first ever pair of New Balances in my life and will most certainly be my last."
  },
  {
    "user": "Henry Simchuk",
    "rating": 5.0,
    "message": "Fit as expected and are good value for money."
  },
  {
    "user": "Grover Guessford",
    "rating": 5.0,
    "message": "Shoes arrived and fit perfectly!"
  },
  {
    "user": "James Evans",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Peter Carlin",
    "rating": 5.0,
    "message": "Comfortable and fits well"
  },
  {
    "user": "Noel",
    "rating": 5.0,
    "message": "Love New balance swag"
  },
  {
    "user": "Carl Patrick Barnes Jr",
    "rating": 5.0,
    "message": "Very comfortable shoes!"
  },
  {
    "user": "sierra vera",
    "rating": 5.0,
    "message": "Love them! Great looking & Super Comfortable classic New Balance Shoes!"
  },
  {
    "user": "Ramin Dabiri",
    "rating": 5.0,
    "message": "Great value"
  },
  {
    "user": "Big country",
    "rating": 2.0,
    "message": "I have owned a lot of new balance shoes and these didn’t even make it 4 months. The insoles and the shoe support itself are just completely wore out."
  },
  {
    "user": "DANNY JARAMILLO",
    "rating": 5.0,
    "message": "Lindos Zapatos"
  },
  {
    "user": "Segun Aisinkin",
    "rating": 5.0,
    "message": "The media could not be loaded. Nice fit"
  },
  {
    "user": "Beth Cochran",
    "rating": 1.0,
    "message": "Sizes run too small on this shoes. Buy half a size bigger at least. Does not look as good in person."
  },
  {
    "user": "Francisco Amado",
    "rating": 1.0,
    "message": "The shoes were different one of another."
  },
  {
    "user": "Catherine",
    "rating": 1.0,
    "message": "These shoes are clearly defective. They arrived on the 7th it’s the 18th and the soles are already separating from the left shoe. New Balance used to be a good brand but maybe not anymore . I would return if I didn’t throw the box away ."
  },
  {
    "user": "MissVLuvU",
    "rating": 1.0,
    "message": "The media could not be loaded. Not YELLOW.  These are LIME Green☹️☹️☹️ I had an outfit that would have matched great with what was pictured but I received lime green and black shoes. The camera shows a little yellow but they are actually lime green."
  },
  {
    "user": "Yerisell",
    "rating": 1.0,
    "message": "El tamaño es más pequeño de lo esperado, incómodos. Experiencia descepcionante."
  },
  {
    "user": "Nicolas",
    "rating": 1.0,
    "message": "Not all shoes are made equal, but in new balance's case, not all pairs are made equal. The back of the shoe is mismatched and digs into your heel. I thought I got a factory defect pair, but all the pictures show it. Pathetic quality management."
  },
  {
    "user": "Dimarco Garnett",
    "rating": 1.0,
    "message": "Nice sneaker but I thought they were white not beige and the socks was too small"
  },
  {
    "user": "CARLOS SOLORZANO",
    "rating": 1.0,
    "message": "No es original"
  },
  {
    "user": "Gabriel Rodas",
    "rating": 1.0,
    "message": "El zapato derecho llegó dañada y la intensidad de los colores no es igual a como se ve en la publicación, mala compra espero me devuelvan mi dinero porque estos zapatos están feos"
  },
  {
    "user": "Manuel",
    "rating": 2.0,
    "message": "Not what I expected in color"
  },
  {
    "user": "Angel Avalos",
    "rating": 1.0,
    "message": "The fact the stitching is done horribly. And the shoe feels cheap. Other pairs I have are more comfortable and feel completely different"
  },
  {
    "user": "Simon Cohen",
    "rating": 1.0,
    "message": "I'm a 574 lover, with some of mine starting to wear out, I thought I'd give these a try. The toe box is different, and worse. The insole is harder and feels cheap. The upper is both stiffer and thinner, making it feel plastic-y. the shape of the bottom is weird so it feels bad to walk on. The logo on the side looks like its about to come off."
  },
  {
    "user": "Brittany McQueen",
    "rating": 1.0,
    "message": "So excited I ordered as a Christmas present they were the last pair in the size I needed and they got damaged during delivery and had no more in my size to exchange so I was very disappointed..."
  },
  {
    "user": "Scott Kielty",
    "rating": 4.0,
    "message": "They're great New Balance shoes. I felt like they ran just a hair small, but maybe that's me. I love the look and color."
  },
  {
    "user": "Robert",
    "rating": 1.0,
    "message": "The construction on these shoes was so poor I returned them immediately. I've purchased many pairs of NB over the years and these are different in materials and construction than any previous pair I've owned."
  },
  {
    "user": "Sebastian Covington",
    "rating": 4.0,
    "message": "Great shoes for the price. Definitely designed for running and not just for casual walking."
  },
  {
    "user": "darrin",
    "rating": 1.0,
    "message": "Be the most uncomfortable sneaker ever worn. Lacks any type of support"
  },
  {
    "user": "pattk77",
    "rating": 1.0,
    "message": "I wear 15 wide and the length on these were fine but super tight in the middle area like narrows. Not true wides. These shoe companies are a joke."
  },
  {
    "user": "Eduardo Diaz",
    "rating": 5.0,
    "message": "I like these because they are too heavy and it is breathable material I guess the only thing is the leather kind of wears out a bit fast."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "La caja donde llegó estaba muy destruido"
  },
  {
    "user": "Dad of four",
    "rating": 5.0,
    "message": "Classic style and comfort for shoes to walk in.  I wouldn’t run/exercise with them but a good fit for your clothing style.  Also picked them up when there was a Prime deal so the price was very reasonable."
  },
  {
    "user": "matthew",
    "rating": 5.0,
    "message": "The shoe is beautiful, its the blue suede as sung by Elvis.  It fits my foot perfectly, as sold, no inner soul replacement needed."
  },
  {
    "user": "John R. Barry",
    "rating": 5.0,
    "message": "I recently bought these shoes because I have been searched for something that does not destroy me heels. The last few pairs of running shoes I bought have caused blisters and the inside of the shoes have broken down (heel area) within weeks. This even happened to the more expensive running shoes I purchased. This pair of shoes has been great so far! They fit well. They are lightweight. They breathe. And so far the heels are comfortable. I will be buying these as long as they have them available."
  },
  {
    "user": "Bobby",
    "rating": 5.0,
    "message": "Just what I ordered. New Balance always a quality shoe."
  },
  {
    "user": "Paul M",
    "rating": 5.0,
    "message": "Great for price on Prime Day, New Balance so you know it fits, feels and looks good."
  },
  {
    "user": "Janice L.",
    "rating": 5.0,
    "message": "Comfortable shoes and nice looking"
  },
  {
    "user": "Michael Dahl",
    "rating": 5.0,
    "message": "Shoes fit nice and my first pair of different colored New Balances."
  },
  {
    "user": "Luke",
    "rating": 5.0,
    "message": "I wear a size 10 and these are pretty snug but my feet still have enough room and they look great!"
  },
  {
    "user": "Jason",
    "rating": 5.0,
    "message": "Fits great and comfortable"
  },
  {
    "user": "Jason Jacobs",
    "rating": 3.0,
    "message": "Love these shoes. But, going of a pair of similar NB shoes I had I ordered accordingly. The shoes run 1.5 sizes to large in this style"
  },
  {
    "user": "Keesha Fitzgerald",
    "rating": 5.0,
    "message": "I bought them for my father on Father’s Day. He loved them! Great fit and exact color."
  },
  {
    "user": "Joseph K.",
    "rating": 3.0,
    "message": "Comfortable shoes and I would have left a great review except the shoes started falling apart within one week of wearing them. More specifically, the small rubber that is glued to the very front of the toe area does not like to stay glued. I tried shoe goo, silicone, and hotglue. Nothing works. I just tossed them 4 weeks after purchasing."
  },
  {
    "user": "Kyle S",
    "rating": 5.0,
    "message": "Love these shoes!!"
  },
  {
    "user": "Chuck",
    "rating": 1.0,
    "message": "Shoe Fits more like a women's size 8 my toes hit the very front of the shoe inside"
  },
  {
    "user": "Amy Wolfe",
    "rating": 1.0,
    "message": "Not even 24 hours."
  },
  {
    "user": "Gyo",
    "rating": 5.0,
    "message": "Cool sneakers"
  },
  {
    "user": "Stacy E.",
    "rating": 5.0,
    "message": "Like the fit, looks good for a casual shoe."
  },
  {
    "user": "Fernando Cova",
    "rating": 5.0,
    "message": "Great!"
  },
  {
    "user": "Rosoter",
    "rating": 5.0,
    "message": "Feels amazing"
  },
  {
    "user": "Roscoe C. Pernwickle",
    "rating": 5.0,
    "message": "These shoes are fantastic"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "True size 9 bought an 8 1/2 almost a size too large."
  },
  {
    "user": "ech72",
    "rating": 5.0,
    "message": "exellend"
  },
  {
    "user": "Karina Ortiz Felix",
    "rating": 5.0,
    "message": "Good quality"
  },
  {
    "user": "MB",
    "rating": 5.0,
    "message": "True to size."
  },
  {
    "user": "melcardona",
    "rating": 5.0,
    "message": "all good no brake in required"
  },
  {
    "user": "B",
    "rating": 5.0,
    "message": "I bought this shoes for my dad as a gift. They fit perfectly and he wears them all the time. He loves how comfortable they feel. Highly recommend them"
  },
  {
    "user": "n. ferris",
    "rating": 5.0,
    "message": "nothing to dislike, great price and great fitment! love them"
  },
  {
    "user": "Hunter",
    "rating": 5.0,
    "message": "Very comfortable and stylish."
  },
  {
    "user": "Chad Laubenthal",
    "rating": 5.0,
    "message": "One of the best fitting shoes I've ever had! The colors are perfect for representing Thee Ohio State!"
  },
  {
    "user": "Brenda Jones",
    "rating": 5.0,
    "message": "I love everything about these shoes"
  },
  {
    "user": "Tonygarza",
    "rating": 5.0,
    "message": "Great product and very happy with purchase"
  },
  {
    "user": "Houston Kelley",
    "rating": 5.0,
    "message": "They are great 👍👍👍👍👍👍"
  },
  {
    "user": "Jason",
    "rating": 5.0,
    "message": "515, 574, and 994 New Balance are the only sneakers I buy now. 2-3 pairs of these a year are all I need. Cheap enough to color coordinate. Thanks."
  },
  {
    "user": "Bigg Brown",
    "rating": 5.0,
    "message": "Will repurchase in the future"
  },
  {
    "user": "Rod Wolfe",
    "rating": 5.0,
    "message": "I really love New Balance shoes. I was afraid they would fit too snugly. Nope!!!  They fit just right. My foot was engulfed in absolute pleasure. Not tight anywhere and looked fabulous. I got the red ones and just love them. They’re so comfortable walking around too. These get a big A+!!!!!"
  },
  {
    "user": "Wade White",
    "rating": 5.0,
    "message": "Comfortable.  The shoe laces are color coordinated which is slick."
  },
  {
    "user": "Alexander",
    "rating": 5.0,
    "message": "Not what I expected. It's like sleepers. This was my first meet with NB product ("
  },
  {
    "user": "Joseph",
    "rating": 5.0,
    "message": "Well worth it"
  },
  {
    "user": "Will",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "CBF",
    "rating": 5.0,
    "message": "kid loves them"
  },
  {
    "user": "Ta.13",
    "rating": 5.0,
    "message": "He love and say they're are comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Would buy from again in future"
  },
  {
    "user": "Brett",
    "rating": 5.0,
    "message": "Good product as I am hard on shoes with having a prosthetic foot.  Excellent heel strike compression resistance."
  },
  {
    "user": "Rio",
    "rating": 5.0,
    "message": "Look great. Fit perfect"
  },
  {
    "user": "Alborn Roberts",
    "rating": 5.0,
    "message": "new balance always my favorite but lately I be in love with the new designs"
  },
  {
    "user": "Benny Miller",
    "rating": 5.0,
    "message": "New Balance is one of the best sneakers on the market.  The wide width of this sneaker is very comfortable and my feet don’t get tired."
  },
  {
    "user": "Bradley",
    "rating": 5.0,
    "message": "Love everything about them. Just wish I bought two pairs when they were on sale 😪"
  },
  {
    "user": "Corey Pierce",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "R. Weld",
    "rating": 5.0,
    "message": "Another pair of New Balance shoes that fit comfortably and feel good when walking. I buy NB as they come in widths (9.5 wide) and a lot of brands only offer M/Dwidth shoes."
  },
  {
    "user": "Poppadee78",
    "rating": 5.0,
    "message": "I consider this one of those sneakers that looks cool and are well put together with decent to good materials. On the flipside of that coin though it’s not the most comfortable for a long durations of time. Now I’m it’s defense I’m someone that’s a big fan of the Adidas boost series of sneakers so my opinion is completely subjective. Would I purchase this same sneaker in a different color-way again ? If the price is right absolutely!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Tried several brands of shoes ...new balance works best ...easy to order, fast delivery"
  },
  {
    "user": null,
    "rating": null,
    "message": "Super Schuh  sehr empfehlenswert"
  },
  {
    "user": null,
    "rating": null,
    "message": "Me gustó el diseño y el color de los zapatos, no son los más cómodos, pero por el precio están bastante bien."
  },
  {
    "user": null,
    "rating": null,
    "message": "Verarbeitung ist ganz okay. Passt wie erwartet"
  },
  {
    "user": null,
    "rating": null,
    "message": "Justo lo que se esperaba"
  },
  {
    "user": null,
    "rating": null,
    "message": "Buenos originales buena oferta"
  },
  {
    "user": null,
    "rating": null,
    "message": "Seleccione un zapato color crema con rosa, me llego uno en color negro y amarillo. No lo regrese porque pienso regalarlo pero me decpciono que elijas un modelo y te llegue otro. Parece problema de las imagenes que no corresponden al modelo seleccionado"
  },
  {
    "user": null,
    "rating": null,
    "message": "Toujours aussi bonne qualite pour ced basket new balance. Je recommande vivement"
  },
  {
    "user": null,
    "rating": null,
    "message": "Gut"
  },
  {
    "user": null,
    "rating": null,
    "message": "El producto se vende como original y no lo es, el material se ve y se siente de mala calidad. No recomiendo comprarlo."
  },
  {
    "user": null,
    "rating": null,
    "message": "El precio excelente, buena calidad, se ven bien, vienen un medio número más grande y vienen amplios, pero en general fue una buena compra."
  },
  {
    "user": null,
    "rating": null,
    "message": "Gut"
  },
  {
    "user": null,
    "rating": null,
    "message": "El paquete llego en buenas condiciones, la caja un poco golpeada, pero eso mo importa. Los tennis son muy cómodos y valen la pena, fue poco el tiempo de espera."
  },
  {
    "user": null,
    "rating": null,
    "message": "Just fine for me, very comfortable for running!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Muy cómodos y talla perfecta"
  },
  {
    "user": null,
    "rating": null,
    "message": "Bought the shoe with the intentions of switching over to new balance... open the box and right away you can tell that these shoes are knock offs.. not even a good attempt.. pretty choked and wanting my money back."
  },
  {
    "user": null,
    "rating": null,
    "message": "Son muy lindas y sobre todo muy cómodas"
  },
  {
    "user": null,
    "rating": null,
    "message": "One of my favourite brands, I have 4 pairs and so far no complaints"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ya había tenido New balance antes, estos son cómodos pero los detalles como que me.hacen pensar que son productos clonados, ya me pasó con unos Sketcher que compre aqui y di otra oportunidad. Seguramente no vuelva a comprar tenis por Amazon."
  },
  {
    "user": null,
    "rating": null,
    "message": "Excelentes tenis de buena calidad, el ÚNICO DETALLE ES QUE VIENEN MUY ANCHOS DE LA PARTE FRONTAL!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ofertan un color y envian otro"
  },
  {
    "user": null,
    "rating": null,
    "message": "estan muy bien y comodos"
  },
  {
    "user": null,
    "rating": null,
    "message": "Very not the confort new balance use to give. Not happy with this purchase"
  },
  {
    "user": null,
    "rating": null,
    "message": "Well done, New Balance.  Well done."
  },
  {
    "user": null,
    "rating": null,
    "message": "Los tenis muy bien no tengo queja. El Problema fue con la foto del producto ya que muestran unos de un color muy diferente al que pedi."
  },
  {
    "user": null,
    "rating": null,
    "message": "Llego un modelo diferente pero pues me gusto y me lo quede"
  },
  {
    "user": null,
    "rating": null,
    "message": "Schnelle Lieferung und top ware!! Gern wieder"
  },
  {
    "user": null,
    "rating": null,
    "message": ""
  },
  {
    "user": null,
    "rating": null,
    "message": "È la prima volta che compro le new balance e mi sono trovato benissimo. Comode, morbide e le puoi tenere a lungo senza che il piede ne risenta. Consigliate"
  },
  {
    "user": null,
    "rating": null,
    "message": "Muy buen producto"
  },
  {
    "user": null,
    "rating": null,
    "message": "De momento bien, son cómodas aunque las adquirí hace poco; recomiendo pedir una talla más, si llevas un calcetín gordo se te ajusta mucho al pie."
  },
  {
    "user": null,
    "rating": null,
    "message": "Très confortables. J’aime bien. J’ai eu juste un problème avec la taille. Le numéro 44 était très petit et pourtant c’est la taille habituelle. Donc je l’ai changé pour une taille plus grande 45 et voilà. Sont très confortables. Merci !"
  },
  {
    "user": null,
    "rating": null,
    "message": "Llego en buenas condiciones y sin retardos👍🏻"
  },
  {
    "user": null,
    "rating": null,
    "message": "Scarpe acquistate per mio figlio e si trova benissimo, non avevo dubbi visto che ne avevo acquistato un paio anche per me qualche settimana fa e sono molto comode. Consiglio di prenderle con un numero in più, io calzo 42 e ho ordinato il 43."
  },
  {
    "user": null,
    "rating": null,
    "message": "Passen super, besser wie meine alten 374 von NB. Erstaunlich das es so Unterschiede gibt."
  },
  {
    "user": null,
    "rating": null,
    "message": "Pros: • New Balance, styling is alright. • The length fits as it should. Cons: • Trainers are cheap feeling, comparable to shoes worth half the price. You can see the glue. • The insole is poorly padded, but switchable. • The colour of the mesh isn't true black. The middle part has a warm (red) tone to it and not as black as the suede at the front. • The suede is thin feeling; I can't see these lasting very long if used off-track. They're definitely a dress trainer, but maybe only for going to the local pub or shop. • The sole is narrow, it feels like they need to be an inch wider as it feels like my feet want to flow over them like how muffins want to escape their wrapper. The mesh sort of bundles them up in an unsupported manner, which creates a rubbing problem with the rigid suede at the back. For reference they are 7 cm wide and my feet are 8 cm wide at the narrowest part. The front of the trainer is good enough for toes to wiggle though. I'll list dimensions below... Dimensions of sole: Heel 8 cm width Middle 7 cm width Front 11 cm width Inside of the trainer is 28 cm length (11 inches for UK size 11). • Even though I only tried them on for about 5 minutes I developed a short moment of plantar fasciitis pain in the arch of my left foot. To reiterate something I've said before, \"I don't like buying clothes online. You just don't know what you're going to get\". 👎"
  },
  {
    "user": null,
    "rating": null,
    "message": "Schnelle Lieferung und Top Ware ! Gern wieder"
  },
  {
    "user": null,
    "rating": null,
    "message": "Nice to fit"
  },
  {
    "user": null,
    "rating": null,
    "message": "Passt gut , sieht schick aus"
  },
  {
    "user": null,
    "rating": null,
    "message": "New Balance è una garanzia, scarpe comodissime anche se dalle foto sembravano più eleganti"
  },
  {
    "user": null,
    "rating": null,
    "message": "He tenido otros modelos y siempre me quedo muy satisfecho con sus diseños. Llegó a tiempo y como si saliesen de la tienda ;)"
  },
  {
    "user": null,
    "rating": null,
    "message": "Son los terceros que tengo de esta marca, para mi son súper cómodos y bonitos"
  },
  {
    "user": null,
    "rating": null,
    "message": "Una marca che non ti delude mai comode calde e affidabili"
  },
  {
    "user": null,
    "rating": null,
    "message": "Tolle Schuhe aber ich habe Größe 40 und muss die 41,5 bestellen, damit sie angenehm zu tragen sind."
  },
  {
    "user": null,
    "rating": null,
    "message": "Muy cómodas."
  },
  {
    "user": null,
    "rating": null,
    "message": "I found the shoe dated /an older design"
  },
  {
    "user": null,
    "rating": null,
    "message": "Mir gefallen New Balance Schuhe vom Design her sehr gut. Habe diese beim Prime Day gekauft und es war goldrichtig. Für den Preis wirklich tolle, sehr bequeme Schuhe (wie von New Balance gewohnt). Wenn ich etwas kritisieren müsste dann, dass die Schnürsenkel etwas lang sind, ich mache dann aber immer einen Doppelknoten rein..."
  },
  {
    "user": null,
    "rating": null,
    "message": "Uso solo new balance. Comode"
  },
  {
    "user": null,
    "rating": null,
    "message": "Great product away to order other pair"
  },
  {
    "user": null,
    "rating": null,
    "message": "Esta marca siempre ha sido la que más me dura, la calidad es buena, son comodas."
  },
  {
    "user": null,
    "rating": null,
    "message": "Forget other reviews this is very light and comfortable trainers no red tint like suggested in previous reviews ps:amazon 100 characters FY!!!!!!!!!!!!!!!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Nice foot wear, easy to wear and matches any outfit"
  },
  {
    "user": null,
    "rating": null,
    "message": "Muito Bom"
  },
  {
    "user": null,
    "rating": null,
    "message": "Preis Leistung Top"
  },
  {
    "user": null,
    "rating": null,
    "message": "Spent ages trying to find a decent pair that wouldn’t break the bank, but unfortunately these didn’t last. Seemed fine at first - laces were really long though (?!) but then the glue at the front started coming loose so returned. No problems with the return process, hence the extra star."
  },
  {
    "user": null,
    "rating": null,
    "message": "Bonne qualité légère et bien dedans prendre la taille habituelle"
  },
  {
    "user": null,
    "rating": null,
    "message": "I am very happy quality price"
  }
]