[
  {
    "user": "Lily",
    "rating": 4.0,
    "message": "I normally wear 7 in other brands and can get away with 6.5. The black sneakers fit really tight all around my toes. Got my Mom a pair also in 8.5 and she said they were tight as well. I have socks on, Mom did not.  I also got the white version with gum soles and 7 fits great.  Different colors fit differently it seems. Overall, really nice looking and clean."
  },
  {
    "user": "Sarah",
    "rating": 4.0,
    "message": "I ordered a 7.5 and I’m normally 7/7.5, and I should’ve ordered an 8 in these, the 7.5 fits, but they are tight. And they pull my dang sock down every step. Lol.. they cute tho"
  },
  {
    "user": "KELLY",
    "rating": 5.0,
    "message": "These shoes are so comfortable. I purchased a 7 which is my usual size and they fit perfectly."
  },
  {
    "user": "Shirley",
    "rating": 4.0,
    "message": "I like the shoes to color I don't like that in no memory comfort"
  },
  {
    "user": "TeeLovelyy",
    "rating": 5.0,
    "message": "I searched for this style for so long and was finally able to get them. They’re so comfortable and fit as expected."
  },
  {
    "user": "Tanya Romano",
    "rating": 5.0,
    "message": "Bastante cómodos y bonitos"
  },
  {
    "user": "Bobby  Smith",
    "rating": 5.0,
    "message": "Slightly larger than I expected but very comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Excellent"
  },
  {
    "user": "MW26",
    "rating": 4.0,
    "message": "It took me 3 tries to find the right size, finally did (they do run a bit small, consider ordering WIDE) and I like them. Cool ‘old school’ shoes, will be nice with jeans or a dress. A little stiff, but all these white, leather sneakers are."
  },
  {
    "user": "kay lee",
    "rating": 5.0,
    "message": "Got these to go to Italy, lotsa walk-in so we’ll see, so far so good"
  },
  {
    "user": "Claudia Muldoon",
    "rating": 4.0,
    "message": "If you want these shoes for a cool look they are perfect! Don't size down, these run a little small. I loved how they completed my outfit and felt comfortable until I tried walking. They are really stiff and one shoe kept making a weird noise. It might have gone away after breaking them in, but I couldn't take it for that long. I will return them unfortunately."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was looking for shoes with a sole that would grip a tile floor , these are pretty good. Not as good as my old converse sneakers but that was50 years ago. Many shoes today add fuzzy fibers to the sole so they can be classified as slippers and slippers can sell cheeper. I am pleased with these and wear them constantly"
  },
  {
    "user": "little.superstar",
    "rating": 5.0,
    "message": "These are very comfortable and padded inside, love them!"
  },
  {
    "user": "James Samaniego",
    "rating": 5.0,
    "message": "They are perfect ☺️ I’ve been using them for almost a month, it fits with every outfit"
  },
  {
    "user": "sonia",
    "rating": 4.0,
    "message": "There is no support or confort in this shoe if you are planning on wearing them for more than 3 hours"
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "Comfortable, sole inserts are soft and true to size. Cute color and have been easy to clean so far."
  },
  {
    "user": "K",
    "rating": 4.0,
    "message": "Nice shoe.  Very attractive style on women with big feet."
  },
  {
    "user": "Katy",
    "rating": 4.0,
    "message": "The shoes themselves were ok… minimal support and padding but a decent sleek looking white shoe. I was rather irked I was clearly resold a pair that had been purchased in store somewhere- they didn’t even bother to remove the clearance tag from inside the shoe. The toes were also rather dirty from someone trying them on. I’d be fine with the scuffs but don’t charge me full price for a used/returned pair and rub your markup in my face. The tag on the bag even states “non-new”. They’re going back."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love the look of these shoes, but these are NOT my most comfortable shoe! I usually wear New Balance, and these are soooo different from NB. They are very stiff and do not hardly bend. I normally wear a 6.5 in shoes so I ordered a 6.5, I possibly could have used a 7 (not sure). If you can “Try before you buy option, I would definitely do that & order a half size up also just to try. I wear these shoes for looks ONLY, I take into account how much walking I will be doing b/c for me these are NOT the shoes I want to do a lot of walking in! But again I do LOVE the look of them, super CUTE and I get LOTS of compliments when I do wear them."
  },
  {
    "user": "nicole",
    "rating": 4.0,
    "message": "So even when I see reviews saying something runs small, I still always get my size and 99% of the time it works out. This is the 1%. I usually wear a 7 or 7 1/2. With these I went with 7 1/2. I will say they fit and are wearable but tight and not what I would have went with had I tried them one first. An 8 would be much better and I never wear 8. These feel like squeezing into a 6. Also I dislike how my socks are always being pulled down in the back so I wore higher socks and they were still getting pulled down. I have 2 pairs and they are both the same. I gave 4 stars because they look good!"
  },
  {
    "user": "Danielle Galindo",
    "rating": 5.0,
    "message": "New favorite shoe! So comfortable and soft on the inside"
  },
  {
    "user": "Kym Mae",
    "rating": 4.0,
    "message": "Look nice. Good as casual shoes. Not great for longer walks. The shoes have always made annoying noises when I walk. The sound is even more pronounced when walking in my carpeted workplace."
  },
  {
    "user": "SJ",
    "rating": 5.0,
    "message": "Love these shoes. Everyone always compliments me."
  },
  {
    "user": "mlg6504",
    "rating": 4.0,
    "message": "They are super cute and comfortable except the fact that they seem to run 1/2 size smaller than I was expecting. I typically wear a 10  and I ordered the 10, but after a couple hours they really hurt my toes because they're smaller than expected"
  },
  {
    "user": "Liliana Perdomo",
    "rating": 5.0,
    "message": "I love it"
  },
  {
    "user": "Nicole Carolina Castaneda de Meléndez",
    "rating": 4.0,
    "message": "Yo lo compre para ejercitarme. Lo utilizo para trabajar piernas y me ha ido muy bien. No lo sentí muy cómodo para caminatas largas."
  },
  {
    "user": "antonio",
    "rating": 5.0,
    "message": "Daughter loves it"
  },
  {
    "user": "Samar Lee",
    "rating": 4.0,
    "message": "I've tried the shoes. They are comfortable and adorable as the pictures shows. I have to return the shoes because the configuration of the heels does not fit my feet. The heels keep falling off when I am on the shoes, no matter how tight I tie the laces. Since I trust the quality of the brand (as I've tried the shoes), I went to buy another shoes from Rebok, suspecting that heel problem was a specific issue with the design of this model. Unfortunately, I found that the second pair of shoes from Rebok also had the same issue. Now I am starting to think that all Rebok shoes would give me such experience. I don't have such issues normally. I think the shape of my feet is typical, not having specific demands for shoes.  I don't know how the shoes fit others. It seems that the reviewers have not mentioned this point. But anyway, the shoes are in good quality and worth the money. Maybe the shoes would fit you."
  },
  {
    "user": "Austin T Otwell",
    "rating": 5.0,
    "message": "I wear an 8-8.5 depending on the shoe. I ordered the 8 because I was worried they would stretch out after wearing numerous times. This was not the case. They have kept their shape and are very flattering and cute. I wish I would have ordered the 8.5 but they are still very comfortable! Great buy!!"
  },
  {
    "user": "Mariana García",
    "rating": 5.0,
    "message": "Me gustaron mucho y me llegaron a tiempo 😀"
  },
  {
    "user": "Glo12",
    "rating": 4.0,
    "message": "This shoes are comfortable, but not for long walks. They fit just right."
  },
  {
    "user": "Rebecca Phillips",
    "rating": 5.0,
    "message": "Good quality, very comfortable. I work 10-12 hour shifts and wear these shoes frequently. They are stylish and very comfortable, good arch support."
  },
  {
    "user": "CARMEN ER",
    "rating": 4.0,
    "message": "Yo pensaba que en USA soy +2 números a mi Medida en México, pues no, resulta que en tennis es 1.5+, por lo tanto solo me falló la talla que ordené. Los tennis están lindos y se ven de buena calidad"
  },
  {
    "user": "L. Elliott",
    "rating": 3.0,
    "message": "The fit was mostly what you’d expect but the pair I received had a very uncomfortable flaw in the stitching at the base of the laces. Made them pinch there. Returned them and went with tried and true Nike"
  },
  {
    "user": "Alexis",
    "rating": 5.0,
    "message": "Buy these. They are so comfortable/high quality."
  },
  {
    "user": "Jenni F.",
    "rating": 4.0,
    "message": "Super cute, looks exactly like the picture. Ordered my normal size and they are a tad too small - size up about a half to a full size."
  },
  {
    "user": "Jenniepoo",
    "rating": 5.0,
    "message": "I have been wearing these shoes for a few months now.  I wear them to the office every day.  They look nice enough I can pull it off with my dress pants.  I have serious metatarsal issues and arthritis.  The stiff sole and roomy interior keep me walking!  I also like the way the look.  They can easily be disguised to look like work shoes with my slacks.  I also wear them with my jeans and capris and they look great.  The sole can be slick in wet weather, which is my only issue.  My shoes still look new, despite lots of use for the past several months."
  },
  {
    "user": "Sara",
    "rating": 5.0,
    "message": "Fits like a dream and is so comfortable. I work 8-10 hours a day on my feet the whole time. Doing anywhere from 15k-18k steps a day. I really love these shoes!"
  },
  {
    "user": "Harley Crane",
    "rating": 4.0,
    "message": "Likes- style-great support- good quality material-great for all day wear. Dislikes- The back of one shoe hurt my foot for the first couple of days I wore them ."
  },
  {
    "user": "Kingdom Celebrity",
    "rating": 4.0,
    "message": "Very Comfortable, and good quality for the price."
  },
  {
    "user": "Julianna",
    "rating": 5.0,
    "message": "The media could not be loaded. I was between a few brands of similar styles, so happy with my purchase! Great quality, fit perfectly true to size and oh so comfy. + full of style & easy to clean! Big fan :)"
  },
  {
    "user": "ErinK",
    "rating": 5.0,
    "message": "I hopped on the “white shoes with everything, even dresses” bandwagon and purchased these. They are super cute! I knocked them down a star for support and comfort just because I have pronated, flat feet and these don’t have super high arch support. But that’s no fault of the shoe, my feet are just weird. If you are looking for a comfortable, white shoe that is affordable, these are it."
  },
  {
    "user": "Heather Williams",
    "rating": 4.0,
    "message": "I love these Reeboks. It took a while of wearing them to get them comfortable around my feet but now that they are a little worn in I love them and they are soo stylish. I get many compliments on them!"
  },
  {
    "user": "Dee Wittenberg",
    "rating": 4.0,
    "message": "They fit well, they are little tight in the front by the toe"
  },
  {
    "user": "Schudell",
    "rating": 5.0,
    "message": "If you're a person that hates creases in their shoes avoid these. Bc they crease almost instantly,  besides this I really do like these shoes. You can wear these with shorts, jeans, dress pants, and dresses. Absolutely love the price point, even thought about buying same pair in case the crease begans to annoy me . Just wore these out today, comfortable and casual."
  },
  {
    "user": "Miss Morrison",
    "rating": 3.0,
    "message": "One was great but the other one was wrinkled and looks like it had water damage so I don’t know if I am keeping them yet. I love the shoes if I can get past the unmatched look."
  },
  {
    "user": "MD",
    "rating": 4.0,
    "message": "I’m a 7.5 in sneakers. The 7.5 was too small so I exchanged them for an 8, which was also small but I just kept those. I’d recommend sizing up a whole size"
  },
  {
    "user": "Grace H",
    "rating": 4.0,
    "message": "I ordered a size 7 in the club 70 shoe and those fit perfectly but this shoe has a more narrow toe box so go a half size up! Also beware of the hard sole, this shoe is for the look and less for functionality. Very cute still."
  },
  {
    "user": "Rachel Wagner",
    "rating": 5.0,
    "message": "Good cushion insoles.  Not to high of arch solid walking shoe"
  },
  {
    "user": "Pamela",
    "rating": 5.0,
    "message": "Son muy lindos y además cómodos, la talla me quedo a la perfección, era exactamente lo que esperaba 🫶"
  },
  {
    "user": "Claire D Kitt",
    "rating": 5.0,
    "message": "Love this shoe.  Was looking for something that i could clean easily.  Runs a bit big.  Had to send back for a smaller size."
  },
  {
    "user": "Pamela Lee",
    "rating": 3.0,
    "message": "I have recently ordered these shoes and decided to order another pair to wear when we went out. I wore these to my sons and on the 2nd day the white over the orange sole started peeling off, plus these shoes were much wider than the other pair, my foot moved all over these shoes. After wearing them i had sore places on my foot from my foot moving around in them. I dont understand how this pair was so much different than the pair i had ordered about 3 weeks or so before this pair"
  },
  {
    "user": "Yadira",
    "rating": 5.0,
    "message": "Quedo bien fue para mi hermana lo mande hacia mi  país  y le encantó"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I really liked these sneakers but the 8.5 was too small and the 9 was too big. I have always worn in Reebok so I was disappointed with the sizing."
  },
  {
    "user": "paige",
    "rating": 5.0,
    "message": "Really liking this sneaker. I have gotten so many compliments and they are very comfy! The only thing is it gave me a blister first time wearing it, so definitely wear ankle socks while wearing them in"
  },
  {
    "user": "MJ",
    "rating": 4.0,
    "message": "Great looking sneakers but runs way too big. Unfortunately I had to send them back. They had great support and a small platform which I really liked. I would recommend them."
  },
  {
    "user": "gabriela",
    "rating": 5.0,
    "message": "El zapato es muy lindo pero como me quedo grande aún no estoy segura"
  },
  {
    "user": "Tracy",
    "rating": 3.0,
    "message": "Shoe is very narrow."
  },
  {
    "user": "Cindy Basdeo",
    "rating": 4.0,
    "message": "I work on my feet all day so this has been a great addition to my life. Plus super cute"
  },
  {
    "user": "DeVona 😊",
    "rating": 5.0,
    "message": "These shoes fit great!! I currently have to wear an ankle brace and I needed some shoes that are comfortable, stylish and supportive. These shoes not only look great with jeans but also added flavor to my dress and long socks. I will be ordering more in different colors."
  },
  {
    "user": "cindybee",
    "rating": 5.0,
    "message": "Great sneaker. A tad snug but I’m sure they will stretch out."
  },
  {
    "user": "Flow Joe",
    "rating": 5.0,
    "message": "Love these !! Have never tried them and I needed something that fit well. I’m usually a 6 in shoes but lately only 5.5 has been working so I gave it a try. Every other shoe brand fit too big so I tried this one. It’s cute, comfy, take anywhere with me. Will get another pair."
  },
  {
    "user": "Stephanie",
    "rating": 3.0,
    "message": "I am glad I got these for the price that I did. They were marked down to less than $40. They are cute and versatile but I would not recommend for long term wear or exercise. I will need to get inserts for these for better arch support"
  },
  {
    "user": "Selina Jones",
    "rating": 4.0,
    "message": "Really like the look and fit."
  },
  {
    "user": "shopperbam",
    "rating": 5.0,
    "message": "I liked everything about this sneaker!  I would definitely purchase another pair in a different color!  Well worth the price!  Highly recommend!  The pink is just as pictured."
  },
  {
    "user": "Cynthiaelle",
    "rating": 5.0,
    "message": "It’s a beautiful shoe but it was painful to wear. The first time I wore the shoe it dug into my toes and was super uncomfortable to wear. I next time I wore them I got blisters at the back of my ankles."
  },
  {
    "user": "Carla Marquez",
    "rating": 5.0,
    "message": "I love these shoes! They're comfy, fit perfect and go with everything"
  },
  {
    "user": "Tracey",
    "rating": 5.0,
    "message": "Had to return but these are so cute. I’d say size down half a size. They are sooooo cute"
  },
  {
    "user": "Vera Mahbosung",
    "rating": 4.0,
    "message": "It’s exactly like the picture and I also like it because is very comfortable and soft too"
  },
  {
    "user": "A.D.M",
    "rating": 5.0,
    "message": "Classy and comfortable"
  },
  {
    "user": "Alexis",
    "rating": 5.0,
    "message": "I've had a few pairs of Reebok classics, but I like these ones way more. They're a bit taller and look great no matter the outfit. They also have memory foam in the soles so they're super comfortable for long walks."
  },
  {
    "user": "Christine",
    "rating": 5.0,
    "message": "So happy that I bought these! They’re very comfy and stylish. I ordered a size 8 which is my normal size and they fit perfectly!"
  },
  {
    "user": "YESSICA PINEDA",
    "rating": 5.0,
    "message": "I haven't had white shoes in a while. White shoes remind me of nursing school days lol I finally decided to get some. They fit perfect with vans no show socks. I usually wear a size 6 in women's shoes. The are a little stiff but I can imagine they will fit more comfortably the more I use them."
  },
  {
    "user": "Suzette R.",
    "rating": 5.0,
    "message": "Es igual al de la imagen, su color es bien blanco. Es un tenni casual para salir, no para trabajar, estar de pie o caminar largas distancias. La plantilla tiene memory, no tiene el suporte del arco del pie. En mi caso llena mis necesidades y el precio es muy bueno en comparación con las tiendas."
  },
  {
    "user": "Maria",
    "rating": 5.0,
    "message": "These shoes go with every outfit. I love the style and the comfort. I recommend 😍😀😃😃"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They are really nice and comfy"
  },
  {
    "user": "G'sMom",
    "rating": 3.0,
    "message": "These do not fit like my more expensive reeboks of the same style and the materials are also cheaper feeling,very slim in the toe box"
  },
  {
    "user": "pamela",
    "rating": 5.0,
    "message": "Son Realmente lindos y comodos, se ven de super calidad!!!"
  },
  {
    "user": "Amber",
    "rating": 3.0,
    "message": "Didn’t like how they made me feel like I was flat footed.and not much comfort when I walk all day long"
  },
  {
    "user": "Luviminda",
    "rating": 3.0,
    "message": "I will return this pair because it is smaller than the normal size. The toe area is narrower than normal or regular size. It looks nice and sturdy though."
  },
  {
    "user": "BK",
    "rating": 3.0,
    "message": "I missed the return date. Would still like to return if possible. Their not comfortable for me."
  },
  {
    "user": "ShopGirl",
    "rating": 3.0,
    "message": "I usually wear a size 6 in shoes, but I ordered these in a size 6.5 because of the reviews, and these are still too small. I don't wear size 7 in any shoes, so there is definitely something wrong with the sizing. Also, I liked the side profile of these shoes but the top of the shoe looks like the old reebok style, and do not look as current in style. I returned."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love them! Classic style and get a lot of compliments on them. Reebok seems to run a little small compared to other brands so I ordered a half size up and it was a perfect fit."
  },
  {
    "user": "Helen",
    "rating": 5.0,
    "message": "I love these Reebok’s. They are my go to day to day sneaker; I ran my first pair into the ground and I have now purchased a second pair. The all white with the tiny green accent is classic and goes with everything. I believe these are true to size, but my new pair is a little bit tight towards the toes, even though I know I bought the same size I had before. Not tight enough to be a concern. They probably just need a little breaking in. I just wouldn’t size down."
  },
  {
    "user": "Kimberly Peralta",
    "rating": 5.0,
    "message": "I loved the shoes a bit snug though overall great design."
  },
  {
    "user": "Elena",
    "rating": 3.0,
    "message": ""
  },
  {
    "user": "Carole Davis",
    "rating": 3.0,
    "message": "I don't think you can say \"100% Synthetic\", then say \"soft leather upper\" in the description.  I was expecting the kind of quality I have always had with Reebok, but this shoe is the most plastic looking shoe I have ever owned.  I have been wearing almost daily for a month now and there isn't even a crease across the toes yet.  Maybe that's a good thing, but they look very synthetic when up close."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I bought these sneakers for my sister as a Christmas present. They are the PERFECT pair of white sneakers. They came crisp and beautiful looking, just like new. Since we are the same size (9.5), I decided to try them on to make sure they fit, and sadly they're a little snug. I feel like they might be okay with thin socks, but anything thick would hurt. I'm not bummed since they're beautiful and she will wear them no matter what, especially since shoes sometimes need to be walked in in order to feel comfortable. So fingers crossed! My advice would be to consider sizing up if you like a comfortable shoe, but take my advice with a grain of salt!"
  },
  {
    "user": "colleen",
    "rating": 5.0,
    "message": "I love these shoes"
  },
  {
    "user": "Lee",
    "rating": 5.0,
    "message": "This is my second pair of Reebok club MEMT sneakers. I purchased a pair for my 13 year old daughter and now a pair for myself. They are super cute and on trend with the white vintage sneaker trend. They look cute with both wide leg and skinny jeans. They are super comfortable too! I ordered the same size 8 I normally wear in Nike and they fit great. I like these better than the club C Reebok sneakers. The club C weren’t as comfortable and were more narrow. My daughter also picked these over Nike Air Force 1s because she said these are more comfortable. All her friends like them too. :)"
  },
  {
    "user": "Sonya Collins",
    "rating": 4.0,
    "message": "Love these! A little uncomfortable at first(just need to be broken in) super stylish and go with everything!"
  },
  {
    "user": "Lyn Morz",
    "rating": 5.0,
    "message": "They were too narrow."
  },
  {
    "user": "Lorrie Renae",
    "rating": 3.0,
    "message": "I might as well hang them from my rear view mirror. My usual size is 6. I put these on and they were at least a full size too small.  Since they are too small to wear, they are not comfortable or offer support."
  },
  {
    "user": "B.E.",
    "rating": 5.0,
    "message": "These were comfortable from the momentI first put them on.  I felt like the shoes was giving my foot a hug. I’ve never been disappointed by Reebok!"
  },
  {
    "user": "Dogs, Cats, and Kids",
    "rating": 4.0,
    "message": "Arrived quickly and the fit is good.  Has good arch support but NO cushion in the heel. Wearing these for walking all day ends up very painful."
  },
  {
    "user": "R",
    "rating": 3.0,
    "message": "Didn't fit correctly so returned them"
  },
  {
    "user": "price",
    "rating": 5.0,
    "message": "Got these as a gift for my 73 year old mother for Christmas and she was so excited she put them own before getting dressed for the day. It was funny see her strutting around in a night gown and sneakers. I might have to get me a pair as well because they are sharp"
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "Good fit and really cushioning."
  },
  {
    "user": "uzlu",
    "rating": 3.0,
    "message": "El diseño del zapato y su calidad no están en discusión, son muy buenos; pero la horma es pequeña, de hecho tuvimos que regalarle el zapato a mi suegra porque a mí esposa (a quien se lo compre) no le quedó, porque la horma es muy pequeña."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great sneakers"
  }
]