[
  {
    "user": "kayla",
    "rating": 5.0,
    "message": "first of all, these are SO CUTE! second, i bought these in size, 9. normally i would buy a 9 wide. but that was not available. when i first put them on i was so surprised because they fit PERFECT. usually with tennis shoes, you have to “break them in” not with these. as soon as you put them on, it’s as if you’ve been wearing them for months! they are sooo comfortable. i’ve never worn shoes that fit so good. i am so shocked. and the fact that they were only $60, even better!!! i am definitely buying these in more colors. so happy with my purchase. there is even extra room for my toes which was surprisingly nice! do yourself a favor and get these!!!"
  },
  {
    "user": "Marie",
    "rating": 4.0,
    "message": "They didn't come in a shoe box, it seems like they were perhaps returned,  but not used- maybe they were tried-on. I agree they run small,  but since I'm a 7& 1/2 to an 8, it's ok. These are great for the gym or running on a treadmill.  But if you like cushioning in your running shoe or run long distances or if your feet swell a bit,  these would not work for you.  I wouldn't wear these on a long pavement walk unless I replaced the insoles. If you like that \"barefoot running\" feel,  these might be ok,  but again,  it depends on the exact shape of your feet, size, or how much they would swell while running. For my purposes of travel, gym, etc,  I like the way they look and I'll be keeping them.  I got the ones that have a \"pink\" logo,  but it's more irradescent-pink-blue- silver,  depending on the angle.  I like that so it works for me."
  },
  {
    "user": "Rayne",
    "rating": 5.0,
    "message": "I originally bought the white pair that had the tie dye hot neon pinkish and blue stretchy straps on it and I love them so much I had to buy a pair in Black. The floral print on the straps is actually a bit larger than what looks like in the picture. The picture made the flowers look a little smaller but they were actually quite big in comparison. If it true to size I wear 10 women's and they fit perfect and I love that I don't I have to mess with laser. I've been trying laces for 30+ years I don't need to prove to anybody that I can lol. they're more of a pain when they keep coming untied, and it's legit just easier to slide them on and not worry about it. I almost bought another pair because the sale that was going on in the moment had dropped like 20 something off the price and it was hard to pass up but then I realized it wasn't in my size at that price so I had to pass it up unfortunately but I will be keeping an eye out for a gray pair because I don't have that color yet and I'm covering my neutrals first lol. I work as an on-site break fix tech so there are some days where I am walking all around different buildings to go fix things and they're comfortable. I feel like I'm like my old Nikes that I replaced with these adidas, my toes have more room to move in the shoe they don't feel super cramped in tight in the toe box. But I also don't really have wide feet I have like average to mildly narrow. I can wear this with very slim no show style socks or even slightly thicker more athletic padded socks and they both feel comfortable. The thick one sometimes even help with making my feet not slide too much cuz I do have to walk up and down a hill sideways sometimes which is awkward on the feet and the thicker socks help with the sliding."
  },
  {
    "user": "Esther Martinez",
    "rating": 5.0,
    "message": "I've had a pair of these before never ordered them off Amazon so i was a bit nervous they fit just a tad big than a usual 8 1/2 but it's not enough to notice it by much rather them be a tad big than a tad small.. i am excited about wearing them i walk a lot in my job,so I'm hoping they do like my last pairs. I love the cloudfoam in the shoe it helps a lot these are the only type of walking shoes i enjoy because i hate tying my shoes i can just slip into them and get going. Im looking forward to buying more colors if the price stays right most definitely will be buying more pairs."
  },
  {
    "user": "Ares Lowe",
    "rating": 5.0,
    "message": "I absolutely love these sneakers. I have them in four different colors. They are super comfy and are good to walk and work out in. Of course you have to be careful with the white but that’s to be expected because, well, ya know, white. If you like Adidas and like comfort, buy these. Just A tip but not THE only tip: Keep checking the prices because they fluctuate drastically. I saw them as high as $61 and change."
  },
  {
    "user": "Katharine Frank",
    "rating": 5.0,
    "message": "I love these shoes! I got them just to try, and I am going to be buying more! They are comfortable to workout in and if you have to be on your feet all day. I am typically a true 9, and these have a little extra room in the toe than I would like."
  },
  {
    "user": "Ashley Zimmer",
    "rating": 4.0,
    "message": "At first they felt weird and not very comfy but then I put thicker socks on and they felt better. I probably just have to get use to them. I’m usually a size 8.5 or 9 and I bought these in an 8.5 and they fit good might get a little loose as they stretch out. I would recommend you go a half size down. Lost of reviews mentioned they run small and I do not think they run small."
  },
  {
    "user": "Liz",
    "rating": 5.0,
    "message": "This is just my first reaction to the shoes…I really like them…a lot!! Arrived yesterday. Fit perfectly. I wear 8.5 in about every shoe (39 EUR), and ordered 8.5 in this one. Slip on easily. Feel very comfortable. I’m so happy with the design, color (black/white) and sharp look. The shoes are casual, but I’m wearing them to my office with casual black slacks and nice top. Also plan to wear them to grandson’s soccer game this week!"
  },
  {
    "user": "Rachel A.",
    "rating": 5.0,
    "message": "My feet are slightly wide and this took a couple wears to get used to the loose and soft feeling but i overall really like the fit. I wear size 9 wife and true to size. No complaints. Easy to match anything to it lol"
  },
  {
    "user": "AAPB",
    "rating": 5.0,
    "message": "I have a pair exactly like these and they were the most comfortable shoes I own. I wore them out walking daily and had to get these when I saw the sale!! These are just a good as the old ones and I've already walked over 2 miles in them today!!"
  },
  {
    "user": "Francine",
    "rating": 4.0,
    "message": "I gave these sneakers 4 stars because they are very cute- they are comfortable but not cushiony. Incredibly light, but honestly, minimal foot support. I would wear these out to run some errands, but not if I was walking around for a long period, and definitely not to work out."
  },
  {
    "user": "Murry",
    "rating": 5.0,
    "message": "So happy I snagged these on sale during Prime Day! They are very comfortable, and do not slip off my foot while walking. I normally wear an 8.5 which is what I ordered and they are perfect for walking around at work."
  },
  {
    "user": "Moon Goddess",
    "rating": 5.0,
    "message": "Comfortable 10/10 They make me feel like I’m walking on clouds and we’ll, I can walk longer in these and my feet don’t hurt. Definitely worth the purchase and but your usual size. Fits as expected"
  },
  {
    "user": "N",
    "rating": 5.0,
    "message": "I have high arches so it’s difficult for me to find comfortable shoes. Many arch supports in shoes aren’t in the right position to support mine, and my arch makes my foot a bit taller so shoes can feel pretty tight. These fit great and are super comfortable. I used to wear Nike’s Revolution 4 running shoes that fit really well, but I couldn’t find them anymore for a decent price. They also had pieces of plastic or something on the heel to keep the heels up straight, which would sometimes give me blisters, especially when the fabric covering them started to wear out after a couple years. These Adidas shoes do not have that. They’re a durable fabric all around and super lightweight. There doesn’t seem to be plastic at the heel, and I’ve never gotten blisters from them even after wearing them long distances. I’ve had them for a few months now and wear them everywhere - school, grocery shopping, walks, etc., they’re great. I also like that they don’t have laces and are easy to put on. I recommend giving them a try, especially if you can try them in a store or use Prime Try Before You Buy / Wardrobe."
  },
  {
    "user": "Reviewsbyme",
    "rating": 5.0,
    "message": "Plenty of give and may run a bit large. Good stretch over bunion area, if that's of interest. Easy slip on and off for travel. The only thing different about them that might bother some wearers is the back but that is rather high"
  },
  {
    "user": "Natnathi",
    "rating": 4.0,
    "message": "I love this slip on edition.  No shoe strings is wonderful! The shoe is just as pictured and very comfortable for my wide feet. My only regret is that there's very little support and cushioning."
  },
  {
    "user": "W Cooper-Porcelli",
    "rating": 5.0,
    "message": "These are so comfortable. I can wear with or without socks and they are equally comfortable. My feet breathe in them and do not get sweaty. I wear them on hikes and just doing daily errands."
  },
  {
    "user": "Diereka",
    "rating": 5.0,
    "message": "They are easy to put on and look super cute! They have built in memory foam however it doesn’t go all the way to the toes which that may just be a thing 🤷🏾‍♀️overall I love them!"
  },
  {
    "user": "Brenda",
    "rating": 5.0,
    "message": "I love the shoes, but they run about one size bigger the other brands. Not sure if I’ll try to make them fit with thick socks, or return for smaller size. They crinkle up in the front from being to big!"
  },
  {
    "user": "MLewis75",
    "rating": 5.0,
    "message": "I'm a nurse and these are some of the most  comfortable sneakers I have ever worn. I will definitely be buying another pair!"
  },
  {
    "user": "Uindygrad",
    "rating": 5.0,
    "message": "Wore these right out of the box to an all-day festival and my feet did not hurt once! Super cute and comfy!!"
  },
  {
    "user": "Marquetta Epps",
    "rating": 5.0,
    "message": "I bought these for a outfit for Halloween party and said let me break them in, other than being a tad big (go down a 1/2 size is my suggestion, I don’t want to take them off. I’m a furry baby mom and I walked my baby in them and they are floaters I love them!"
  },
  {
    "user": "Megan",
    "rating": 5.0,
    "message": "I buy addidas for work, and I'm never disappointed. There always good quality and very comfortable."
  },
  {
    "user": "Norra",
    "rating": 4.0,
    "message": "These sneakers are comfortable and form fitting! My only complaint is the sole gap on the front. It’ll take some time getting used to."
  },
  {
    "user": "Audriana",
    "rating": 5.0,
    "message": "I love these shoes. I've had them for a week and have worn them inside, outside, walking, on uneven ground - these really are quick to pop on, no laces, and just go. I love the arch support for my high arches."
  },
  {
    "user": "Molly Dieck",
    "rating": 4.0,
    "message": "I’m a nurse and these are nice for working 12 hour shifts."
  },
  {
    "user": "Ramsha bhattha",
    "rating": 5.0,
    "message": "I ordered these shoes when I was in a pickle rigth before a trip. I trust adidas as a brand and so i went for these simple yet promising shoes. I was not disappointed at all. I have walked for hours and hours in these during travel and sight seeing. the sole is soft and provides good cushion. definetly recommend for a daily walking shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Cute and generally comfortable! They do have a pretty hard sole that needs breaking-in, though."
  },
  {
    "user": "Desi",
    "rating": 5.0,
    "message": "These are perfect 👌🏼!! They make my work day go sooo much better! I put cushion work inserts in them and they still light. I love that I don’t have to tie my shoes"
  },
  {
    "user": "Melanie E Westog",
    "rating": 5.0,
    "message": "I bought these because they looked easy to put on when taking my dog out.  My daughter also bought a pair and liked hers.  They are comfortable and supportive.  They fit true to size"
  },
  {
    "user": "Karissa Hernandez",
    "rating": 5.0,
    "message": "Super comfortable and looks just like the pic def gonna buy in more colors"
  },
  {
    "user": "freddy",
    "rating": 5.0,
    "message": "These shoes are super cute and comfy. I bought these for long walk days and they do not disappoint. I would not suggest these shoes for hard workouts or runs but great for walking. Make sure to size down one size for a good fit. Highly recommend!!"
  },
  {
    "user": "ILoveBooksSue",
    "rating": 5.0,
    "message": "Ok, I'll admit that I was worried these wouldn't fit because when I got them and I tried to put my foot into it, I just couldn't get it there. I was disappointed and so sad but hope won out. With a little effort and some stretching of the elastic straps across the top, I was able to slide my foot right in and it was like sliding into a well made glove. These are now my favorite shoe! I have put more than 20 miles on them already and will be buying another pair."
  },
  {
    "user": "albertha",
    "rating": 5.0,
    "message": "I like the comfort of the shoes and the design."
  },
  {
    "user": "rose",
    "rating": 5.0,
    "message": "Love the shoes and very comfortable to use."
  },
  {
    "user": "Owls Roost",
    "rating": 5.0,
    "message": "I am on my 5th pair of these shoes. I like the inner soles padding and the fit. I love being able to slip them on. These shoes may not be for everyone but I certainly like them. I walk on the treadmill at the gym almost daily. Great comfortable shoes."
  },
  {
    "user": "Jibi John",
    "rating": 5.0,
    "message": "Just coming back from a MS stroke could not find a pair of sturdy shoes till I got these makes me happy and excited wanted to cry ty adidas for letting me see hope!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Usually I’m size 7 but these trainers are very tight. Half size up would be much better."
  },
  {
    "user": "Elizabeth H",
    "rating": 4.0,
    "message": "I bought this because I saw it was on sale for $25 and I was stoked. However when I tried it on and walked around, the heel area felt like it was slipping up and down as I stepped, which did not invoke a feeling of confidence when walking. Furthermore, it felt longer than my usual foot size. I have a shoe size of between 6.5-7, and I also have an Adidas Advantage in 6.5 which fits like a glove. This was a bit larger than 6.5, so I might want to try a 6. Again, this may be due to the lack of laces and the fact that I have skinny ankles lol. Will return and try a size down. ;) Otherwise, a sleek and cool looking shoe, with nice padding."
  },
  {
    "user": "Shimin Bao",
    "rating": 5.0,
    "message": "Omg, those straps are not for decoration!!  They are compressing the arches of the feet to make them SUPER comfortable to wear! The soles of the shoes aren’t that thick, so o don’t know how they will perform during running or jogging. But for daily working, I walk a lot, they are PERFECT! The best is the material is soft and run slightly larger than Nikes, they don’t cut into my heels. I can’t wait to buy my mom some!"
  },
  {
    "user": "Aleah Mitchell",
    "rating": 5.0,
    "message": "Love these for walks/ runs.  Looks great with casual or lounge wear."
  },
  {
    "user": "Ana Dabrundashvili",
    "rating": 5.0,
    "message": "It's really comfortable, for walking, but not sure about running"
  },
  {
    "user": "jaycee",
    "rating": 4.0,
    "message": "These shoes are exactly what they look like, great comfort and look but I have bought two different colors in the same style now and both have been a half size too big when I wear the same size in the lace up shoes. For some reason the slip on style is just a half size bigger so order down."
  },
  {
    "user": "SnoopyHJ",
    "rating": 5.0,
    "message": "These are great shoes, super comfortable.  However I normally wear a size 8 1/2, so that's what I ordered but they are actually around 1/2 a size too big.  I'm not going to return them, but just a heads up that they do run slightly bigger in length. Overall I am happy with them though."
  },
  {
    "user": "Alyssa",
    "rating": 5.0,
    "message": "Ordered my normal size, and 8, but had to return and order a 7.5 instead. Fits much better, and they are comfy, but my feet get very warm while wearing."
  },
  {
    "user": "Reba",
    "rating": 5.0,
    "message": "I ordered for walking, support and comfort. They seem to be perfect"
  },
  {
    "user": "ladyjazzie",
    "rating": 4.0,
    "message": "WOULD BUY AGAIN"
  },
  {
    "user": "Joan Toussaint",
    "rating": 5.0,
    "message": "Fits as expected, great support and the no laces makes it easy to put on"
  },
  {
    "user": "Margaret Jones",
    "rating": 4.0,
    "message": "Everyday use!"
  },
  {
    "user": "Kari L.",
    "rating": 5.0,
    "message": "Highly recommend.  SO cute and fit true to size."
  },
  {
    "user": "Carey",
    "rating": 4.0,
    "message": "They are supportive and light. Being on my feet all day, that is necessary"
  },
  {
    "user": "sandra Kirckpatrick (",
    "rating": 5.0,
    "message": "I have big problems with my feet. That said, these shoes are great.  Until I can find a different pair, this is the second pair I have purchased."
  },
  {
    "user": "c",
    "rating": 4.0,
    "message": "These shoes are definitely very cute and have a slick look! I used some inserts with them and they were comfortable enough to walk around town for a few hours. I am not as big of a fan of how high on the ankle the front piece is. When walking, it rubs against the front of the ankle."
  },
  {
    "user": "Brittany",
    "rating": 5.0,
    "message": "Love everything about this shoe. Very comfy, light weight and soft. Breathable material. Perfect fit."
  },
  {
    "user": "Lisa K Payton",
    "rating": 5.0,
    "message": "Love the color"
  },
  {
    "user": "Lesa Hodge",
    "rating": 4.0,
    "message": "I bought them because I wanted some I didn't have to tie up. Good comfort shoes."
  },
  {
    "user": "Sammie",
    "rating": 5.0,
    "message": "Would buy again."
  },
  {
    "user": "vickie mchenry",
    "rating": 5.0,
    "message": "Everything"
  },
  {
    "user": "WildThornberrysDecor",
    "rating": 4.0,
    "message": "I love these shoes! Comfortable and light weight. I will say they are a tad more snug than my other pair of adidas but not to were I would size up. I think they will stretch as I wear them in. They did come with a stain on them straight out the box but I was able to remove it fairly easy. Would buy again"
  },
  {
    "user": "Bevel",
    "rating": 5.0,
    "message": "I love my Adidas.  They are comfortable, easy to slip into, great quality for work and leisure. I'm satisfied I got a good deal for the price."
  },
  {
    "user": "Nick Shirley",
    "rating": 5.0,
    "message": "I work in dental so having shoes with no shoes strings is perfect and they have the cloud sole so it’s heaven on my feet"
  },
  {
    "user": "Twai33",
    "rating": 4.0,
    "message": "Great shoe, quick & easy to slip on and off. Comfortable I was surprised this adidas shoe was narrow. It was tight around the sides so I got a bigger size. Went up to a size 8, it fit better but it seems the shoe is a narrow fit. I still like the shoe, its easy to slip on and off, and its a classy looking white shoe."
  },
  {
    "user": "MC",
    "rating": 5.0,
    "message": "Best money I have spent on shoes"
  },
  {
    "user": "Teresa",
    "rating": 5.0,
    "message": "Horrible shoes and cheaply made. Wore 2X and the strap is coming off already."
  },
  {
    "user": "wendy alvarez",
    "rating": 5.0,
    "message": "Divinos quedan muy y son muy cómodos los"
  },
  {
    "user": "teri",
    "rating": 5.0,
    "message": "I can now go for my walks with out crying feet"
  },
  {
    "user": "Dionna",
    "rating": 4.0,
    "message": "Love the shoe but they only sent 1 shoe I have 2 feet"
  },
  {
    "user": "Marilynn Mckerracher",
    "rating": 5.0,
    "message": "love these shoes. I’m not real into “trending” products but these comfy, long lasting shoes, that are easy to put on, have been a eye catcher to all my peers."
  },
  {
    "user": "10Loves",
    "rating": 5.0,
    "message": "Liked everything about these sneakers.  Fit was spot on. No flipping when I walk.  Great support style. Love that I can slip on as I have RA mobility problem. So no shoe ties or hard to open velcro."
  },
  {
    "user": "emily",
    "rating": 5.0,
    "message": "These shoes are everything!  I usually do not buy shoes online since I like trying them on first but these were on a lightning deal so I couldn't pass up the price!  I received them and they fit perfectly!  They are so adorable I have received so many compliments on them already!  These are also very comfortable which is a win!  Absolutely recommend!"
  },
  {
    "user": "EB",
    "rating": 5.0,
    "message": "super comfortable"
  },
  {
    "user": "Rhonda Reese",
    "rating": 5.0,
    "message": "Very comfortable shoes for casual walking."
  },
  {
    "user": "Micah Proctor",
    "rating": 5.0,
    "message": "Really comfy! True to size."
  },
  {
    "user": "latinavaquerita",
    "rating": 5.0,
    "message": "I was needing a pair of sneakers for walking around on vacation and these are so nice! I got the black and white which were on sale for $39, such a bargain because I would have paid more. I am going to get another pair in a fun colour next. Excellent buy. Fit was true to size."
  },
  {
    "user": "Heidy Serrano",
    "rating": 5.0,
    "message": "These shoes are true to size the insoles are amazing like walking in a cloud they contour to your feet."
  },
  {
    "user": "StarGaze09",
    "rating": 4.0,
    "message": "As we all know, sizing varies based on the different brands of footwear. Here is some info to hopefully help you decide which size is best for you in this sneaker: • I am a 7.5 in Converse, Women Nikes, Skechers, and Keds. • In old navy flip flops I go for an 8. • In crocs I’m a 7 I ordered these Adidas in a size 7.5 for a Run I’m doing and they are a half size too big. I won’t be able to get the correct size so I’m just going to keep these. However, I provided a picture to show that I have about an inch of toe space from the top of my toe to the tip of the sneaker. A 7 would be perfect. I will update this picture with length measurement for better decision making for customers. Overall it a comfortable sneaker, very light on my foot, just the right amount of snug, and doesn’t make my feet sweat."
  },
  {
    "user": "Carolyn",
    "rating": 5.0,
    "message": "Confort"
  },
  {
    "user": "Grimey Dimey",
    "rating": 4.0,
    "message": "Flexible yet durable. I was a delivery driver so I moved around a lot of different terrain. They didn't betray me by rolling my ankle. A lot of sneakers will not move over rough terrain without hurting ankles. These are trustworthy and comfortable. Very pleased 😊"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "They’re very cute but the toe box is huge. The rest of the shoe fits well. I got my usual size."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are so comfortable and such amazing Quality. They are true to size."
  },
  {
    "user": "Tammy Winchell",
    "rating": 5.0,
    "message": "These are nice Adidas shoes they are comfortable and nice looking."
  },
  {
    "user": "Preet",
    "rating": 4.0,
    "message": "Like these shoes. I don’t think so they’re good for workout. But Best for walk."
  },
  {
    "user": "Jeannette",
    "rating": 4.0,
    "message": "Good sneaker for the money—-does run narrow."
  },
  {
    "user": "Heddy J.",
    "rating": 5.0,
    "message": "These shoes are comfortable, easy to slide on and off, love thar there are no laces to mess with, the soles provide just enough comfort, the toe box is riy and doesn't restrict toes which is helpful while lifting weights, and the soles are minimal and provide a good solid base for balancing while weight lifting. They wear out faster than other shoes but worth it for the benefits and price. I've has 5 pair already and will continue buying them."
  },
  {
    "user": "Kayla",
    "rating": 4.0,
    "message": "I would order a size smaller because the sizing is definitely not accurate."
  },
  {
    "user": "Brooklynn maki",
    "rating": 5.0,
    "message": "I absolutely love these shoes and will buy more. They fit perfectly and as a 6’2” (188cm) woman I have particularly large feet and having the right size in a woman’s shoe makes all the difference. Shipped super fast and living in Alaska that shocked me how fast they were here. Much appreciated. Anywho that’s all just buy them you know you want to love. Treat yourself they are amazing."
  },
  {
    "user": "tomionia",
    "rating": 5.0,
    "message": "It is very light and comfortable. Good for gym workout"
  },
  {
    "user": "Tere",
    "rating": 5.0,
    "message": "Love them! They are stylish and comfy and look great!"
  },
  {
    "user": "Rawrlz",
    "rating": 5.0,
    "message": "I was hesitiant on getting these and after a few months of wearing them daily, I hecking love them so much and will only ever get these slip-on ones from now on!"
  },
  {
    "user": "Monica W",
    "rating": 5.0,
    "message": "I bought this shoe to wear to work. I work in the healthcare field and they are very comfortable. I stand for about 8-12 hours 4 days a week. No complaints here except they run a little smaller. I wear a size 8 and had to send back for a size 9."
  },
  {
    "user": "Eshatfield",
    "rating": 4.0,
    "message": "The shoe looks great. I wish it had better support."
  },
  {
    "user": "Jennifer",
    "rating": 5.0,
    "message": "Love these sneakers! They are so comfortable and affordable!!"
  },
  {
    "user": "LoveLea88",
    "rating": 5.0,
    "message": "There’s enough room for socks."
  },
  {
    "user": "Jacqueline",
    "rating": 5.0,
    "message": "These shoes are extremely comfortable and true to size. They work great for the treadmill (have not tried running outside) as well as walking around."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I'm in love with these shoes. They are so freaking comfortable that I can wear them all day. I also like the look but comfort is my main priority and these shoes provide support and feel soft."
  },
  {
    "user": "amy Cruz",
    "rating": 4.0,
    "message": "Very comfortable. Glad I bought them"
  },
  {
    "user": "AT",
    "rating": 5.0,
    "message": "Soft and comfortable shoes. Easy to wear."
  },
  {
    "user": "Christie",
    "rating": 5.0,
    "message": "If you are a size 8, just get a size 8. I sized down to a 7.5 because of the comments and they were too small."
  },
  {
    "user": "M Malady",
    "rating": 5.0,
    "message": "I have been buying different shoes every 3 months for many years! This adidas shoe may be the best I’ve ever had! I purchased them in black as well! They are supportive and very comfortable!"
  },
  {
    "user": "Nicole Kuo",
    "rating": 5.0,
    "message": "cozy & comfortable to wear"
  }
]