[
  {
    "user": "deborah estensen",
    "rating": 4.0,
    "message": "The shoes are slip on and did not work for me but may be great for others."
  },
  {
    "user": "Dawn J. Douglas",
    "rating": 5.0,
    "message": "I own five pairs of these shoes. I match them with my work shirts. I get compliments on them every day. The colors are vibrant. They are super comfortable. Everyone thinks they are expensive Nike brand because they are so well put together. The tongue says \"LOVE\" which is awesome. I loved the first pair so much, I bought them all other colors except purple and white. The orange goes with my WNBA sweatshirt. It's a win win - Price you can't beat; quality and superfast shipment."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I read all the comments before ordering and had to size up to a 9 because I'm normally wear a 8 1/2 but they don't offer that size.They are light weight and still remained very comfortable after wearing all day.I ordered the neon green and the color was as shown but the back of the shoe is a little lose fitting."
  },
  {
    "user": "Confirmed Customer",
    "rating": 5.0,
    "message": "They fit like a glove and are great for walking and working out! Relieves pressure on my knees and feet! They're cute too!!!"
  },
  {
    "user": "Jennifer Martin",
    "rating": 5.0,
    "message": "I absolutely love these. I have yo stretch the back to get on but once on they are super comfy"
  },
  {
    "user": "Patty Murray",
    "rating": 4.0,
    "message": "These shoes are exactly the color I needed.  I wouldn't wear them to run in due to the sole and the lack of support, however, they are my school's colors and I teach in them, so they serve a purpose and are comfortable."
  },
  {
    "user": "Gigi",
    "rating": 5.0,
    "message": "I have had So Many Complaints on these Tennis Shoes. They fit Wonderfully and have that Spark of Brightness that's Definitely Eye Catching. I make a joke about how bright they are... Telling my Patients that these draw everyone's Eyes and Attention to my feet so they don't Notice my Plump Midsection.  A Definite must Buy! Ps: I wore these when I went to visit my Grandchildren and Left without them. Yes, my Grandson Absolutely Inherented them... So I purchased another pair for me."
  },
  {
    "user": "Natalie",
    "rating": 4.0,
    "message": "They are cute"
  },
  {
    "user": "Ali",
    "rating": 5.0,
    "message": "Awesome shoes.. I get compliments constantly"
  },
  {
    "user": "Lisa Johnson",
    "rating": 5.0,
    "message": "I love this"
  },
  {
    "user": "kevin vanderlaan",
    "rating": 5.0,
    "message": "I am on my feet sometimes 15 hours a day. My feet used to hurt so bad when I got home, but these shoes make it feel like someone is rubbing my feet all day and the light weight of them out less strain on my legs and knees for the price it's definitely a 5 star product."
  },
  {
    "user": "sara",
    "rating": 4.0,
    "message": "Initially purchased for my mom who wears size 11 due to neuropathy.  The shoes have plenty of shock absorbtion, are very lightweight, and fashionable but the built in \"sock\" is too narrow for wide toe boxes and make it difficult to donn.  I tried them on and they fit fine and we're very comfortable, I do not require wide toe box and wear between 10-11 depending on brand."
  },
  {
    "user": "Ellan",
    "rating": 5.0,
    "message": "Love the orange & the comfort!"
  },
  {
    "user": "Emily",
    "rating": 4.0,
    "message": "I really liked these shoes but the support is not there for my feet. I have plantar faucitis and need more arch support than they provide. I normally size up on shoes and place my inserts in for more arch support. I wear a 9.5 and do 10 to make room for my insert but these shoes run a half size small. So if your normally a size 9.5 with out inserts get a ten. They are also narrow which is fine for my feet but not for wide feet. I'm sending them back and getting a half larger."
  },
  {
    "user": "Upset consumer",
    "rating": 4.0,
    "message": "Super cute shoe!! Picture doesn’t do the shoe justice at all!! I purchased the shoe for working out but sadly not comfortable for simple workouts but comfortable to walk around"
  },
  {
    "user": "James",
    "rating": 5.0,
    "message": "These shoes surprised me!  I was expecting another lame pair of shoes and was pleasantly surprised with the quality and comfort"
  },
  {
    "user": "Ms. Wright",
    "rating": 4.0,
    "message": "I first ordered a size 10, which is what I wear. They came and was too small. I was bummed because they claim they are \"true to size\" but I immediately got online to order a size up. Would liked to have been able to order a 10 1/2 but alas so many seller of shoes stop half sizes at 9 1/2 which is bizarre to me. Anyway, I got the size 11 today and immediately tried them because if I was going to return both I want to make one trip. As expected - the 11's are a tad too big, however - I would prefer a bigger sports shoe to a smaller one. So, I will be keeping the 11's and returning the 10's. So far (I wore them around the house today as I worked from home and they seem comfortable so far. I bought them to wear this weekend so hopefully, they are comfortable and last."
  },
  {
    "user": "glinda121",
    "rating": 5.0,
    "message": "I love these shoes. I'm about to order more colors. They are very comfortable.  They wasn't very comfortable on the first few wears.  I had to break them in"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I love these shoes.  The color I amazing.  I started running in them and my feet feel good.  I am very happy with my purchase."
  },
  {
    "user": "D.Williamson",
    "rating": 5.0,
    "message": "Lite weight, comfortable shoe for on the go!"
  },
  {
    "user": "Darla J Ehlers",
    "rating": 3.0,
    "message": "They're okay, not uncomfortable..., they have a tap or cloppy sound on hard walking services. Not what I expected as far as comfort and softer sole."
  },
  {
    "user": "Brayden Hughes",
    "rating": 4.0,
    "message": "Very stylish and lightweight"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are really  comfortable when broken in"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These sneakers are comfortable, washable and good looking. I get compliments whenever I were them!!"
  },
  {
    "user": "Debbie Lovett",
    "rating": 3.0,
    "message": "Not any support.  Plus they need half sizes as they run larger than regular sizing.  I ordered my regular size 8 and they are too big.  Was going to return for a 7 1/2 but saw they didn’t have half sizes.  I do like the color (got the neon orange).  I also love how light they are."
  },
  {
    "user": "Davida",
    "rating": 3.0,
    "message": "The shoe is very pretty but it is difficult to put on because of the fact that the tongue is attached to the shoe. It is comfortable enough to walk but not to run."
  },
  {
    "user": "Heather L Schiradelly",
    "rating": 5.0,
    "message": "Love the look.  I’ve gotten a ton of compliments.  I did buy inserts for more support.  Definitely worth the price."
  },
  {
    "user": "KimWatson",
    "rating": 3.0,
    "message": "I hate I couldn't wear them! They came super fast and were really pretty. They just did not fit!"
  },
  {
    "user": "Kay",
    "rating": 3.0,
    "message": "It was to tight for me feet"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Didn’t feel good. I ordered a different style for my daughter. I’m returning these and getting hers"
  },
  {
    "user": "Jasden Williams",
    "rating": 4.0,
    "message": "The shoes are cute and came in quick. They run a smidge small so I would say order a half  size up. Not a lot of cushion in the insoles but will do if you are wearing them for fashion and not running or walking for a long period of time."
  },
  {
    "user": "elaine",
    "rating": 4.0,
    "message": "These shoes are great, once you cut that strap off the back. I literally couldn't even get them on my feet with that on, it doesn't allow any bend or give to finagle your foot in. I cut them off with nail scissors and they become comfortable and cute shoes. I couldn't give them a full 5 stars because of the strap but besides that I love them. I just bought a second pair because my first white pair got really dirty."
  },
  {
    "user": "Dayna McCain",
    "rating": 4.0,
    "message": "I love the shoe but I think it runs small. I wear a 6 but I need a 6.5."
  },
  {
    "user": "Ocean",
    "rating": 3.0,
    "message": "Very cute, fancy looking sneakers. Receiving LOTS of compliments. However, not comfortable. Insoles are a bit hard. Had to purchase a Dr. Scholl insole which made it way more comfortable for me. Also, you cannot adjust the strings/laces to your fit (that’s if you need them to adjust to your feet tighter), but with proper sizing/fit, it’s not necessary."
  },
  {
    "user": "Yunisleydis Del Carmen Silva Agosto",
    "rating": 4.0,
    "message": "Si"
  },
  {
    "user": "kitamoma",
    "rating": 5.0,
    "message": "They are really cute shoes. I first bought them for work (I work for Amazon) but then I felt they was too cute for work. I think I should have got a size up. I wear 8 but I should have got a 8 in a half."
  },
  {
    "user": "Lynn Michel",
    "rating": 5.0,
    "message": "Wasn’t sure since the price is cheap!  Well I now own 3 pairs!!!  Blue/green, Black/red and the neon Green!  Super comfy, love that they just slip on don’t have to tie them.  I clean rental cabins for a living so I’m on my feet all day.  First pair of shoes that my feet don’t hurt at the end of the day from running up and down stairs and non stop for 7 hrs!!!  I will buy more!!!"
  },
  {
    "user": "Sebrina Bradford",
    "rating": 5.0,
    "message": "Nice shoes"
  },
  {
    "user": "Heather",
    "rating": 3.0,
    "message": "I like these shoes, just expected them to be more comfortable than they actually are. I work 12 hour shifts & the soles don’t have as much cushion as I expected. They are lightweight, and they look nice.. I would suggest maybe sizing up by half a size.. I’m a size 8 I might have gotten a more comfortable fit if I would’ve gotten an 8.5. I’m pretty much satisfied with the shoe overall.. just not the right shoe for everyday wear."
  },
  {
    "user": "Lesharn Anderson",
    "rating": 5.0,
    "message": "I like those Shoes because they seem to have good Support and would support my back and Knees. I had two knee surgery, I was looking for a good pair of shoes too work in. I have these Shoes still in the Shipping bag. I could return them in exchange for something else. Thank You"
  },
  {
    "user": "Denise Raspberry",
    "rating": 4.0,
    "message": "The heel area needs to be a little deeper because your foot may slip out."
  },
  {
    "user": "sandra",
    "rating": 5.0,
    "message": "Comfort and love good."
  },
  {
    "user": "Fabiana",
    "rating": 5.0,
    "message": "Great tennis Shoes for the price. Surpassed my expectations! Lightweight, comfortable just like my Nike’s that I paid almost $200 for it and this one is a fraction of the price. Thank you!"
  },
  {
    "user": "Na Na",
    "rating": 3.0,
    "message": "Probably a decent shoe, just runs small.  Unable to wear have to give away."
  },
  {
    "user": "kim",
    "rating": 4.0,
    "message": "I REALLLY LIKE THIS SNEAKER.  I LOVE THE COLOR, THE FIT WAS TIGHT IN THE BEGINNING. IT'S LIGHT WEIGHT AND COMFORTABLE, ONCE U BREAK THE SHOE IN."
  },
  {
    "user": "Tonniesha",
    "rating": 5.0,
    "message": "I like the shoes… the only draw back is they can get dirty easily and I hope when I wash them they still fit and look good."
  },
  {
    "user": "Deborah L. Lee",
    "rating": 4.0,
    "message": "I was looking for a brown sneakers and I came across these. I liked the style and the colors so I brought 3 pair. They are very comfortable and light weight. Love these sneaker."
  },
  {
    "user": "sherry wolf",
    "rating": 3.0,
    "message": "The back of the shoe is flimsy which makes getting it on the foot difficult also the support inside the shoe is much less than the so-so shoes. your feet really feel it after a day on your feet."
  },
  {
    "user": "amanda",
    "rating": 4.0,
    "message": "Sizing runs a bit large. An inexpensive shoe for just hanging out or doing chores."
  },
  {
    "user": "Barbra Neis",
    "rating": 4.0,
    "message": "I really thought these would have the same awesome padded insole as the Just SoSo shoes but they do not. So cute though and lightweight."
  },
  {
    "user": "PhePhe",
    "rating": 4.0,
    "message": "Would purchase more in different colors. Very comfortable and stylish."
  },
  {
    "user": "April",
    "rating": 5.0,
    "message": "I loved these shoes so much I bought a second pair and the third pair are in my basket for another purchase. They are comfortable I’m on my feet all day taking care of patients at doctors office, floors are hard tile and these don’t kill my feet. I am normally a Nike only girl but I gave these a chance and I love them. I will continue to buy until they are no longer available. Great show for the money and comfortable fits true to size as I ware a 10 no problems here."
  },
  {
    "user": "elaine johnson",
    "rating": 5.0,
    "message": "THEY ARE HARD TO GET ON BECAUSE THE LACES DON'T OPEN"
  },
  {
    "user": "Mia Williams",
    "rating": 5.0,
    "message": "The color and feel of shoe that distributes accurate amount of body weight evenly for walking."
  },
  {
    "user": "Jazmine Bryant",
    "rating": 5.0,
    "message": "I use These shoes to work out/ walk/run!! Super comfortable and I always get compliments!!"
  },
  {
    "user": "Norma bruneau",
    "rating": 5.0,
    "message": "There very nice"
  },
  {
    "user": "Leora Allen",
    "rating": 3.0,
    "message": "I wear a size 11 shoe, and I ordered a size 11, and these were more like a size 10. Very snug shoe. Hard to put on. Maybe if they were a TRUE size 11 than they would fit better. Not easy to put on at all."
  },
  {
    "user": "Danielle B.",
    "rating": 5.0,
    "message": "Great support and comfort. It felt like I was walking on clouds ☁️ ☁️☁️"
  },
  {
    "user": "Simply Sondra",
    "rating": 4.0,
    "message": "I will you have given this review 5 stars but….The shoes are comfortable but my shoes were mismatched, not the size but the style.  I had different wording on the back of each shoe.  Not sure if that was intentional but for the price I just took one for the home team.  The color was vibrant and definitely an eye catcher.  Hopefully they will correct sendIng mismatched shoes."
  },
  {
    "user": "Cleone barbosa",
    "rating": 3.0,
    "message": "I need another more bigger thanks"
  },
  {
    "user": "J",
    "rating": 4.0,
    "message": "It took a few decently long walks before they felt comfortable but once they “broke in” they were great. After looking at the bottom, you can see where they “broke in”! That rubber section was really awkward feeling until it wore down a little. I feel like they’re not going to last very long based on how that happened but for now I do like them. This was right after a trip throw the washing machine also. For the price, they’re good and I like how sporty they look. Worth a try but you have to commit to wearing them until they’re comfortable."
  },
  {
    "user": "Indy",
    "rating": 4.0,
    "message": "I had the take the inside out to fit them. They cute but please order a size up and if u keep the insole in, order two sizes up"
  },
  {
    "user": "Kerri L Wilson",
    "rating": 4.0,
    "message": "Absolutely LOVE these shoes!  I bought a pair for each of my children and a couple grandkids.  I added a PoweStep Pulse insert because I use them but the support is still great without an insert.  ❤️"
  },
  {
    "user": "Penny",
    "rating": 3.0,
    "message": "I get compliments on these all the time. Here's the problem: way, WAY too tight around the opening. The only way I can get them on is to thread a sturdy, solid item through the loops on the back to pull them on. Once on, they fit and feel great. Took a few times to get used to how the bottom feels when I walk. Loosen up that opening, maybe make it more stretchy so it's easy on and the rating goes to 5. The small opening and difficulty of getting them on is what makes it a 3."
  },
  {
    "user": "Sonia Mejia",
    "rating": 4.0,
    "message": "Sin muy confortables , y livianos pero por alguna razón cuesta ponérselos es mejor ordenar una talla más de la que usualmente usas son pequeños y si tú pie es grueso no los recomiendo, pero por lo demás están buenos"
  },
  {
    "user": "Gapetta Smith",
    "rating": 4.0,
    "message": "Amazing color a lot of compliments! But they don’t come in half sizes but still fits good enough"
  },
  {
    "user": "cowgirl",
    "rating": 5.0,
    "message": "Nice shoes for comfort to walk in and very stylish. I will purchase them from the store anytime 😊"
  },
  {
    "user": "Kereen Fisher LLC",
    "rating": 4.0,
    "message": "Overall it fits great after the struggling to get it on. If you have wide feet, you will have a hard time getting it on."
  },
  {
    "user": "taylore",
    "rating": 5.0,
    "message": "So I have arthritis in my foot. I have tried OC shoes, new balance, fila and these shoes are the most comfortable shoe I’ve had in a long time. My family and friends all have them. Don’t be afraid of the colors either they are so cute"
  },
  {
    "user": "Kat",
    "rating": 4.0,
    "message": "The media could not be loaded. loved them at first the fit was great love the style, but after a couple months the sole a weird break down and started disappearing now it feels like I have something on the bottom of the shoe like tiny rocks but nothing is there but the area wearing away, I may have a couple wears left out of them, then they'd be trashed. I got them October last year....ill add a pic of soles later."
  },
  {
    "user": "Vicki9",
    "rating": 4.0,
    "message": "These shoes will be noticed! All the colors are really vibrant. I’ve been buying 1/2 size up for my work shoes. These fit like my normal size, but I’m keeping them because they are comfortable for normal wear and I love the color! They would not work on the cement floor where I work for the 8-10 hour shift Perhaps if they came in wide that would make the difference? I also cut the ribbon off the back because it kept twisting and hurting my feet.  They were very comfy after I did that and easier to put on."
  },
  {
    "user": "Shay hill",
    "rating": 5.0,
    "message": "They are very comfortable in light"
  },
  {
    "user": "Lynn",
    "rating": 4.0,
    "message": "I bought the shoe one size larger. The only down side is the tongue of the shoe is sewn to the side, which makes it difficult to put on.  Overall this is a great shoe if your on your feet for long hours"
  },
  {
    "user": "H DeGrossa",
    "rating": 4.0,
    "message": "Love the color, lightweight and stylish!"
  },
  {
    "user": "yinka adeyemi",
    "rating": 4.0,
    "message": "I have received so many compliments on these shoes. They're comfortable and literally slide on like a sock. Doesn't feel like your feet are trapped in hot bulky sneakers. Have em in pink and yellow. Will continue to add to my collection ☺️"
  },
  {
    "user": "Kathy C",
    "rating": 5.0,
    "message": "Takes the pressure off the ball of the foot"
  },
  {
    "user": "Donna",
    "rating": 5.0,
    "message": "These are so comfortable.  I wear them at work."
  },
  {
    "user": "Gustavo Perez",
    "rating": 5.0,
    "message": "Cool sneakers"
  },
  {
    "user": "Kristine McLemore",
    "rating": 3.0,
    "message": "unfortunately I'm sending these back. They are super cute and I feel like they would be comfy but they don't fit. I usually wear a 8 1/2 or 9. I ordered the 9 and my toe is at the end. I know I don't need to go up an entire size and they don't have half size so I guess I'm on the hunt for a different pair. Bummer though because they are super cute and light weight."
  },
  {
    "user": "Christina Maniak",
    "rating": 5.0,
    "message": "Bought for work. I work 10 hour shifts. I paired these with the Dr Scholl's work insoles. Omg comfy"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "My husband got these for me and they are very comfortable.  The fit is awesome as they might be a hair big.  I normally wear an 8.5 and he bought these in 8 and fit perfect."
  },
  {
    "user": "Karolyn Adams",
    "rating": 5.0,
    "message": "I Love this shoe!!! I love the color and plan to buy more colors! I wear a size 9 and it fits very well. Not too loose or too snug,  just right! Im sure if you have wider feet though you may size up one. They're a GREAT buy!!"
  },
  {
    "user": "Natalie Marie",
    "rating": 5.0,
    "message": "I took a gamble buying these off brands and I'm so happy I did.  I have a pair of $130 name brands and they are not half as comfortable as these are especially for all day wear!! I went back online to order 3 more colors.  I will have a field day at the gym with these.  Already getting compliments like crazy!"
  },
  {
    "user": "Amanda",
    "rating": 2.0,
    "message": "I’m on my feet half the night and these shoes are so bad I had to Replace the insoles and buy a ball of your foot insole so the uneven part would stop hurting. I couldn’t hardly walk from the pain by the time I left work before I figured out how to fix the problems. I gave it 2 stars because I get a lot of compliments on how cute they are."
  },
  {
    "user": "Heather White",
    "rating": 5.0,
    "message": "I’ve been buying the “Just So So” brand shoes for a minute. This was my first time buying this type from what I believe is the same manufacturer. But I prefer these to the Just So So’s. They’re slim, lightweight and super comfy!"
  },
  {
    "user": "D.Y.H.W.",
    "rating": 4.0,
    "message": "So I have a wide foot and I'm a plus size woman, size 20. I purchased a 10 and it was big in the toe area BUT snug on the sides. I took the foam insert out, which will help with this OR you can not wear socks OR take out the insert and not wear socks. I'm a stay at home mom of four and have plenty Nike and Jordan's I wear so I will only wear these when I'm running the kids to school or matching an outfit."
  },
  {
    "user": "Tiara",
    "rating": 4.0,
    "message": "I love the color of the shoe"
  },
  {
    "user": "Kendra Hickman",
    "rating": 3.0,
    "message": "The shoes are designed with the strap on the back that provides support to the upper ankle however the shoe itself run small making it extremely hard to put these shoes on. I ordered a size 10 my usual size and they were way too small"
  },
  {
    "user": "NurseKay",
    "rating": 5.0,
    "message": "These are the most comfortable,  lightweight shoes I have ever purchased,  and the price is amazing,  I'm a registered Nurse and I walk over 6000 steps per day and between these shoes and my Ted hose I never have any pain. I'm comfortable and they feel like I'm wearing next to nothing. I'm definitely going to purchase more. These are a size 9. They are true to size, if you wear thick socks then I'd say order up a size. Due to the fitted style. I've gotten so many great compliments on this shoe. The material is comparable to that of a $200 dollar pair of Nikes if not better. I absolutely love my shoes."
  },
  {
    "user": "K. Clemmensen",
    "rating": 2.0,
    "message": "Very cute shoes, but run very small. Also, heel is very loose, and rubs while wearing, which is odd when the length is too small. Sole looks cushy and flexible, but is rigid hard plastic. Great for fashion shoes, but not usable as athletic shoes."
  },
  {
    "user": "Marah MacDonald",
    "rating": 5.0,
    "message": "I get compliments almost daily on the look.  They are comfortable for walking and going to gym.  Order your normal shoe size.  No need to go up half size.  About to order a second pair 🤩♥️"
  },
  {
    "user": "Theresa Zuccaro",
    "rating": 4.0,
    "message": "Went off their chart. US Size 9 shoes were to big and too wide. But with new thick inserts they fit ok."
  },
  {
    "user": "Pooh",
    "rating": 5.0,
    "message": "Love the comfort. I wear these for work purposes at the hospital 12 hr shifts COMFORTABLE & STYLISH❤❤❤"
  },
  {
    "user": "BALMATIE M.",
    "rating": 4.0,
    "message": "Well constucted true colour to picture as advertised comfortable i will be ordering more colours for sure my only snag is that its difficult in get into your feet but once its in its easy going from there"
  },
  {
    "user": "Claudian",
    "rating": 2.0,
    "message": "Ordered for walking event and upon trying to slide my foot in I knew it would not work... it was too tight and the foam inside was not comfortable."
  },
  {
    "user": "K.D. Robinson",
    "rating": 4.0,
    "message": "I like the style and comfort."
  },
  {
    "user": "DG",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "elvira",
    "rating": 4.0,
    "message": "it is like the picture"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love everything about this tennis shoe. Comfortable and lightweight. Would definitely purchase more colors."
  },
  {
    "user": "Ronel Peterson",
    "rating": 2.0,
    "message": "I wear orthotics in my shoes so I wasn't too worried about the support. These shoes are very cheaply made. There is hardly any cushion in the sole. I probably wouldn't order again."
  }
]