[
  {
    "user": "Kar Star",
    "rating": 5.0,
    "message": "I got these shoes to wear in Vegas, and really love them.  I typically wear a 7.5-8 in most shoes, but got these in an 8...they were a little bigger than expected, but still comfortable.  After walking close to 20 miles in these kver the course of my trip, I did develop blisters in the bottom of my feet near my toes....but I attribute that to me being out of shape, and them fitting slightly large.  Overall they were very comfortable.  I wore them casual and dressed up.  Get 'em!"
  },
  {
    "user": "Connie Davis",
    "rating": 4.0,
    "message": "Fits well with plenty of toe space. Lacks cushioning that I prefer because of arthritis. I need a sneaker that is more dressy and leather that matches most of my outfits.  I am traveling to Scotland where rain is always a threat. I did not want to pack more shoes, so I ordered these to wear with a black pants and sweater outfit for a reception.  Most of my clothes are black. These shoes are good looking, but I've been warned that Naturalizer shoes are uncomfortable by my daughter who had 2 pairs. She said they were miserably uncomfortable. I hope that's not true because this trip is 20 days long."
  },
  {
    "user": "Zhuldyz T.",
    "rating": 4.0,
    "message": "Seem like good quality, I don't care much for the light brown back, they run a bit large, otherewise they are ok."
  },
  {
    "user": "Mackenzie Thede",
    "rating": 5.0,
    "message": "If you have wide feet, these are fantastic. If you have high arches, these are okay. They run large, go down a size or half size."
  },
  {
    "user": "Lori",
    "rating": 5.0,
    "message": "Used for walking around the city. Also looks really cute with a dress. Love them!"
  },
  {
    "user": "Summer614",
    "rating": 5.0,
    "message": "I've been looking for a pair of white sneakers that come in wide to wear all year long with everything. I don't have wide feet, but I have to wear a wide shoe because of foot problems. It's so hard to find something that's both stylish and comfortable; usually your'e sacrificing one or the other. These shoes check both boxes! And they actually have a little bit of arch support, too. I haven't worn them except for an hour or two here and there so I can't speak to all day wear like at Disney World or something but overall, I would highly recommend them."
  },
  {
    "user": "Karen McDougal",
    "rating": 5.0,
    "message": "These are beautiful shoes, very comfortable and cushiony"
  },
  {
    "user": "Lisa S",
    "rating": 5.0,
    "message": "Bought my third pair for vacation to Paris and Nice! I walked over 70 miles in 11 days! The sneakers were like wearing slippers. They were so comfortable and looked stylish with shorts and sundresses!! Love, love, love them!!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Great for wide feet but does not feel the same as my past Naturalizer pairs. Sole feels thin and the edge on toe box came loose within 2 weeks."
  },
  {
    "user": "Karen 1g",
    "rating": 5.0,
    "message": "I am pleased with the quality of the soft leather. The shoes are very comfortable with no break-in period needed. Will be wearing these on my European River Cruise where we will have excessive walking. The gray color is really cute and will go with anything."
  },
  {
    "user": "Jason de Verteuil",
    "rating": 3.0,
    "message": "its a nice shoe but its wide so does not fit right"
  },
  {
    "user": "Kristin K",
    "rating": 4.0,
    "message": "I love these shoes. They have lots of cushion and fit my wide feet. I can also put my orthotics in them for extra arch support. Plus, they are stylish!"
  },
  {
    "user": "Paul Mosier",
    "rating": 5.0,
    "message": "Just received them yesterday and I knew the minute I put them on  I was going to love them. The heel part is especially cushy.  Wore them all day at work- 8 hours with no socks and love them! Make my size 12 feet appear smaller somehow."
  },
  {
    "user": "Megan Parrill",
    "rating": 4.0,
    "message": "This shoe fits well Right away, no need to break it, no tight spots or rubs weird. I did hope the arch support was better. The fit is big so you can fit an after market one"
  },
  {
    "user": "Paula Kelley",
    "rating": 5.0,
    "message": "Nice colorway! Fit true to size.  Looking forward to wearing in the Fall.  Definitely recommend."
  },
  {
    "user": "Barbara McNeil",
    "rating": 3.0,
    "message": "I ordered wide width however this shoe was narrow. The box reads W but the toes are squished 😞comfortable otherwise"
  },
  {
    "user": "KMF",
    "rating": 5.0,
    "message": "Sneaker is very comfortable and I can walk all day in them. Will make a great travel shoe."
  },
  {
    "user": "Lisa Carraher",
    "rating": 3.0,
    "message": "Comfy!!! But after moderate use for 3 months, sole is separating"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Super comfortable. I wore these all around Mackinac Island I have a very wide foot in these fit perfect. I was able to wear them all day. They were very very comfortable"
  },
  {
    "user": "Cherish Plazinich",
    "rating": 4.0,
    "message": "The outside material is cheap feeling and creases easily. So they do not hold their “newness” long. I still love them and wear them everyday."
  },
  {
    "user": "Lisa Jones",
    "rating": 5.0,
    "message": "I've been looking for a white sneaker to wear that I can dress up or down as needed.  But so many out there just didn't have the support or comfort.  These are the BEST.  I can wear them all day without my feet hurting or getting tired.  And my teen son's girlfriend thought they were CUTE.  Win Win.  Now I'm looking to see what other shoes I can get from Naturalizer."
  },
  {
    "user": "Valerie",
    "rating": 5.0,
    "message": "Bought these for a trip to Spain, which involved a lot of walking. These sneakers fit perfectly and are so comfortable."
  },
  {
    "user": "Lauren",
    "rating": 4.0,
    "message": "Great pair of shows. Wider than expected but very comfortable"
  },
  {
    "user": "Donna",
    "rating": 3.0,
    "message": "I have been looking for a wide width leather shoe like this for years. I was thrilled to find this shoe. I have a lot of trouble finding wide enough shoes for my feet with good arch support. I did not know whether to order the 81/2 or 9. I normally wear 81/2 wide and it is a good fit but you never know with sneakers and thicker socks. In the past I have had to get a 9 wide in tennis shoes. I ordered the 9 wide but they are too long and rub my foot at the heel and sides. I am sending them back and getting the 81/2 wide. Love the shoe style!"
  },
  {
    "user": "Wendy Watson",
    "rating": 3.0,
    "message": "For the price, these are more attractive than most tennis shoes and I would’ve liked to keep them for that reason. Unfortunately the shape was not right for my foot, which is a fairly normal foot. They narrow at the toe which made my toes feel cramped. I could’ve bought a size bigger but then, I’d guess, they would be too long. It’s a shame because I really like the look. DEFINITELY not for wide feet. If you have normal width feet and you just gotta have these, go up a half size (at least). Trust me."
  },
  {
    "user": "Michelle Dorani Johns",
    "rating": 2.0,
    "message": "I usually love Naturalizer shoes but these were a miss. I paid $100 bucks for a pair of sneakers that I could have bought at Target for $25. The leather on the toe box started to peel after just one use. The insoles are flimsy and while they were wide enough and looked nice, my feet were killing me after wearing them for the day. They just weren’t comfortable. I added my own insoles and just wear them for errands from time to time."
  },
  {
    "user": "Zoila Michuda",
    "rating": 4.0,
    "message": "Haven't walked extensively in them, so can't say how comfortable they will be, but they feel good."
  },
  {
    "user": "Jovelyn Agbalog",
    "rating": 5.0,
    "message": "The most comfortable travel shoe I’ve ever purchased!  Looked cute with a dress or with leggings!"
  },
  {
    "user": "pianojo",
    "rating": 5.0,
    "message": "I've been searching for this style, type of shoe for some time. These fit! With socks perfectly.. If I go without socks, the heel may be slightly loose. The first time I wore them for more than 12 hours and they remained comfortable. Love them!"
  },
  {
    "user": "MYRNA G",
    "rating": 5.0,
    "message": "So comfy and light and looks perfect with jeans, dresses and skirts.  I've been looking high and low for sneakers that I would love to wear with sundresses and have returned about 10 sneakers to date and finally found the one. Perfect!"
  },
  {
    "user": "barbararolla",
    "rating": 5.0,
    "message": "I like everything."
  },
  {
    "user": "Joe Drexler",
    "rating": 5.0,
    "message": "These shoes are great for my feet. I struggle with arch support and fit. These shoes I can wear for hours walking."
  },
  {
    "user": "CR & MR",
    "rating": 3.0,
    "message": "Not up to expected standard of quality for Naturalizer. Wore them once before the heel cup needed repair."
  },
  {
    "user": "KS",
    "rating": 5.0,
    "message": "I have narrow feet with high arches. It’s hard to fit sneakers that fit comfortably. These are great. I bought them for walking around Disney world. They were so comfy and my feet were not sore even after 2 days at the parks. I didn’t get any blisters either. I wore them basically brand new too so they weren’t broken in. We got stuck in a downpour so I threw them in the washer and they washed well too. They’re really cute too."
  },
  {
    "user": "Carol",
    "rating": 5.0,
    "message": "I really liked these shoes. they fit true to size and are very comfortable.  Some of the previous reviews that I read mentioned they did not hold up very but I have had mine for 4 months now and they are holding up very well."
  },
  {
    "user": "M. Blank",
    "rating": 5.0,
    "message": "I wanted a tennis shoes that was stylish and comfortable.  I need a 5 1/2 wide, but choices are really limited for that size.  Sometimes I can get away with a 6 and this one worked perfectly.  It’s really cute, light weight and has great arch support."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Loved these shoes, but for $100 I would hope they would last for more than about a weeks worth of wear. T o scratches that ruin toe area and already side rubber is detaching. I want to love these but  disappointed about how they look like an old pair of worn out sneakers so quickly"
  },
  {
    "user": "Leslie",
    "rating": 5.0,
    "message": "Great white sneaker. The suede heel keeps the shoe from feeling too white.  Comfortable right out of the box.  Many reviews mentioned the small toe box so I ordered a \"Wide\" which was perfect for my wide-ish feet.  The padded heel hasn't rubbed and the price was outstanding."
  },
  {
    "user": "Lillian Ma",
    "rating": 3.0,
    "message": "Wore it on two trips. After second trip the inside sole became detached. Now need to superglue it back down…"
  },
  {
    "user": "SimpleSuzy",
    "rating": 3.0,
    "message": "Cute shoes, very soft leather, and not too heavy. Really wanted to love the shoes but although I ordered both a 7 & 7.5 wide size, the area where my big toe was felt hard and too snug. Perhaps it may be from the rubber outsole? I didn’t feel much of an arch either. Sadly, I will be returning both."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Other reviews stated these were not naturalizer’s.  Definitely are and much better price than large department stores. I will update post if they do not last the wear and use expected. Amazon does it again and does not disappoint!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Had a pair that before and love the fit and very comfortable, right out of the box soft not stiff, would buy another pair was not sure by reviews but they were perfect. would buy again."
  },
  {
    "user": "WLL",
    "rating": 2.0,
    "message": "These are the most comfortable white leather sneakers I have ever had on BUT the first day I wore them the toe got scratched at my retail job. I have 4 year old Keds that don’t have any scratches in the leather. I returned them as defective."
  },
  {
    "user": "Deb",
    "rating": 5.0,
    "message": "I purchased these sneakers to take on vacation. We will be doing a lot of walking. I figured I'd better wear them some before vacation to break them in. No breaking in, total comfort! Love them."
  },
  {
    "user": "deborah corritone",
    "rating": 2.0,
    "message": "The heel of the shoe on the back of your foot the lining rides up, and creased, and made blisters on both backs of my heels"
  },
  {
    "user": "ramosfam",
    "rating": 5.0,
    "message": "So comfy and cute! I’ve worn them 3 times and I also have 3 little kids with me…and they are still looking great, no scuffs at all. Such a relief bc so many light colored shoes get marked up instantly"
  },
  {
    "user": "Marian carter",
    "rating": 5.0,
    "message": "I ordered narrow width and fit is perfect!!!"
  },
  {
    "user": "Lisa",
    "rating": 2.0,
    "message": "One they looked nice and the other was because they are Naturalizers. They hurt my feet so bad. Not worth the price. Go to Walmart and get a better shoe."
  },
  {
    "user": "Katherine",
    "rating": 5.0,
    "message": "Very comfortable and nice fit.  I'd certainly recommend these shoes"
  },
  {
    "user": "Darlapuppy",
    "rating": 3.0,
    "message": "While these fit well the quality is quite poor. The sole on the side has separated in many spots after being worn maybe 1x every 2 weeks. My white sneakers that were 1/2 the price from Target help up much better."
  },
  {
    "user": "kim verhoef",
    "rating": 5.0,
    "message": "I love these shoes.  They are very comfortable and supportive.  And they are cute and sporty!"
  },
  {
    "user": "Rtfh",
    "rating": 3.0,
    "message": "The sole of the shoe is very comfortable. If you walk a lot the rest of the shoe may not hold up well. Faux-leather started to crease instantly upon try on."
  },
  {
    "user": "Donna",
    "rating": 5.0,
    "message": "I found out about these through “whatishopped” on Instagram (recommend following her) and she kept recommending them.  I splurged and I’m glad I did.  I wear them constantly!  I have a white Adidas pair like these but these don’t look as wide on my feet."
  },
  {
    "user": "augustacooper",
    "rating": 5.0,
    "message": "Bought these for my trip to Spain. My feet thanked me every time I put them on, would definitely recommend these shoes."
  },
  {
    "user": "William Hurley",
    "rating": 4.0,
    "message": "I kept these..loose in heel but rest of shoe is fine.  Great quality"
  },
  {
    "user": "Molly D.",
    "rating": 2.0,
    "message": "I wore these about 3 times and the seam came apart.  They didn't have much support overall.  Ok for wearing around town but I need more support for walking farther distances.  I do really love the style and the detail of the color on the heel though."
  },
  {
    "user": "sheridan hafdal",
    "rating": 5.0,
    "message": "They are a little tight.  Hopefully, they will stretch out"
  },
  {
    "user": "Heather",
    "rating": 4.0,
    "message": "Fit: Mostly fits as expected and pretty comfortable. Consistent with other Naturalizer sizing. Only complaint is that the portion for my heel seems a bit shallow. Wish it was slightly deeper for a more comfy fit - I get that it’s low profile but it’s just slightly to the point where I feel like my heel/ankle aren’t snuggly in the shoe. For reference, I have a high arch and narrow to average width feet. My toes are on the longer side but feel like I have plenty of wiggle room. Appearance: I got the white with tan banding. It looks sharp - bright white and the leather material looks more expensive up close. Pairs well with ankle jeans. Minor note - the first time I wore them my partner immediately thought my foot was hanging out of the shoe bc they thought the tan banding was part of of my heel. :)"
  },
  {
    "user": "Sandra S.",
    "rating": 5.0,
    "message": "My daughter was looking for good walking shoes and after several different tries with other companies she decided to try these and loves them. Definitely a keeper!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was a little skeptical about these shoes after I read 2 or 3 reviews that were not great, but my shoes have held up well. I have worn them 3 or 4 days a week, and I love them so much! They're  as cute as they are comfortable,  too."
  },
  {
    "user": "Happy Lady",
    "rating": 5.0,
    "message": "I wear a 8.5 AA width shoe and have a hard time finding shoes that fit well.  I have a very low instep and often shoes set too high across the the top of my foot.  These shoes fit great and are comfortable.  I like the new look and I wear them without socks and they don't look like clod hoppers, I know I'm dating myself here.  Even though I'm in my seventies, I try to stay in style and these tennis shoes are great and look good with skinny or slim jeans."
  },
  {
    "user": "Lizzy Vega",
    "rating": 5.0,
    "message": "Bought these for my mom who recently had knee surgery and has a swollen ankle and has been looking for comfortable shoes because her job requires her to stand all day. At first purchased the 8 Wide but was too big on her, so I returned and bought size 8 which was true to her size, the turnaround time for the return and reship was total 48 hrs; I was amazed how quickly we got the new pair. totally recommend!"
  },
  {
    "user": "Tanya Lopez",
    "rating": 5.0,
    "message": "Super comfortable!!! Kuddos to Naturalizer for FINALLY creating a true WW shoe."
  },
  {
    "user": "KWhit",
    "rating": 5.0,
    "message": "I'm normally an 8.5 - 9 wide in sneakers and tried these in 8.5 wide and and they fit perfectly. Love the taupe suede on the back...seems to make my feet look smaller, lol.  Highly recommend. Very in tune with current style."
  },
  {
    "user": "M",
    "rating": 4.0,
    "message": "The good news: they really are real leather(!} and they look nice. The bad news: they run long and a bit narrow and weren’t very comfortable for me.  The insole was just shaped wrong for my foot and quickly started to hurt.  If they fit you right, you might love them."
  },
  {
    "user": "k8tydid",
    "rating": 5.0,
    "message": "These are amazingly comfortable and stylish. I have an average foot, somewhat low arch, average width and may a bit long toes. The arch is in the correct spot, the sole is very cushiony but not so much that my foot pops sinks and then pops up out of it like some shoes, the back near the heel does not flip off, and the sides do not gape. I wear a 7.5 and bought a 7.5 and it fits as expected. I have not worn them for an extended period of time, I just got them a few days ago, but they are a great shoe so far!"
  },
  {
    "user": "Lizzie Hembree",
    "rating": 5.0,
    "message": "Awesome shoes, so comfortable.  I do have narrow feet, and the fit perfect."
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "message": "I bou go t these because another reviewer had said that they fit her wide feet without making them look ridiculous. I second that! They gave me blisters to the sides of my Achilles the first few times I wore them without socks, but nothing bandaids and time couldn’t heal! I now wear them with low-rise socks and love them!"
  },
  {
    "user": "Anne D Houston",
    "rating": 1.0,
    "message": "I loved these shoes! They were the perfect balance of cute and comfortable. I’d only worn them maybe half a dozen times and today I noticed one of the soles is coming unglued from the sole. Ridiculous! They’re barely worn! And of course I’m 1 week past my return window so not much I can do about it besides warn others. Quality of these shoes is subpar, to say the least."
  },
  {
    "user": "Lisa",
    "rating": 3.0,
    "message": "Nice style, but too tight and small"
  },
  {
    "user": "Jen",
    "rating": 5.0,
    "message": "These sneakers are so comfortable without any breaking in period necessary. I wore them on my honeymoon walking all over Rome, Florence, and Paris (6+ miles every day) for 2 weeks and they were amazing!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "These are the most comfortable casual shoes I've ever owned, and they looked great with my outfits! I forgot I had them on a few times when I was on a 6.5hr road trip. I've walked about a mile in them, and I was comfortable and satisfied! I cleaned them as well, and it was pretty easy! Looking to make more future purchases in different colors!"
  },
  {
    "user": "Elizabeth Key",
    "rating": 5.0,
    "message": "So comfortable right out of the box! Have already received several compliments."
  },
  {
    "user": "G",
    "rating": 5.0,
    "message": "Perfect for all day walking on cobblestone"
  },
  {
    "user": "Kzzephyr",
    "rating": 2.0,
    "message": "These are cute and very cushioned, however I've only worn them 2 days walking around on vacation and they are already falling apart despite being very careful and hand cleaning them. The leather material is scuffed and ripping off and you can see the wear and tear on the sole. Also no traction on the bottom whatsoever. Dissapointed I'll probably have to toss them after my trip."
  },
  {
    "user": "Vicki Perez",
    "rating": 5.0,
    "message": "These sneakers are well made and very comfortable. I like the overall appearance of them because they are more sleek looking rather than real wide. They are consistent with Naturalizers comfort and style."
  },
  {
    "user": "Tal Gal",
    "rating": 4.0,
    "message": "I have several pairs of Naturalizer sneakers, two others are slip on shoes.  I have wide feet, so I bought 11W.  I feel like I had more room in the toebox and arch in the slip-on style.  These have removable insoles so I can add my own inserts.  They are fine for everyday walking but I wouldn't wear them all day under more serious conditions."
  },
  {
    "user": "Kim C.",
    "rating": 5.0,
    "message": "Love these wide tennis shoes. They are comfortable and durable."
  },
  {
    "user": "Kelley Bruss",
    "rating": 5.0,
    "message": "So comfortable. So cute."
  },
  {
    "user": "Amanda",
    "rating": 3.0,
    "message": "These are both the most comfortable and most fragile shoes I’ve bought in a while. I bought two pairs because the first one immediately got cuffed up irreparably on my first wearing. I thought I’d just done something abnormal to mess them up but I’ve destroyed the second pair within the course of about a month. The toe is completely ripped up and both shoes are torn down the side. This “leather” is entirely too fragile to be used on footwear. It’s unfortunate because the foot bed is incredibly comfortable. I took the insoles out and put them in another pair of casual sneakers then threw these shoes out. Kind of a waste of money :("
  },
  {
    "user": "Kls",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "J",
    "rating": 4.0,
    "message": "Very difficult to find narrow sneakers.  These have a slightly larger than narrow toe box but the narrow heel is perfect.  They are comfortable and I think after breaking in the toe box can be tied tighter without the excess diffing  into the top of my feet."
  },
  {
    "user": "Katherine B Morgan",
    "rating": 5.0,
    "message": "Loved the fit!"
  },
  {
    "user": "Georgia",
    "rating": 5.0,
    "message": "I love this shoe! Naturalizer never fails to make a true 9 Narrow. I have a small frame and long skinny feet with toes like fingers. My big toes are oddly shaped and require extra space in the toe box. Or I lose a nail. Most sneakers on my feet look like bumper cars or tug boats. But this style on my feet (in white, no less) appears ~dainty-. It’s cushy in just the right spots to wear with or without socks.  The style is a keeper. FYI, Other Brands I wear: New Balance, Franco Sarto, Taos."
  },
  {
    "user": "LoveAmazon",
    "rating": 5.0,
    "message": "Second pair for me! Love this comfy sneaker that looks great with jeans and dresses."
  },
  {
    "user": "Casanova",
    "rating": 5.0,
    "message": "These are great! I had been looking for white sneakers that would match any outfit and be comfortable at the same time. I usually have issues with  closed toe shoes (they bother me in the back). These shoes were very comfortable and did not bother me at all throughout the day. They are also very lightweight and of good quality. I loved them and would definitely buy another pair if I needed it.  Definitely recommend."
  },
  {
    "user": "Kindle Customer",
    "rating": 2.0,
    "message": "I really loved these sneakers. They fit great and made my feet happy. The only thing is that after only one month of wearing them, the eyelets tore right out. It only did this on one side of the shoe. Was very disappointed that I had to ditch wearing them only after one month"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Really sharp shoes, not comfy enough to wear to work. Somewhat narrow."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "I bought these shoes in August, wore them about 5x and now in October, the rubber sole is already pulling apart from the leather. These shoes do not last."
  },
  {
    "user": "CT",
    "rating": 1.0,
    "message": "I made a big mistake I reordered this shoe and the replacement came apart in the same place. What happened to Quality control? Is it a thing of the past? Glue didn’t hold this expensive shoe together.  I lost my $100.00 don't let it happen to you, run while you still can!"
  },
  {
    "user": "Karla Cantú",
    "rating": 5.0,
    "message": "Son lo mas cómodo y se ven justo como en la foto"
  },
  {
    "user": "Lp",
    "rating": 4.0,
    "message": "I’ve been buying naturalizer fashion sneakers since last year. They are made long. I wear a 7.5 and need a 6.5 in the mule style and 7 in the tie version I try to go with a double wide if available because they run very narrow and I have a small bunion on right and a fresh surgical recovery left foot happening These came with a flaw on leather hence the 4 stars"
  },
  {
    "user": "Margaret S.",
    "rating": 5.0,
    "message": "If have a narrow foot and this is a great sneaker style for that casual day dressing you see in all the magazines.  Wore it all through Paris in the fall and everyone had sneakers on with their dresses because you walk everywhere.  I searched for a 2nd narrow pair and finally found it here on Amazon.  I love it!"
  },
  {
    "user": "Juan Carlos Garcia",
    "rating": 5.0,
    "message": "Una vaina bien"
  },
  {
    "user": "Georges",
    "rating": 2.0,
    "message": "Great looking shoe and fits well. Unfortunately with under 10 uses (less than 10k steps a day) there is already a tear forming between the sole and the show itself. Very dissapointing."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I bought these shoes because I was going to Coachella and needed to be comfortable walking in shoes for at least 10 hours..... THE BEST SHOE EVER.  They're modern,  cool and comfortable.  I've gone to buy similar styles from other makers like puma and Adidas... but the comfort  doesn't come close."
  },
  {
    "user": "jenny d",
    "rating": 5.0,
    "message": "10/10. Buy these shoes. I just ordered a second pair because I know I will want another when these get worn out. I bought another pair of the white ones and the tan/suede ones as well. So comfortable and look great."
  },
  {
    "user": "Pat N",
    "rating": 4.0,
    "message": "These shoes are a little too wide for a \"narrow\", but they're OK when I have them stuffed with my orthotics and insoles.  It's nice that the original insoles are removeable.  As another reviewer mentioned, the laces were white-white and the leather is more of an off-white which I didn't like, so I ordered some beige laces.  That added another $6.00 to an already high price for sneakers, but I'm used to that with a narrow foot."
  },
  {
    "user": "Jenn",
    "rating": 5.0,
    "message": "I love these shoes! I recently developed a Morton's neuroma on my right foot and was having toe pain, numbness, and tingling in my feet, making it hard to work out and walk. My podiatrist recommended dumping all my shoes that lacked any kind of support or comfort, so I went looking for new shoes that were both stylish and had the squishiness and support I needed. These totally fit the bill. They replaced all my basic white sneaks, but they're so comfortable and have allowed for less pressure so that I don't even feel any of the neuroma in the ball of my foot, which is allowing it to heal. I'm going to be buying more Naturalizers in the future!"
  },
  {
    "user": "Rhiannon Eich",
    "rating": 1.0,
    "message": "These shoes feel nothing likely leather and more like a cheap, fake material. Left shoe already had a scuff on the toe with the material peeling. Tongue of the shoe was already very creased and you could see that with the normal bend of the foot with walking, the sole would soon separate from the rest of the shoe. Bummer since from a comfort standpoint, they were well-cushioned and I had planned to wear them for a European vacation. Returning immediately though. For $90, not worth the cheap product!"
  }
]