[
  {
    "user": "Stephen P",
    "rating": 5.0,
    "message": "All my life I've been wearing normal sized width shoes when I knew my foot was just a little bit wider than the average. Took a chance to go to the wider soul & at first I felt it was too wide but after releasing the uneven shoe laces and readjusting the lace tension, it gave me the room, widthwise, I needed for my foot that I've never experienced before in all other shoes. I looked at Skechers, Reebok, Nike, Puma etc and none would give me the choice of width!? Thank God New balance isn't a cookie cutter company as everyone has different needs and they produced an awesome pair of shoes for a very reasonable price - I'm SO grateful. The guy that did the above video review is not lying about taking them to Disney world, you could walk forever & you feel like you're on air, it also holds firm your inner ankles where no other shoe has done before. Love them - thank you so much New balance, your my go to shoe now until you get greedy and start becoming uncompetitive and raising the cost where people cannot afford!"
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "I've played every kind of sports I could get my hands (and feet on) ever since I was 7 years old (Little League hard ball/fast pitch) and have always looked for the best shoe for that sport. A good fitting well-made shoe is critical to optimum performance levels. New Balance has always been a great shoe, and this one is perfect for my current activity level; mostly walking, light jogging and the gym. Very happy with the fit, comfort level, foot support, quality, and price. Highly recommend!"
  },
  {
    "user": "J. McMeins",
    "rating": 5.0,
    "message": "Great for wide feet. My feet are so wide I prefer a 6E, so I can go down to an 11 1/2 for length. these have a lot of padding so this shoe in a 12 with 4E is just fine. they still need to be broken in, but if you’ve had wide feet all your life like me and you know by how they feel on arrival that they will fit, no shoe stretcher needed."
  },
  {
    "user": "Your friend",
    "rating": 3.0,
    "message": "I wear an 11D in most all shoes, boots and sneakers. I currently have two New Balance pairs in size 11D. This shoe was marked and sold as an 11D but my big toe was tight to the end.  It may be because the shoe feels like there is too much height/padding in the heal and it pushes your foot forward in the toe.  Regardless, it was a generally weird fit, unlike my other New Balance shoes, so I decided to send it back. They may have given in over time, but I did not want to risk wasting my money on an ill-fitting shoe. Build quality was good! Update 10/23/22:  I did send the 11D back and thought I would try a 12D. The length was maybe a tad more than I needed but worked out in some respects: The 12D was a much better fit than the 11D and I had a bit of room for a thicker sock. There then was a problem that arose in that the metatarsal area on my left foot was giving me trouble that I never had.  I removed the NB, removable insoles that have \"fancy\" raised areas but are not practical for all people. I then bought some new, smooth inserts with a firm foam layer plus a layer of memory foam. These new insoles reveled to me there was a deeper condition beyond the factory insole's raise areas, that were bothering my metatarsal.  It appears to me there is a problem with the basic construction of the sole. It just doesn't seem to be sturdy enough not to transfer either the tread pattern or just some other irregularities in the foot bed construction which put undue pressure on the sole of my foot. To keep trying, I then another dense, flat insole, under the memory foam insoles to hopefully bridge the irregularities of the footbed but to no avail.  The shoe was roomy enough to accommodate the double insoles, but nothing I did seemed to help and the fact that these shoes were just plain uncomfortable and caused a problem with my feet, and mostly the metatarsal area. I can't quite grasp how so many people love this shoe. I have had many middle level NB walkers and cross trainers, and these have been by far the most uncomfortable/painful. Unfortunately, I will relegate these to occasional use and light chores and not for any P.T. and no walking."
  },
  {
    "user": "S. Hudson",
    "rating": 4.0,
    "message": "Very nice shoes. I need the heel loop to help me get my shoes on. New Balance is one of the few companies that still puts one on. Was sad to see that New Balance is deleting this loop from many of their shoes. The shoes are very comfortable and look good. They even make my size 15 feet look smaller. :-) Delivery time was good. Would buy from this seller again"
  },
  {
    "user": "Sputnik",
    "rating": 4.0,
    "message": "I like everything about these shoes EXCEPT that the toe box is way too narrow. The rest of the shoe is nice and wide and comfortable and looks good and feels good but I just can't wear them because they squish my toes too much."
  },
  {
    "user": "Ronald Delgiudice",
    "rating": 5.0,
    "message": "I use these for work I'm on my feet all day.  Very comfortable fit great and made very well. This is my 2nd pair, had the other's for a few years ! Highly recommend!!"
  },
  {
    "user": "Donna M Derivan",
    "rating": 5.0,
    "message": "My husband does a lot of walking on concrete and tiled floors all day and these offer the best support for him.  He is also diabetic so fit is important for his foot health."
  },
  {
    "user": "NCPICKER",
    "rating": 5.0,
    "message": "As stated, these are the most comfortable shoes that I have worn. They are very attractive (personal taste) and very durable. They have been upgraded through the years; however, they are still as comfortable and durable as the first pair that I purchased. Comfort and Quality at a reasonable price. Can't be beat!"
  },
  {
    "user": "Heather Rammel",
    "rating": 5.0,
    "message": "like any shoe, they take time for your feet to get used to but they fit perfectly, love the style, the colors, but the only flaw is that i don’t really like is the material the tongue is made out of but that is just me personally. Other than that i will definitely be buying these again in other colors."
  },
  {
    "user": "David",
    "rating": 5.0,
    "message": "I'm a professional chef and always on my feet. i have plantar fasciitis and alot of shoes dont work for me but right out of the box these shoes are comfortable and don't even require any breaking in."
  },
  {
    "user": "Sandy",
    "rating": 5.0,
    "message": "Bought from my fiance and we're a little tight at first but feeling better to wear now after wearing them around the house a little bit to break them in"
  },
  {
    "user": "Dan G",
    "rating": 5.0,
    "message": "I don’t leave many reviews and I will keep this short. I was skeptical about buying a tennis shoe online but I was pleasantly surprised. This was a great overall shoe.  I bought it because I recently picked up Pickleball and my running shoes were not a good stable court shoe.  These turned out to be perfect for Pickleball and they are so comfortable and stylish they have become my everyday shoe. Great price, stylish, and comfortable.  Thanks."
  },
  {
    "user": "Leisure_man",
    "rating": 5.0,
    "message": "Ordered the 11 X-Wide and fits perfectly.  NB is the only brand that fits my x-wide feet.  And the price is reasonable."
  },
  {
    "user": "Eng teach",
    "rating": 5.0,
    "message": "My husband is a farmer and needs comfortable, work shoes.  This gray color is great, and he says they feel really good (14  4E) .  They can be worn as a jean and sports shoe; very nice appearing shoe."
  },
  {
    "user": "John Stapinski",
    "rating": 4.0,
    "message": "I loved the comfort. And the looks  and the size  fits perfectly.  BUT: not much support on the outsides and the arch. But I'm a fat guy with flat feet so that could be why.  Thank you Amazon and Thank you NEW BALANCE..... ALL IN ALL 4 1/2 STARS WANT TO GIVE A 5 BUT THE SUPPORT IS THE ONLY THING STOPPING ME.... JOHN A. STAPINSKI, VALLEJO CA."
  },
  {
    "user": "Paul T. Juno",
    "rating": 5.0,
    "message": "Great shoes and fit perfect. Needed new shoes that would be good for walking. Felt great from the start too, not much need for breaking in."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have extra wide size 8. Very comfortable and fits well!  I use it for my daily walking exercises on pavements in hilly neighborhoods."
  },
  {
    "user": "Typongtv",
    "rating": 5.0,
    "message": "No matter where you are around the world, if you got wide feet, you like walking comfortably and you your budget is tight....stick to the 608, stock up on as many as you possibly can. I've been importing the NB 608 for years. Here in Egypt shoe stores don't offer wide and extra wide variants in any brand, I tried these years ago and since then I don't feel the need to try any other. All shoes have a short life span if you use them extensively, and my case one pair lasts about a year in good condition until it starts to age poorly and falls apart. To me that's normal for this price range, I just keep buying new ones. The weakest area on this model is the mesh part on the sides near my bunions, the stitching seems to fall apart quick, then the mesh starts tearing. The cutout seems to help with flexibility and comfort, but I hope they either ditch it or use a sturdier type of mesh in future upgrades. I also believe that using a damp cloth to clean it up speeds up the wear of the leather. All in all... I enjoyed v4 and I'm enjoying v5 maybe even more with the flatter midsole. Look for discounts throughout the year and stock up on these babies, they're comfortable, stylish and the extra width is definitely its best feature New Balance offers."
  },
  {
    "user": "Niceguy71653",
    "rating": 5.0,
    "message": "I have worn these shoes for years. For the price I think they are the best value around.  Order them a half size bigger than what you normally wear. Just don’t throw them in the clothes washer.  When I did the glue on the soles fell apart ."
  },
  {
    "user": "Ray Gwiazdowski",
    "rating": 5.0,
    "message": "I found a pair of these on clearance in a local store a few years ago  Finally a shoe wide enough for my feet  They are now shabby worn looking but still sturdy enough for work/painting shoes  Could not find a new pair till I checked on Amazon"
  },
  {
    "user": "Myron Jackson",
    "rating": 5.0,
    "message": "I was very happy with these shoes. They are extremely comfortable to wear. Being able to get the wide width made a huge difference. I've had them a couple of weeks and they are holding up very well. I would buy these again next time I need shoes."
  },
  {
    "user": "TJY",
    "rating": 5.0,
    "message": "This is my third pair of New Balance 608's. I used to buy the USA-made 993's, but the price has soared in recent years. The 608's are very comfortable and stylish. Peltz Shoes shipped ahead of schedule and I am very pleased."
  },
  {
    "user": "Larry Teckenbrock",
    "rating": 5.0,
    "message": "I need a shoe I could use for daily workout and pickle. ball. These shoes have worked well. I have had multiple New Balance shoes and the fit is always perfect."
  },
  {
    "user": "Cyndil's Mommy",
    "rating": 5.0,
    "message": "These are the shoes he likes best.  He has had several pairs.They give him the support he needs. Amazon shipped them quickly."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "The local shoe store was out of white - supply chain issues.  Quick delivery from Amazon saves me from driving around.  608 extra-wide fits my foot well and I like the support I get from New Balance.  Tip I learned: if you wear your shoes frequently (several days/week), you probably need to replace them yearly even if the outside looks good."
  },
  {
    "user": "Windos 68",
    "rating": 4.0,
    "message": "They Are Great Shoes tho They Do Not Last in Daily Wear. They Sole Comes apart from The Top Of Shoe. I don't Know How to actually explain it. To Try NOT Spend another $50 - $60 I put Gorilla Inside (See Image) It Lasted a Few More Months The Image Shows The Second Time in 9 Months I Put The Glue The First Part That Came Apart Was the Front Of Shoe"
  },
  {
    "user": "VERRE 1",
    "rating": 4.0,
    "message": "Fairly comfortable after shoty break in period. Good support, but a bit heavier than expected, so a bit achy after walking avg 5-7 miles. Bought Skechers all pro walkers at same time - a bit more comfortable"
  },
  {
    "user": "lady bug",
    "rating": 5.0,
    "message": "My husband needed a new pair of tennis shoes and he only likes white.  Hard to find white tennis shoes.  Here they are.  Plain white and just what I was looking at a pretty good price."
  },
  {
    "user": "Pamella",
    "rating": 5.0,
    "message": "I bought for my husband and he said that they are the most confortable he has every had."
  },
  {
    "user": "Jeremy Brewer",
    "rating": 4.0,
    "message": "Good shoes for the track, gym or for shopping. Would not wear to work for prolonged standing and comfort. Shoe strings are way to long. New balance has the longest shoe strings and it serves no purpose."
  },
  {
    "user": "KayLynn L.",
    "rating": 4.0,
    "message": "This could be one of the most comfortable shoes I have ever had. I would have given it a perfect rating but I live in a hot climate and the shoe is not as breathable as I would have liked. But it is incredibly comfortable and durable."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Bought these shoes specifically for use during racquetball. This is the second pair that I've bought. It's just super hard to find good athletic shoes for playing racquetball. For the price, they're hard to beat. I play raquetball two days a week, and for 2 hours each day, so I put these shoes through their paces and got about 1.5 years out of them. I'm actually surprised they lasted as long as they did. Their grip on the polished hardwood floor is great and with all the side-side movement I never injured an ankle. Regarding the comfort and sizing. I wear a size 9.5 EEE so it's always nice to find a good shoe with the correct width. These shoes fit that 9.5 EEE perfectly. Not too big or short, and just the right width. It does take about 3-4 weeks of racquetball to break them in, though. Until then they aren't quite as comfortable on the court and my feet are a little sore at the end of the matches. Highly recommend these shoes."
  },
  {
    "user": "Taxation Consultant",
    "rating": 5.0,
    "message": "608V5 have been my favorite daily shoes for many years. The black ones are great for everyday casual wear, but if you have a dress occasion, they can escape notice that they’re not true leather dress shoes unless someone is looking closely at them."
  },
  {
    "user": "Peggy Vooge",
    "rating": 5.0,
    "message": "Bought for my husband who is very active and on his feet a lot! They not only look good and feel good but they are made really well!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Listen, I got these shoes as a joke because I had just had a child. Now… I cannot stop wearing them. The shoes are comfortable and people still make fun of me for wearing them. #DaddyShoes4Life"
  },
  {
    "user": "Laurie D.",
    "rating": 5.0,
    "message": "I’ve owned several pairs of 880 running shoes and this 680 takes a little off the running shoe appearance. Very comfortable in wide size that I need!"
  },
  {
    "user": "Reloader57",
    "rating": 5.0,
    "message": "Been wearing New Balance for 40 years. We’ll made, comfortable and wear well. True to size."
  },
  {
    "user": "Jim",
    "rating": 5.0,
    "message": "As these were 4E they fit my wide foot very well.  Would buy again."
  },
  {
    "user": "John Schmit",
    "rating": 4.0,
    "message": "I have had many pairs of New Balance so maybe my standards are higher for these. I am a \"wide\" in many shoes and I have both std width (used for gym only) and now wide (for walking) NB shoes. The std is a little snug while the wide were comfortable with no break-in necessary, but the one very minor, vanity driven comment is that wide \"look\" bigger.  There nat be more padding at the ankle, which is good o prevent chafing, and the soul is wider to distribute my weight, which is also good, but because these are a bigger than my other shoes, my eyes exaggerates what my wife's eyes do not see. Oh, forget I mentioned that... New Balance is a great shoe. I do not regret any that I have purchased over four decades."
  },
  {
    "user": "William L. Langley",
    "rating": 5.0,
    "message": "The new balance is very comfortable, gives good support, looks great! Best of all they do not squeak like the similar Nike Air Monarchs."
  },
  {
    "user": "Timothy Jones",
    "rating": 5.0,
    "message": "My 624's were discontinued and the new 619's were reviewed as running small and $25 more. The 608's were on sale with free shipping so I got a pair and they mimicked my 624's. Really happy with the purchase & will buy another pair b4 they are discontinued too."
  },
  {
    "user": "Jarheadcop",
    "rating": 5.0,
    "message": "My wife teases me that I wear \"Dad shoes\" and that I reorder them every year.  I know they'll be comfortable and they'll go with everything I wear.  I don't have to worry about any local store not having them in stock and what color they come in."
  },
  {
    "user": "jimo",
    "rating": 5.0,
    "message": "Been wearing this brand for years and they fit my feet better than Nike or Adidas. Very comfortable as well, only other brand I've found that is almost as comfortable is Asics crossfit."
  },
  {
    "user": "Gary Kitchen",
    "rating": 5.0,
    "message": "I have previously owned the NB 608, and this does not disappoint. I did step up 1/2 size to a 9. I typically wear 8 1/2 4E, but have found this is still rather tight across the widest part of the foot. The 1/2 size up is just right right. Zero break-in, comfortable straight out of the box. Had them for a few weeks, would order the same again. Good long-term daily wear."
  },
  {
    "user": "Consetta M. Shroyer",
    "rating": 5.0,
    "message": "My man orders these, typically in white, however, he chose the gray suede this time. He is very pleased with the look of the shoe. He has been in the morning dew with them & they still look great... PLEASE NOTE: They do sell a sueded leather sneaker cleaning kit... I would recommend getting one to keep the suede from matting eventually... Really not any different than, washing/wiping down your regular sneakers... Is a good fitting shoe for my man... 👍😉👍"
  },
  {
    "user": "Bart L. Russell",
    "rating": 5.0,
    "message": "Great shoes for my work. I'm a Barber and stand for long periods at a time. I've developed achilles tendonitis over the last year and these are the only mass production shoes that are not hideously ugly. Though my son does call the Air-Grandpa's; I can live with that."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "great shoe for the price, perfit.  easy to walk in and break in.  would buy again"
  },
  {
    "user": "Tony Owens",
    "rating": 5.0,
    "message": "I have been wearing this shoe for years and as usual it fits perfect and I love them!"
  },
  {
    "user": "Robert H. Wolfe",
    "rating": 5.0,
    "message": "Excellent tread on the bottom, long lasting and comfortable"
  },
  {
    "user": "Babybear",
    "rating": 5.0,
    "message": "It’s New Balance, which I’ve never had a problem with, so it’s just average. But I like at least once in a while finding perfect being average. Sized right, well built, comfortable, delivered on time. Good value for the money."
  },
  {
    "user": "Malcolmgilliland",
    "rating": 5.0,
    "message": "Shoe fit better than ones I normally get"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I'm usually buying walking shoes from NB but decided on this cross trainer due to walking on both cement/pavement and trails. The shoe fit great right out of the box and accommodated my orthotics. It's not as comfortable as a walking shoe but it provides better support for the different surfaces. Pleased with my buy."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have been buying this shoe for many years now maybe just in different models but basically the same shoe and color combination . Love these shoes"
  },
  {
    "user": "Timothy Themad",
    "rating": 4.0,
    "message": "Actually your dads shoes. Order em when you turn 30+ and have 1 child."
  },
  {
    "user": "Nancy",
    "rating": 5.0,
    "message": "This is the third pair I bought for my husband. They wear well and very comfortable."
  },
  {
    "user": "Georgia Meadows",
    "rating": 5.0,
    "message": "these shoes are for a christmas present."
  },
  {
    "user": "Dr. Ed",
    "rating": 5.0,
    "message": "New-balance keeps their size and style numbers constant, so you can easily buy on line, just duplicating your current shoe. Plus they are high quality sneakers."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I liked the support and the look."
  },
  {
    "user": "Dr. Ken",
    "rating": 5.0,
    "message": "I have been wearing New Balance for many years now and my podiatrist highly recommends New Balance and the 608 model shoe.  I purchased several pairs of the New Balance Men's 608 V5 - gray for work (I volunteer at the local hospital) and white for day-to-day wear and they really fit well and are very comfortable!  And based on my history with New Balance, they are quite durable and wear well!  Highly recommend!!!"
  },
  {
    "user": "Pirra",
    "rating": 5.0,
    "message": "They're basic shoes, are affordable, and pretty comfortable sov that's all good. Only thing is that they're a little looser then I expect but it's no big deal."
  },
  {
    "user": "Maxx0026",
    "rating": 5.0,
    "message": "Due to the width of my feet I have been buying the 608s in a EEEE width for years.  The dog and I walk 3 to 4 miles daily and these shoes last well.  Price is very attractive and I keep buying them."
  },
  {
    "user": "Mary-Ellen L",
    "rating": 4.0,
    "message": "These shoes were too tight on one foot. I have bunions on both feet plus hammer toes so these 4E shoes did not work."
  },
  {
    "user": "Sandy",
    "rating": 5.0,
    "message": "Husband is hard on shoes and New Balance seems to be the only brand to last him two or three years whereas others maybe 4-6 months tops. He's says they're comfortable and he wears these daily for work and long hours on his feet plus his daily walks. Shipping was 2-4 days faster than originally said."
  },
  {
    "user": "Ronald Carvalho",
    "rating": 5.0,
    "message": "Like New Balance for fit"
  },
  {
    "user": "William Weber",
    "rating": 5.0,
    "message": "Great for all day wear."
  },
  {
    "user": "Kenny M.",
    "rating": 5.0,
    "message": "I have always loved the fit. Probably my 4th pair since I found them!! Love them. I don’t work out directly but I walk quite a bit  on sidewalks, and treadmill. Very comfortable Kenny"
  },
  {
    "user": "Fitu Tuua",
    "rating": 5.0,
    "message": "First shoe that actually fits perfect wide enough and comfortable. I stand on forklift pedal 10 hours a day and at the end of the day can’t wait to switch into my New Balance 608!"
  },
  {
    "user": "Ed W.",
    "rating": 5.0,
    "message": "Bought these for casual walking and pickleball, well made and sized well. New Balance fits my foot well, as I have a wide requirement."
  },
  {
    "user": "walter hawthorn",
    "rating": 5.0,
    "message": "Wear them every day"
  },
  {
    "user": "bvilledick",
    "rating": 5.0,
    "message": "Love the 4E Fit."
  },
  {
    "user": "JGV",
    "rating": 4.0,
    "message": "Very comfortable and good support at a very good price."
  },
  {
    "user": "Craig",
    "rating": 5.0,
    "message": "I have a few and happy with the support on all of them"
  },
  {
    "user": "Robert Acosta",
    "rating": 4.0,
    "message": "I wear size 15 with most of my shoes but sent back the 15 and ordered a16  which fits perfect"
  },
  {
    "user": "Kenneth A. Neidorf",
    "rating": 5.0,
    "message": "This shoe fits me perfectly.  It's very comfortable.  I go for very long walks (up to 8 miles) and never have any foot problems"
  },
  {
    "user": "David Stewart",
    "rating": 5.0,
    "message": "This is a comfortable shoe. It is leather and it allows air flow around the foot unlike shoes with synthetic material."
  },
  {
    "user": "John R Baker",
    "rating": 5.0,
    "message": "Fast delivery. With no store hassle. Convenient time saver. I’ve been using them that’s why they are a little dirty."
  },
  {
    "user": "AS",
    "rating": 4.0,
    "message": "I don't care what my daughter says, these are not dad shoes! If you get them in white, then yes, those are dad shoes...maybe. Black? Work shoes. All the other colors? Just plain old comfortable shoes! They fit fine. They aren't knock offs. I can't speak to how they are for working out but for just everyday wear, they are great! The last pair I bought I wore daily for 2 years before they started getting uncomfortable and falling apart. Now, if you wear them at work and walk a lot like I do, expect them to wear out faster. My work pairs only last about 9.months but I do a lot more walking at work than off work. And what's wrong with comfortable shoes anyway? Nothing! Darn kids today think all men over 50 wear dad shoes no matter what kind of shoes they wear! Yes, I wear white crew socks with them! Big deal! At least I'm not wearing knee high black socks with them. Well... I do wear black compression socks with the black pair of these shoes I wear to work but that's different! That's for work! Darn kids these days! They need to get offa my lawn!"
  },
  {
    "user": "todd",
    "rating": 5.0,
    "message": "Excellent shoe"
  },
  {
    "user": "Roxy Sparkles, Llc",
    "rating": 5.0,
    "message": "Can use, only 1 shoe in the box!! Very disappointed!!"
  },
  {
    "user": "David B.",
    "rating": 5.0,
    "message": "Run small, so get 1/2 size larger than normal."
  },
  {
    "user": "Ryan Medeiros",
    "rating": 5.0,
    "message": "Fits comfortably and has held up using every day for about a year. Better than other shoes I've gotten."
  },
  {
    "user": "E Segan",
    "rating": 5.0,
    "message": "This product came a little bit early which was great and fit the person needing them perfectly."
  },
  {
    "user": "Rich F.",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "JWaggo",
    "rating": 5.0,
    "message": "These are lightweight, very comfortable .. Great support...."
  },
  {
    "user": "Happy Camper!",
    "rating": 5.0,
    "message": "These are my husbands favorite sneakers by far!"
  },
  {
    "user": "Sandra S DiGiovanni",
    "rating": 5.0,
    "message": "This is a replacement pair of NB608 that I currently have. My old pair are about 7 years old and are still going strong. I use them for yard work. Glad I found them on Amazon because I have not seen them on the NB site or anywhere else!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fits perfectly, feels great, looks ok and no complaints.  FYI, I have only had them for a week so Amazon should really ask for reviews after items have been used for some length of time."
  },
  {
    "user": "Tod Johnston",
    "rating": 5.0,
    "message": "I’m rocking like a new dad I’m these kicks.  I even had senior dads comment how much they liked these shoes.  Not only am I patriotic with the red white and blue new balance, but my feet are comfy and stylish."
  },
  {
    "user": "chad Hazlett",
    "rating": 5.0,
    "message": "Bought these to wear at work.  Am on my feet the the entire time I am working and these shows feel great from start to finish!!"
  },
  {
    "user": "Amazon Customer suprised",
    "rating": 5.0,
    "message": "As my title said I love the foot room and they really support me while I walk."
  },
  {
    "user": "AjaxLesser",
    "rating": 5.0,
    "message": "These have held up way better for my 5mile walk every day compared to the air force ones I had before. Way better support and more sole life"
  },
  {
    "user": "Twila Ann Milliman/",
    "rating": 5.0,
    "message": "Best Brand for Balance and fit."
  },
  {
    "user": "PMills",
    "rating": 5.0,
    "message": "These shoes fit perfectly and are super comfortable for all-day casual wear.  Great for walking.  Most comfortable shoes I've had in a long time."
  },
  {
    "user": "Low Wings",
    "rating": 5.0,
    "message": "I’ve worn this model of New Balance shoe for several years — it’s a personal favorite!"
  },
  {
    "user": "Celeste Lambert",
    "rating": 5.0,
    "message": "These shoes are great. I have a wide foot. They fit without being to narrow."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They fit well and comfortable too."
  },
  {
    "user": "Ashley Cooper",
    "rating": 5.0,
    "message": "Been buying these shoes for years for husband it’s the only tennis shoes he likes and that fit him they he wants them to so I will keep buying them as long as they make them"
  },
  {
    "user": "Heather Ramsey",
    "rating": 5.0,
    "message": "Bought these for my father. He absolutely loves them. He said they fit great and are very comfortable. Will purchase these again for him."
  },
  {
    "user": "Shawn Ritchie",
    "rating": 5.0,
    "message": "Great shoe, definitely durable. I have had New Balance before, but not in the last couple of years. I never ordered shoes online until this pair. 608 V5 were a perfect fit. I just looked at my old shoes that were not NB and ordered that size. I generally take days of research and hours in the store to pick a pair that I think will work for me. Not a cheap shoe, not too expensive either, but 100% worth the extra you will pay for 2 pair of cheaps that fall apart in a few weeks or a month. The leather uppers didn't crinkle, like the cheap vinyl ones do. Clean up real nice. The sides take hot concrete well. I walk .9 to and from work every day. This shoe keeps me walking and it doesn't feel like my ankles have been crushed. I work retail so in addition to walking to/from work I'm on concrete all day. Sometimes I'm in the cooler/dairy, sometimes I'm outside bringing carts in. I could be anywhere on any given day and my feet need to keep up. This shoe can absorb the shots. Looks good, feels good. I got the white w/navy N. Will buy white w/black N next. I might not ever trust another shoe to perform like this one has so far."
  }
]