[
  {
    "user": "Austin DeMaria",
    "rating": 4.0,
    "message": "These are super cute but I wear them more for fashion than I do as sneakers. They fit on the large size feeling more like a wide fit than regular. They also are not very cushiony so it makes them a little less comfortable than I had hoped for. I like them but if I had to do over I probably wouldn’t buy them again."
  },
  {
    "user": "Todd310",
    "rating": 4.0,
    "message": "We love this brand, everything a great about this show. Well made, stylish and comfortable. We only wish the white option was easier to clean. It’s seems to pick up every bit of dirt and wondered if it should have some sort of a coating to protect it from common dust and dirt. Buy this shoe in anything but white. Great shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I really like the design of the shoe. The nylon fabric used on the upper shoe is very thin."
  },
  {
    "user": "Mamalisa",
    "rating": 5.0,
    "message": "I stumbled upon these shoes online and found them on Amazon. So happy with the purchase! It’s comfortable and goes with everything."
  },
  {
    "user": "Southern.Shopper",
    "rating": 5.0,
    "message": "Omg. I wore these sneakers for the first time on my trip to Portugal. They never hurt my feet not one time during my entire trip. I didn’t have to break them in at all and walked all day with no issues. Super light weight and true to size. I’m definitely ordering another pair. I ordered my usual size 9 1/2. If you are thinking about ordering a pair. Go ahead and press the button. Enjoy."
  },
  {
    "user": "Mom of 3+1",
    "rating": 5.0,
    "message": "I’m glad I was able to find a shoe that was affordable, stylish  and comfortable."
  },
  {
    "user": "Kelly J.",
    "rating": 4.0,
    "message": "I usually buy the traditional canvas Tretorns in 6.5 And leather ones in size 7 so I thought this shoe in a 7 would be right but they were too big."
  },
  {
    "user": "Zoraida",
    "rating": 5.0,
    "message": "Me agradan muchísimo los compre por mi necesidad de comodidad y en ellos lo he encontrado todo estoy feliz con ellos"
  },
  {
    "user": "Gelsomina4",
    "rating": 5.0,
    "message": "Loved this shoes. Very cute and comfortable. Loved them."
  },
  {
    "user": "Elisa",
    "rating": 5.0,
    "message": "$100x$100 excel"
  },
  {
    "user": "heather",
    "rating": 5.0,
    "message": "Sneaker is really cute to wear to run errands; they do run a bit big but not enough to go up a 1/2 size"
  },
  {
    "user": "Jackie Humphreys",
    "rating": 5.0,
    "message": "Cute and comfortable"
  },
  {
    "user": "Serena D.",
    "rating": 5.0,
    "message": "I LOVE LOVE LOVE these new sneakers. I will buy the white and green as well."
  },
  {
    "user": "Kim Nieves",
    "rating": 5.0,
    "message": "Great looking sneaker. Very comfortable. I ordered half size smaller( Tretorn run big)."
  },
  {
    "user": "Beverly Perry",
    "rating": 4.0,
    "message": "Like the shoe but the material is too soft and they run big!"
  },
  {
    "user": "Heather Ley",
    "rating": 3.0,
    "message": "The quality of Tretorn just isn't the same as I remembered. The shoe tongue doesn't come all the way up and they just have a bit of \"cheap\" feel. I got these at a massive sale price or I would have returned them. Not worth full price."
  },
  {
    "user": "Mike & Celeste",
    "rating": 5.0,
    "message": "I found this on Amazon while searching all over the web for this particular pair in this color. They were sold out a year ago and the price was and still is $85, if you can find them. Bought this for half the price! Oh yeah! Checked them out again a few days after I bought them and they were sold out here on Amazon. This is a hard to find color hence the reason for it excitement. Moving to the technical specs, it's a classic retro style (which seems to be the trend these days, it's like wishing back for the good old days when things were cooler and actually lasted, and they were cheaper too). They're comfortable out of the box, even without socks, no blisters formed, nothing rubbed against my heel, sides of feet, toes or anything like that. It's well constructed, sturdy, with suede leather parts on nylon, the stitching is well done and the gull wing is the kind of dark green I like. Tretorn is a classic brand and I'm a classic kind of person, I guess. I have worn them and walked quite a bit in them and my feet still feel good at the end of the day. Happy feet!"
  },
  {
    "user": "JPerrin",
    "rating": 5.0,
    "message": "Quality shoe… runs a little larger than expected. Awesome color vintage white and green. Will definitely purchase another color."
  },
  {
    "user": "goddess",
    "rating": 3.0,
    "message": "I am an 8.5 and this 8.5 was way too big. Returning"
  },
  {
    "user": "Mary Alison Wilshire",
    "rating": 5.0,
    "message": "Great shoe! Cute, comfy and fits perfectly!"
  },
  {
    "user": "gina ramey",
    "rating": 3.0,
    "message": "I returned it The fit was off"
  },
  {
    "user": "Jessica",
    "rating": 5.0,
    "message": "I am always hesitant to buy shoes and clothes online however, I have complete faith in the reviews of others to guide in my purchases (thank you all). My shoe size ranges from 8 - 9, depending on the shoe. There were several mentions of running true to size so I selected my true to size in tennis shoes and purchased an 8.5. They fit perfectly. The sole is extremely comfortable, the shoe is light, high quality and it's a really great looking shoe!"
  },
  {
    "user": "K.",
    "rating": 3.0,
    "message": "I really wanted these to work. I normally wear a women's 6.5 in athletic shoes, but the 6.5's were huge! I sent them back and ordered a women's 6 and they were too snug.  These shoes are so cute and I'm so disappointed that I seem to be in between sizes. The sizing definitely seems off."
  },
  {
    "user": "kellyr",
    "rating": 5.0,
    "message": "I bought these for my granddaughter and she loves them!"
  },
  {
    "user": "Mander",
    "rating": 3.0,
    "message": "I loved tretorns in college, but these were pretty uncomfortable. Perhaps my standards are too high, but the price was too much for this level. It did make me very much appreciate Amazon Prime's try before you buy."
  },
  {
    "user": "WinnieMiss",
    "rating": 3.0,
    "message": "What a cute, sporty shoe but ohhh so wide and fits large~ had to give to a friend~ but super super cute!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wear a 7.5 but this shoe was a little wider than the normal 7.5. I put a sole insert and it feels perfect!"
  },
  {
    "user": "Christina Lauro",
    "rating": 4.0,
    "message": "From the first wear not only didn’t require breaking in but I’d forget about my feet! And everything hurts my feet!"
  },
  {
    "user": "jerseygrl70",
    "rating": 5.0,
    "message": "These are the most  comfortable, light weight pair of sneakers I own. Bonus- they’re gorgeous. I’ve actually been approached by random strangers complimenting my Treton. Highly satisfied."
  },
  {
    "user": "Hind",
    "rating": 5.0,
    "message": "Liked the fit , the design and the color"
  },
  {
    "user": "Olivia Cappert",
    "rating": 5.0,
    "message": "Cute and vintage appeal"
  },
  {
    "user": "JFaw",
    "rating": 3.0,
    "message": "These are made with synthetic material so are very hot in the summer. Shape of the toe is more pointed than I expected. This makes them feel larger. May be good for some but not for me."
  },
  {
    "user": "Lesley",
    "rating": 5.0,
    "message": "Super cute & comfy"
  },
  {
    "user": "Patrick",
    "rating": 4.0,
    "message": "Absolutely no arch support but are super stylish. Didn’t fit my pregnant feet even though I sized up. It was juuuuuust a little too snug on my right foot, length wise."
  },
  {
    "user": "Kim",
    "rating": 5.0,
    "message": "So comfortable and stylish!"
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "Very comfortable and true to size"
  },
  {
    "user": "Joyce Agee",
    "rating": 5.0,
    "message": "nice shoe , good fit , great fit"
  },
  {
    "user": "M Aguilera",
    "rating": 4.0,
    "message": "I love the tennis shoes unfortunately I received wrong pair; I ordered the red, white, and blue version but received the blue/white version.  I’m keeping them just bummed I didn’t get the correct color combo."
  },
  {
    "user": "Sharon",
    "rating": 3.0,
    "message": "These were really nice sneakers but they did run a bit large for me. I ordered my normal size of 8.5 however I could’ve order an 8 instead. You may need to size down. The only thing I couldn’t get past was the squeaking noise they made so sadly I had to return them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Exercise walking"
  },
  {
    "user": "Seslie Kennedy",
    "rating": 5.0,
    "message": "Comfortable. Use for casual wear"
  },
  {
    "user": "Benjamin A Reynolds",
    "rating": 5.0,
    "message": "old school sneaker feels and fits great"
  },
  {
    "user": "M McMahon",
    "rating": 2.0,
    "message": "I agree with some other reviewers that these shoes don't seem like \"real\" Tretorns.  I had to buy inserts for the shoes almost immediately, because they were so uncomfortable.  They are very lightweight, which is nice, but in this case, it feels like it's because the materials they used are so cheap.  I'm disappointed, since they weren't cheap."
  },
  {
    "user": "Christy Westmoreland",
    "rating": 5.0,
    "message": "Bought these for a vacation where we were going to walk a lot. They were amazing I will be buying more in different colors."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I was born in the 70s and wore the cloth Tretorns growing up - so I prefer the description \"retro\" rather than \"vintage\"  But, they are so cute - every single time I wear them -  I get a compliment and a recognition of the old school brand.  Love! Love! Love these! So cute!"
  },
  {
    "user": "Michelle",
    "rating": 3.0,
    "message": "They are cute but really wide and light weight"
  },
  {
    "user": "Sheribg",
    "rating": 4.0,
    "message": "This is my second pair of these tennis shoes. I bought them for the price and color. But as I compare them to my first pair, these make a squeaky sound when I wear them. I didn’t return because I thought I’d break them in and the sound would stop. I do not wear them daily, but have worn them about ten times, and they continue to squeak. Otherwise, the fit and style are great and I love these shoes (& get compliments on them when I wear them)."
  },
  {
    "user": "D. Wallace",
    "rating": 5.0,
    "message": "These are great and comfortable.  If between sizes, size down, they run big."
  },
  {
    "user": "LauraL",
    "rating": 2.0,
    "message": "Ended up returning because they ran small and had no cushioning in the heels."
  },
  {
    "user": "Claudifer",
    "rating": 5.0,
    "message": "They look great and feel like socks 🌟"
  },
  {
    "user": "Anne French",
    "rating": 4.0,
    "message": "I usually wear an 8.5 in tennis shoes. I sometimes wear a 9. I read were these ran small. Plus the sizing was limited so I thought I would try a 9.5. It worked fine."
  },
  {
    "user": "Leslie Haws",
    "rating": 5.0,
    "message": "Love the look and comfy fit of these sneakers. Well made and they look great with anything :)"
  },
  {
    "user": "debbe",
    "rating": 3.0,
    "message": "The shoes seemed flimsy....not surebif theybare authentic. ??"
  },
  {
    "user": "wheelerlibrarian",
    "rating": 5.0,
    "message": "These run a size to 1 1/2 sizes large. I ended up with 8. I usually wear 9 - 9 1/2. These are very comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Love the way they look but they have no support at all."
  },
  {
    "user": "Clayton Walton",
    "rating": 5.0,
    "message": "I love them!!!"
  },
  {
    "user": "Tabitha C.",
    "rating": 2.0,
    "message": "No arch support. Flat insole. Can’t imagine these would be practical or comfortable walking shoes for those with flat feet or high arches."
  },
  {
    "user": "Shawn",
    "rating": 5.0,
    "message": "Extremely light weight, like wearing socks. Love love love them!"
  },
  {
    "user": "Vic",
    "rating": 1.0,
    "message": "I was so excited to get these shoes. When they went on sale I picked them up. They are comfortable with the foam insole. However they are massive. Be ause they are so big, by trying tighter it's put strain on the laces and tire the sides. Really poor quality. Size 1.5 down. Would have returned but wire outside first time I wore them. Sides tore with thread coming up after first wear."
  },
  {
    "user": "Kristina",
    "rating": 5.0,
    "message": "Pretty, light, comfortable"
  },
  {
    "user": "Nat74",
    "rating": 5.0,
    "message": "The are a tad big. I have a narrow foot, and they are a little wide, but I kept them. They are much cuter in person. Must buy!"
  },
  {
    "user": "Stac",
    "rating": 5.0,
    "message": "I love these sneakers!  Lots of complements on them and super cute!  They are a little narrow so if you have wider feet prolly not for you!  But works great for a style staple in my sneaker wear!"
  },
  {
    "user": "R.G. Friedman",
    "rating": 5.0,
    "message": "I am a size 4 shoe & a hard fit so I don't buy shoes on line often. But with the Pandemic I have been shopping more online & these sneakers were so cute I couldn't resist taking the chance. I am glad I did. The are comfortable to wear & fit well. My only complaint is the shoes are a bit stiff putting them on. I think that once they are broken in & worn a lot this will change."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I loved the retro look. Very comfortable."
  },
  {
    "user": "GC",
    "rating": 5.0,
    "message": "Loved the tennis but they run a bit big. I'm a true 8.5 an 8 would've fit perfectly."
  },
  {
    "user": "ibgagirl",
    "rating": 5.0,
    "message": "I am IN LOVE with these. I wore the original tretorns in the 70’s and early 80’s. They were always the pinnacle of comfort. Recently, with the trend being retro brands are new again, I ordered some other “iconic” brand. They are not comfy and the sizing was off. I remembered how much I loved the tretorns of my youth. I wanted not only a comfy shoe but stylish as well. I intended to purchase the original nylite style but these grabbed my eye. 2 days later they arrived. I tore open the box, slipped them on, and have worn them every single day. Compliments galore. I was standing on a sidewalk waiting to cross a street and 2 different passers by in cars yelled “love your shoes” to me. Best purchase in a long time!!"
  },
  {
    "user": "Wen",
    "rating": 5.0,
    "message": "They are fantastically light and comfy!!"
  },
  {
    "user": "Nicole Veazie",
    "rating": 4.0,
    "message": "I grew up in the 80s in Nola and Tretorns were popular. I’ve only seen them in white with the different color check. Well these colorful ones attracted my attn. I love them and get many compliments. I give it 4 stars bc the material reminds me of a cheap plastic. I feel like if my foot expands, the shoes will come undone. Prob not true, but that’s how cheap the material feels. Would I buy them again? Yes!!!! They’re too cute and rather comfortable!"
  },
  {
    "user": "Sharon",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Staci",
    "rating": 2.0,
    "message": "I wear size 7 in women but these were about 2 sizes too big! Not sure if its in men or womens size. Very cute shoe tho. Wished they had fit me."
  },
  {
    "user": "gladiator unbeatable",
    "rating": 5.0,
    "message": "I had a pair of Tretorn when I was in high school (a lifetime ago). I thought the company had gone out of business. Turns out they just quit selling them at stores near where I lived. I came across them again on another website and then found them on here. These are the second pair of Tretorn I’ve bought on Amazon and I LOVE them. They fit great. They are adorable and I’ve gotten compliments on them every time I’ve worn them. They are super unique. And sooooo comfy. I wore them on a trip to New York and walked all over the city and my feet never hurt! Great shoes. Cute and comfy."
  },
  {
    "user": "Kristin Crocker",
    "rating": 1.0,
    "message": "I had these shoes for about a month and was wearing them out on a trip.  I came back to the hotel, and took off the shoes and sole separated from the actual shoe.  Thankfully I had another pair of tennis shoes with me, but it is still frustrating."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "I typically wear a 6.5/7 I ordered a 6 and a 6.5 both way too big.  The insoles in both pair I purchased were cut smaller than the inside of the shoes so even if they would have fit this would not have been comfortable.  The soles seemed liked a rubber blend or some sort. Again, if they would have fit I wouldn’t have kept them because I don’t like my sneakers to be slippy and sound like kids plastic at shoes."
  },
  {
    "user": "Yvette Carroll",
    "rating": 5.0,
    "message": "I‘be been a Tretorn fan since the 90s. Love these shoes!"
  },
  {
    "user": "paula tatum",
    "rating": 5.0,
    "message": "Retro and super cute!!"
  },
  {
    "user": "Ryan ODowd",
    "rating": 3.0,
    "message": "Way too large."
  },
  {
    "user": "Stacey Dennis",
    "rating": 5.0,
    "message": "Love the feel of the shoe. Haven’t had a pair of Tretorns since high school and that was a LONG TIME AGO!!!  They still feel as comfortable as they did back then. Unfortunately my right foot is bigger than my left foot in my old age so my big toe on my right foot is a bit snug in the shoe but that’s not Tretorns fault. The design is a bit flashy for me but I got them to wear at Disney so I figured I could act my shoe size and not my age while at Disney."
  },
  {
    "user": "Megan Thorpe",
    "rating": 5.0,
    "message": "Loved so much, bought a 2nd pair. Perfect with jeans, skirts, dresses, you  name it."
  },
  {
    "user": "ROXANNE MARTIN",
    "rating": 4.0,
    "message": "Love the shoe,  need it in a 6 1/2 ."
  },
  {
    "user": "Lindsey",
    "rating": 2.0,
    "message": "Excess glue on the suede caused a portion of the shoe to be discolored. The interior stitching is bulky and rubs foot because there isn’t any lining and the stitching us exposed. Disappointed. Not recommended."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "I love the shoes, but am disappointed in the quality. I’ve worn them 4 times and they have already started to deteriorate where the toe creases. With each step the interior lining pinches the toe fabric so there’s a permanent pick on both shoes. I doubt many will notice, but it’s disappointing having only worn them 4 times."
  },
  {
    "user": "Yasmeen Husain",
    "rating": 5.0,
    "message": "I love these! I have wide- post -pregnancy -weight -gain -feet and these are very comfy. They appear very narrow but they do not fit narrowly.  These would not be good for running I don’t think (at least not if you are overweight). I love the retro look of this shoe too! I will bit again, I do believe!"
  },
  {
    "user": "Julie M",
    "rating": 5.0,
    "message": "Cute look!"
  },
  {
    "user": "arnita jackson",
    "rating": 5.0,
    "message": "I love love love this shoe but I ordered the wrong size so I am saddened that I  had to send them back . Now they are out of stock in my size and I can't find my size any where"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love the old school look of these sneakers. They felt really snug at first, but quickly molded to my foot. They are very comfortable. I'm no shoe expert, but I don't think that this sneaker is good for wide feet."
  },
  {
    "user": "Rachel M.",
    "rating": 1.0,
    "message": "These sneakers were HUGE. So strange my normal size would be that far off. Seems unlikely and makes me wonder if there was something faulty with the Amazon Tretorns? Retuned …"
  },
  {
    "user": "HauteMomma",
    "rating": 5.0,
    "message": "If you like bright. colorful and cheerful sneakers, then these are the ones for you! It was comfortable walking in them all day.  They're true to size, so if you typically wear a 7 or 8 then buy your normal size."
  },
  {
    "user": "FamilyofFour",
    "rating": 5.0,
    "message": "Love this shoe! It's my second pair. The fit is spot on and I've received a lot of compliments."
  },
  {
    "user": "S+H",
    "rating": 5.0,
    "message": "These are long shoes. I normally buy a 6 in running shoes or sneakers and in these I bought a 5.5. They’re a bit too long in the toes, but I love them so much I don’t care. I could have done with a 5 in the length, but these work fine and are so comfortable!! And I love the colors!"
  },
  {
    "user": "Amazonwoman",
    "rating": 5.0,
    "message": "This old school beauty slipped on my foot like I was Cinderella.  Perfect comfortable fit. Streamlined toe and slightly elevated sole makes my foot look lean.  I love this Tretorn White w/ red and light blue accents...super cool and eye-catching.  With the color being mainly white, the subtle colors pop just enough to say a little something.... I am a new fan of this classic"
  },
  {
    "user": "P. Sampson",
    "rating": 4.0,
    "message": "I felt the retro love. Friends of the 1990's noticed these shoes. Anyone born past 1999 didn't know the impact of this brand. Most Tretorns are too large, but this fit my foot. I usually take a \"B\" 9, but a regular 9 fit. It doesn't breath that well, so you'll have some warm hooves."
  },
  {
    "user": "bargbet",
    "rating": 1.0,
    "message": "The overall appearance of these shoes were so disappointing.  Plastic, stiff, cheap... should have paid attention to reviews.  Overall, shoes were wide and too short - boxy.  I was a Tretorn fan for years, many years ago and loved them.  Was hoping they'd be a cute option for summer shoes with dresses etc but will be going back asap."
  },
  {
    "user": "bluebug02",
    "rating": 1.0,
    "message": "Knock-off shoes? Not sure, but they were nothing as advertised. Just a very cheap and poorly made shoe."
  },
  {
    "user": "Jennifer Wagner",
    "rating": 5.0,
    "message": "I love these Tretorns. I get so many comments from people who wore the classics in the 80s. Very comfortable."
  },
  {
    "user": "Lisa Garlock",
    "rating": 4.0,
    "message": "7.5 was $15.49, size 7 was $75; so I went with the 7.5..  it's a little big, but the shoe is very cute so I am going to keep.  (it is a pointy tennis shoe so it is long)  Came with 2 sets of shoe laces, nice touch."
  },
  {
    "user": "J.L.",
    "rating": 5.0,
    "message": "I ABSOLUTELY LOVE these shoes! They look adorable on and are very comfortable. If your looking for that vintage tennis shoe look, you have found it! I get so many compliments on these!"
  },
  {
    "user": "Latangela P.",
    "rating": 1.0,
    "message": "The shoe is not like the old school Tretons.  They have an old look to them.  Not the most attractive."
  },
  {
    "user": "Eunice",
    "rating": 1.0,
    "message": "I bought this Warehouse item as new, but it arrival crushed and deformed, after one week of use the sole was come off, I claimed several times and Amazon did not want to take responsibility for this. I lost my money and sports shoes."
  },
  {
    "user": "corby peck",
    "rating": 1.0,
    "message": "Don’t recommend. Fabric tore after two times of wearing."
  },
  {
    "user": "Clark",
    "rating": 5.0,
    "message": "Love this shoe they her some dope 10 stars for me"
  }
]