[
  {
    "user": "Just a person",
    "rating": 4.0,
    "message": "they didn’t fit! Order up a size"
  },
  {
    "user": "Captain Mike",
    "rating": 4.0,
    "message": "These are narrow and run small. I can imagine them being comfortable if they were not so tight."
  },
  {
    "user": "Brooke Castle",
    "rating": 5.0,
    "message": "Comfortable and cute"
  },
  {
    "user": "kittygotclaws",
    "rating": 4.0,
    "message": "I initially bought these in Olive size 9 which is what I am in my other Steve Madden Linqs sneakers but these were a very small fit. I could get my foot in but not walk in them so they were returned. They were gone in the 9.5 in the Olive so I bought the grey. Its a lovely light shade of grey and fit perfectly. I have a narrow foot. Listen to the reviews to size up a half size. The only reason they got 4 stars is they are scuffed on the backs of the heels when I took them out of the box and on the front of one shoe, the zips are extremley stiff to pull or down and they are not as high on the foot or the wedge as my linqs pairs. However, when I printed the return label for the olive pair and rang DHL for collection I was refunded immediately from Amazon which was fantastic and enabled me to buy the grey pair before they sold out. There will be a breaking in period I feel which there wasn't with my other pairs, I can wear those all day but these are fab. I would buy another if they were available in 9.5. :)"
  },
  {
    "user": "LF",
    "rating": 4.0,
    "message": "Love the style and comfort. The only downside is that the  inside of a sole cracks after significant wear and you have to buy a new pair. I am on #4 since the show came on the market several years ago and I wear it non stop. Love the design, wide or narrow, it fits well. Great quality, easy to brush to clean, and there is always toothpaste to clear the sole."
  },
  {
    "user": "Sindy Guevara",
    "rating": 5.0,
    "message": "I am a big fan of Steve Madden shoes. I have these in the dark grey color and I absolutely love them. I had to get them in black for this year. Great shoe and comfort"
  },
  {
    "user": "J. Warren",
    "rating": 3.0,
    "message": "Seem ok - design looks nice"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoes are good. I had to return for a larger size because they are narrow. Side note the driver threw the box on my door so hard the box was broken.  Good thing the package didn't have glass in it."
  },
  {
    "user": "PAULETTE",
    "rating": 5.0,
    "message": "Great quality and comfort. Zippers on both sides ads to the ease while taking them off and on. Very cute with jeans or shorts."
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "I just got these in the mail and I absolutely love the look and feel of these shoes. HOWEVER, I feel like I got a used/returned item. The shoebox itself had been torn up and taped back together. The bag the shoes were in had dirt on them making me question the storage condition of these shoes. The shoes themselves look fine until I put one on and noticed the inside lining on the right foot had apparently started to come off at the toe. The white around the bottoms was just a tad dirty but cleaned right off with a magic eraser. The right seam on the heel also looks a little worn. So far it doesn't feel like enough to go through the hassle of a return as the shoes still look great, but I haven't decided yet. I read the reviews that these fit small so I sized up 1/2 a size and even then is a little snug. Also, after walking in these shoes for like 10 minutes, the white bottom already looks a little squished by the ball of my foot. I like the look of the zippers down so I'm not worried about them breaking but I could see how others say they don't work very smoothly. So overall thoughts are I LOVE these shoes but I'm very worried they won't last. I will update in about a month!"
  },
  {
    "user": "T.  Lee",
    "rating": 4.0,
    "message": "I have a different pair of Steve Madden shoes, different style, that fit perfectly.  So I was very surprised that these 9's were too tight!"
  },
  {
    "user": "Hannah R.",
    "rating": 5.0,
    "message": "I loved the look of these Steve Madden wedgies, but I was having a hard time justifying the price.  Sooooo...I first bought a cheap knock-off pair for a third of the cost🤦🏻‍♀️.  I am writing this review to stop you from making the same mistake!!  Just bite the bullet & pay for a quality product.  The cheap pair looked cute enough, but after a few hours I could really feel them cutting into my toe box.  I was stubborn & wore them several more days, hoping it would get better as they stretched out, but I always left work limping.  Just awful!  Cheap construction, too.  Stitches were already going. Last week I went ahead & purchased this Steve Madden pair and have been wearing them all week to work.  So happy with these shoes!!!  I had read other reviews mention needing to size up, so I decided to order an 8.5 instead of my usual 8.  I think I made the right decision.  I wouldn’t want them any tighter.  The first day my inside right foot felt the zipper more than the left, but eventually it stretched a little & I haven’t felt it since.  Perfect shoe for dressing down but still looking cute.  Quality construction—these will last a while.  No regrets!!"
  },
  {
    "user": "Lizette Woerner",
    "rating": 3.0,
    "message": "I was so excited about these adorable shoes.  They arrived quickly and the packaging was outstanding, but I wasn’t crazy about the look of the shoe.  I thought they looked cheaply made, stiff/cardboard like, and they are definitely made for a narrow foot.  I normally wear a 5.5 or 6 regular, but these were unbearably painful on my piggy toe.  So I had to return them. I know some people mentioned going up half a size, but that’s never an option for me given the stiffness of the shoe that would’ve made them too clunky and loose around my ankle."
  },
  {
    "user": "Nevada C.",
    "rating": 5.0,
    "message": "I bought a size 7 I typically always wear a seven sometimes even a 6.5. These were SO small I thought it must have been a mistake and carefully looked at the sizing on the shoe again. It felt at least a size 6. I’m waiting on a size 8 and hoping that will fit better. I wore them for a few hours to an event and they killed my toes because of how small they were but otherwise surprising comfy!! Zippers didn’t work as well as I thought and the white part got dirty fast but I do love them. I’ll either update this review or make a new one when the size 8 comes but you MUST SIZE UP Update: I got the size 8 and they fit better, I still could do a size 8.5. If zipped up all the way they rub on my ankle bone so I unzipped a tiny bit and they’re perfect. The white trim gets dirty SO fast and the suede black does too with lint and hair sticking. I wouldn’t pay $90.00 for these but they were on sale for $37 so for that price they’re worth it."
  },
  {
    "user": "MK",
    "rating": 5.0,
    "message": "I usually wear a size 7 and I purchased an 8 which was a perfect fit. My feet are on the narrow side."
  },
  {
    "user": "Carolina Ch",
    "rating": 2.0,
    "message": "Unfortunattly I did not paid attention to the size up reco and my regular size 8 was too tight. Also I feel they are hard to the feet, making it unconfortable to wear. I did not returned them because it was an internacional shipment so I ended up giving them away. Lost my money"
  },
  {
    "user": "Dina Garafola",
    "rating": 2.0,
    "message": "Unfortunately it took only 2 light wears for the sole to separate from the shoe. I'm so disappointed in the quality because I really loved the style."
  },
  {
    "user": "Katherine Hall",
    "rating": 5.0,
    "message": "I wear a 7.5  - 8. Ordered an 8 to be safe. Glad I did. Wear thin socks with them."
  },
  {
    "user": "AVchicky",
    "rating": 5.0,
    "message": "Typical great quality expected from Steve Madden. Great looking shoes. Pretty comfortable. Great travel shoes, easy On/off."
  },
  {
    "user": "lori",
    "rating": 4.0,
    "message": "These booties are cute, but hopefully they will stretch some. They feel a little short in length."
  },
  {
    "user": "Amanda Pavek",
    "rating": 3.0,
    "message": "The black comes off all over you ankles! These are expensive shoes to have to wash your feet every time you take them off. Cheap soles mean they scuff up EASILY and you need to clean them after every wear.  They fit as expected and are cute though."
  },
  {
    "user": "Julie Flugrad",
    "rating": 5.0,
    "message": "I bought the gray pair for my daughter.  I already own a brown pair.  I probably wear this pair of shoes more than any other I own.  I sized up a half size because they were a little snug. Love them!"
  },
  {
    "user": "CMMacy",
    "rating": 5.0,
    "message": "This was when the reviews came in handy & were so worth heeding. They run 1/2 size smaller than normal. I usually wear a size 7.5 in all of my Steve Madden shoes/boots so when the word was out that these run small I ordered up a half size & so happy that I did!"
  },
  {
    "user": "Danielle",
    "rating": 3.0,
    "message": "Run small should have gotten the next size up"
  },
  {
    "user": "cheryl burke",
    "rating": 5.0,
    "message": "These are great however they run small order a half size up!"
  },
  {
    "user": "Julia Pearson",
    "rating": 5.0,
    "message": "Love the gray color of this wedge sneaker.  Pretty comfortable after wearing a few days for an entire day.  I even threw axes in them last night."
  },
  {
    "user": "GIOVANNI ROCCA",
    "rating": 5.0,
    "message": "Daily use"
  },
  {
    "user": "marilyn",
    "rating": 5.0,
    "message": "These were super cute and well made. I have a medium width foot yet they were too narrow across the widest part of my foot. I’ve never had a shoe fit me too narrow so I was disappointed to have to return them."
  },
  {
    "user": "SpringBlossoms",
    "rating": 4.0,
    "message": "True to other reviews, they were a half size too small. I'm typically an 8.5 and ordered my true size, because they didn't have a 9 in stock, but they are too tight. Some reviews said they stretch out over time but I don't think they stretch out enough. Unfortunately, I'm sending them back. For $30, I thought I could pull it off!! Otherwise, the shoes look great."
  },
  {
    "user": "Karen Stringer",
    "rating": 5.0,
    "message": "LOVE these cute boots! I typically wear an 8.5, which is what I ordered and they fit perfectly! Some of the reviews on here kinda had me worried, saying these boots are so tight and to size up. I’m so glad I didn’t listen to them. They’re completely wrong! I personally have some experience with actual tight boots and these are totally fine and not tight whatsoever. These boots are trendy, stylish and comfortable. If you’re on the fence, just go for it and get them. You won’t be disappointed. So happy with my purchase. It was worth the price too!"
  },
  {
    "user": "Allison Shoemaker",
    "rating": 3.0,
    "message": "These run vary narrow and rub on the ankles. I had to return them for discomfort."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love the overall look of the show but the shoe itself is very narrow. Hopefully it stretches."
  },
  {
    "user": "Kelly A. Pandofi",
    "rating": 4.0,
    "message": "I love the looks of this shoe.  I usually wear an 8.5 but ordered up after reading other reviews (great idea).  I wore them around the house and the inside zipper kept hitting me on my inside ankle bone.  I'm hoping that the more I wear them they will feel better."
  },
  {
    "user": "Juleybee",
    "rating": 3.0,
    "message": "I do like these boots but they are quite uncomfortable at times. They are very stylish but they make my feet tired, they are cushioned but I realized that I have never been a fan of Steve Madden shoes."
  },
  {
    "user": "Lisa McNary",
    "rating": 4.0,
    "message": "I should've listened to the reviews and went up a 1/2 size! They were super cute and seemed well made but unfortunately they were too narrow for me. I ordered an 8 and wish I ordered an 8 1/2, sadly I had to return these."
  },
  {
    "user": "L. Metts",
    "rating": 5.0,
    "message": "This is my 4th pair…..second in black"
  },
  {
    "user": "Mariela",
    "rating": 4.0,
    "message": "I'm a 6.5 and ordered a 6.5 and they are good looking, comfortable but a little tight, I can not use them with regular socks, I have to wear thin socks or none to be able to feel them comfortable.  That said, they look super cool an they rock!"
  },
  {
    "user": "tiffywynne",
    "rating": 4.0,
    "message": "I really like these sneakers and they're pretty comfortable. One of the zippers will not stay up, but I still wear them. I like that they're actual suede. The other ones I saw were faux suede."
  },
  {
    "user": "Silcal85",
    "rating": 1.0,
    "message": "I was so excited about these shoes but quickly disappointed when I put them on and realized how narrow they are. I do not have wide feet and these are so painful and uncomfortable. I would size up if you want to buy these and hope they fit better."
  },
  {
    "user": "Hunzi",
    "rating": 5.0,
    "message": "Well made and comfortable."
  },
  {
    "user": "MarineMoM",
    "rating": 3.0,
    "message": "I love these shoes and have been going back and forth on buying them. When the olive color came up on sale, I pulled the trigger. I sized up 1/2 of a size from my normal based on many reviews. They arrived, perfectly packaged and I fell in love. That’s where it ended. The zippers were almost impossible to get up and down. You can’t get your feet into them without having at least 1 of them unzipped. I kept them for a couple weeks, trying the zipper over and over, hoping it would loosen up. The length was perfect and slightly narrow, but not a deal breaker. Unfortunately, I had to send them back. It wasn’t worth it to fight with the zippers every time I wore them. They are well made and great looking shoes...if only the zippers would work. Sigh!"
  },
  {
    "user": "Jbarr",
    "rating": 3.0,
    "message": "I was a big fan of the Steve Madden Women's Caliber Sneaker so when I saw this shoe I was very excited. These run about 1/2 a size small and are much stiffer than the caliber sneaker. I found the caliber sneaker much better for me personally than these. I love the look of these shoes just not on me, they seemed clunky and heavy in my opinion."
  },
  {
    "user": "Mrs. Otey",
    "rating": 5.0,
    "message": "Let me tell you, these are the most comfortable & cute wedges I have ever worn! I am a plus size woman with wide feet and I ABSOLUTELY LOVE these shoes! I rather where these than my regular sneakers."
  },
  {
    "user": "Christine Breslin",
    "rating": 1.0,
    "message": "This is the 3rd pair of these exact shoes and first time buying from amazon.  The black bleeds all over my feet, ankles and on to the white sole without even getting wet.  Very unhappy about this."
  },
  {
    "user": "shrimpeez",
    "rating": 5.0,
    "message": "These shoes are super cute and I can wear them all day at work.  I bought a size 10 because that is what I wear in normal sneakers.  They are fairly true to size but they just fit.  I think it's because the tow is a little more narrow than my running shoes.  Anyway, it's nice to find something fashionable that is comfortable.  And the quality seems really good."
  },
  {
    "user": "Wire122",
    "rating": 3.0,
    "message": "I ordered my normal size (6) and the shoe was far too tight.  Couldn't zip shoes on both sides.  I'm almost always a size 6, only exception is in running shoes when I size up to a 6.5.  I ordered based on other reviews but it didn't work.  The other issue I had is that in needing to return the shoe due to size, I'm having to pay return shipping.  I would gladly try for the next half size up but if those don't work as well I'm not paying $11 for shipping and no pair of shoes.  What a disappointment. Will go with a different company that offers return shipping/exchanges vs. something on Amazon where I'm paying return shipping to the 3rd party vendor."
  },
  {
    "user": "Alliiance",
    "rating": 4.0,
    "message": "I wear a size 8, but i read reviews saying the shoes were running small...SO i purchased an 8.5. When the shoes came, they were too big. I considered keeping them in case the 8's were too small, but my foot would literally slide out when I walked. So i returned them for an 8, and when those came they definitely felt too small (mostly just narrow). I decided to keep them in hopes that they'd stretch, and they did! Now they fit like a charm. Although they feel small at first, I would definitely go with your original shoe size and just wear them around so they stretch. I love these shoes and would buy again!"
  },
  {
    "user": "Agy",
    "rating": 4.0,
    "message": "Great fit and pretty comfortable. The only reason I took of one star is because one of the zippers feels a little uncomfortable pressing into my ankle."
  },
  {
    "user": "Dana Starr Fudge",
    "rating": 5.0,
    "message": "This suede wedge sneakers is the perfect solution for dressing up any outfit. Stylish and comfortable."
  },
  {
    "user": "Malibu, CA",
    "rating": 4.0,
    "message": "I was shopping for a boot that I could wear in the summer and this one is it.  It also has a wrapped wedge heel that gives a little height with the look of a sneaker.  The only con I can describe is in the way the pieces of leather are stitched together across the top of the foot.  The seam is rigid and doesn't arc well so it seems wide at that seam.  I've been adding inserts to try and shape the seam into a natural curve/arc when I'm not wearing the shoes.  I still love the boots, even with this small issue."
  },
  {
    "user": "Nancy Capozzi",
    "rating": 5.0,
    "message": "I absolutely loved these wedge sneakers.  I was so happy to finally find them at a reasonable price but when they arrived they didn’t fit.  They were too nice to return so I gifted them to my friend.  She loves them."
  },
  {
    "user": "Kenzie",
    "rating": 3.0,
    "message": "I really wanted to love these, although they just didn't look great on me. I am short so they just look too big and clunky. They are a heavier wedge than I am used to wearing, definitely not a lightweight shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I’d buy it again in different colors!"
  },
  {
    "user": "Monica B.",
    "rating": 3.0,
    "message": "I wear 6,5-7 and ordered 7 But too small too tight and hurts my ankles too The material is not so soft (especially near ankles)"
  },
  {
    "user": "Miss G",
    "rating": 5.0,
    "message": "My new favorite pair of shoes!  Looks super cute yet comfortable!  Beauty doesn't have to be pain!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I’m so bummed! I bought the leopard print wedgies in my true size, 8.5, and they’re too small. I should’ve sized up like some reviewers were saying. Now the sale price is gone and the 9 and 9.5 are sold out. They’re super cute, great quality, and came packaged very nicely though. I’m going to cry all the way to Kohl’s when I return them."
  },
  {
    "user": "JessieH289",
    "rating": 4.0,
    "message": "These shoes look amazing, but I agree with the other reviews; they run small. My foot is on the wider side, and I normally wear a size 9. I am returning for a 9.5."
  },
  {
    "user": "Megan Price",
    "rating": 3.0,
    "message": "I always wear a size 7 and I could barely get these on my feet. Once I got them on, there was no way I could walk around in them. Super frustrated at the sizing and that I had to pay return shipping costs to the seller. These are cute and seemingly well-made, but the sizing is so off. I went with Cushionaire brand instead and they're half the price and twice the comfort!"
  },
  {
    "user": "Pamela Rall",
    "rating": 5.0,
    "message": "Love these,so comfy and they fit perfectly!!"
  },
  {
    "user": "Allyssa",
    "rating": 5.0,
    "message": "These fit perfectly and I can wear them for long periods without having to take them off. They’re so cute I’m obsessed with them."
  },
  {
    "user": "Patrick",
    "rating": 4.0,
    "message": "My daughter loves these and they fit her feet fine, but she has big ankles and they are difficult for her to get on. If the zipper were functional this would have solved the problem."
  },
  {
    "user": "kailuagirl808",
    "rating": 4.0,
    "message": "These were part of a Prime Wardrobe shopping spree! I've been eyeing this wedge sneakers for like a year and was excited to finally try them out. They are every bit as cute as I thought they'd be, although a bit on the small side. I usually wear an 8, but these were a little snug with a light sock on. Overall, I loved these and ordered a half size bigger; definitely recommend. Pros: -love the approximately 2 inch hidden wedge -easy on/off -suuuuper cute Cons: -run a little small"
  },
  {
    "user": "M. A.",
    "rating": 5.0,
    "message": "These are expensive but really nice. I had to return mine because a have chubby feet and they were too tight, but that's me. Would have loved these in a loose fit or wide."
  },
  {
    "user": "Victoria V",
    "rating": 5.0,
    "message": "These shoes are so adorable! They do run small though. I am usually a size 8 but bought an 8.5 because I read the reviews. The 8.5 fit perfectly! The only downside was the fact that the top of the zipper kept digging into one of my ankles, but I just unzipped it a tiny bit and then it was perfect without looking weird at all. That's why its still 5 stars for me! I also don't think these shoes would be very comfortable for a wide foot or thick ankle though. I wanted to edit this review because after wearing these shoes a few times, I broke the in a bit more and the zipper at my ankle is no longer a problem! Yay!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I sized up a 1/2 a size and it they were to big. I returned them, but they were nice quality and comfortable."
  },
  {
    "user": "jasmybell",
    "rating": 5.0,
    "message": "Cute and cozy"
  },
  {
    "user": "Samantha",
    "rating": 3.0,
    "message": "Really comfy and seem like a great show. The faux suede however was scuffed and oddly colored in spots - kind of alike they were worn once or twice."
  },
  {
    "user": "Rebekahra",
    "rating": 5.0,
    "message": "They are exactly what I was looking for! I was going to buy a knock off brand but I wanted quality and comfort over cost. I’ve only worn them for about 30 minutes and it will take some time to break them in. They fit true to size. I do not have a wide foot. I am an 8.5 and I ordered an 8.5. I also like the added height."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I tried these shoes on at a dept. store in my size and sadly they were to tight. I searched on Amazon and found at the same sale price as the store. I ordered a half size up and they fit great. I have a high arch so they are perfect for dinner or evening out but with out arch support I could not wear all day.  They look amazing with skinny jeans."
  },
  {
    "user": "Nikki Tackett",
    "rating": 5.0,
    "message": "I'm glad u read the reviews. They show runs small. I'm usually a 6.5 and I got a 7 in the army print. By the end of the day they did loosen but only giving more room i needed. I also ordered the light grey with little holes, again sizing up, and they are perfect i love these shoes! Size up and you'll love them too!!!!"
  },
  {
    "user": "Ela",
    "rating": 2.0,
    "message": "As soon as i took these out of the box I immediately thought they must have sent the wrong size. I checked the box and the shoe and they were labeled a size 8 but there is no way I could have worn these without being in severe pain. Yes, I could fit my foot in but it was very very tight. I would size up twice if this is how all of them are made."
  },
  {
    "user": "Keri C",
    "rating": 4.0,
    "message": "I bought a 1/2 size up and so glad I did.  I have wider feet and was worried they would be too narrow but surprisingly they're not. They're a little stiff at first but I'm sure they'll break in. Happy with my purchase!"
  },
  {
    "user": "Elizabeth",
    "rating": 3.0,
    "message": "The answer from the seller about the \"vegan leather\" material is misleading: this is an ankle-height rubber rain boot. Thick, heavy rubber. Like your childhood wellies, but even floppier because they are super wide, especially at the ankle. Before I applied an insole, it felt like I was standing and trying to walk wearing a plastic bucket on each foot. That being said, once I had my favorite insoles in they became wearable. I am keeping these for the upcoming rainy months as rainboots I can wear casually, but the fit and material were a complete surprise."
  },
  {
    "user": "Beth Sheola",
    "rating": 5.0,
    "message": "Love them, they're tight at first in toes and ankles but loosen up with wear. If you're a perfectionist like me with your special shoes, you wont like how dirty the soles get and how fast. Even with a magic eraser cant get all the dirt off. So that sucks but they're super cute if you can keep them clean."
  },
  {
    "user": "Rachel P.",
    "rating": 5.0,
    "message": "I love these because I can dress them up or down and always get a little extra height that I like. They are super comfortable so I can wear them all day walking around and not have my feet hurting by the end of the day. I typically wear a size 8 (which is what I ordered) and they fit me perfectly. I do have narrow feet where I could see a person with wider feet my having issues (just as a heads up)."
  },
  {
    "user": "V Billings",
    "rating": 5.0,
    "message": "After reading reviews I decided to size up. I wear an 8 in all other Steve Madden shoes. I ordered an 8 1/2 because I was scared they would be too small if I got a 8. The 8 1/2 were way too big! I ended up selling them to a friend because I hate having to deal with returns. I just got my Size 8 in today and they’re perfect. I have a narrow foot and they fit great. If you have a wide foot I would size up. Overall they’re the cutest shoes and so comfortable!"
  },
  {
    "user": "tim",
    "rating": 5.0,
    "message": "So cute. They are not walking shoes, they rub a little at the ankle. But for waterproof rain shoes, they're adorable. I got compliments on them at work, no one could tell they were rain boots. They have a comfy sole, not much arch support but they're soft so no problem wearing them all day, just the couple spots where they rub do get sore."
  },
  {
    "user": "Izumi Jones",
    "rating": 5.0,
    "message": "These are very comfy and are to size. I got a 6 since my size will vary between 6 & 6.5. With Steve Maddens 6.5 would be too big for me and uncomfortable. I love these since I can still wear a thin pair of socks and my feet have room to breath."
  },
  {
    "user": "Giovany Esteban Alvarez Triana",
    "rating": 5.0,
    "message": "La medida, el color, la marca y sobre todo la comodidad"
  },
  {
    "user": "Nazerine",
    "rating": 4.0,
    "message": "Quality is great, super cute & fashionable. However,  I have narrow feet and even with thin sox these 8.5 were still a bit snug fitting ...so I suggest going a half size up if you wear thick socks.  Also the zipper part hits the ankle area which can hurt a bit unless your socks cover your ankle. Otherwise,  I like them."
  },
  {
    "user": "jaime mathis",
    "rating": 4.0,
    "message": "The 7 firs my foot but can’t be worn for too long without hurting my feet. I tried the 7 1/2 in them and they are too big. Hoping they will stretch as I wear them"
  },
  {
    "user": "TXpatriot923",
    "rating": 5.0,
    "message": "I normally wear a sz 7 and they were too tight, so I reordered 7.5, they are perfect. I absolutely love them, they are comfortable and so pretty. I’ve gotten so many compliments on them. My only disappointment, after only wearing them a few times, I can see a tiny area on the tip of the toes is loosing the fuzz, it looks like grey plastic underneath. I will just need to be careful to not touch anything, I’m not sure how it even happened."
  },
  {
    "user": "mandy",
    "rating": 5.0,
    "message": "I'm usually a 7.5 or 8 and sized up to the 8 after reading reviews. They fit great! Had to wear them in a little bit but now they are comfy and I'm so glad I didn't get a cheap pair, instead going with a name brand I trust. These are great casual shoes that give you a little height!"
  },
  {
    "user": "Anna Perry",
    "rating": 5.0,
    "message": "I read lots of reviews on these shoes before I decided to buy. It’s true you have to break them in to get the width just right BUT they are stretchy. So don’t be discouraged if you have to wear them for thirty minutes or so before you get a true fit. They are super cute! I love them!"
  },
  {
    "user": "Karan",
    "rating": 5.0,
    "message": "It looks so pretty and the fit is good too"
  },
  {
    "user": "Sara",
    "rating": 5.0,
    "message": "A bit tight around the ankles if I zip it all the way up but amazingly cute and comfortable. Walked around all day straight from the box and they were amazing! I left the zippers slightly unzipped which made them comfortable and also stylish. You really can’t tell you’re in heels but you are a bit taller which for me at 5’3” is a huge difference. Love! I also have foot pain and these didn’t hurt my feet! They don’t have much (or any) arch support but had a soft footbed so they still worked well for me."
  },
  {
    "user": "Greeno",
    "rating": 5.0,
    "message": "These are so cute and comfortable.  I usually wear 9-9.5 and initially ordered the 9, but the toe box was really tight so I exchanged for the 9.5 and they were just right.  They are a great alternative to a casual sneaker and i get compliments on them frequently.  Since the sole is about an inch platform, the hidden wedge is pretty low so they are quite easy to wear for extended periods of time, even if standing or walking."
  },
  {
    "user": "Chris",
    "rating": 5.0,
    "message": "Love the shoes! They do fit snug you might want to go up a half size or so. But other than them running a bit small I loved them! I have two different pairs. Loved the suede leather."
  },
  {
    "user": "Jolee Smith",
    "rating": 4.0,
    "message": "These shoes are cute and comfy but they do stretch and come unzipped slightly when you wear them. Makes them feel loose and I have to adjust them frequently. Other than that these are great shoes. Super cute!"
  },
  {
    "user": "Olive_Jane",
    "rating": 5.0,
    "message": "I love these shoes and get compliments every time I wear them out. They do run smaller I got a whole size larger. The width is narrow imo they have adjusted and fit better than they first did. I actually couldn't even put my foot in them at first, I had to not wear socks and then spritzed with water and walked inside with them. Still not the most comfortable shoe. Maybe if you have a narrow foot they might be."
  },
  {
    "user": "K. Campbell",
    "rating": 3.0,
    "message": "Very cute shoes but tight on my toes"
  },
  {
    "user": "Di",
    "rating": 5.0,
    "message": "I have multiple pairs of Steve Madden wedge sneakers.  Very comfortable! Can wear to work as business casual or with jeans.  Wedge is a good height.  I am 5 ft 3 in. So great for me to add height but still comfortable."
  },
  {
    "user": "Ann V.",
    "rating": 4.0,
    "message": "I received so many compliments on these shoes.  They are stylish and comfortable.  My left shoe was definitely tighter than the right.  I've never had that issue before but you may want to size up for comfort."
  },
  {
    "user": "kelly treadway",
    "rating": 4.0,
    "message": "Great looking shoes; however, these run 1/2 size small with thin socks and whole size small with winter socks! Luckily my foot is smaller than my daughter’s. Keeping for myself and ordered her a size up! Also if you have a wider foot at the toe-end, these are a bit snug...pack a bandaid for blister prevention!"
  },
  {
    "user": "M. Richardson",
    "rating": 5.0,
    "message": "Love the look of these!  On day one wearing them, I was concerned as the fit in the toe box area felt right.  By day 2 wearing them they felt perfect!  I normally wear an 8.5 and that fit well.  They do seem to run a little narrow so might not be great for wider feet."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are very comfortable and look great with jeans and or leggings. I wasn’t sure about the fit so ordered my normal size, 7 1/2, and they are perfect.  I would buy again!"
  },
  {
    "user": "Taylor",
    "rating": 5.0,
    "message": "Absolutely LOVE these. They are so comfortable but are a bit narrow. I wear a size 7 1/2 and I got the 8 and so glad I did! Definitely go up a half size since they are a bit narrow!"
  },
  {
    "user": "Alisa H",
    "rating": 5.0,
    "message": "Love these. Very comfortable and really cute with just about everything. Only complaint is if you are walking a lot the zipper can rub on your ankle and be a little uncomfortable. Not enough to cause a blister or anything but it’s definitely noticeable."
  },
  {
    "user": "Jen",
    "rating": 4.0,
    "message": "Buy a size up, they definitely run small!"
  },
  {
    "user": "Susan",
    "rating": 1.0,
    "message": "White part of shoe for some reason is getting yellow."
  }
]