[
  {
    "user": "vince watson",
    "rating": 5.0,
    "message": "As soon I received these shoes, I tried them on to make sure they would fit and to do a comfort check.  I ended up wearing them throughout my house for the next hour or so. In fact, these are more comfortable than my croc slip-ons!  I've loved Cole Haan shoes for many years, these are more comfortable than I could have ever imagined. THANKS!"
  },
  {
    "user": "salvatore c. mazzara",
    "rating": 4.0,
    "message": "My very young nieces and nephews said they looked good on an old man!!!"
  },
  {
    "user": "Tripp",
    "rating": 5.0,
    "message": "Wore the shoes fresh out of the box and they are very comfortable. No issues with them at all."
  },
  {
    "user": "Jep",
    "rating": 5.0,
    "message": "Shoes were just as I hoped.  Fit was good & they are high quality shoes."
  },
  {
    "user": "Boring Bob",
    "rating": 5.0,
    "message": "I am pleased with these shoes, they are quite comfortable and the leather is soft and buttery. I have unusual feet, in that one foot is a full size larger than the other, but even buying shoes that fit my larger foot, both feet are quite comfortable in these. They are neither too small nor too big. They offer adequate support, although I may add some sort of insole for better arch support. Not everyone would need that, but it might make them more comfortable for me."
  },
  {
    "user": "Joe Nowlin",
    "rating": 5.0,
    "message": "Ordered shoes because of the looks but the longer I wore them the more comfortable they were. Very pleased and plan to order another pair in another color."
  },
  {
    "user": "Erick Jimenez Mora",
    "rating": 5.0,
    "message": "Fit as expected, really confortable"
  },
  {
    "user": "Raymond P.",
    "rating": 5.0,
    "message": "Well made, light, very comfortable...and sized right for my ortho inserts."
  },
  {
    "user": "Dmitry",
    "rating": 5.0,
    "message": "5-"
  },
  {
    "user": "bill calhoun",
    "rating": 4.0,
    "message": "Pros: I love the light weight of this sneaker.  I use it for work as well because it is not your typical fad shoe.  It is much lighter than I had anticipated so, I can walk and stand at work all day.  My other shoes are clunky and rather stiff. Con: I am finding small spots on the toe (even though I treat my shoes as gold) that are losing their \"white\".  I am wondering how to stop that from happening or to restore the small discolorizations."
  },
  {
    "user": "kbincostarica",
    "rating": 5.0,
    "message": "Cole Hann has always made an excellent shoe by reputation. This is my first purchase in 25 years. I was not disappointed. Soft, comfortable leather and good finish. Highly recommended"
  },
  {
    "user": "JKC211",
    "rating": 4.0,
    "message": "This is my third pair in this series.  I have a canvas needed pair that are grey and these leather sneakers that are virtually identical.  I prefer the leather for sure but obviously I baby the white shoes.  The leather is soft and luxurious and actually very soft."
  },
  {
    "user": "Savatus",
    "rating": 5.0,
    "message": "Shoe fit as expected and looks great. Very versatile…can wear with business casual, casual, or everyday use."
  },
  {
    "user": "mwrushing",
    "rating": 5.0,
    "message": "Stylish design, comfortable to wear"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "comfort and quality"
  },
  {
    "user": "Thomas Jordan",
    "rating": 5.0,
    "message": "Perfect casual business shoe"
  },
  {
    "user": "DJB",
    "rating": 5.0,
    "message": "Great shoe ...."
  },
  {
    "user": "Eric",
    "rating": 5.0,
    "message": "I’ve only wore them twice and I must say they are the most comfortable shoes that I own. Definitely recommend these."
  },
  {
    "user": "Thomas",
    "rating": 5.0,
    "message": "Clean fit and stylish shoe."
  },
  {
    "user": "Tyler",
    "rating": 4.0,
    "message": "Nice shoes but feet are constantly sweating while wearing these"
  },
  {
    "user": "Bradley Smith",
    "rating": 5.0,
    "message": "A good sneaker that looks sharp and is comfortable.  What more can one ask?"
  },
  {
    "user": "KWC",
    "rating": 4.0,
    "message": "Not leather material, looks cheap"
  },
  {
    "user": "rustynail",
    "rating": 5.0,
    "message": "a very stylish casual shoe"
  },
  {
    "user": "Ipkoklou",
    "rating": 5.0,
    "message": "Light"
  },
  {
    "user": "Tina F.",
    "rating": 5.0,
    "message": "Good quality and comfortable from the first wear."
  },
  {
    "user": "Brian McCormick",
    "rating": 5.0,
    "message": "Repeat customer"
  },
  {
    "user": "Charles Brown",
    "rating": 4.0,
    "message": "Great shoe. Light weight, Very comfortable more so than I would have expected. It’s like walking on a cloud soft but not squishy if that makes sense. The leather is also very soft easy to wear no hard spots that rub. I e gotten a fair amount of compliments on them so they must look pretty good. Lol. I would give them a solid 4.5. The only drawback is the stitching at the base of the tongue looks weird and I wonder if they start to separate there only time will tell. Otherwise I’d recommend them. Ps if you can try before you buy ALWAYS do it all the reviews in the world don’t matter if YOU don’t like it."
  },
  {
    "user": "JJ",
    "rating": 5.0,
    "message": "I thought they would be too tight because there was no width option. I usually wear a D width and these fit perfectly."
  },
  {
    "user": "Antwane B",
    "rating": 5.0,
    "message": "A very all around good shoe. Definitely getting another pair."
  },
  {
    "user": "edgar garcia",
    "rating": 5.0,
    "message": "The shoes are very well made very comfortable."
  },
  {
    "user": "Erroll Staton",
    "rating": 5.0,
    "message": "These shoes a perfect for today’s fashion. I wear these shoes with jeans, shorts, sport jacket & casual pants…enhances many looks."
  },
  {
    "user": "Freddy Geraldo",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "Linda C Bernstein",
    "rating": 5.0,
    "message": "Liked the color. Also a great price!!!"
  },
  {
    "user": "Señor",
    "rating": 5.0,
    "message": "Love the quality"
  },
  {
    "user": "Jesus Rodriguez",
    "rating": 5.0,
    "message": "Es muy confortable, hecho de fina piel con una puntera que no te machaca los pies y de un ancho justo para mis pies. Puede ser usados perfectamente con un Jean pero también con un traje y quedan bien, su color pega con todo, gran producto"
  },
  {
    "user": "KY LIN",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Eliazar calzado",
    "rating": 5.0,
    "message": "Beautiful looking sneaker, excellent quality!"
  },
  {
    "user": "Huskoj",
    "rating": 4.0,
    "message": "I love Cole Haan Crosscourts. I have 2 pair, so I bought the black ones to add to my collection. These fit well and feel good like my others, but they look to be a different type of material. I’m just not sure I like them as well as the other pairs that I own."
  },
  {
    "user": "Howard Hartley",
    "rating": 5.0,
    "message": "Need some trim accent!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very comfortable shoe. Leather is soft and I could have gotten away with a halfnsize smaller."
  },
  {
    "user": "S",
    "rating": 5.0,
    "message": "Muy livianas y cómodas"
  },
  {
    "user": "Grimking",
    "rating": 5.0,
    "message": "Comfortable, great looking. Great value."
  },
  {
    "user": "Coach Pablo",
    "rating": 5.0,
    "message": "Shoe strings needed to be whitèr and longer."
  },
  {
    "user": "Jerry Garfin",
    "rating": 5.0,
    "message": "FIT AS EXPECTED- VERY COMFORTABLE"
  },
  {
    "user": "Michel",
    "rating": 3.0,
    "message": "I like it"
  },
  {
    "user": "Alfredo Berrios",
    "rating": 5.0,
    "message": "I use it to work, and it's giving me true support, the only thing i don't like is that the supplier does not have all colors...but overall great product for the pricw."
  },
  {
    "user": "Chris Meeker",
    "rating": 5.0,
    "message": "These shoes are the most comfortable shoes I’ve ever had right out of the box. WOW. I’m looking for another style to buy"
  },
  {
    "user": "JReg",
    "rating": 5.0,
    "message": "This is a second round with this shoe.  Husband likes this shoe a lot and his first set is getting worn and he wanted a repeat."
  },
  {
    "user": "Justin R.",
    "rating": 5.0,
    "message": "I love these shoes! Real material! Feels great from day one."
  },
  {
    "user": "TERRY THORNE",
    "rating": 4.0,
    "message": "Bought as a gift for my boyfriend.  He loves them"
  },
  {
    "user": "Edward Weems",
    "rating": 5.0,
    "message": "It is comfortable and stylish."
  },
  {
    "user": "Virginia",
    "rating": 5.0,
    "message": "outstanding look"
  },
  {
    "user": "Adam S.",
    "rating": 5.0,
    "message": "I usually wear Stan Smith's, and these are a nice alternative with a similar look, but in black. My workplace has a really lax dress code but I would not wear sneakers - I could wear these easily however. They are very versatile."
  },
  {
    "user": "Bassetbob",
    "rating": 4.0,
    "message": "It would have been nice if Cole Haan added a few ventilation holes but that probably would have added another dollar at the most I am happy with the style and fit so I can't complain. Just my 2 Cents....Cheers"
  },
  {
    "user": "Robert L. Slates",
    "rating": 5.0,
    "message": "I liked the style of this shoe, and when It came, it was much more comfortable than I had imagined."
  },
  {
    "user": "Wayne D Van Hest Jr.",
    "rating": 5.0,
    "message": "Shouldn’t buy shoes on line"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "A very good looking sneaker but after constantly getting blisters on my heels I gave them away."
  },
  {
    "user": "VW002",
    "rating": 5.0,
    "message": "I have ordered about 4 pairs of these shoes on different colors and Iove them.  They are quite stylish and comfortable."
  },
  {
    "user": "Words and Music",
    "rating": 3.0,
    "message": "I have this model in white - great looking, and a perfect fit - so I decided to order the same in black, size 11.5 Wide. Unfortunately, though the size on the box read 11.5 Wide, the right shoe was actually a 10.5 Wide, and the left shoe was an 11. Very sloppy assembly and packing control, and it had to go back."
  },
  {
    "user": "CESAR DE WINDT",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Julissa",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "BP",
    "rating": 5.0,
    "message": "I wore these on a trip to Europe where I was walking an average of 7 miles a day. I did the thing you should never do -- broke in a new pair of shoes on a trip and brought no alternatives. But I had a feeling these wouldn't ever hurt my feet. And they didn't. So comfortable, stylish and toe the line between something you can hike in or dine in a Michelin rated restaurant."
  },
  {
    "user": "leolynch",
    "rating": 4.0,
    "message": "I need to order shoelaces for cole haan sneakers"
  },
  {
    "user": "E Elizabeth Creel",
    "rating": 5.0,
    "message": "Good product"
  },
  {
    "user": "Lizabeth Bloom",
    "rating": 5.0,
    "message": "Very comfortable and stylish sneaker, looks great with jeans."
  },
  {
    "user": "Krisinda LaFleur",
    "rating": 5.0,
    "message": "My brother said he had these in another color and lived in them. This pair completed his wardrobe."
  },
  {
    "user": "Lester k payton",
    "rating": 5.0,
    "message": "The media could not be loaded. Maybe a little ore arch support. I’m 5’10” 155lbs and 26 years old. Flat shoes after 10 hours I can feel the arch come down. The shoe sole itself is very comfortable squishy and supportive I’m really feel a strong 8.8/10 . With that being said this is the best dress/causal shoe I’ve bought so far"
  },
  {
    "user": "Danielle Teso",
    "rating": 5.0,
    "message": "I gifted these to my dad for his birthday and he loves them. He said they're extremely comfortable and very light weight. Mind you, he is very picky when it comes to shoes as he doesn't like anything too tight/loose, too heavy, etc. they're also a beautiful leather that does with anything. I would highly recommend."
  },
  {
    "user": "Donald G Jackson",
    "rating": 5.0,
    "message": "I've worn Cole Haan shoes for years and have always been pleased with their quality.  These contemporary \"blue\" leather sneakers fit well, look great, and made me Happy.  I'm ready for summer."
  },
  {
    "user": "Ralph s.",
    "rating": 5.0,
    "message": "I have bought the sneaker before I'm pay much more for it the one you see in the photo is 2 years old they wore well I'm not hard on shoes but you're not going to take me to run through gravel it's a great shoe if you respect that it'll respect you comfortable and don't look like everybody else is sneaker it's hot"
  },
  {
    "user": "Darryl Simon",
    "rating": 5.0,
    "message": "I like everything thing about this item..A good buy."
  },
  {
    "user": "lefme1",
    "rating": 3.0,
    "message": "Used to better quality from Cole Haan"
  },
  {
    "user": "Christopher Moloney",
    "rating": 5.0,
    "message": "I like these shoes, and might buy them again. They are comfortable and light. Style is good. Quality overall shows some irregularities at seams and a few minor manufacturing misses. These won't last as long as I had hoped, but still decent for the price. Cheaper than other Cole Haan in quality."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "If you like the look of an Adidas Stan Smith sneaker you will love this shoe. They have they have the look of the Stan Smith but very comfortable with a leather insert and all leather upper easy to maintain in very durable great shoes for wearing shorts and jeans."
  },
  {
    "user": "Tony R.",
    "rating": 5.0,
    "message": "These are very lightweight and comfortable. I’ve only worn them a couple times so far but I like them. I agree with some other reviews that the leather doesn’t seem real durable(it’s pretty thin feeling). It seems like they could tear or scratch pretty easy if not too careful. But that’s part of why they’re so soft, comfortable and lightweight."
  },
  {
    "user": "Mona R",
    "rating": 5.0,
    "message": "Perfect versatile shoes....can wear w casual jeans outfit or with more business attire. Very comfortable. They do scratch easily but in my experience most all of these types of shoes do. Highly recommend."
  },
  {
    "user": "Bernard Morgan",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Margaret",
    "rating": 5.0,
    "message": "I bought these for my husband and he said they are the most comfortable shoes he has worn in a long time!"
  },
  {
    "user": "Marvin W.",
    "rating": 4.0,
    "message": "It neatly fit and comfortable ."
  },
  {
    "user": "Thomas C Bencivenga",
    "rating": 5.0,
    "message": "Nice comfortable fit, lightweight and soft leather"
  },
  {
    "user": "Ivy",
    "rating": 3.0,
    "message": "not like leather"
  },
  {
    "user": "Dottie A.",
    "rating": 5.0,
    "message": "I loved the speedy service what I did not  like is it was placed in front of my garage, we were on vacation and there is was , had we been home and backed out of our garage we would have run all over it !  I have a Ring doorbell on my front porch for the reason knowing when deliveries are made I expected it to be placed on my FRONT PORCH not in front of my garage!  Gladly everything worked out.  My husband loves the shoes by the way."
  },
  {
    "user": "Bojango",
    "rating": 5.0,
    "message": "The shoes look great, are very light but supportive. Tried six pairs of whit tennis shoes and these were the best."
  },
  {
    "user": "maurice livingstone",
    "rating": 5.0,
    "message": "It’s a great fit happy I bought it ."
  },
  {
    "user": "DHT",
    "rating": 3.0,
    "message": "Only wore these shoes 5 times. Here are my thoughts so far. Pros: *Light and portable. *These are off white. Pure white can be overpowering bright and glaring. Ever try to dirty your brand new white sneakers a little before wearing them? These goes with everything the same way. *Minimal, simple and elegant design. *Very comfortable cushion for my feet. *Feels resistant to getting dirty compared to my other white sneakers. Have not wiped them at all and they still look clean. Cons: *Big deal here. I used long to low cut thicker socks (standard low cut that show a bit) during my initial wears and had no issues. One day, I used thin low cut socks to work and the minute I stepped out of my vehicle, it dug into my Achilles badly. I barely could walk a few feet and was in total agony from the parking lot to my office. Luckily, I brought extra heel pads out of caution from other reviews. I was pretty doubtful of those at first. The heel pads do help, but a little bothersome. This is a let down given the price. *A big concern is the durability of the leather. It is light and soft, but crease very easily and awkwardly around the shoe. I was walking and staring at them at first, but decided to stop being a maniac. It is less visible to see creasing with the white color. Think carefully getting a darker color. Use a shoe tree or stuff them to maintain its shape. That seems to help. I tried a half size down, but it was a bit too tight and snug. I got my true size and noticed the length did not differ substantially, but it was a little wider and a lot more comfortable for my feet. Perhaps size down if you are between half sizes. I rate them 3.5."
  },
  {
    "user": "Andranik Gasparyan",
    "rating": 5.0,
    "message": "It’s looking great and it feels like tailored for you. I hope that this pair of shoes gonna last long if so that’s become my Best Buy."
  },
  {
    "user": "GTO Bruin",
    "rating": 5.0,
    "message": "These basic white sneakers were exactly what I wanted. Light weight and quality materials. In this review I'll cover three things that I think are notable. Fit, quality and comfort. I normally wear 11M (US) for dress shoes and for casual shoes. But often for athletic shoes, I have to size up, particularly for brands like Nike and Adidas. I wasn't sure about what size I should with these since I have other casual style Cole Haan in 11M that fit fine, but these are an athletic style. So I went with my normal size, and they fit great. I am also impressed with the quality of the shoes. The leather has a soft feel, but the shoe itself has a solid structure (not floppy). Though a very plain style, the stitching and workmanship makes it appear very high quality. Also, the color is not bright white, but rather it has a very slight gray hue so it appears muted, which is gives it a premium look. Lastly, these are very comfortable. They are light weight and provide reasonable support for casual wear, though not for actual sporting activity. The arch support is less than average (ie. flatter). I am very happy with this purchase. Though there are a number of options for basic white leather sneakers, I personally chose these base a lot on my satisfaction with previous Cole Haan purchases. These did not disappoint."
  },
  {
    "user": "ZT",
    "rating": 3.0,
    "message": "I like the look of the shoe as far as styling however the toe section was wider than I needed it to be and made it look like a clown shoe on me. Comfortable and cushioned but I couldn’t get past the look of it."
  },
  {
    "user": "Xavier Andrés Vargas",
    "rating": 5.0,
    "message": "Buenísimos"
  },
  {
    "user": "Doris Koine",
    "rating": 5.0,
    "message": "Love the shoes, my husband keeps saying how much he loves them, now owns a black and tan.  He is going to buy a dark blue soon."
  },
  {
    "user": "ReadingRover",
    "rating": 3.0,
    "message": "These look pretty nice, and can go with many different looks, but they're not particularly comfortable if you plan on wearing them all day/night. I never realized how much the arch support meant until I got these. There is none. They would probably be much more comfortable with just a little internal arch support, and 4 or 5 eyelets instead of 7. I haven't had to deal with stains or dirt yet, so I don't know how well they will clean, but if the worst happens I am doubtful that they will ever have that \"new\" look again."
  },
  {
    "user": "Henry",
    "rating": 5.0,
    "message": "I use these as all-day work shoes! They fit snug but not uncomfortable. The gel in the sole is wonderful as I usually stand all day at work and these do not give me feet fatigue like my other nice dress sneakers."
  },
  {
    "user": "Quincy C.",
    "rating": 4.0,
    "message": "These are good-looking sneakers.  They have a simple, low profile design and are the right width.  Their coloring is more of an off-white vs. pure white, but that's a good thing so they don't blind you.  Some people have written reviews complaining about the heel area of the shoe being ultra stiff and tearing into their Achilles.  That never happened to me. I've always worn these with crew or dress socks, so maybe that helps prevent it. I've worn my pair at least 20 times now and they're holding up.  No horribly deep creases in the uppers and no peeling or anything (my pics were taken today).  They're easy to clean; a wet paper towel does the job.  The shoes are pretty comfortable.  They have just enough cushioning (I have bony feet) to not hurt.  Where the shoes are lacking is support.  After a day of wearing them my feet sometimes feel sore.  I have low arches, and end up with tender feet if I wear them for an 8-10 hour period or walk a lot in them. I like the look of these shoes a lot so I'll keep wearing them, but not if I'm going to walk a lot.  Inserts will probably help."
  },
  {
    "user": "Morris d.",
    "rating": 5.0,
    "message": "Soft leather."
  },
  {
    "user": "Alexander A. Bencosme",
    "rating": 4.0,
    "message": "exceeded my expectations"
  },
  {
    "user": "William",
    "rating": 5.0,
    "message": "Like the style. Comfortable. Light weight."
  },
  {
    "user": "Beverly Tremain",
    "rating": 5.0,
    "message": "I purchased these for my 17-year old son and he loves them. No breaking these shoes in. Size seems to run a little larger. You can not beat Cole Hahn quality and they are so classy looking. I'm trying to teach my son to buy higher quality and less."
  },
  {
    "user": "Joel Helman",
    "rating": 5.0,
    "message": "Very comfortable shoes and stylish."
  },
  {
    "user": "Eric Gonzalez",
    "rating": 5.0,
    "message": "My first reaction picking up the package from the front porch was \"WOW...this box doesn't weigh much...wonder if they only shipped one of the shoes.\" Thankfully, both shoes were in the box. These are lighter than a few of the other shoes I have of this style. I put them on immediately (thanks to Amazon fulfillment for such a fast shipping...I ordered these less than 20 hours prior to receiving)...and they feel amazing on the first try on. Other brands of basic casual tennis shoes I enjoy Vans 5 eyelet Basic black with white sole (I include an insole insert with these as my feet are slightly more narrow than their fit) Jousen Leather business Casual Ecco Soft 7 (possibly my favorite for business casual wear, but these take a few uses before breaking in nicely) Sperry (my favorites 5 eyelet for basic casual with shorts) Sketchers with memory foam insoles (Mark Nasen) I have worn Cole Haan Dress Shoes for years and loved their comfort and durability. I look forward to wearing these more in the weeks to come as part of my regular business casual rotation."
  },
  {
    "user": "nourdine chlilak",
    "rating": 5.0,
    "message": "Very comfortable and very good quality"
  }
]