[
  {
    "user": "Ducklovers",
    "rating": 5.0,
    "message": "I have foot problems! Most plain sneakers are too narrow in the toe box and squeeze my feet. I've owned 3 pairs of nautica sneakers now, and it's the only brand that doesn't squeeze my toes or forefoot. I can't say they are extra cushiony or super comfortable, but because they are the only sneakers that don't make my feet ache, I keep buying them!"
  },
  {
    "user": "B.R.R.",
    "rating": 4.0,
    "message": "I’m always a 9.5, wear a 10 for comfort in sneaks. These were very tight. I’m going to get a 10.5 or 11."
  },
  {
    "user": "Shopper",
    "rating": 4.0,
    "message": "Toe box is tight. I kept them thinking they would stretch after a couple wears but they didn't."
  },
  {
    "user": "Gregory R. Mayo",
    "rating": 4.0,
    "message": "I liked the arch support. But after my first time wearing them my feet were hurting and I got blisters on both ankles"
  },
  {
    "user": "K Pat",
    "rating": 4.0,
    "message": "Really liked the style and quality of these but sizing ran very small. Had to return"
  },
  {
    "user": "Christy Keever",
    "rating": 5.0,
    "message": "I love these shoes!  I took out the laces and put in some bungee laces.  I get so many compliments on these shoes.  They Nautica, so they're well made, crisp and stylish.  I love them."
  },
  {
    "user": "valerie",
    "rating": 4.0,
    "message": "But love the shoe I'm going to reorder just going up a size"
  },
  {
    "user": "SNatale",
    "rating": 4.0,
    "message": "These were super cute, just what I was looking for…but I wear 11m , and they were super narrow..have to go back.. :("
  },
  {
    "user": "Oswaldo",
    "rating": 5.0,
    "message": "Excelente materiales"
  },
  {
    "user": "CJ",
    "rating": 4.0,
    "message": "Over all I love my shoe should of seen if you had wide shoe cause it fut tight on my little toes over all I love them thanks"
  },
  {
    "user": "SAM",
    "rating": 4.0,
    "message": "First pair of Nautica brand.  Seems comfortable, could use a little more insole cushioning.  Attractive shoe."
  },
  {
    "user": "David S.",
    "rating": 5.0,
    "message": "Excelente compra"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "It does not have arch support."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Loved the look of the shoe but the 9.5 size was too short and the size 10 was too wide."
  },
  {
    "user": "Andrea Castaneda",
    "rating": 5.0,
    "message": "I bought these shoes for my friend and me, they are very comfortable, we both use them for going on long walks in the park."
  },
  {
    "user": "Renee Byrd",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "T",
    "rating": 5.0,
    "message": "This sneaker is so cute and comfortable.  Wore this with my wedding dress instead of heels and it was the best thing I ever did.  It is really great quality sneakers.  The only thing was that I like my sneakers with a little breathing space and this sneaker was too as fit.  If you're like me I suggest that you take a size up."
  },
  {
    "user": "Lori Lambert",
    "rating": 5.0,
    "message": "Amazing shoe. Would definitely buy again. I get compliments on them all the time."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I loved the shoe but it was dirt in both side looked like someone put their foot in with a sock and the mouth is way wider than expected but it's a great shoes and love the overall look and feel and they find craftsmanship."
  },
  {
    "user": "Edwin",
    "rating": 4.0,
    "message": "Cómodo"
  },
  {
    "user": "J.Kinney",
    "rating": 4.0,
    "message": "I liked the style, but the fit does not match U.S. standard sizing even though it states US size 7.5. It fits like a size 6 or 6.5.  I need a refund or replacement in a different size."
  },
  {
    "user": "Jesiree Vargas",
    "rating": 5.0,
    "message": "Son muy bonitas pero un poco incomodas, son muy rigidas"
  },
  {
    "user": "astrid carranza",
    "rating": 3.0,
    "message": "Bueno en general bastante bueno, lo único que me vinieron manchados"
  },
  {
    "user": "Mibert Polanco",
    "rating": 3.0,
    "message": "I'm disappointed, the sneakers came dirty"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Shoe is very narrow and the sizing information does not tell the buyers anything about the width."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Good"
  },
  {
    "user": "Luis Lopez Bello",
    "rating": 5.0,
    "message": "Me gustaron mucho"
  },
  {
    "user": "Faby Fabian",
    "rating": 5.0,
    "message": "A really good buying. It was expected as I wanted"
  },
  {
    "user": "Joan wortham",
    "rating": 5.0,
    "message": "I've been looking for a white sneaker and as usual Nautica made one that I absolutely love.  It's got a bit of lift, but doesn't look stacked.  They are very comfortable and the color (white) is fantastic on tanned legs.  I wear them with jeans, shorts, dresses, basically everything.  I've never bought a bad shoe from the Nautica brand.  You won't regret it.  I wear 7.5  to 8, and bought the 7.5 which fits perfectly.  Roomy inside with a great look on the outside."
  },
  {
    "user": "MW",
    "rating": 3.0,
    "message": "Cute shoes but not great comfort.  I'm in my late 50s and want to look trendy but not YOUNG!  The look is what I wanted but in my 50's I demand more comfort than style.  They went back."
  },
  {
    "user": "LINDA HERNANDEZ",
    "rating": 3.0,
    "message": "Like the style, the size was good, but the shoe is not comfortable."
  },
  {
    "user": "Anggelo Pirela Carrión",
    "rating": 5.0,
    "message": "Llaman mucho la atención adonde se vaya, buen diseño, cómodos. 29/7/2022. En calidad le escribiré en unos meses."
  },
  {
    "user": "Mom of 6",
    "rating": 5.0,
    "message": "Looks pretty on - feels roomy at toes even without the extra usual puff on top.  Great looking walking shoe."
  },
  {
    "user": "Just your local hedgehog",
    "rating": 3.0,
    "message": "The shoes arrived in perfect condition. They’re super cute and the sole was as cushiony as it looks. I ordered my normal 8.5 but unlike a bunch of other reviewers, I didn’t find them true to size. My toes were suuuuuuper close to the end. I’d have to go up another half size to remedy the fit lengthwise. I have to return them, though, mainly because the whole toe box area was *tight*. Someone would need a pretty narrow foot to find these comfortable, I feel. But hey, if that’s you, order a half size up and go for it. Very cute shoes. Sadly these are heading back."
  },
  {
    "user": "Ideliz M Mora",
    "rating": 3.0,
    "message": "My shoe size is between 9.5-10. I order 10 and my toe is screaming and is too narrow. Shoe is also heavy. So disappointed"
  },
  {
    "user": "Anne F. Batty",
    "rating": 4.0,
    "message": "These sneakers are comfortable, cute.  Great Price!"
  },
  {
    "user": "cheryl  deyle",
    "rating": 4.0,
    "message": "Tennis shoe. Hurts my toes - will not be able to play tennis in them. Disappointed."
  },
  {
    "user": "Brooklyn",
    "rating": 5.0,
    "message": "Normally a 9.5 a size 10 fit great wore brand new all day at a Dodger game. Parked far and walked around all day to stay out of the sun and it had no discomfort."
  },
  {
    "user": "noraliza duarte matias",
    "rating": 4.0,
    "message": "Super lindos"
  },
  {
    "user": "eirislandia",
    "rating": 5.0,
    "message": "EL SIZE CORRE MUY GRANDE"
  },
  {
    "user": "Karen Piriyaviboon",
    "rating": 4.0,
    "message": "I like the design and color. The product is match with the picture. It was a little hurt on my first wear, but I think it will be better."
  },
  {
    "user": "fabi",
    "rating": 5.0,
    "message": "Muy bonito"
  },
  {
    "user": "Mel Child",
    "rating": 4.0,
    "message": "For som reason they cause my feet to sweat more than my other tennys"
  },
  {
    "user": "mayra catari",
    "rating": 5.0,
    "message": "Tal como los esperaba, me quedaron perfecto de acuerdo a la talla, pero no son muy cómodos si los usas por largo tiempo."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Excelente calidad pero quedan pequeñas, soy 8M en todas mis tennis, así que las pedí 8M y no me quedan, debí pedir un número más, al menos."
  },
  {
    "user": "maria angelica bautista soto",
    "rating": 5.0,
    "message": "Loved then"
  },
  {
    "user": "Rachel",
    "rating": 4.0,
    "message": "Pretty shoes. The fit was off and was a little scared to wear them. I knew they wouldn't be white for long"
  },
  {
    "user": "Kiki Conscious",
    "rating": 5.0,
    "message": "Nothing to like of dislike about this shoe.  Very comfortable and looks good with skirts, jeans and shorts.  This is a decent brand to purchase."
  },
  {
    "user": "Kindle Customer",
    "rating": 2.0,
    "message": "I had high hopes for these shoes, they are very nice looking and go well with a variety of outfits.  However, I have narrow feet, and these shoes are even a bit too narrow for me, when walking a distance.  The sides tended to rub against my feet after walking all day, and I started developing constant rubbing and stress on the sides of my big toes and baby toes.  These are ok for the occasional I wear them for a few hours, but not for all day walking or running."
  },
  {
    "user": "roseline",
    "rating": 4.0,
    "message": "A little too hard, like the top is not really flexible and is a little uncomfortable. I don’t know if it will go away with time and wear and become softer. I like that you can just clean the shoes without having to wash them. They are really sturdy for sure."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Because I have my perfume to go along with it"
  },
  {
    "user": "Amelia",
    "rating": 4.0,
    "message": "Really liked the look, super cute with casual dresses, but they run small. I'm normally an 8.5 which is the size purchased would have really needed a 9. Super narrow, I have a very slender foot, and we're tight."
  },
  {
    "user": "Gabriel Padilla",
    "rating": 3.0,
    "message": "Es hermoso! Pero se ensucian rapido y los intente lavar con detergente clear y se pusieron bien amarillos. Lastima porque son hermosos."
  },
  {
    "user": "sergio carino-garcia",
    "rating": 5.0,
    "message": "Cómodos para caminar buen estilo diseño y calidad buenas"
  },
  {
    "user": "Maria Alejandra",
    "rating": 5.0,
    "message": "Están muy lindos y finos."
  },
  {
    "user": "Chris thompson",
    "rating": 5.0,
    "message": "These are exact to size and are comfortable"
  },
  {
    "user": "Sealifesusie",
    "rating": 2.0,
    "message": "Started falling apart at first wear, also wore a blister on ankle.  Size is perfect and super cute not going to return because I wore them already.  I will repair and wear a bandaid until broke in.  Would not purchase again."
  },
  {
    "user": "Carmela",
    "rating": 4.0,
    "message": "the collar of the sneaker rubs my ankle.  A different brand arrives tomorrow so I will be able to make a comparison to see which sneaker fits better."
  },
  {
    "user": "Sharon Schneider",
    "rating": 5.0,
    "message": "I love the shoes how do you order two pair first ones to small after wearing the second pair they are still a little too small so next time I will order a little bigger so if you order them try a little bit bigger than normal"
  },
  {
    "user": "Brenda Patton",
    "rating": 5.0,
    "message": "Everything!!"
  },
  {
    "user": "angelica reynoso",
    "rating": 4.0,
    "message": "En realidad se ven como en la imagen, pero ya puesto, se sienten duros, no son nada comodos para el Objetivo que tenía en mente. Pero son hermosos."
  },
  {
    "user": "Victoria OReilly",
    "rating": 5.0,
    "message": "Love the style for the price !"
  },
  {
    "user": "Kimone Graham",
    "rating": 5.0,
    "message": "I liked everything about it."
  },
  {
    "user": "Rebecca",
    "rating": 4.0,
    "message": "I loved the shoe and it is my size but they were to narrow by the toes, Im using a shoe stretcher to widen them. Nobodys fault , I really like this style."
  },
  {
    "user": "Jean Lournel Leandre",
    "rating": 3.0,
    "message": "the product is not fit as it suppose to"
  },
  {
    "user": "RL",
    "rating": 5.0,
    "message": "Very good support"
  },
  {
    "user": "Ruth Morrow",
    "rating": 4.0,
    "message": "Really cute shoes and I was so excited to get them but they were too small!  I wear a size 8, so reordered another pair a half size bigger."
  },
  {
    "user": "Melany Urdánigo",
    "rating": 5.0,
    "message": "The media could not be loaded. Tal como esperé. Muy contenta con la compra"
  },
  {
    "user": "ANO2178",
    "rating": 5.0,
    "message": "I like how simple these shoes are—exactly what I wanted. Knocked a star off because they are super tight! And I have a very average foot… the size was a true fit, but the tightness—ouch! I have worn these many times and I still get a blister on my pinky toe after a couple hours."
  },
  {
    "user": "Tammy",
    "rating": 3.0,
    "message": "Cute but not as comfortable as I was hoping. I thought it would be more of a wide shoe. I have a bunion, and thought my feet would love them. I can not make out of house before my feet hurt. The sides rub the inside of my feet."
  },
  {
    "user": "Kathleen S. May Caraballo",
    "rating": 3.0,
    "message": "Beautiful shoes, not comfy enough to go out and run errands with them as they are too tight on my little toes"
  },
  {
    "user": "israel chefetz",
    "rating": 2.0,
    "message": "A beautiful and comfortable shoe. But after two weeks it broke."
  },
  {
    "user": "Chance Quesnell",
    "rating": 4.0,
    "message": "So cute and comfortable! They could have more padding in the back, the first time I wore them I got a blister on the back of my ankles but I got better socks and it fit perfectly!"
  },
  {
    "user": "Diane L.",
    "rating": 4.0,
    "message": "I llike the style and support. They will look good with jeans in the winter They are very reasonable for the quality."
  },
  {
    "user": "DJH",
    "rating": 4.0,
    "message": "Cute, but no arch support or cushion."
  },
  {
    "user": "Andrea",
    "rating": 5.0,
    "message": "Quede contenta con mi compra, es cómodo solo qué hay que usarlo con medias porque si no lastiman el pie. Lo recomiendo"
  },
  {
    "user": "Pamella McFall",
    "rating": 5.0,
    "message": "I really didn’t know what to expect ordering these 👟 shoes hey are REALLY CUTE.. love them!!"
  },
  {
    "user": "Esther Corporan",
    "rating": 5.0,
    "message": "Me agrado bastante buena calidad"
  },
  {
    "user": "Heather M",
    "rating": 3.0,
    "message": "I got the Bella dawn white shoes. I got size 8 and 8.5. These shoes sizing is very confusing. The 8’s were very small felt like 7.5 or smaller so I tried the 8.5’s and they felt like 9’s. :/ I put insoles in the 8.5’s and now they fit alittle better. Still a bit big. I’m usually a true size 8. The shoes are very cute on but a little clunky. Probably not worth the price. :/ But I’m keeping them because they are super cute and I can wear a dress with them or jeans."
  },
  {
    "user": "Sunshine and Unicorns",
    "rating": 5.0,
    "message": "I had a pair of Nautica shoes I loved so much--super cute and super comfortable--but by the time I needed to replace them, they were totally discontinued.  So, I searched for a new pair of equally cute shoes--and I am SO glad I found these.  They're incredibly comfortable (super insanely cushiony insoles) and totally hold up on long, rainy, soggy walks to the metro.  I first got a pair in blush and loved them so much I bought a second pair of blush sneakers and a pair in peacoat. <3  Honestly, if it wasn't for the shutdown and losing two-thirds of my paycheck, I'd order a pair in silver!  The picture is of the first pair of blush with a purse I had gotten earlier (didn't realize until then that I kind of have a thing for pink...)  The shoes in the picture look a little darker in color than they actually are.  I bought a 7.5 because that's what my old Nautica shoes were.  These new ones are fit like a glove (or foot glove?)."
  },
  {
    "user": "grumpycarnez",
    "rating": 3.0,
    "message": "I only wear them twice a year.  Because they tear up my heals!  I have tried with and without socks..... they hurt!!1"
  },
  {
    "user": "atthedunes",
    "rating": 2.0,
    "message": "I am a teacher and REALLY wanted these shoes to work. At the beginning, they were adorable and after one wear, began to be really comfortable but after 4 months of wearing them to work often, the rubber on the side is peeling away from the shoe to where the entire sole of the shoe is about to fall off. Also, the material seems to be thinning on the top and the inside is not breathable."
  },
  {
    "user": "Cristina Ortega",
    "rating": 4.0,
    "message": "Es muy bonito pero queda pequeño"
  },
  {
    "user": "Micki Ellenberger",
    "rating": 5.0,
    "message": "I wear 8 to 8.5. I purchased an 8.5. They are perfect."
  },
  {
    "user": "Kathy Chandler",
    "rating": 4.0,
    "message": "Runs a half size small."
  },
  {
    "user": "Nancy J",
    "rating": 4.0,
    "message": "Very simple and seem durable enough but they are for looks only and are not a support shoe. Better for a medium foot, not wide."
  },
  {
    "user": "Mandy",
    "rating": 5.0,
    "message": "Love these shoes! I wore them to walk around in Nashville with t-shirt dresses/skirts/shorts/etc because I knew we would be doing a lot of walking and my feet felt great the whole time! The heel isn't too high, and I love the material because I can just wipe of any dirt to keep them white! Very happy with this purchase."
  },
  {
    "user": "Carolina",
    "rating": 4.0,
    "message": "I love leather shoes, so easy to clean. These are not an exception."
  },
  {
    "user": "Scubachick88",
    "rating": 4.0,
    "message": "Sizes not even close to being correct. Toooooo small. Gave away"
  },
  {
    "user": "Rosaura",
    "rating": 5.0,
    "message": "I am in love with this sneakers"
  },
  {
    "user": "Boy mom",
    "rating": 5.0,
    "message": "I needed to replace my white leather tennis shoes and these are so good. Classy with a bit of a platform. I only wear them out to keep them looking super clean and white. Even with a platform your foot still looks narrow and petite. Super comfortable perfect length on the laces. They look great with skirts, jeans, jumpers, shorts you name it."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Buyer beware- the elastic heel of the Akila-white color is very uncomfortable. It digs into your heel and rubs horribly after a while. I can't return them because I've worn them but would not purchase this model again- it gave me blisters through thick socks. I've purchased a different variant of these Nautica shoes (the Aelisa-white) in the past and do highly recommend them, but make sure you don't get the model with the scrunch heel. Otherwise, they are size-accurate; I wear a women's 10 and ordered the same and they fit well."
  },
  {
    "user": "Handy Andy",
    "rating": 4.0,
    "message": "The shoe is very stylish and nicely made. Unfortunately for me the toe is not rounded. The toe area is very narrow and too pointed for comfort."
  },
  {
    "user": "Miss Poppins 57",
    "rating": 4.0,
    "message": "They are cute sneakers and do add support. Maybe I just need a size up because they do run true to size.  The seller got them to me on time and they were well packaged ."
  },
  {
    "user": "Payton",
    "rating": 5.0,
    "message": "These shoes are still comfortable after teaching for 8 hours! They are a little on the heavier side but aren’t too clunky. I really like these shoes and they are worth it. It took about two times wearing them for my foot to adjust to them but other than that they are great"
  },
  {
    "user": "stephany granja",
    "rating": 4.0,
    "message": "Son muy lindos aunque un poco duros, tengo q usarlos con medias taloneras por dentro porque lastiman el pie cuando se camina mucho tiempo con ellos."
  },
  {
    "user": "Leeann Rosa",
    "rating": 2.0,
    "message": "They fit a little big. I wear ankle socks and they hurt a little bit. Not sure why. Can’t return them not happy"
  },
  {
    "user": "er",
    "rating": 5.0,
    "message": "I go through about 2 pairs of white sneakers per year and was looking for a cute option that wouldn’t break the bank. I don’t love the Nautica script around the bottom but it’s so subtle you don’t notice. They’re comfortable and fit true to size in my opinion. Once I wear though this pair I’ll definitely order another"
  },
  {
    "user": "Wine Country Consumer",
    "rating": 3.0,
    "message": "Order at least a half size up. Not true to size"
  },
  {
    "user": "Juana Moreno",
    "rating": 2.0,
    "message": "No tengo un mes usándolo y ya se están despegando 🫢🫢🫢🫢"
  }
]