[
  {
    "user": "Carol Sullivan",
    "rating": 5.0,
    "message": "I'm 73 years old and hard to find anything to look good and easy on my feed.  These sneaks fit the bill for both style and comfort.  Volunteer and walking a lot.  No painful felt, compliments where did I buy these, the green color exactly what I wanted and cushion does not make my feet look like boots.  Fit true to size and price is fair.  Recommend you can't go wrong."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these shoes! I don’t think I’d used them for working out, but more for an everyday walking shoe. The color is gorgeous and the fit is TTS."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Wore these shoes all week on my recent trip to Ireland and we walked a ton. Very comfortable, highly recommend 🤩"
  },
  {
    "user": "ComfortIsKey",
    "rating": 4.0,
    "message": "Colors match the pictures, pretty comfortable for all day wear but I did need a couple of wears to break them in. I would definitely buy again"
  },
  {
    "user": "Victoria Tringale",
    "rating": 5.0,
    "message": "Perfect casual sneaker. I wouldn’t suggest for working out but they are good for day to day. Ankle is a bit big but otherwise very comfortable"
  },
  {
    "user": "Jamelle N.",
    "rating": 5.0,
    "message": "I bought these shoes to wear on vacation. I knew I was going to be doing a lot of walking. Extremely comfortable  and good walking shoes!!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Five stars"
  },
  {
    "user": "Tgifw",
    "rating": 4.0,
    "message": "I ordered half a size up. Normally that’s what I do for sneakers. Got lots of compliments and surprisingly very comfortable, arch support is excellent and hits to correct spot. No break in needed. Bought it for a trip to Europe and tried it on over the weekend to break it in, it is so comfy I didn’t want to take it off. I will spray the suede parts with a suede protector since it’s a very light color it can get dirty fast. I took one star off due to the packaging it came in. The box had a large cut, even the tissue paper was cut. The shoe didn’t have a cut."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are nice looking shoes, however, I had to return them because they are very narrow. I have wide feet, but usually am able to fit in a normal width. Not so with these."
  },
  {
    "user": "RPB1975",
    "rating": 5.0,
    "message": "So comfortable and cute- stylish- got complements and wore walking 12 miles and no issues!!! I love these shoes!!!"
  },
  {
    "user": "Julie",
    "rating": 5.0,
    "message": "Shoes are super comfortable and lightweight"
  },
  {
    "user": "Bathuxuries",
    "rating": 5.0,
    "message": "I love these sneakers but they are too big. I am trying just to wear them with thicker socks but I probably could have went a whole size smaller. I wouldnt work out in these. They are just for running errands and having a nice pair of sneakers my dog hasnt eaten so i dont look like a hobo while i am out! I have always wanted a pair of new balance and I finally got them. I just dont want to go through a hassle of exchanging them so ill deal with it"
  },
  {
    "user": "M. Elslip",
    "rating": 4.0,
    "message": "Needed new shoes for work (on my feet all day), and heavy duty running shoes are too stiff and supportive. I need a flexible sole, cushy insole and medium support. These fit the bill perfectly. They're cute, comfortable and true to size."
  },
  {
    "user": "Jennifer McHugh",
    "rating": 5.0,
    "message": "I sized up a 1/2 size based on reviews, but I think they are true to size. Very comfortable and I got so many compliments."
  },
  {
    "user": "Owen",
    "rating": 5.0,
    "message": "Stylish and comfortable"
  },
  {
    "user": "Yvette Lerma",
    "rating": 5.0,
    "message": "Very comfortable to wear, stylish and better than expected! Recommend buying"
  },
  {
    "user": "Customer in PA",
    "rating": 5.0,
    "message": "These are very nice; I only buy New Balance.....anytime I stray away I always come back to NB. These are stylish; I've gotten compliments. Trying to keep up with everyone and stay in style!!!"
  },
  {
    "user": "Rene Lopez",
    "rating": 5.0,
    "message": "Buen precio para ellos tenís."
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "I’m super picky about shoes. I want style but neeeed comfort. Bought for a trip w lots of walking. Excellent! No discomfort. Didn’t need breaking in. I don’t use them for working out but I have other New Balance and they are great. I would not use them for running. Lots of compliments on the leopard print!"
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "Love this shoe. This is my 3rd pair of NB from Amazon. They fit perfect to size."
  },
  {
    "user": "Hetal Patel (@firesidecoffeebooks)",
    "rating": 5.0,
    "message": "I was in Europe for a month doing a lot of walking and hiking on rocky terrain. These shoes were the perfect companion. They are light, comfortable, and definitely provide the support you need to for those long, long days."
  },
  {
    "user": "terri DiBona",
    "rating": 5.0,
    "message": "Support, fit great. And comfortable"
  },
  {
    "user": "Bryant",
    "rating": 5.0,
    "message": "Soy bien bonitos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love everything about this shoe…fit perfect and all day comfort"
  },
  {
    "user": "Lauryn Cardoza",
    "rating": 5.0,
    "message": "True to size. Super cute and comfy."
  },
  {
    "user": "Stephanie Patke",
    "rating": 5.0,
    "message": "So cute and comfy"
  },
  {
    "user": "ALYSSA",
    "rating": 5.0,
    "message": "Love the style and extremely comfortable!!! My first pair of New Balance!"
  },
  {
    "user": "Gianna-Leigh Bastar",
    "rating": 5.0,
    "message": "Got these on a whim, and I have zero regrets! Definitely the best pair of sneakers I own. I’ve always liked New Balance, but these just stand above the rest. I’m a fitness instructor so I spend a lot of time on my feet, these make it so much easier. Plus, they’re cute!"
  },
  {
    "user": "erin kollada",
    "rating": 5.0,
    "message": "So comfy"
  },
  {
    "user": "Cheronica",
    "rating": 5.0,
    "message": "Love them!"
  },
  {
    "user": "Charm",
    "rating": 5.0,
    "message": "Very comfortable."
  },
  {
    "user": "Aris  Alt. Reynoso de  almonte",
    "rating": 5.0,
    "message": "Me agrado que no son pesado..lo compré  talla 5 y me quedó  perfecto  es más  bien  para pies fino..haci que si tienes  pies ancho uyyy no es para ti...me encanta  el color..estoy pensando  comprar  otro..se lo recomiendo...se sienten muy bien  en tus pies... digo en mis pies....comprenlo  no se van  arrepentir..y tienen buen  precio  que es lo más  importante... vienen en su talla.."
  },
  {
    "user": "tammy bishop",
    "rating": 5.0,
    "message": "Cant wait til fall to wear them! Tried them on, they're comfortable........"
  },
  {
    "user": "TH M.",
    "rating": 5.0,
    "message": "Love the color burgundy and it fits well. I wear a 10.5 but purchased an 11 bc it was cheaper. I have room at the toe but it’s not too big. It’s a nice NB shoe for the price and color."
  },
  {
    "user": "NOEMI YUQUI",
    "rating": 5.0,
    "message": "Es una tela medio rara un poco arrugada y se ve de rápido desgaste"
  },
  {
    "user": "Dee",
    "rating": 4.0,
    "message": "My school colors."
  },
  {
    "user": "KC",
    "rating": 5.0,
    "message": "I purchased these shoes after reading a lot of reviews regarding shoes for retail workers, people standing on concrete all day ECT .. Most were upward of $200. I noticed that most had a very thick sole. Visually these shoes looked similar. From day 1 these shoes have been comfortable. I work 8-10 hours a day and have had zero for soreness or pain since. No pain during my day. No pain at night when I get home. I highly recommend these shoes."
  },
  {
    "user": "indybungalow",
    "rating": 5.0,
    "message": "Like the patterns.  Very comfortable and light. Size 7 fit well, same as other NB shoes."
  },
  {
    "user": "Sandrine M.",
    "rating": 5.0,
    "message": "I'm usually size 8 for any shoes but for New Balance sneakers I tend to take a 8.5 size because they always run small for me. Surprisingly, this model fits true to size! I ordered first 8.5 and it was way too big. I ordered a 8 and they fit perfect! Good quality shoes with good cushion/support. Also this model does not have a different larger to choose from. I sometimes get the \"wide\" if it's available. Even if they are not wide they are not narrow and I feel really comfy in them. Hope this review wil help others to know what to get!"
  },
  {
    "user": "Gabriela A",
    "rating": 5.0,
    "message": "Super cute and actually took these for a walk around Disney and they were great!"
  },
  {
    "user": "Jaszlyn",
    "rating": 5.0,
    "message": "I usually wear a 11 I’m most shoes I have wide feet so I like the room. But there’s are a little big my feet slide out very easy. Overall great shoe very comfortable."
  },
  {
    "user": "wilneth Patrick",
    "rating": 5.0,
    "message": "It is so comfortable"
  },
  {
    "user": "Sandra",
    "rating": 5.0,
    "message": "Lindos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "For running and casual day out."
  },
  {
    "user": "BigMig",
    "rating": 5.0,
    "message": "I'm a huge supporter of having a comfortable walking shoe when traveling or doing a lot of walking. I find New Balance to be a great running shoe, but they ALSO have great walking options. This was a great purchase and is doing well with mileage. Not too heavy of a shoe and good tread. Oh, and cute color options too as a bonus!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these because I loved the color and wanted a new run around sneaker. They are super light. I wore them the first day for 8 hours without issues."
  },
  {
    "user": "John A La Motta",
    "rating": 3.0,
    "message": "Pretty colors and comfortable but the fit was too wide and I wear a medium width. I also think the inside padding should be more cushiony."
  },
  {
    "user": "Ondria",
    "rating": 5.0,
    "message": "These are a good quality good looking sneaker, unfortunately I had to return them because I wanted them for exercise and they were a tad too narrow, if they had fitted me comfortably I would have kept them. I ordered a Saucony running shoe to replace them."
  },
  {
    "user": "Nancy Flores",
    "rating": 4.0,
    "message": "Light weight and super comfy"
  },
  {
    "user": "Catalina",
    "rating": 5.0,
    "message": "Amazon kept suggestion I should have bought them. I am so glad I did it! They are comfy and exactly the color I was looking for."
  },
  {
    "user": "Parent of 2 wild kids",
    "rating": 5.0,
    "message": "For some reason NB are the only shoes I can wear!! Will buy more in different colors, very comfortable, great for everything!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "If you have any  foot issues, this may not be the best supportive shoe.  Love the look of them,  just can't wear them for long periods of time."
  },
  {
    "user": "G Gaitan",
    "rating": 5.0,
    "message": "The media could not be loaded. 🦶🏼I have plantar fasciitis. 🦶🏼Flat wide-ish feet, and an ankle surgery that still gives me problems now and again, and I’m on my feet constantly. These shoes are a life saver! I cannot wear ‘squishy’ shoes at all if the heel has any give to it then I can’t wear them. My ankles cannot handle shoes that are unstable. These are firm and supportive I’ve worn them for 14 straight hours on my feet most of the time and I love them. They definitely worked for me. I’ve even done 2-3 mile walks in them! 15/10 will be purchasing in different colors. * (I was waiting to be seen at my eye doctor then waiting for glasses to be fitted when I took these pics just in case your curious about what my feet are on in that one pic🤓)"
  },
  {
    "user": "Jenny B",
    "rating": 3.0,
    "message": "These shoes run about a half a size too big. I love New Balance shoes, but these are not my favorite. The style and the color are fabulous, but they aren't as comfortable as other NB shoes I've owned. I bought these due to the amazing reviews, but was disappointed. I would not repurchase or recommend to a friend."
  },
  {
    "user": "Alexandra",
    "rating": 4.0,
    "message": "loved the color, but there isn't much padding and no real arch support. Returned."
  },
  {
    "user": "Jess",
    "rating": 4.0,
    "message": "Only wore one time and they were already visibly dirty. Not great since they have suede portions. Otherwise very cute and comfortable Update** These have become my favorite athletic shoes of all time, I wore them to Mexico, I wore them to France, and soon I’ll be wearing them to Greece. They are the only shoes that keep my feet feeling good walking all day. I still think they got too dirty but I’m here to buy a darker color."
  },
  {
    "user": "julie",
    "rating": 5.0,
    "message": "I like these shoes a lot. I always buy this brand , but some fit differently than others. These have a comfortable cushion and are lightweight. They don’t have the big clunky bottoms like some tennis shoes.  I liked them so much , I ordered another pair in a different color."
  },
  {
    "user": "Chelsea Sederstrom",
    "rating": 5.0,
    "message": "So comfortable! I'm a brewery manager and on my feet for long hours on concrete! My feet don't hurt wearing these shoes!"
  },
  {
    "user": "Anna",
    "rating": 5.0,
    "message": "Good quality for the price of sneakers."
  },
  {
    "user": "Caimanesco",
    "rating": 5.0,
    "message": "Buen zapato"
  },
  {
    "user": "Ragnar",
    "rating": 5.0,
    "message": "Wanted a separate pair of sneakers for the treadmill, very light and comfortable."
  },
  {
    "user": "Debra",
    "rating": 4.0,
    "message": "Wanted a new pair of walking sneakers. These are really too good looking to just walk in however that’s what I’m going to do. Once o do that I’ll come Back and update. For now they were comfortable the entire time I wore them inside the house. FYI. The bottom outside sole is flat. Which is something I’ll need to get used to. Not uncomfortable. Just different."
  },
  {
    "user": "SEBASTIAN",
    "rating": 4.0,
    "message": "Si comodidad"
  },
  {
    "user": "Diana Sardi",
    "rating": 5.0,
    "message": "The shoes are great! Super comfy, they have memory foam so you can have them all day. The colors are beautiful. Fits perfect! I will definitely buy from the store again! Great buy!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Not the most comfortable to wear all day. True to size."
  },
  {
    "user": "Deserie C. Cisneros",
    "rating": 5.0,
    "message": "I love everything about them, I love the comfort, the style the affordability!"
  },
  {
    "user": "Katelyn",
    "rating": 5.0,
    "message": "Shoe fit perfect and price was great!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Nice fit and comfortable"
  },
  {
    "user": "Kimberly",
    "rating": 5.0,
    "message": "I usually wear a size 9 but went down to 8.5 and it's still kinda big, falls off my ankle. I think a size 8 would have been a better fit. But the look of these (I got the leopard black tan ones and army green) are SO noice! They're comfy AF. Loves these! They squeak a lot so be prepared for that, hoping it goes away soon tho. Great shoes, worth the price!!!!"
  },
  {
    "user": "Fernanda Cárdenas",
    "rating": 5.0,
    "message": "Nice design, materials, comfy"
  },
  {
    "user": "Bianka Avellino",
    "rating": 5.0,
    "message": "The media could not be loaded. I love the color and how they’re true to size.  I also like how comfortable that they are; they are a good shoe for that my doctor recommended for my heel pain, so I bought them to relieve my heel spurs and plantar fasciitis and inserted my custom inserts the podiatrist gave me. He said don’t waste your money on expensive shoes. I love the look and feel of these shoes."
  },
  {
    "user": "Tracy L. Sherwood",
    "rating": 3.0,
    "message": "I tried them on and the arch and heal were great. Very comfy but they are a B width and are too narrow for my wide foot. Would totally buy them if they came in a wider size."
  },
  {
    "user": "K North",
    "rating": 5.0,
    "message": "Such a better quality that the pair I returned.  Kind of strange because it's the same brand...."
  },
  {
    "user": "Heels on two",
    "rating": 4.0,
    "message": "I’m not big on NB sneakers but these are great very comfortable"
  },
  {
    "user": "Merissa",
    "rating": 5.0,
    "message": "Love these! I’ve always been a fan of New Balance fit. These fit true to size and are super comfortable for a run, shooting hoops, or even running around as a server in a restaurant."
  },
  {
    "user": "Karen",
    "rating": 5.0,
    "message": "I wear them to work. They are very comfortable but they are just for aesthetics.  I change once I get there, they are way too cute to get labor and delivery “ juices” on them!😂"
  },
  {
    "user": "Kianna webb",
    "rating": 5.0,
    "message": "They are True to size. Comfortable and they are worth buying"
  },
  {
    "user": "Maria R",
    "rating": 5.0,
    "message": "I love my shoes absolutely comfy"
  },
  {
    "user": "Amanda",
    "rating": 5.0,
    "message": "Very stylish at an affordable price!"
  },
  {
    "user": "Karissa ortega",
    "rating": 5.0,
    "message": "These are sooooo comfortable and also cute for any sporty look"
  },
  {
    "user": "Kisha Bruce",
    "rating": 5.0,
    "message": "Super cute and a great fit!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Tracee Brown",
    "rating": 5.0,
    "message": "The media could not be loaded. They are very comfortable"
  },
  {
    "user": "mia calarese",
    "rating": 5.0,
    "message": "I had this in my cart for a long time. It went down to $60 and I wanted to buy it, and then when I went to buy it it was sold out. So I honestly hated to spend the extra 20 bucks, but they got more in stock and I spent 80. I am not disappointed. These shoes look fantastic. They are quite comfortable."
  },
  {
    "user": "Khristy Wade",
    "rating": 5.0,
    "message": "Great price and comfortable for 12 hours work flow"
  },
  {
    "user": "SGA82",
    "rating": 5.0,
    "message": "Comfortable and stylish. I prefer to wear these with showing some ankle. It’s cuter that way to me."
  },
  {
    "user": "Mary O",
    "rating": 5.0,
    "message": "I needed a little more width in my sneaker and these did the trick.  Very happy with them."
  },
  {
    "user": "Nancy Howser",
    "rating": 5.0,
    "message": "Very comfortable and great colors"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great sneakers"
  },
  {
    "user": "Lyndsey Berry",
    "rating": 5.0,
    "message": "I wear these almost every day now. So comfortable and amazingly stylish. Contemplated buying for a while but so so happy I did"
  },
  {
    "user": "Lynette G.",
    "rating": 2.0,
    "message": "I’ve been buying New Balance sneakers for years and never had a problem before with them being too tight in the toe area. The left sneaker actually aggravated my little toe so much that my nail is ready to fall off! Also, the tread on the bottom of the sneakers does not provide good traction.  They do look just like the picture though."
  },
  {
    "user": "Claire",
    "rating": 5.0,
    "message": "As new sneakers that are very comfortable Size is just right"
  },
  {
    "user": "Tracie Greene",
    "rating": 5.0,
    "message": "They are super comfortable and cute!!"
  },
  {
    "user": "Melissa",
    "rating": 5.0,
    "message": "New Balance has taken a cross trainer and added some features for style. I can wear this all day. Very comfortable and not so sporty."
  },
  {
    "user": "Emily Seeger",
    "rating": 5.0,
    "message": "I usually wear a 9 in New Balance and that’s what I got. If you’re comparing and happen to wear Brooks running shoes;  I wear a 10 in Brooks and Saucony but usually a 9 in New Balance and these fit true to that size. They are really cute. I like a suede look in a sneaker and these have that!"
  },
  {
    "user": "Kalynn Persell",
    "rating": 5.0,
    "message": "These shoes are so comfy and cute. They’re easy to slip on and off and they go with just about anything. Great buy."
  },
  {
    "user": "Maria Estefania Calvillo",
    "rating": 5.0,
    "message": "Stylish and comfortable sneakers"
  },
  {
    "user": "Kristin L.",
    "rating": 5.0,
    "message": "I bought these sneakers because I have terrible plantar fasciitis in both feet. I do wear my medical inserts with them. I would highly recommend the shoes if you have the correct orthotics."
  },
  {
    "user": "Robert G. Mull",
    "rating": 5.0,
    "message": "great shoe!"
  },
  {
    "user": "E BookMaster",
    "rating": 5.0,
    "message": "They are so cute.  Love the color with the pattern on the heel.  They were a perfect fit and so comfortable."
  }
]