[
  {
    "user": "angela watters",
    "rating": 4.0,
    "message": "I really like this New Balance shoe! however, it was smaller than I expected. I purchased a size 8. sadly, I had to return them. found the same pair on Footlocker in 8.5 wide fingers crossed that size works."
  },
  {
    "user": "Melissa Saravia",
    "rating": 5.0,
    "message": "i use these for my 12 hour shifts and they come in clutch to say the least!"
  },
  {
    "user": "Penney Baker",
    "rating": 5.0,
    "message": "I first ordered my normal New Balance size 10, but they were too short.  Some of the reviews stated this fact, but I didn't listen.  I returned and recorded a 10 1\\2, my toes are definitely at the end of the shoe, but it may be because of the shape of the toe box.  They have nice cushioning and I will keep them, because I wanted this particular color and they will not be everyday shoes."
  },
  {
    "user": "Jacq",
    "rating": 5.0,
    "message": "I usually wear a 7, but got a 6.5 because when I ordered I think I had one too many glasses of wine and thought I was still 110 lbs pre baby weight. BUT, the 6.5 fit well so they do run a little big. Also there’s A tiny, maybe half an Inch heel to the sole. I’m 5’2 but in these sneeks, I feel like I’m walking the run way."
  },
  {
    "user": "Quentin Morgan",
    "rating": 5.0,
    "message": "Good brand, good fit in general."
  },
  {
    "user": "Farah Altenord",
    "rating": 5.0,
    "message": "I love it feel so comfy"
  },
  {
    "user": "Brittany Powers",
    "rating": 5.0,
    "message": "For my daughter, runs a little small, order a half size up otherwise very happy!"
  },
  {
    "user": "Hillary.",
    "rating": 4.0,
    "message": "I'm considering reordering in a larger size. They seemed comfortable, though cramped."
  },
  {
    "user": "Josie Hickman",
    "rating": 5.0,
    "message": "Love these I have wide free and got my regular size in a wide fit and they are perfect!"
  },
  {
    "user": "Teachergal2002",
    "rating": 5.0,
    "message": "Great comfy sneakers with a retro feel."
  },
  {
    "user": "MamaShane",
    "rating": 5.0,
    "message": "Love them but definitely order a half size larger."
  },
  {
    "user": "sonia Elizabeth",
    "rating": 5.0,
    "message": "COMFORTABLE! I love the color I got, and I loved how these go with everything"
  },
  {
    "user": "Kyle",
    "rating": 5.0,
    "message": "Runs a little small, half a size up if you’re between sizes. Feel great, shoe will last years."
  },
  {
    "user": "PA S.N.",
    "rating": 4.0,
    "message": "Little uncomfortable in the front despite there being sufficient room."
  },
  {
    "user": "Oralia Barrera",
    "rating": 5.0,
    "message": "Love Them 🥰."
  },
  {
    "user": "Chrethia M.",
    "rating": 5.0,
    "message": "I love them! Be sure to check the sizing chart. I normally wear a kids 6/womens 7. However, their sizing chart is a bit different. Their kids 6 is a women’s 7.5 so just be mindful of that. I did order a half size up and it fit perfect. They are very comfortable."
  },
  {
    "user": "Vee Emkay",
    "rating": 3.0,
    "message": "They’re nice but…the support is less than what I expected for New Balance.  The fit is good and it’s my fault for not getting the wide size.  They’re nice but wouldn’t order again.  I’ll go to the NB brick n mortar store!"
  },
  {
    "user": "Michal O'Dwyer",
    "rating": 3.0,
    "message": "Liked the style and shape. But the shoes were too tight around the toes, pressing down painfully on the big toe from above and there wasn’t enough room for the toes in front."
  },
  {
    "user": "Maria F. Guilarte",
    "rating": 5.0,
    "message": "👍🏼👍🏼👍🏼👍🏼👍🏼"
  },
  {
    "user": "funfin",
    "rating": 5.0,
    "message": "Love these shoes.  I have never bought New Balance before.  I think I have found my brand!!  They are comfortable. It was nice that they came in my size and wides at that.  I didn't have to go up a size."
  },
  {
    "user": "Mustangdenise",
    "rating": 5.0,
    "message": "Love the shoes!!!!"
  },
  {
    "user": "Luisa Durazo",
    "rating": 5.0,
    "message": "I absolutely love these!! The size was perfect!"
  },
  {
    "user": "esgaye",
    "rating": 2.0,
    "message": "I am a size 10. My toe goes right to the end, with nothing extra left. That was with no socks. More import, the padding for the ball of your foot is poor quality."
  },
  {
    "user": "Arryca",
    "rating": 2.0,
    "message": "Don’t like them they are a darker color in person"
  },
  {
    "user": "Kindle Customer",
    "rating": 1.0,
    "message": "Las tallas estan descritas como \"hombre\" y son tallas de mujer"
  },
  {
    "user": "Laura",
    "rating": 1.0,
    "message": "Did not work."
  },
  {
    "user": "Ann",
    "rating": 1.0,
    "message": "Had to return. Runs small and the black suede looked worn."
  },
  {
    "user": "Deb",
    "rating": 4.0,
    "message": "Great shoe, great fit and comfortable. However the color grey is misleading, it’s brown suede. Not a hint of grey. Brown."
  },
  {
    "user": "Donna Smart",
    "rating": 1.0,
    "message": "To small"
  },
  {
    "user": "Wendy James",
    "rating": 5.0,
    "message": "Always great quality, fits true, very comfortable for my feet as I do not have a high arch.  This 574  classic is the flattest arch in a shoe I could find.  They wear nicely!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Acquistate per effettuare un regalo. Ottimo prezzo rispetto la media proposta sul mercato. Prodotto originale, conforme, nuovo e privo di difetti. Consegnato nella sua scatola originale. La taglia é giusta, viste altre recensioni ho optato per la mezza taglia in più ma il numero effettivo sarebbe stato quello corretto. Il pacco è stato consegnato prima di quanto previsto in fase di acquisto. Molto soddisfatta"
  },
  {
    "user": null,
    "rating": null,
    "message": "J'ai déjà ce modèle dans une autre couleur. J'adore ces baskets, elles sont très confortables. J'ai dû enlever les semelles d'origine pour les remplacer par d'autres semelles moins épaisses car il faut que j'ajoute mes semelles orthopédiques. Sinon le colis est arrivé dans un piteux état. Les chaussures étaient dans leur boîte, la boîte était juste emballée dans une enveloppe en papier, voici le résultat de la boîte (voir photos) heureusement que les baskets n'ont rien eues. Je suis déçue du manque de soin apporté au colis de la part des livreurs."
  },
  {
    "user": null,
    "rating": null,
    "message": "Ho acquistato questo paio di scarpe dopo averne indossato un altro tipo, sempre dello stesso marchio, e posso dire che sono davvero fantastiche. Comode e morbide, le consiglio. Ho acquistato la taglia 37.5, di solito indosso dal 37 al 38 delle altre marche di scarpe varia in base al tipo di modello"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ottima velocità nella consegna"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ottime scarpe. Avevo preso un 38 essendo indecisa sulla taglia e devo dire che per me il 37.5 sarebbe andato benissimo. Ho risolto inserendo una soletta"
  },
  {
    "user": null,
    "rating": null,
    "message": "Super bequem. Farbe passt zu allen Jeanslooks. Ist schon mein zweites gleiches Paar. Beim ersten war Verarbeitung schlecht: nach ca. 10x Tragen hat sich Oberstoff seitlich vom großen Zeh von Sohle gelöst und es bildete sich ein ausgefranstes Loch. Hoffe, dass sie diesmal besser halten, da ich sonst echt begeistert bin."
  },
  {
    "user": null,
    "rating": null,
    "message": "Modello e marca collaudato ormai da anni. Acquisto sempre valido"
  },
  {
    "user": null,
    "rating": null,
    "message": "100%✓ recommend..👌I love these trainers! They're like slippers! I ordered a black pair from here after already having a pair for years. I then ordered the burgundy pair as i wanted another colour as they're so comfy. They do come up smal but i stuck to my usual size 4 and they are nice and snug. Thank you!👌☺️"
  },
  {
    "user": null,
    "rating": null,
    "message": "Le scarpe sono stupende e molto calde! Adattissime all’inverno. Ho ordinato mezzo numero in più del solito come consigliato nelle recensioni, e devo dire che calzano perfette essendo un po’ imbottite all’interno. Ottimo acquisto ad un ottimo prezzo!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Carine sono carine ma mi calzano un po' troppo strette nonostante abbia preso il mio numero abituale, sia come lunghezza, sia come pianta, me le aspettavo decisamente più confortevoli"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ho dovuto prendere mezzo nr in più della misura abituale ma sono molto belle e comode."
  },
  {
    "user": null,
    "rating": null,
    "message": "Pour de la marche"
  },
  {
    "user": null,
    "rating": null,
    "message": "Calza un po di più na belle comode ed originali"
  },
  {
    "user": null,
    "rating": null,
    "message": "Kann man gut online bestellen, wenn man seine Größe kennt. Ich habe schon verschiedene Farben. Passt mit Einlagen hervorragend. Gute Dämpfung, guter Halt. Chic."
  },
  {
    "user": null,
    "rating": null,
    "message": "Mi serviva una scarpa a pianta larga, comoda e calda...l'ho trovata ed è perfetta."
  },
  {
    "user": null,
    "rating": null,
    "message": "Dopo la prima difficoltà con il numero, ora prodotto ottimo"
  },
  {
    "user": null,
    "rating": null,
    "message": "Bellissime!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Super leicht, mega bequem!!! Zu beachten gilt: immer eine Nummer größer bestellen!"
  },
  {
    "user": null,
    "rating": null,
    "message": "New balance una conferma"
  },
  {
    "user": null,
    "rating": null,
    "message": "Sehr bequem"
  },
  {
    "user": null,
    "rating": null,
    "message": "Tolle und bequeme Schuhe. Super Farbe. Ich würde sie aber das nächste Mal eine Nummer größer nehmen."
  },
  {
    "user": null,
    "rating": null,
    "message": "Ottima scarpa, comoda e leggera… la consiglio"
  },
  {
    "user": null,
    "rating": null,
    "message": "Le uso da anni e non ho mai trovato una scarpa più comoda di questa"
  },
  {
    "user": null,
    "rating": null,
    "message": "Belle comode e leggere"
  },
  {
    "user": null,
    "rating": null,
    "message": "Uso new balance da anni. Le ho regalate a mia sorella. Felicissima"
  },
  {
    "user": null,
    "rating": null,
    "message": "Consegnate nei tempi dichiarati, fedeli alla foto publicizzata su Amazon, ottima vestibilita’, comode e confortevoli, ho scelto questo modello di New Balance perché cercavo una scarpa ben chiusa e avvolgente dopo una frattura al piede, scelta che non poteva essere più indovinata, rapporto qualità/prezzo ottimo."
  },
  {
    "user": null,
    "rating": null,
    "message": "Condizioni perfette, consegna rapida."
  },
  {
    "user": null,
    "rating": null,
    "message": "Super!Sehr bequem."
  },
  {
    "user": null,
    "rating": null,
    "message": "Ho acquistato queste scarpe essendo un modello che già conoscevo, sono molto comode, io le uso a lavoro e sto molte ore in piedi. Dietro sul tallone hanno un leggero rialzo cosi da ammortizzare la camminata e non stancare la gamba."
  },
  {
    "user": null,
    "rating": null,
    "message": "Tolle Turnschuhe!  Alles ist gut.  Sehr bequemes Modell.  Ich empfehle 100%!  Auf der Länge des Fußes 26 cm bestellte Größe 40,5."
  },
  {
    "user": null,
    "rating": null,
    "message": "Went for half size up than normal and they fit like a glove, and very comfortable."
  },
  {
    "user": null,
    "rating": null,
    "message": "identique à un produit magasin attention taille un peu grand pointure commandée 41"
  },
  {
    "user": null,
    "rating": null,
    "message": "Scarpe molto comode."
  },
  {
    "user": null,
    "rating": null,
    "message": "Prodotto come da descrizione e consegna rapida."
  },
  {
    "user": null,
    "rating": null,
    "message": "Las he comprado a un buen precio, new balance es sinónimo de calidad y el color es muy bonito."
  },
  {
    "user": null,
    "rating": null,
    "message": "-"
  },
  {
    "user": null,
    "rating": null,
    "message": "Le produit correspond exactement à ce que je m'attendais...."
  },
  {
    "user": null,
    "rating": null,
    "message": "Buena calidad y cómodas. La lengüeta de una de las zapatillas llegó con un doblez todo la lo largo debido a la bola de papel que estaba mal puesta y me está costando que recupere su forma."
  },
  {
    "user": null,
    "rating": null,
    "message": "Ottimo prodotto arrivato in tempi brevi. Veste piccolo consiglio un numero in piu"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ottimo rapporto qualità/prezzo. Perfette da indossare tutti i giorni."
  },
  {
    "user": null,
    "rating": null,
    "message": "Son bonitas pero las tuve que devolver porque tallan pequeño"
  },
  {
    "user": null,
    "rating": null,
    "message": "Davvero comode per i miei piedi pianta larga!  Considerato il periodo di saldi, le ho pagate forse un po' care. Consegna puntuale,  molto utile il servizio hub."
  },
  {
    "user": null,
    "rating": null,
    "message": ""
  },
  {
    "user": null,
    "rating": null,
    "message": "I love it 😍"
  },
  {
    "user": null,
    "rating": null,
    "message": "Bought for my sister and she absolutely loves them"
  },
  {
    "user": null,
    "rating": null,
    "message": "Me encantan"
  },
  {
    "user": null,
    "rating": null,
    "message": "These were great for going out running did feel a little small"
  },
  {
    "user": null,
    "rating": null,
    "message": "Tutto perfetto oggetto come in descrizione"
  },
  {
    "user": null,
    "rating": null,
    "message": "Gut, wie immer. Trage diese NB seit 1986. Sollte immer eine Nummer zu groß bestellt werden."
  },
  {
    "user": null,
    "rating": null,
    "message": "Todo correcto, parece original y talla bien"
  },
  {
    "user": null,
    "rating": null,
    "message": "Il prodotto è molto buono, la misura è giusta , il rapporto qualità prezzo è eccellente, consigliato"
  },
  {
    "user": null,
    "rating": null,
    "message": "Super comfortable. Great quality and quick delivery. Cheaper than on other sites too. I am normally an EU38 and after reading reviews decided to order an EU39. They fit perfectly."
  },
  {
    "user": null,
    "rating": null,
    "message": "Over the moon. Trainers came promptly. I went half a size up and they fit perfectly. Really comfortable. Really pleased with the price and purchase!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Wurde auf meinem Lieblings-Laufschuh-Blog auf diesen Schuh aufmerksam gemacht: Der einzige Nicht-Laufschuh, der bei (Über-)Pronation empfohlen wurde. Da meine Fußgelenke gewichts- und baubedingt immer nach innen kippen und das zu starken Schmerzen vor allem in beiden Kniegelenken führt, trage ich fast ausschließlich korrigierende und dämpfende Laufschuhe- da bin ich dann mit 120 € und mehr dabei. UND JETZT DIESER SCHUH!!Ein ganz normaler Alltagssneaker, der meine Füße so gut abstützt! Sieht chic aus, die Dämpfung ist nicht so gut wie bei einem Laufschuh, aber reicht absolut aus, das Fußbett ist herausnehmbar und dann passen auch orthopädische Einlagen hinein! Und das für unter 100€- ich bin begeistert!! Und habe längst ein zweites Paar😁. ABSOLUT SONNENKLARE KAUFEMPFEHLUNG!!!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Quedan perfectamente y son comodísimas, llegaron en perfecto estado."
  },
  {
    "user": null,
    "rating": null,
    "message": "Recomiendo  pedir 1/2 número"
  },
  {
    "user": null,
    "rating": null,
    "message": "Für den Preis ok"
  },
  {
    "user": null,
    "rating": null,
    "message": "Consegna veloce e impeccabile come sempre, grande Amazon ! Ho acquistato 4 paia di NB negli ultimi mesi . Sono originali MA, il mio solito 36 x 1 paio risulta perfetto , il secondo paia -1cm perciò stretti. Ho ordinato 1x37 che mi dici UK 4 = perfette ma gli ultime tg 37 sono Uk 4.5 …3 paia nella descrizione mi fa vedere che sono tg 4 UK ma mi trovo un 3.5, 4 e 4.5  Non sto capendo più’ niente…..  scarpe belle, ben fatte , originale ecc ecc ma e’ come fare un terno a lotto quando fai un’ordine  !!!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Produits arrive vite de bonne qualité confortable rien à dire je recommande"
  },
  {
    "user": null,
    "rating": null,
    "message": "Took on board the sizing comments and sized up. Very happy with the shoe."
  },
  {
    "user": null,
    "rating": null,
    "message": "Son cómodas y bonitas! Espero que dure bastante. Aún no las he lavado. Llegó súper rápido (en el mismo día)."
  },
  {
    "user": null,
    "rating": null,
    "message": "Comode e leggere"
  },
  {
    "user": null,
    "rating": null,
    "message": "Scarpe molto comode perfette"
  },
  {
    "user": null,
    "rating": null,
    "message": "Acquistate queste scarpe per la mia ragazza per una vacanza in cui si doveva cammire moltissimo si sono rivelate un vero successo. Molto belle esteticamente e comodissime. New Balance sempre una garanzia. Spedizione amazon top come al solito"
  },
  {
    "user": null,
    "rating": null,
    "message": "Comprate già tempo nel colore rosa,ho deciso di prenderle anche nere calzano perfette. Consiglio acquisto."
  },
  {
    "user": null,
    "rating": null,
    "message": "conforme"
  },
  {
    "user": null,
    "rating": null,
    "message": "Diese Schuhe benutze ich hauptsächlich in der Arbeit"
  },
  {
    "user": null,
    "rating": null,
    "message": "Leider nicht in der Farbe wie bestellt , aber trotzdem gut. 🤣"
  },
  {
    "user": null,
    "rating": null,
    "message": "Je fais habituellement du 39. Pour une autre paire de NB574 j'avais du 40 et pour celles ci j'ai du prendre du 40,5."
  },
  {
    "user": null,
    "rating": null,
    "message": "Un marchio una garanzia! Non sembra nemmeno di indossare scarpe ma 2 cuscini. Usate per lavoro (ristorazione) e mai avuto dolori a fine giornata! Indossarle preferibilmente nel periodo primaverile o autunnale! Transazione facile e veloce. Consiglio vivamente!"
  }
]