[
  {
    "user": "Demarcus T",
    "rating": 5.0,
    "message": "Perfect casual shoe for people with big feet. These are good looking and very versatile in how you can wear them. For their price they are incredible quality as well"
  },
  {
    "user": "Sarah Y.",
    "rating": 4.0,
    "message": "Already had rerun label in box. Returned 10/12/22 Thanks"
  },
  {
    "user": "Christina",
    "rating": 4.0,
    "message": "Just they they were slim but they look nice and are comfy"
  },
  {
    "user": "Rick",
    "rating": 5.0,
    "message": "Sizing help Cole haans I sized down to 8.5 mens. My adidas Sneaker size is 9.5 and rebook cross trainers I’m a 9.5 as well. May may not help others but wanted to put that out there Looks Super clean and packaged well worse then to break them in and feel really comfortable. These are canvas shoes so they’ll get a little dirty quicker."
  },
  {
    "user": "Matthew Desrochers",
    "rating": 5.0,
    "message": "I’m always looking for a wide sneaker and these fit perfectly.  They are off white not pure white but still look great"
  },
  {
    "user": "Juri A.",
    "rating": 4.0,
    "message": "Siempre compro la misma talla en esta marca pero este zapato es mas grande, una talla mas grande"
  },
  {
    "user": "Daniel Frechette",
    "rating": 5.0,
    "message": "I LOVE these sneakers. really nice. The price was great too!"
  },
  {
    "user": "emil8517",
    "rating": 5.0,
    "message": "Very comfortable, fit as expected."
  },
  {
    "user": "Luis Gerardo Núñez Ramírez",
    "rating": 5.0,
    "message": "Me encantaron los zapatos"
  },
  {
    "user": "Tiffanie Baker",
    "rating": 5.0,
    "message": "Perfect fit for a last minute end of summer event!"
  },
  {
    "user": "Eric",
    "rating": 3.0,
    "message": "Arrived loose in an amazon box (no Cole Han Shoe box).  Also feel very cheaply made (I guess that is \"light\").  So, I wonder a bit if they are a knock off/counterfeit.  Then again, seems unlikely someone would bother to make knock offs of $75 shoes. It's only day and and maybe they will break in a bit, but I have the following complaints on fit and function: -They squeak with every step.  Coming from the inside (my cotton socks rubbing on the inside sole/liner. -I am 40 something male and wear a 10 wide in most shoes and purchased that here.  I would consider this shoe only moderately wide.  I could definitely use more room in the toe box.  Where the shoe narrows at the top it pushes against my big toe.  My toe knuckles have enough room to lie flat without being bunched up (which is the most important part for me) but just barely. -I am wearing these as business casual and they fall more on the casual side of that.  That said, I would not want to use them for any athletic activity or for lots of walking.  Lack of support and rubbing would likely result in pain for me. -Sole is flimsy (I prefer stiffer)"
  },
  {
    "user": "LYNN Hernandez",
    "rating": 5.0,
    "message": "I use them every day. I have a feeling they may not last more than a year (I wear my shoes till they are totally falling apart) but I like them for now."
  },
  {
    "user": "Manolo1977",
    "rating": 4.0,
    "message": "They are 1/2 number longer than espect Quality…perfect 👌🏻"
  },
  {
    "user": "Alex Georgiev",
    "rating": 4.0,
    "message": "I am usually size 8 but this is definitely too long. Good looking shoe. I would get half a size down."
  },
  {
    "user": "Ken",
    "rating": 5.0,
    "message": "Fit good"
  },
  {
    "user": "Filippo Neri",
    "rating": 4.0,
    "message": "These are very good-looking, \"dressy\" sneakers. They have style. Unfortunately, they aren't the most comfortable to wear. For some reason, they hurt my feet. Not a lot, but enough that I wear them less than I would otherwise."
  },
  {
    "user": "Jeff",
    "rating": 5.0,
    "message": "I have 6 pairs of Cole Haan shoes all very good fit well and are holding up well"
  },
  {
    "user": "Luz",
    "rating": 5.0,
    "message": "Me encantaron! Fueron un regalo para el día del Padre para mi esposo y son unos de sus favoritos. Tiene otros de la misma marca pero estos son más informales, así que van con todo."
  },
  {
    "user": "AM",
    "rating": 5.0,
    "message": "Very nice around town shoe.  I walked for hours and they were comfortable all day."
  },
  {
    "user": "Edward Brown",
    "rating": 4.0,
    "message": "Not as comfortable without wearing socks, I really wanted to wear them without socks."
  },
  {
    "user": "JD Martin",
    "rating": 5.0,
    "message": "Bought these for my Son-in-Law and he absolutely loves them. Says they are very comfortable, looks great with his dress pants, stylish and gives plenty of cushion for his feet. He is a hockey coach and wears them for long hours. Definitely recommend this seller"
  },
  {
    "user": "Bob Beland",
    "rating": 3.0,
    "message": "The sneakers were fine at first when I wore them without a sock. Very comfortable and stylish. Then on a chilly day, I wore them with thin socks for the first time while I drove 90 miles to Martha's Vineyard. When I arrived, I could hardly walk, my feet were killing me and I had been sitting down/driving for 2 hours! Blisters on both big toes. I think I should have ordered a size 10 instead of a 9.5. So I don't know if it was a size problem or the shoes, but they are relegated to the closet."
  },
  {
    "user": "Jennifer wall",
    "rating": 5.0,
    "message": "Lovvvvveeee these shoes! My husband wears 15 wide so that's a hard size to find...love that cole haan has 15 and wide! I got these for my husband to wear with some golf shorts and a polo. They look great, fit great and fabulous material. Will buy them again. Very classy fashionable shoe."
  },
  {
    "user": "Damian D.",
    "rating": 5.0,
    "message": "Maybe I just got too used to my clapped-out beater shoes. I _thought_ they were comfortable, until I bought these. Fairly breathable and flexible material with a soft sole. Semi-elastic laces are something I'd never considered, but they're actually great. Always just right and never too tight. As far as durability, it's only been a couple of months, and I wear different shoes for different situations. -- However, based on my use, they've been holding up very well. Definitely a brand I'll be revisiting!"
  },
  {
    "user": "Eli Keppler",
    "rating": 4.0,
    "message": "Run a half size big I think but quality"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Great value for the money. Comfortable and trendy."
  },
  {
    "user": "Timothy P.",
    "rating": 4.0,
    "message": "These are very comfortable shoes but they run big. The tip of my big toe is one inch+ short of the tip of the shoe on both feet. I've worn the same size 10.5 shoe in every brand for the last 25 years and this is the only shoe that I need to go down a half size in. Other than that, they look and feel great. I'll probably exchange these if any 10's come back into stock."
  },
  {
    "user": "MaLSa82",
    "rating": 5.0,
    "message": "I really like these as an all-around shoe. They are very lightweight and also quite comfortable (nice foam insole). I think they look great and can be worn in most situations (casual, semi-dressy, w/ shorts, etc). Very happy with these! I wear a size 11 and they fit as expected/perfectly. The sole is also surprisingly grippy considering it doesn't have crazy tread or anything like that. Hopefully they hold up (I have had them for about a week now) A+!"
  },
  {
    "user": "Juan Emilio del Rosario",
    "rating": 3.0,
    "message": "Bien cómodos, y de buena calidad, pero el calzado derecho es ligeramente más grande que el izquierdo"
  },
  {
    "user": "Hayes_stuff",
    "rating": 5.0,
    "message": "Good shoe.  Looks good, comfortable, etc.  Be aware of the cloth uppers though.  Easy to get wet and easy to stain."
  },
  {
    "user": "Eddie Hurtado",
    "rating": 5.0,
    "message": "Originally bought this sneaker for work.  As soon as these arrived I put them on so I can break them in.  I was surprised how comfortable they felt right off the bat.  I ended up wearing them outside of work!  If you are on the fence about purchasing these, I say go for it. You won't regret it."
  },
  {
    "user": "MLB37",
    "rating": 5.0,
    "message": "Everyone loves my shoes.  Where did you get those pops up everyday I where them.  Thanks"
  },
  {
    "user": "MICHAEL M.",
    "rating": 5.0,
    "message": "I have had so many compliments on these shoes.  Very comfortable and looks great with any clothing."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great sneaker to wear to the office, church, or to a picnic. Great purchase"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "One of the most comfortable shoes I’ve owned.  All buy different colors next"
  },
  {
    "user": "Ron from Mesa, AZ",
    "rating": 5.0,
    "message": "I love these shoes. I have many pairs various colors. I receive constant compliments and inquiries about where to buy. Most importantly being on my feet all day they are the most comfortable shoe I have worn. They can be dressed up or down business or casual. They are a dressy and more comfortable Vans alternative."
  },
  {
    "user": "Zack Ward",
    "rating": 5.0,
    "message": "They're Cole Haan shoes. Comfortable, stylish, easy to put on and take off, quality materials. Everything a shoe should be."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great looking shoe . Comfortable to wear and true to size . I'm glad I got these"
  },
  {
    "user": "James Harris",
    "rating": 5.0,
    "message": "Great shoe! Very stylish and comfortable."
  },
  {
    "user": "mkat",
    "rating": 5.0,
    "message": "Love this handsome shoe love Cole Hann shoes very well made great value"
  },
  {
    "user": "Miguel",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Ron from Mesa, AZ",
    "rating": 5.0,
    "message": "I am a Vans guy on off time and Cole Haan guy for work. I love these because they are a professional look of a classic Vans and more comfortable. Can be dressed up or down. Love these shoes!!!"
  },
  {
    "user": "Jake Writer",
    "rating": 5.0,
    "message": "Would recommend, have already gotten multiple compliments and I've only worn them twice."
  },
  {
    "user": "Randy StClair",
    "rating": 3.0,
    "message": "They fit larger than expected. I wear size 11 and they fit like a 12. And they aren’t very comfortable either."
  },
  {
    "user": "David Stagg",
    "rating": 5.0,
    "message": "I really like these, my new casual favorite, well designed, smart, very comfortable and high quality. I will be buying again."
  },
  {
    "user": "Ray",
    "rating": 5.0,
    "message": "Very happy with the product and service"
  },
  {
    "user": "Jhon",
    "rating": 4.0,
    "message": "Buen producto calidad vs precio"
  },
  {
    "user": "Saul",
    "rating": 5.0,
    "message": "Great shoes but make sure o order a full size smaller. I normally order a 10.5 wide, I ordered a 9.5 wide. They fit perfect."
  },
  {
    "user": "Diego",
    "rating": 5.0,
    "message": "Excelente producto"
  },
  {
    "user": "Jimmy",
    "rating": 3.0,
    "message": "Would be comfortable but insole is not removable. It is so glued-in that you really can't remove it without leaving a whole bunch of foam behind. For most people with plantar fasciitis, being able to switch out the insoles is a must."
  },
  {
    "user": "mike sesty",
    "rating": 4.0,
    "message": "Hard to explain in words but i went w others advice and got a size down bc im planning to wear these w/o socks but the issue is even going w a 10.5 down from an 11 my toes barely reach the end of the shoe! I mean to the point where if i wiggle my toes you can see them just past the lace area….  The shoe is even a tad lose but id never get my foot in a size 10 so its the shoe itself thats odd . Other than that its CH so the look and quality is there"
  },
  {
    "user": "Jeff in Southern California",
    "rating": 5.0,
    "message": "These stylish sneakers are very versatile. You can wear them with shorts, jeans, or pair them with slim fit khaki's for a modern look."
  },
  {
    "user": "Dema Y.",
    "rating": 5.0,
    "message": "Bought those shoes for my brother. They are very elegant!"
  },
  {
    "user": "CCN 🙏",
    "rating": 5.0,
    "message": "Excellent shoe. Great quality and comfort! Happy with shoes"
  },
  {
    "user": "George Amaro",
    "rating": 5.0,
    "message": "Pretty comfortable shoes. Fit as expected.  The shoes have a nice soft sole good for walking and just casual wear.  I have plantar fasciitis so I’m weary of buying shoes for the comfort. The canvas material is soft and insoles are supportive.  Def would recommend and they look pretty good also."
  },
  {
    "user": "M",
    "rating": 5.0,
    "message": "Back to work using these shoes they look stylish with chino pants! Comfortable"
  },
  {
    "user": "Brent",
    "rating": 5.0,
    "message": "This is my second pair of these. I had the gray, and then wanted the white. Being Cole Haan, they are extremely comfortable. I’ll probably even buy another pair in another color!"
  },
  {
    "user": "Rene Y. Kageff",
    "rating": 3.0,
    "message": "A little on the narrow side. I wear a 10 regular."
  },
  {
    "user": "KNWR",
    "rating": 5.0,
    "message": "I bought these as summer sneakers a couple of months ago. They stretched a bit after a few wears, and are now very comfortable (I bought the wide fit). I like the overall detailing on the shoe (mid gray canvas with light gray stitching) and that it doesn't feature a large logo/pattern, except for a small marking on the back. I don't normally get compliments on my clothes/apparel because I tend to dress down (t-shirt and jeans w/NB sneakers) but I've received multiple  positive comments on these shoes, including asking which brand and where I bought them."
  },
  {
    "user": "ANA VENT.",
    "rating": 5.0,
    "message": "Great seller … my husband loved these shoes"
  },
  {
    "user": "Amz Customer",
    "rating": 4.0,
    "message": "I wear size 10. I ordered 10s in these but they seem bigger, even though it says 10 on the shoe."
  },
  {
    "user": "Emmanuel Kwame Ahadzi",
    "rating": 5.0,
    "message": "Great look and comfortable to wear"
  },
  {
    "user": "Alain A",
    "rating": 5.0,
    "message": "No I usually wear a 11, I ordered a half size smaller and I probably could’ve gone a full size but there’s still quite comfortable as is. Definitely needs a little bit of time to break in as they are quite stiff but that’s typical canvas. They look sharp aside from the front tip having a bit of a divot."
  },
  {
    "user": "RM",
    "rating": 5.0,
    "message": "Comfortable pair of shoes from CH. Would definitely recommend."
  },
  {
    "user": "Size 14",
    "rating": 5.0,
    "message": "I’ve heard about the comfort of Cole Haan but was not in a hurry to spend $100+ on a pair. Found these and I like them.  I wear 13 in some brands and 14 in others. I got the 14 and they are roomy. Will order another color, likely size 13."
  },
  {
    "user": "EMMANUEL",
    "rating": 5.0,
    "message": "CASUAL WEAR. VERY ELEGANT AND COMFORTABLE"
  },
  {
    "user": "Scott W",
    "rating": 5.0,
    "message": "Really great price for name brand shoes. Fit is perfect. Very stylish."
  },
  {
    "user": "Ellery Adams",
    "rating": 5.0,
    "message": "Excellent fit and quality. Looking for my next pair now."
  },
  {
    "user": "RD93448 Heroiny Burgos",
    "rating": 5.0,
    "message": "No es fiel al size pero ya eso es algo de la marca como tal, deben saber que en colehaan siempre se debe de elejir medio size menos que tu talla regular"
  },
  {
    "user": "Kiko",
    "rating": 5.0,
    "message": "Great, casual dress sneaker; wish they had more choices in wide.  I'm not normally a wide but 9 1/2 was too long  and slightly narrow.  Gave the 9 wide a try and voila!~ perfect fit!  Have not yet done any serious walking in them but appear to be very comfortable."
  },
  {
    "user": "SCOTT",
    "rating": 5.0,
    "message": "Very comfortable. True to size."
  },
  {
    "user": "andrew",
    "rating": 4.0,
    "message": "These are some very clean-cut sneaks that you can dress up or dress down.  They feel like great quality for the price.  You'll want inserts though, since there is not much arch support.  I normally wear size 13 but ordered size 12 and they fit  fine."
  },
  {
    "user": "David Friedman",
    "rating": 5.0,
    "message": "They fit well and are very comfortable. They look fantastic with shorts!!"
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "These shoes are awesome. They look very stylish and fit the modern look. Great purchase"
  },
  {
    "user": "Adel-71",
    "rating": 5.0,
    "message": "👌"
  },
  {
    "user": "Ethan",
    "rating": 4.0,
    "message": "I wear a size 11 and had to order a 10 but other than running large that feel amazing"
  },
  {
    "user": "Esteban mackliff",
    "rating": 2.0,
    "message": "Compro esta marca por que son con los que mi pie queda menos adolorido al final del día Zapato sin arco , un zapato cualquiera"
  },
  {
    "user": "Greg R.",
    "rating": 3.0,
    "message": "Awesome looking shoe, but it’s a size larger. Too bad they ran out of My size down for exchange"
  },
  {
    "user": "Jeffrey A Dominique",
    "rating": 5.0,
    "message": "I love these shoes! They are super comfortable and very stylish. I did buy a smaller size than most shoes that I wear, but once I got the right size they fit great."
  },
  {
    "user": "Roberto Pérez",
    "rating": 5.0,
    "message": "Really enjoyed this shoes, fit exactly as expected and VER comfy"
  },
  {
    "user": "Chavrlie",
    "rating": 5.0,
    "message": "Cole Haan quality and fit"
  },
  {
    "user": "KDog71",
    "rating": 5.0,
    "message": "Was worried about sizing since this is a sneaker and not an Oxford. Ordered my normal size and these fit true to size. Love the look"
  },
  {
    "user": "Jennfer Guerrero",
    "rating": 2.0,
    "message": "Came with a factory damage and the right foot look larger…"
  },
  {
    "user": "Omar Ramos",
    "rating": 5.0,
    "message": "Muy bien"
  },
  {
    "user": "Luis Lujan",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Sherman",
    "rating": 3.0,
    "message": "First off, I read all of the reviews and most said that the shoes run long. However, even going a size down I think they're still a little long. For my preference I should have went down 1 1/2 down. But it's a great looking shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great"
  },
  {
    "user": "Jose Oliva",
    "rating": 3.0,
    "message": "Too large"
  },
  {
    "user": "sailaway459",
    "rating": 5.0,
    "message": "Very good fit and look, well, red. Worn them a couple of times and really like them. I would recommend them."
  },
  {
    "user": "Alan Hendron",
    "rating": 5.0,
    "message": "Great shoes very well made. Great looking and very comfortable. Will buy again."
  },
  {
    "user": "KINGFARI",
    "rating": 5.0,
    "message": "Very comfortable !! Don’t ask just get it !!"
  },
  {
    "user": "Arnold Brownstein",
    "rating": 5.0,
    "message": "Love these shoes with a perfect fit"
  },
  {
    "user": "Jeffery N Langford",
    "rating": 5.0,
    "message": "Great shoes, but did not fit my narrow foot.  Amazon is the absolute best company with which to work."
  },
  {
    "user": "Kenneth Turner",
    "rating": 5.0,
    "message": "These shoes are absolutely beautiful. Love'em."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "espirituano",
    "rating": 1.0,
    "message": "Cuando lo use me provoco ampollas en los pies."
  },
  {
    "user": "Rhys",
    "rating": 5.0,
    "message": "These are so comfortable and clean looking. Couldn’t be happier."
  },
  {
    "user": "CARLOS FORERO",
    "rating": 5.0,
    "message": "Amazing confortable  Beautiful"
  },
  {
    "user": "RICARDO",
    "rating": 1.0,
    "message": "En la segunda lavada se mancharon los zapatos, mal material, me siento engañado"
  },
  {
    "user": "Daniel G.",
    "rating": 1.0,
    "message": "they are broken"
  }
]