[
  {
    "user": "Michelle G",
    "rating": 4.0,
    "message": "It was so hard to get the shoe on it’s so stiff for being mesh I had regular black socks on and it was so hard to get the shoe over my ankle it like strained a muscle in my foot I put on nosy socks that are like silk that I wear with my dress shoes for work and it was a less hassle but still takes time to get the back over your foot hopefully once they break in a little better I won’t have this problem but I’m on my way to work and my foot is killing me"
  },
  {
    "user": "RAJ",
    "rating": 4.0,
    "message": "What I like most about this shoe. The color was popping and eye-catching. They are comfortable once you get them on. The non-slip soles need more grip. The thing I like the least about this shoe, the shoe is hard to put on, the loophole on the back is to small to put your finger into, to help you pull the shoe o to your foot. These shoes are like socks with a sole.  SMH, if you make the loophole bigger, this shoe would not be to bad."
  },
  {
    "user": "Lisa R.",
    "rating": 4.0,
    "message": "I bought a couple pair they are comfortable and stylish"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "In the finger loops, I cannot insert my finger. I am a small frame. The back straps talk about weight to 1000 pounds. I don’t understand the purpose of this. The back straps are not equal on both sides. this soul is not flexible at all.  fun color!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I Love the Price and the shoes are so Very nice, Very light, Very comfortable.  I would recommend this shoe to those who pay crazy money for shoes that looks and feels the very same."
  },
  {
    "user": "Theresa",
    "rating": 4.0,
    "message": "Beautiful pair of shoes. Too hard to put on perhaps because there is no tongue by the instep. However, once it goes on, it fits to size."
  },
  {
    "user": "Stephane",
    "rating": 5.0,
    "message": "These shoes are definitely more for walking.  I wouldn't run in them as there is not enough cushion to absorb the shock.  They material on the bottom takes some getting used to, but they look great!"
  },
  {
    "user": "MG",
    "rating": 4.0,
    "message": "But they are comfortable. Are really just not a sport shoe."
  },
  {
    "user": "Lisa Reynolds",
    "rating": 5.0,
    "message": "Unfortunately, I’m in between sizes. I Usually wear an 8 in tennis shoes, but these were too big. Then I bought a 7 since, they don’t come in half-sizes and they were too short. I’m so disappointed…But they’re so cute & cool looking, plus comfortable."
  },
  {
    "user": "Tina Hotchkiss",
    "rating": 5.0,
    "message": "Love theses sneakers!! I’m planning on buying another pair!! Very well made, and comfortable. So I’m giving them 5 stars!!"
  },
  {
    "user": "LaToya Matthews",
    "rating": 5.0,
    "message": "I love these I have them in 2 colors. They fit great, and are very comfortable. I have recommended to friends."
  },
  {
    "user": "Alexander R.",
    "rating": 5.0,
    "message": "El articulo es ligero y cómodo. Facil de poner y quitar. Light and conmftabe easy to wear and onwear."
  },
  {
    "user": "Ava T",
    "rating": 5.0,
    "message": "These shoes are amazing!! They look like the exact pictures that are shown before you buy them. They are very lightweight and very comfortable. I would defintely recommend to someone who walks a lot like me. I wear these about twice a week!! VERY comfortable and very cute!! Would def recommend and buy again."
  },
  {
    "user": "TL",
    "rating": 4.0,
    "message": "When I first received the shoes, it looked as if they had already been worn. One of the shoes had cat hair inside it and a dirt smudge on the outside. This was very noticeable because I ordered a white pair. I can say that when I came back online to complain, it was dealt with immediately. They replaced them with a much newer-looking pair of shoes, which I was happy to see. They fit okay, but a little bit tight. I appreciate the immediate response to my complaint."
  },
  {
    "user": "Cassandra",
    "rating": 5.0,
    "message": "Love the look and great fit."
  },
  {
    "user": "CoachDenise",
    "rating": 5.0,
    "message": "Love these shoes! I get so many Compliments!"
  },
  {
    "user": "shoppingcrazemama",
    "rating": 5.0,
    "message": "I work 12 hour shifts and on my feet all day these shoes have never had my feet hurting! I love them & just bought another pair (a diff color). The purple is so adorable! I didn’t like the strap at the back that said something about lbs so I just cut it off it was easy to do & did not change anything about the shoe other than making it look prettier! Love them! Also size down. I usually wear size 9 and these fit a little big. My new size I have coming is 8 and think it will fit a little bit better."
  },
  {
    "user": "Bella",
    "rating": 5.0,
    "message": "I want a pair in every color. I get compliments every time I wear them and they are very comfortable ❤️"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These fit true to size. They are very light and comfy. I would say they are compatible to nikes but a lot cheaper.  I bartend and can wear these 12 hours without any foot/back/hip pain what so ever."
  },
  {
    "user": "Turshandah Wilson",
    "rating": 5.0,
    "message": "They was good and comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The size too small they are not true to fit. They are a size too small"
  },
  {
    "user": "Samantha jones",
    "rating": 5.0,
    "message": "I wear them for work and working out. very comfortable."
  },
  {
    "user": "Lisa Ruff",
    "rating": 4.0,
    "message": "Great"
  },
  {
    "user": "Roxanne Easterling",
    "rating": 5.0,
    "message": "Like the color and the light weight"
  },
  {
    "user": "Christine Gries",
    "rating": 4.0,
    "message": "Fit true to size and very light weight. I work at a hospital & on my feet 8-10 hrs a day so comfort is a must. The only thing issue is the heel does not give when trying to put on. I use a shoe horn & that makes it easier. I am glad the heel is like that for stability. Will buy again."
  },
  {
    "user": "Rhonda G Lewis",
    "rating": 5.0,
    "message": "They fit tight, and are light weight. I get compliments when I wear them. Only if the top were a little softer."
  },
  {
    "user": "Terri Mims",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "S Summers-Santiago",
    "rating": 5.0,
    "message": "Good buy and much needed foot balance and space"
  },
  {
    "user": "J. R. Frazier",
    "rating": 4.0,
    "message": "Love the shoe. It’s a bit snug to put on but fits like a glove once on."
  },
  {
    "user": "Jody Price",
    "rating": 5.0,
    "message": "Super cute, a little tight for my wide feet, not super comfortable insoles."
  },
  {
    "user": "KD",
    "rating": 4.0,
    "message": "Good quality, super bright just a little heavier of a shoe than I normally wear.  I wear  an 8 and I bought an 8."
  },
  {
    "user": "Lacey",
    "rating": 4.0,
    "message": "Once I get my foot in them they are great, just very hard to slide foot into have use the loop with screwdriver in it to pull them on"
  },
  {
    "user": "Pamela Rubio",
    "rating": 5.0,
    "message": "I’ve had these shoes I believe 2 years now and I always get compliments. I’ve referred at least 20 people to buy these shoes. I wear them to the gym and on hikes a lot. The only complaint I do have is one shoe has always had a part that feels a bit more elevated in the middle which makes it a bit uncomfortable over time but other than that love. They’re very durable and haven’t had any wear and tear at all surprisingly."
  },
  {
    "user": "David Smith",
    "rating": 4.0,
    "message": "I am an active 60 year old women and for me the shoes were not comforable.  I need more padding ."
  },
  {
    "user": "Leidy",
    "rating": 4.0,
    "message": "Lo único negativo es que son muy duras en el soporte."
  },
  {
    "user": "Treva Whitney",
    "rating": 4.0,
    "message": "Order one size up"
  },
  {
    "user": "S. meredith",
    "rating": 3.0,
    "message": "I got size 11, but they definitely wasn't a size 11 for me. I could wear them, but they were tight. I ended up giving them to a friend who wears a size 9.5-10. And she said they fit perfectly."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love them perfect fit"
  },
  {
    "user": "Doe",
    "rating": 4.0,
    "message": "I wear size 9 so thats what i ordered. Good fit. I did replace the insoles with my own because they didn't have much support in them. But overall I love them"
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "I love love love these tennis shoes. Gone are the days when I spend hundreds of dollars on name brand tennis shoes. That's really not my thing. I ordered them in black and they are cool, eye catching and really comfortable. They are a little hard to put on but with a shoe horn you can slip right into them. Will definitely order more in different colors. Oh, BTW the price was right in my  budget for a tennis shoe."
  },
  {
    "user": "Neex2",
    "rating": 4.0,
    "message": "Only problem is a lil hard to put on. Stylish very cute and worth the money"
  },
  {
    "user": "April",
    "rating": 4.0,
    "message": "Light weight fit great"
  },
  {
    "user": "Samantha Anderson",
    "rating": 3.0,
    "message": "The description says non slip work shoes these are not Non slip I bought these for work and I was slipping all over because the shoes do not have any grip. They are comfortable and lightweight and definitely have got a lot of compliments on these I just really got them for work and I can’t even wear them for that!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "El mejor"
  },
  {
    "user": "Deneen d messer",
    "rating": 4.0,
    "message": "The media could not be loaded. Never use them too small"
  },
  {
    "user": "Giovanna",
    "rating": 4.0,
    "message": "Too snug"
  },
  {
    "user": "C H.",
    "rating": 4.0,
    "message": "Alil heave"
  },
  {
    "user": "Amie Tyson",
    "rating": 5.0,
    "message": "They are exactly as described. Lightweight and very comfortable."
  },
  {
    "user": "carol seitz",
    "rating": 3.0,
    "message": "I did not like the way they were laced (from the top instead of from the bottom).  I had to change that and the laces were almost too big for the holes."
  },
  {
    "user": "Ms. Paulette Belle",
    "rating": 3.0,
    "message": "What I like about the shoes are they are comfortable to work in. What I dislike about the shoes, they are too hard to get on. The back of the shoes are too flexible and that’s what make it hard to put on. Also, the bridge of the shoes are too tight."
  },
  {
    "user": "Richard Flannery",
    "rating": 5.0,
    "message": "Loved them they fit great and are bengals colot"
  },
  {
    "user": "shelly Sohne",
    "rating": 4.0,
    "message": "Looks great feels great the only issue I had was the insert. The insole is very cheap and thin. I bought new insoles and the sneakers are great. You can slip your foot in easily without undoing the laces."
  },
  {
    "user": "Jacob Johnson",
    "rating": 4.0,
    "message": "Update: loving them. I am wearing those thin no show slip on socks but the shoes are great. I wore them to work yesterday and they were comfy. Definitely narrow. Would not work for a wide foot. It is hard to get on but i manage with loosening the laces and a shoehorn. I might try a half size larger. I do like the tightness of the fit- it feels snug and supportive and so far i like the feel when walking. But the real test is when im working a 12-hr ish shift I love the look of them of my foot."
  },
  {
    "user": "carli",
    "rating": 5.0,
    "message": "The media could not be loaded. I LOVE these shoes! I got the orange as a gift and I wear them 8-9 hours a day at a job where I'm standing and walking all day & my feet aren't killing me when i get home. I get comments and compliments all day from coworkers and customers. I just bought the yellow green ones and this video is of my first wear on a walk with my dog. I feel like I'm wearing glowsticks on my feet and I love them! Highly recommended if you're not afraid of standing out! I clean them by spraying them with shout stain remover and scrubbing with a toothbrush then I take out the little insole thing and throw them in the washing machine on hot/quick wash, and I live in the sunniest/hottest place in America so I sun dry them and they come out as bright as ever! Love these. I've had the orange ones for 4 months, wash & wear them regularly and have no issues so far."
  },
  {
    "user": "Darlene Cobwell",
    "rating": 5.0,
    "message": "They are kind of hard to put on"
  },
  {
    "user": "Claudia",
    "rating": 5.0,
    "message": "I love the light weight comfort. I suffer from achilles’ heel pain so these worked out great. I did add orthopedic inserts because I have to for any shoe."
  },
  {
    "user": "Lauren Harrison",
    "rating": 3.0,
    "message": "Cheap plastic. And shoe is a little smaller but it’s a shoe and works"
  },
  {
    "user": "Berry",
    "rating": 4.0,
    "message": "Absolutely love the look of these sneakers the only one thing I would change is the sound they make when you walk on wood floors they're not soft rubber... but very comfortable and very stylish"
  },
  {
    "user": "micky",
    "rating": 2.0,
    "message": "Got these 2 wks ago. 1st step was jarring! there is little to no heel roll on shoe so when you step the shoe slaps down flat. I work in warehouse walking or racing on concrete floor for 8 hours no sitting down no standing in place and this shoe is not acceptable, which was what I bought them for based on someone else's review! the sizing is accurate if you wear thin socks but if you wear heavy socks in winter you need a bigger size although , I wont be buying another pair of these! They are fine for standing around at brawlmart trying to look cute but not for walking or working in a warehouse or hard floor environment. the tongue does not give so you have to put your foot on the floor to force it into the shoe. then it gives when you are walking making a loose fit! the laces do little to prevent this, they appear to be for looks.  I have only worn these on weekends to putz to the grocery store and each time I put them on I dislike them even more, but now of course I think it is too late to ask for a refund. bottom line if you're looking for a shoe that works as hard as you and provides comfort and support on concrete flooring then keep looking.... as I am"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "I found these shoes very cute & could hardly wait to put them on. I love the color & the style. They are very hard to get on but I finally got them on & wore them all day. By the end of the day my feet were killing me. I haven’t put them on again; I may try them again…hoping the next time will be better."
  },
  {
    "user": "Amanda Evans",
    "rating": 5.0,
    "message": "Love these shoes! Very comfortable, I workout 2 hours a day and my feet never hurt so lite weight. People will come up and ask “ where did you get your shoes “"
  },
  {
    "user": "Bentley",
    "rating": 4.0,
    "message": "Not super comfortable for the long term, adding insoles may help with that though."
  },
  {
    "user": "kasi serrano",
    "rating": 4.0,
    "message": "They're nice light shoes, and I love the bright green color. They're not the most comfortable for my wide feet, as they smash my toes together. If you have skinny feet, they'd be great shoes."
  },
  {
    "user": "Cynthia Mayhew",
    "rating": 5.0,
    "message": "Wonderful shoes. I love them"
  },
  {
    "user": "sonya woods",
    "rating": 5.0,
    "message": "I purchased these because ai was looking for a solid color shoe that can match everything. I love the red bottom detail. I am a size 9.5 but I ordered the 10. I recommend ordering a 10 if you’re a 9.5."
  },
  {
    "user": "Taylor",
    "rating": 4.0,
    "message": "I ordered my normal size. Very vibrant just like the pictures, pretty comfortable. I don’t normally have to loosen strings to put my tennis shoes on but had to with these. Not a lot of traction on the bottom. I’ve used them for everyday wear and exercising. Also there not very wide. I really do love them and have had tons of compliments! Their lightweight and can’t beat the price!"
  },
  {
    "user": "Amanda L. Routhier",
    "rating": 5.0,
    "message": "I ordered my first pair to “try”, these are the best! Comparably as comfortable as Under Armor. I have put miles on every pair, it’s air cushion comfort. Offers great support and a color to go with everything!  Even loads of compliments during recent business travel, I wore them during travel time and was approached by everyone from airport personnel to hotel staff to fellow conference members. Don’t believe me? Buy a pair, you’ll love ‘em!"
  },
  {
    "user": "Kathleen",
    "rating": 5.0,
    "message": "Great support snug fit around ankles"
  },
  {
    "user": "Daisy's",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "kerrie",
    "rating": 4.0,
    "message": "They are eye catching sneakers and comfy.  Im a size 9 and found they are a tiny too big so i need to wear a sock. Very lightweight ..im.afraid if i retirn them for 8.5 they will be too small"
  },
  {
    "user": "Sarah Hollingsworth",
    "rating": 3.0,
    "message": "The strap on the back had random words written on it, such as 4500 pounds. However, you can cut that strap off with a pair of scissors in the shoes look pretty cute"
  },
  {
    "user": "Gucci_Land",
    "rating": 5.0,
    "message": "I purchased the these shoes for my part time job.. Babbbyyy, I am going to order more in the other colors. PROS: true to size (I wear a 9-9.5, i purchased a 9) So comfortable So lightweight Everyone has asked where did purchase  them from. CONS: it is a struggle putting them on because of the tongue part is so long."
  },
  {
    "user": "M&M",
    "rating": 3.0,
    "message": "The reviews seem like everything I was looking for. But the shoe did not live up to what I expected. I wear 9.5 but I ordered a size 10. I could barely get my foot I'm. The first day I wore them I had to change my shoes mid shift. The sole it like a hard plastic which gives no cushion after a time of wearing them. They were not slip resistant as described. I was slipping the entire time I wore then. Regular sneakers work better than these. I signed up to return them while was at work because of how disappointed I was. But if you want them just to kick around it they will work for you. The design and style were nice."
  },
  {
    "user": "Amy Hill",
    "rating": 5.0,
    "message": "Looks nice, work at a large dealership, but no comfort with nice look."
  },
  {
    "user": "Kindle Customer satisfaction",
    "rating": 5.0,
    "message": "My Mom Love her shoes they are comfortable and they fit Great she loves hers."
  },
  {
    "user": "heather",
    "rating": 3.0,
    "message": "After very little use the top shoe lace holes break and become unusable...I ordered another pair and they all have it happen. Not made well."
  },
  {
    "user": "AMSMeier",
    "rating": 3.0,
    "message": "Was hoping these shoes would have a soft cushy bounce with the design of the shoe sole. It does not. The ribbon that angles across the back of the shoe seems to be the only heel support. The color of the shoes is gorgeous."
  },
  {
    "user": "Aida Licon",
    "rating": 5.0,
    "message": "I use them for work and they are super comfortable and my feet don’t hurt at all. No need to break them. I looooved them! ☺️"
  },
  {
    "user": "Rosemary Williams",
    "rating": 5.0,
    "message": "It was my purple daughters Birthday. They were delivered on time and my daughter loves the shoes. They are comfortable to her feet. 💚🌹"
  },
  {
    "user": "Reachelle Gonzalez",
    "rating": 5.0,
    "message": "Bought these for my son who usually complains about his feet hurting but since we got these I have not had a complaint"
  },
  {
    "user": "Ames",
    "rating": 4.0,
    "message": "Pros: Stylish and unique design😁. Comfy enough for all-day wear. Cons: A bit heavy. Shoe is slippery when se gets wet😲"
  },
  {
    "user": "Katherine Cantrell",
    "rating": 5.0,
    "message": "Love these, will be ordering more. I've got severe Achilles tendonitis and had some torn tendons about a year ago. These shoes have helped tremendously!! Even more comfortable after a long shift on hard surfaces than my more expensive \"name brand\" shoes!!! Supportive and light weight as well!!"
  },
  {
    "user": "Angella Cooper",
    "rating": 5.0,
    "message": "I used it for work every one love it.."
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "These shoes are very very comfortable. I’m on  feet for about 7 hours, and my feet don’t hurt when I take them off from all day. Others shoes, my feet hurts. My husband bought 2 pairs for himself( of course in mens) and my step daughter’s friend saw them and tried them on and loved it. So we got her a pair for graduation gift"
  },
  {
    "user": "Debra D.",
    "rating": 3.0,
    "message": "Too tight hard to get on"
  },
  {
    "user": "david wargo",
    "rating": 5.0,
    "message": "My wife always wears a size 7, they fit perfectly. She said they're very comfortable. Wants a pair in Black now. 😆"
  },
  {
    "user": "Broke",
    "rating": 4.0,
    "message": "Nice shoes"
  },
  {
    "user": "Gayle",
    "rating": 3.0,
    "message": "Color is great. Shoes are somewhat comfortable but I need more arch support. The shoes are a big hit with my coworkers.  Several people have ordered them now and we have a colorfully footed team!"
  },
  {
    "user": "Tiffiny",
    "rating": 5.0,
    "message": "Super tight. Hard to get on. But very cute and lightweight id order 1 size larger"
  },
  {
    "user": "Priscilla",
    "rating": 5.0,
    "message": "There’s no give trying to get them on! I use a shoe horn and no problem there…! I bought them in several colors… they are fashionable they’re cute they’re lightweight comfortable however there’s no stretch when you try to get them on you have to definitely get a shoehorn the loop at the back doesn’t always do the trick so I figured I’m gonna have to buy shoehorns and keep one in my bag so if I have to go out and take my shoes off at least I could get them back on!"
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "Work but it’s too small.  I have to give my mom"
  },
  {
    "user": "Angels22",
    "rating": 5.0,
    "message": "comfortable"
  },
  {
    "user": "Doubletree Ranch",
    "rating": 5.0,
    "message": "You must have these shoes they are so comfortable and I have arthritis in my toes an  I need more of them in all the nice colors. I can’t say I had shoes that felt better."
  },
  {
    "user": "Alexandra",
    "rating": 5.0,
    "message": "I love these sneakers, comfortable, looking good and the best is the price. More than expected!"
  },
  {
    "user": "Yessi",
    "rating": 5.0,
    "message": "These are great quality for the money. Beautiful colors and fit comfortably. I bought 2 pairs- neon green and orange. The only issue I have is that they are almost like thick socks, so when putting them on it can be tricky pulling them up from the back part of the shoe. The loop hole is too tiny to stick my finger in and too small to use it to pull up. Still it’s not a deal breaker because they are really cute. I’m hoping they get easier to pull up as I wear them more. On a side note, I bought my 80 year old dad a pair of white ones mens ones because he liked mine. They were impossible for him to put on because of the same issue, so I had to return his."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Omg these shoes are so nice! I bought 2 pair and I'm buying 2 more! Great buy"
  },
  {
    "user": "Gustavo Perez",
    "rating": 5.0,
    "message": "Good sneakers"
  },
  {
    "user": "Tracie Gil",
    "rating": 5.0,
    "message": "These shoes are awesome and so comfortable for the price! I'm on my feet all day for work and let's just say my feet do not hurt after I take my shoes. These are the most comfortable shoes I have ever owned, I've had to share this link to 6 different people at my job because they want to order some. I Love Them!!!!"
  },
  {
    "user": "Frances Coleman",
    "rating": 5.0,
    "message": "A co worker told me about these shoes I bought a pair and I can say best shoe for the money. I have already ordered another pair."
  },
  {
    "user": "Cali",
    "rating": 3.0,
    "message": "My girl is a size 8 ...we got a smaller size for some reason..now my daughter whom wears a 7 has new shoes ! Asian people..remember there is people bigger than your sizes..get with the program."
  }
]