[
  {
    "user": "Lizzy",
    "rating": 4.0,
    "message": "I wanted to wear these shoes to Disney World. With the Florida rain and hot weather, I was so glad to have found these. All I would have to do is keep a change of dry socks in my bag. Now, Disney requires a lot of walking. So I wore these shoes for a few days and even exercised in them (walking long distances). At first I really enjoyed them. Felt comfortable, highly breathable, and stayed cool in the summer heat (purchased light grey for that reason). However, eventually on a normal walk, my feet started to cramp & I could feel the lack of arch support. My feet and ankles were killing me for the rest of the day. I knew I would never be able to wear them like normal shoes again. These will now be my kayak shoes only (which they will function great for). Not Disney World shoes for long walks, unless your arch can take it. I may still throw them in my bag, idk, for when the rain at the park does hit. Pros: - lightweight - generally comfortable - highly breathable - water proof - stay cool in heat - fit normal shoe size Cons - no arch support - uncomfortable bumpy sole design - definitely don’t wear in the rain unless you’re expecting to allow the water to go through them"
  },
  {
    "user": "Michelle Dickerson",
    "rating": 5.0,
    "message": "As a hairstylist in a fast paced salon, I was hoping this shoe would be as comfortable as my traditional croc slides. While they are comfortable, traditional ones still have it a little better. These are nice as they are airy and lightweight. They don't offer much by way of arch support. And they do tend to track hair around the salon in the way that the slides don't. Still hold their value and I'd recommend them."
  },
  {
    "user": "Rebecca",
    "rating": 5.0,
    "message": "I wanted the comfort of Crocs, but needed something with a truly closed heel for work, and these fit the bill! I don’t love that you can see the color of my socks through the shoe, but it’s not a big deal; you can wear black socks and it’ll be camouflaged."
  },
  {
    "user": "RMRH",
    "rating": 4.0,
    "message": "Usually wear a size 9.  These were a little snug.. my toes were right up to the top of the toe box.  Exchanged for a size 10.  They are roomier but a little too big in the toe box even with footsies.  I will return them. They are lightweight.  The grooves on the inner sole are what also prompted me to use the footsies...  I don't find the grooves comfortable at all. I purchased these trying to find support and relief from walking around the house in flat shoes or socks, which does my feet and legs no favors. I think 1/2 sizes would be a good idea. I have pictured my toes sticking up to show how much room is left in the toe box after sizing up to size 10."
  },
  {
    "user": "Catharine",
    "rating": 5.0,
    "message": "Great shoe for heel impact. Very spongy.  The tongue on the shoe is sewn in and part of the shoe and not separate so if you a high instep it could feel tight.  However, I own a lot of croc shoes and find that they do stretch a bit after wearing them.  I wear these for tennis and never have pain in my heel. Your foot can get sweaty and squishy since it is rubbery inside but it doesn't impact my playing or walking. I dont wear socks since I find it more comfortable without them.  They are light and I have traveled with them as well. True to size . I'm normally a 9 and got a 9 and they fit perfectly."
  },
  {
    "user": "HS",
    "rating": 4.0,
    "message": "Overall it's still a great shoe. After wearing it for a full day my pinky toe started aching. Only then did I realize it isn't as roomy in the toes as regular Crocs are, which is disappointing. Other than that it's still a great shoe."
  },
  {
    "user": "Lyd",
    "rating": 5.0,
    "message": "I LOVE these shoes! I’m overweight and am standing on the job for 10.5 hrs a day and my feet do not hurt!  I wear them for work and on vacation days where I know I’ll be on my feet all day"
  },
  {
    "user": "SouthernGurl",
    "rating": 4.0,
    "message": "Love the first gen pacer but not some much this second gen pacer. I like them but not love!"
  },
  {
    "user": "R Long",
    "rating": 4.0,
    "message": "Only wish I could wear them with socks. Wearing socks with these feel like the circulation is being cut off to my feet. Other than that…LOVE them."
  },
  {
    "user": "Jennifer G.",
    "rating": 5.0,
    "message": "Love the comfort of these shoes and also the fact that it they get dirty I can wipe them clean with a baby wipe or rag"
  },
  {
    "user": "Allison McLaughlin",
    "rating": 4.0,
    "message": "Bought these to wear while working as a cashier. Crocs aren’t allowed where I work, and standing for so many hours, I thought my crocs may be the most comfortable, so I thought that croc sneakers would be the next best thing. At first they were comfortable, but after few hours my feet were hurting. Fast forward 2 weeks and I realize that my back and feet hurt badly after wearing them."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "There are many things I like about these shoes. They’re waterproof, pretty cute,  comfortable footbeds. But the problem for me is that if I wear a liner sock or go sockless, the shoe rubs the back of my heels and causes blisters. There is something hard, almost sharp, on one of my shoes. My foot was literally bleeding after only a couple hours of wearing them with a liner. On the other hand, if I wear them with a sock that covers my ankle, it’s enough cushion to protect my foot and this doesn’t happen. This is annoying because I actually bought these shoes to wear to theme parks, etc, places where my feet would get wet, and the whole idea was to not wear socks. So they are pretty useless for the intended purpose. In my opinion this was a lot of money to spend on shoes that make my foot bleed. Also, something I could deal with but will note here, the sizes seem quite narrow to me. If you don’t have a very narrow foot, I would suggest getting the mens or youth styles, as they give a little more room width wise. Just subtract two from your woman’s shoe size and that’s your man/youth size. I considered doing this and wish I had."
  },
  {
    "user": "Alicia",
    "rating": 4.0,
    "message": "These are super comfortable. I can walk in them all day while in the city. Made the mistake of wearing them on a hike & felt every time I stepped on a pebble."
  },
  {
    "user": "Tatyana",
    "rating": 5.0,
    "message": "Great shoes for what I need. I can keep them looking clean very easy, just whipe off with moist cloth and it's done. I wish they came in half sizes, but like them any way. I'll probably  buy another pair soon"
  },
  {
    "user": "Adrian Galvan",
    "rating": 5.0,
    "message": "very light weight wore them to sea world theme park, they were great for the water rides .... comfort was ok I normally wear vans so these were a bit more comfortable but not a full support shoe...overall I was pleased with this purchase might purchase more colors"
  },
  {
    "user": "Saurabh",
    "rating": 5.0,
    "message": "I have been asked several times where did I buy these from. They look soo good and are anti slip and super conmfortable. I wear these to gym for running or just casually for going out."
  },
  {
    "user": "Eric & Julie",
    "rating": 4.0,
    "message": "My son and husband both purchased these shoes for men and they absolutely love them so I ordered a pair for myself. They are super lightweight and appear to be high quality shoes and I believe they are meant to be worn without socks which was my intent. However the stitches on the heel of one of the shoes were very rough and made the shoe super uncomfortable. I could tell from putting them on just once that I would have blisters within minutes. I was sad to have to return them but I don't mess around with shoes that aren't comfortable from the very beginning."
  },
  {
    "user": "Merrie",
    "rating": 5.0,
    "message": "Constantly get compliments on these shoes.  Love them.  Very comfortable.  Very attractive.  I normally buy a 6.5 to 7 but needed a 6 in these."
  },
  {
    "user": "Bryant Robles",
    "rating": 5.0,
    "message": "I'm flat footed and these shoes are very comfortable  and I feel i can walk in them all day"
  },
  {
    "user": "Tiffany",
    "rating": 4.0,
    "message": "I like these but they are definitely not as comfy as the lite-ride croc sneakers. There is less room and after an 8 hour shift my feet are sore which they are not with the lite-ride. I like the style of these but will not buy another pair, and will use for walks. Fits as expected, did not have to size up or down."
  },
  {
    "user": "Kate",
    "rating": 5.0,
    "message": "These shoes are comfortable, great looking, incredibly durable, and easy to clean. My wife and I like to take our German Shepherds on hikes thru Florida trails which can sometimes get a little swampy and soupy. Meaning, very muddy, like the dogs. Anyways, as you can see in the pictures, I got my new crocs filthy.  After a little 15 min soak in a sink with some soapy water and a quick 20 minute wash in the laundry machine, they came out looking just like new.  Home Run Crocs!  Now, if we can just get our dogs to clean up as easy….."
  },
  {
    "user": "Chris",
    "rating": 5.0,
    "message": "Such a great sneaker!  I love that they are quick drying.  They are great for that summer to fall transition when the ground can be wet, but like a traditional sneaker will not hold the moisture and take forever to dry.  I have more of a flat foot so long walks in these aren’t great, but if you are doing light walking, these are great!"
  },
  {
    "user": "AC",
    "rating": 5.0,
    "message": "I love these! I wear them all the time and get so many compliments on them"
  },
  {
    "user": "Kathy Quick",
    "rating": 4.0,
    "message": "I wish there were half sizes in thiese. I love the shoes but I wear a half size and had to go up a size to get a pair."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Definitely light weight shoes. Not a fan of the non-lace up/slide-in shoes. Not able to adjust loosen or tighten the fit."
  },
  {
    "user": "Annalise Schramm",
    "rating": 5.0,
    "message": "No dislikes. Wear them to work. Am on my  feet 8 hours. I do a lot of walking and standing."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes and they are very comfortable. They look and feel very good quality"
  },
  {
    "user": "donna",
    "rating": 5.0,
    "message": "use around house for good support and comfort"
  },
  {
    "user": "michelle",
    "rating": 4.0,
    "message": "Use this for my Hawaii trip. The shoes was comfortble to walk around and use it for swimming and dried fast. Will recommend it."
  },
  {
    "user": "Michael Glassman",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Michelle Kawas",
    "rating": 5.0,
    "message": "Love this shoes. Bought them for a trip to the islands and it was perfect for traveling, use with dresses and shorts and also to walk on sand. They are so comfortable and water proof. Will totally recommend"
  },
  {
    "user": "Syl",
    "rating": 5.0,
    "message": "My Mom usually wears 10 1/2, but says these fit great, are soft, comfy, loves the look, and material."
  },
  {
    "user": "Wesley",
    "rating": 4.0,
    "message": "The arch is not as high as I was hoping, but the heel is very comfortable. I wore them on a day in the airport with lots of walking and they were perfect. Also very easy to clean, although not as breathable as I expected."
  },
  {
    "user": "Brandy Johnson",
    "rating": 5.0,
    "message": "I really love these shoes. You do have to break them in but once you do they are amazing. Actually they still felt amazing before the break in. I’ll be purchasing two more pair the all black and the blue ones I believe. If your on your feet all day like I am then I encourage you to get these"
  },
  {
    "user": "Brittany Lamke",
    "rating": 3.0,
    "message": "These shoes are super cute and so far pretty comfy if you’re just around the house. But I bought them for my 15 minute morning walk to public transportation and there is a really uncomfortable design flaw on the inside back of the shoe that is sure to keep giving me blisters. Unfortunately, all my socks are low or no-show and I kinda bought them to wear without socks, so this is disappointing. Don’t want to return but probably will as it’s a lot of money to spend on uncomfortable sneakers I intended for daily use."
  },
  {
    "user": "Jennifer Lively",
    "rating": 3.0,
    "message": "I bought these shoes hoping that they would be light weight and easy. Unfortunately the rubber gives my heels blisters immediately and they are extremely tight over the top of my foot. maybe After I break them in for a while they will get better but currently they cut off circulation to my foot."
  },
  {
    "user": "Suzie",
    "rating": 5.0,
    "message": "Nice shoes, very light weight & fit right."
  },
  {
    "user": "Laine",
    "rating": 4.0,
    "message": "I’m a 9M and sometimes a 9W but I couldn’t handle the tightness across the instep."
  },
  {
    "user": "Leticia Garcia",
    "rating": 4.0,
    "message": "Good shoes for long shift but feet felt sweaty"
  },
  {
    "user": "Al.Herr",
    "rating": 4.0,
    "message": "Like the look, love the comfort, no to trilled with the outer texture, they look super dusty always even after a good clean."
  },
  {
    "user": "Robbie",
    "rating": 5.0,
    "message": "Ok guys, I have really painful problems with my feet and these shoes make my work life not miserable. Best money towards shoes I've ever spent. Not to mention the shoes are essentially water proof so when i need to clean them I just rinsed them in hot water and let them dry in front of a fan for an hour or two. Because the shoe is basically all rubber it didn't take long for them to dry and they look brand new again. 100% would buy again."
  },
  {
    "user": "Raquel",
    "rating": 4.0,
    "message": "Muy cómodo, ligero y fresco. Corre grande quizás una talla más y es resbaladizo. Por todo lo demás excelente."
  },
  {
    "user": "peggie",
    "rating": 4.0,
    "message": "cute light weight and waterproof"
  },
  {
    "user": "karelis vivas",
    "rating": 4.0,
    "message": "Para ser un calzado crocs no es tan cómodo como lo esperaba"
  },
  {
    "user": "Kristin Hugall",
    "rating": 5.0,
    "message": "The best shoe I’ve owned!"
  },
  {
    "user": "Heather Christianson",
    "rating": 3.0,
    "message": "These shoes are super comfy and fit very well, but there is not enough support, so I had to return them."
  },
  {
    "user": "Brenda646",
    "rating": 3.0,
    "message": "The Crocs brand is wonderful, and my husband wears its standard clogs product every day. But although this Crocs “sneaker” looks good, it doesn’t quite work. The material is more of a canvas, wasn’t stretchy and didn’t conform to my foot. Did not fit like a normal, lace-up sneaker. I returned it."
  },
  {
    "user": "pookinss",
    "rating": 3.0,
    "message": "This shoe hurt the top of my foot. That could be just my foot ."
  },
  {
    "user": "francis",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Mimi2Nemo",
    "rating": 5.0,
    "message": "I enjoy wearing Crocs regular shoes and had to try these. They are an ideal blend of the Crocs comfort and the practicality of a sneaker. I wear these for errands and working in the yard. Excellent breathable upper, comfortable soles and laces to prevent stepping out of the shoe inadvertently."
  },
  {
    "user": "Cpavlik",
    "rating": 5.0,
    "message": "They were way too narrow"
  },
  {
    "user": "paulettte",
    "rating": 4.0,
    "message": "Love the light weight ,but it rub my pinky toe can't wear to long"
  },
  {
    "user": "Geather Norris",
    "rating": 4.0,
    "message": "Shoe had a good look felt good much to big.When I read description it said order your regular size. I returned"
  },
  {
    "user": "Jenn Garro",
    "rating": 3.0,
    "message": "I love croc sandals and thought these would be just as comfortable…These were not comfortable at all! I ordered a size 8 since that is what I purchase when buying previous crocs. They seem small and just disappointing."
  },
  {
    "user": "Leesa Hill",
    "rating": 3.0,
    "message": "These shoes did not fit as recommended to go up from 6.5 to 7.  Too wide for my feet and too long.  Probably should have ordered the 6."
  },
  {
    "user": "Tayler Moore",
    "rating": 5.0,
    "message": "First, I didn’t know Crocs made sneakers and I’m sure happy they do. I visit Disney and Universal often so these are perfect park shoes. No more walking around in wet shoes after a ride. These are comfortable and the mesh too let’s the feet breathe. So glad I got these!!"
  },
  {
    "user": "Janet Medeiros",
    "rating": 5.0,
    "message": "I’m am avid Amazon shopper and don’t leave reviews for items, but I felt the need to leave one for these sneakers. My family returned from a week long Disney World trip. We each walked over 100,000 steps in a span of 5 days. Through sun, humidity, rain, and every day all day wear, the croc sneakers were awesome. No blisters. No discomfort. Our feet were fine and there was no need to change out of them mid-day (like we have in the past for one day trips to Disneyland wearing other big brand sneakers). My family was very impressed with these shoes."
  },
  {
    "user": "Diane Nibeck Smith",
    "rating": 3.0,
    "message": "I love crocs. Thought these would be great. They are very narrow. They are narrower than most regular athletic shoes. They also have tight elastic that goes over the top of the foot. The quality seems fine. They are headed back."
  },
  {
    "user": "Sasha Provencial",
    "rating": 5.0,
    "message": "I love these shoes. I hate socks. So I love that you can wear them without socks and they don't get smelly. Honestly not sure how socks would even fit. They are snug. And I don't have wide feet at all. So if you have wider feet I recommend getting the men's. Also the air holes keep your feet cool. The inside is just like crocs. So comfy. When I walk it feels like a mini foot massage."
  },
  {
    "user": "michelle moscatel",
    "rating": 5.0,
    "message": "I love them Judy wished they has the same insole as all the carols it’s great for the feet"
  },
  {
    "user": "A-Bomb",
    "rating": 5.0,
    "message": "Very comfy and look great! I stand all day for work."
  },
  {
    "user": "Kristen Williams",
    "rating": 5.0,
    "message": "I love these shoes so much. I have issues with my left foot and no shoes are comfortable except these. I honestly am so grateful for them. I wear an 8.5, bought an 8 and they were too small so I got a 9 and they fit perfectly. I am a Massage Therapist and I wear them everyday with my scrubs. They look great too. I also wear them to take my dog on walks, to the park, etc. They clean up so easily just run them under water and dry them off and they are good as new again. They have holes at the top for air flow and my feet always stay cool. Antimicrobial, don't harvest germs so they don't stink at all. I am obsessed and won't buy another tennis shoe ever!"
  },
  {
    "user": "Theresa",
    "rating": 4.0,
    "message": "No socks needed"
  },
  {
    "user": "Pomala",
    "rating": 3.0,
    "message": "These shoes were not comfortable to me.  I returned them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love it all!"
  },
  {
    "user": "Ashley fullmore",
    "rating": 4.0,
    "message": "Fits perfect, super comfortable, so easy to clean, but not much support for arch’s"
  },
  {
    "user": "Tom B.",
    "rating": 5.0,
    "message": "These are comfortable shoes and I would consider buying them again."
  },
  {
    "user": "MS2005",
    "rating": 4.0,
    "message": "Comfort and convenience of the Crocs brand Hose them off and go Great product"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I can see how this would not be comfortable if my ankles were large or if I were flat footed or if I had Fred Flintstone wide feet. But I don't. The support is perfect. The looks is exquisite! It is excessively breathable if you normally have sweaty feet. As a profession, I have taken care of feet and this shoe is perfect for washing and durability. I honestly can't think of a more perfect shoe. The tiny bumps in the sole are great for stimulating blood flow but a diabetic may not appreciate that. This shoe is definitely great for exercise! This shoe if cleaned regularly could be worn without socks but I think you are always better off with a fresh pair of clean socks to collect bacteria instead of your shoes. To each their own. These are my thought both personal and professional."
  },
  {
    "user": "Sharla Browning",
    "rating": 4.0,
    "message": "Exercise"
  },
  {
    "user": "Diane Smith",
    "rating": 5.0,
    "message": "These shoes are so comfortable. I have severe neuropathy from a very strong chemotherapy. These shoes help to support and give comfort immediately upon putting them on. The only shoes I have found that don’t hurt my feet!!😊"
  },
  {
    "user": "Patty Harrison",
    "rating": 5.0,
    "message": "Order the smaller size"
  },
  {
    "user": "pollet parra",
    "rating": 5.0,
    "message": "The media could not be loaded. Increíble en todo sus sentidos, uso para trabajar en restaurante y al final del día no me duelen los pies recomendados"
  },
  {
    "user": "TJB",
    "rating": 5.0,
    "message": "Love these crocs! Comfortable Durable Nice fit So attractive."
  },
  {
    "user": "ashley auer",
    "rating": 5.0,
    "message": "I have very pained feet!! Whether it’s from standing or walking during my whole 8 hour shift!! Came across these and said “why not”. These have been amazing for my feet, they no longer hurt.. no exaggeration there. I don’t recommend without socks as well as thick socks. I only use very thin no show socks."
  },
  {
    "user": "Dorothy Reid",
    "rating": 5.0,
    "message": "I purchased these shoes for work, that was the best decision I’ve ever made! I totally recommend this product, I only wish I had read some of the reviews before I purchase it, because it runs a little big I’m a size 8 and a half and got a 9 because they don’t come in half sizes, but I still wear mine I don’t care! This item is definitely worth it!!!"
  },
  {
    "user": "Raquel Salcedo",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Darcey",
    "rating": 2.0,
    "message": "I loved my previous pair of these shoes, so I bought another pair. When I first put them on, they seemed to feel the same, but maybe a little less cushiony. As I've worn them more, they are actually hurting my feet around the top and tongue area.  The tongue is not separate from the top of the shoe, so it's more of a slip on and can't be loosened. I can't wear them for very long before they start making my feet ache. Of course now I've worn them and they can't be returned. These just don't seem to be as well made/comfortable as my previous pair.  Wasted money as they will probably just sit in the closet..."
  },
  {
    "user": "Pam",
    "rating": 3.0,
    "message": "I ordered these after trying them on in a store. It was comfortable in the store. I got my pair from Amazon and I wore them to work. By lunchtime one of them was wearing a blister on the top side of my foot. I think they are good for just hanging out. Not long work days."
  },
  {
    "user": "jacy clifft",
    "rating": 5.0,
    "message": "I’m on my feet all day for my job and these are absolutely amazing!!!! So comfortable, I normally wear a woman’s size 9 and these are just a little bit big but the comfort is outstanding!! Would definitely recommend"
  },
  {
    "user": "Julie L Madaus",
    "rating": 3.0,
    "message": "Needed insoles but they are too small for me to add the insoles."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Shoes are very narrow."
  },
  {
    "user": "Carey",
    "rating": 4.0,
    "message": "Love them but a little wide in the toes"
  },
  {
    "user": "Charmaine Jay",
    "rating": 5.0,
    "message": "I love these. They slip on easily. Sometimes I like to wear them with socks, which can be a little trickier as the sock sometimes sticks to the shoe. But they are fantastic in water."
  },
  {
    "user": "Taryn S.",
    "rating": 3.0,
    "message": "These were so cute and would have been a great summer  shoe since  they can go from wet and dry while camping. But, oh yes the dreaded But! Compared  to my reg crocs, the sole is much thinner and harder and believe  me, your foot feels it. So sent them back with a heavy sigh 😕 The search for my perfect summer  shoes continues"
  },
  {
    "user": "Cindi M",
    "rating": 5.0,
    "message": "I had to order a size up as I was in between sizes. These shoes are very comfortable. I can stand for long periods of tie without any aching, thanks to these shoes. They are cute and lite! I will order some in a different color because they are so comfortable."
  },
  {
    "user": "Kcap",
    "rating": 5.0,
    "message": "I wore these shoes for multiple days in a row on travel, walking several miles per day in hot weather. They stayed completely comfortable!"
  },
  {
    "user": "Gabrielle",
    "rating": 3.0,
    "message": "Great product but was way to big. Expected to be able to get my normal size .... like with flip flops."
  },
  {
    "user": "Andrea Guarnizo Hidalgo",
    "rating": 5.0,
    "message": "El color es hermoso tal cual la foto.. llegaron muy bien"
  },
  {
    "user": "Spirit101_DPO_Kin",
    "rating": 3.0,
    "message": "Sorry Crocs, the size works as expected. However the quality does not match the croc’s name. They are advised as arch supporting but they are flat. When walking on the beach, sand accumulate inside the shoe so you’ll find yourself constantly removing your shoes to dump sand out or your walking on sand inside the shoe. The first time even putting them on, the croc tab fell off. They’re okay if you want something sorta stylish to wear at the beach but not for comfort and not literally on the beach/sand."
  },
  {
    "user": "USA User",
    "rating": 3.0,
    "message": "At 1st these felt good, but I'm pregnant and as I walked around, it didn't give me the support I needed. My feet started hurting 😫."
  },
  {
    "user": "Rofab",
    "rating": 5.0,
    "message": "I like these for the summer they have holes in them so they are not necessarily for the beach but perfect for walking around , Grocery shopping and all those errands you need to run"
  },
  {
    "user": "Juanita Ramirez",
    "rating": 3.0,
    "message": "They are fairly light."
  },
  {
    "user": "Chatan15",
    "rating": 5.0,
    "message": "This shoe is very light weight,  has great support and extremely comfortable. This is the best shoe I've ever purchased."
  },
  {
    "user": "Girl mama 💜",
    "rating": 5.0,
    "message": "I work in theses everyday! And I love them! I really recommend getting a pair!"
  },
  {
    "user": "Kristi Laws",
    "rating": 5.0,
    "message": "These are the most comfortable tennis shoes I’ve owned! I have osteoarthritis. I’m constantly on me feet at work & I’ve finally found a comfortable pair!"
  },
  {
    "user": "Malinda D.",
    "rating": 5.0,
    "message": "Where have these been my whole life? Fit is perfect. Sooooo comfortable and super easy to clean. No more smelly dirty shoes! Seriously threw all my other white sneakers away after wearing these the first time. I need these for my entire family! Well worth the 60 dollars!"
  },
  {
    "user": "Jeremy Jones",
    "rating": 5.0,
    "message": "Super light, comfy, and I love the fact that I can clean them with soap and water and dry them off after to be on the go."
  },
  {
    "user": "NHarden",
    "rating": 4.0,
    "message": "A bit longer would have ordered a half size down. Still comfortable for traveling and everyday wear."
  },
  {
    "user": "Deanna Havink",
    "rating": 5.0,
    "message": "These shoes are so comfortable! Working in the medical field, you definitely need comfy and breathable shoes. 10/10 recommend."
  }
]