[
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Oh, I so badly wanted these to fit because I love the design and the way they look. But they have no stretch at all and I could not even get my orthotics in them. So if you have orthotics that you have to insert in the shoe don't buy these shoes. Either that or I guess you could buy them two sizes too big but sadly I'm going to have to return them. So disappointed."
  },
  {
    "user": "Tif Black",
    "rating": 5.0,
    "message": "Love these shoes! I really like the tan/brown tread look with black and gray. While you can find these easily in men’s sizes, they’re hard to find in women’s, and my little feets are too tiny to fit in men’s. To boot (pun intended), they’re wicked comfortable! Love these. Hoping they’ll some day have an all gray with a tan tread. One can hope…"
  },
  {
    "user": "Mrs. C.",
    "rating": 5.0,
    "message": "I am the type of person who can not wait to take off my shoes.  But now I don't want to take these shoes off!  I have various foot and chiropractic issues that make shoe shopping a drudgery for me, because even if a pair of shoes feels comfortable at first, it isn't long before I have some kind of pain and/or even nausea.  New Balance has been the one brand that always has a shoe that finally works for me, and this pair is perfect! They are advertised as black and gray, but they are actually navy blue, and I prefer the navy!  I am a very happy and satisfied customer!"
  },
  {
    "user": "Meg Chicago Peach",
    "rating": 5.0,
    "message": "I decoded to try before you buy with New Balance shoes since I used to wear them years ago and haven't in so Ling. Shoes that have arches built in often hit me in wrong spot amd cause severe nerve pain and so many brands are ruled out. I decided to try NB again and these had a high cup heel and reviews said cushiony sole. So I got thwm. I LOVE THEM!!! And size is perfect for my sz 7 foot. One foot is slightly wider as I broke all 5 tarsal bones, but my heel is narrow. These are wonderful."
  },
  {
    "user": "Christina Bernice",
    "rating": 5.0,
    "message": "I work long hours as a nurse in a nursing home. I bought these for work! Prolly the cutest shoes I’ve ever owned! And very comfortable for 12 hours shifts. Love them. Fit as expected."
  },
  {
    "user": "Kim C Saur",
    "rating": 5.0,
    "message": "As I grow older arthritis in my feet and back is an issue, but who doesn't want to be stylish as well. I run towards needing a wider shoe and these fit perfectly. No need to size up. And there's a perfect amount of support for my long day as a teaching assistant."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I would give these 5 stars because they're comfortable, fit well, look good but they are definitely not black. I needed them to be black. I'm keeping them because they are nice looking and very comfortable. The N is black but the majority of the trainer is a dark or cobalt blue. In poor light they do pass for black but in the sun or any kind of good lighting you can clearly see they're dark blue. So if you want a great dark blue trainer. These are for you."
  },
  {
    "user": "rnach",
    "rating": 5.0,
    "message": "This is by far the best shoe I’ve ever had. I put them on straight out of the box and was able to wear them to the gym without needing to break them in, I wear them to work or am on my feet most of the day, I have not had a single blister, the shoes don’t rub any part of my foot, I bought a second pair but they didn’t come as pictured so I sent them back but definitely 10 out of 10 in my book"
  },
  {
    "user": "Sierra W",
    "rating": 5.0,
    "message": "The shoe is great love the color and quality. But the shoe does run small. I’m a 7.5 and ordered a 8 and it fits just perfectly. If I were to order a 7.5 my toe would be at the very tip of the shoe and would start to squeeze my feet. But beside that definitely would recommend"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These offer the support I needed to get though work all day with no pain. The heal has extra padding, which is really nice as well. They were a bit difficult to get on the first few days as the heel was very stiff, but it loosened up just enough to make it more manageable after a few days."
  },
  {
    "user": "Moraima Cruz",
    "rating": 5.0,
    "message": "I have these in various colors.  Love how cushiony and comfortable they are.  I usually buy one size smaller in gym shoes but these were exactly mi regular size."
  },
  {
    "user": "Shaplus3",
    "rating": 4.0,
    "message": "Very comfortable shoes. 2 issues, the insert in the bottom of the shoe is not glued in place so as I walk throughout the day, the insert slips and soon my toes aren’t touching the tip, and the end is riding up the heel which will be easily fixable. The laces however are round and stiff. They look like they will be durable, but MUST be double tied or they untie a lot. Overall comfort is great though so I still rate the shoe high!"
  },
  {
    "user": "chelseyryan",
    "rating": 5.0,
    "message": "While I love the shoes, they don't come with any insoles. Not sure how or why. Super disappointed"
  },
  {
    "user": "Theresa",
    "rating": 5.0,
    "message": "These shoes are great. The thing to know is they run a bit large."
  },
  {
    "user": "Mandy Robertson",
    "rating": 5.0,
    "message": "Very comfortable and love the style! I've order 2 pairs and definitely ordering more!!"
  },
  {
    "user": "Brianna",
    "rating": 5.0,
    "message": "My go to shoes for now on. As a medical assistant I’m always on my feet running around and I attend night classes. On average I’m out from 730am to 830 at night and I’ve noticed with these shoes I don’t get the usually aching or throbbing at the end of the day. I’ve also have very flat feet, pop in a pair of shoe insoles for extra support and you’re good to go for the rest of your day!"
  },
  {
    "user": "Erika Fikstad",
    "rating": 4.0,
    "message": "Took one star off because the color that’s titled “black/gray” is definitely more of a dark navy and light navy and not black/gray. My usual size was slightly larger than normal so I would size down half a size - just beware of the color if you want black shoes. I’m returning for the black and light aluminum in half a size down because the shoe itself was very comfortable and not too narrow"
  },
  {
    "user": "Linda Gaudin",
    "rating": 5.0,
    "message": "So comfortable and lightweight!  I love how they look, too.  My only issue is that they are a bit hard to put on but that may just be me--haha!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are so comfortable...  I have purchased a couple New Balance sneakers now, so definitely size up 1/2 size as they run a bit small.  Priced right for the quality too."
  },
  {
    "user": "Anna",
    "rating": 4.0,
    "message": "i bought these for a half marathon and they came a little bigger than expected, haven’t worn them much but definitely have to double sock it"
  },
  {
    "user": "MizTbeauty",
    "rating": 4.0,
    "message": "These were so tight that my feet were cold. I believe they make a wide version. Other than being tight, the actual shoe was very high quality and I could tell it would be comfy with the wide"
  },
  {
    "user": "Jess wall",
    "rating": 4.0,
    "message": "Really love these shoes, I work 12 hour shifts in a nursing home and my feet are not sore after work. They have great support. They’re just a bit tight around the toes, hoping they will stretch out a little after wearing them for a while"
  },
  {
    "user": "Bee",
    "rating": 4.0,
    "message": "They ran a little bit larger than I thought (I got a 7.5 after trying on a 7 in store) but are so comfortable. I like that the tongue is attached so it’s a snug sock-like fit. The laces are round so they don’t stay tight unless they’re double knotted, but they are so comfortable and have a nice wide toe box."
  },
  {
    "user": "lisa lawson",
    "rating": 4.0,
    "message": "I love these shoes because they are cute and comfortable. Unfortunately they come untied and loose every hour. Even with the double knot it gets loose. I am keeping the shoes but will have to change out the shoestrings."
  },
  {
    "user": "Lorelei Romano",
    "rating": 5.0,
    "message": "Super stylish and comfortable!"
  },
  {
    "user": "Stephanie Nivin",
    "rating": 5.0,
    "message": "Best shoes ever"
  },
  {
    "user": "The D's",
    "rating": 5.0,
    "message": "Super comfy and great for all day use. Roomy toe bed and feels supportive. These were my go-to shoes at a recent music festival! Love them and will definitely buy again."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "It took a minute to break them in. Wasn’t use to them at first. Once I did, most comfortable shoe for working, running on concrete. The tongue of the shoes doesn’t have a lining on the inside of the shoe. So my toe is making its way thru the shoe. Oh well they’re not as much as Nike."
  },
  {
    "user": "Kathleen Boyle",
    "rating": 5.0,
    "message": "Very comfortable. Easy on and off"
  },
  {
    "user": "noreen  adame",
    "rating": 5.0,
    "message": "Love these shoes comfortable fit."
  },
  {
    "user": "Maria Scariano",
    "rating": 5.0,
    "message": "Love these shoes! I work in a hospital so I'm on my feet all day. After I got these I noticed that many of the nurses had these also. I love how many different colors and designs they have!"
  },
  {
    "user": "Haley Swedzinski",
    "rating": 4.0,
    "message": "Got wide width, cute shoe and I love this New Balance type of shoe, but runs small."
  },
  {
    "user": "Kely",
    "rating": 4.0,
    "message": "these run large, and are for narrow feet. I wish i could get correct size by wore them a few times to figure it out."
  },
  {
    "user": "Tikyabo",
    "rating": 5.0,
    "message": "It looks sleek in the black color I ordered. It is light and comfortable."
  },
  {
    "user": "Ashley Woodall",
    "rating": 5.0,
    "message": "I love these shoes! They are super easy to put on and very comfortable. I have gotten many compliments of them."
  },
  {
    "user": "Myra",
    "rating": 4.0,
    "message": "The black/grey is NOT black. It’s dark navy! Someone must be colorblind to think these are black. They’re navy. I like the way they fit and look so I’m keeping them. But, if you’re looking for black, pass these by."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These look nice with so many thing because of the neutral colors.  Great for walking and wearing all day."
  },
  {
    "user": "Katy K.",
    "rating": 5.0,
    "message": "Great shoe fits well lots of support very wide"
  },
  {
    "user": "Tammie W.",
    "rating": 4.0,
    "message": "The shoes fit well but a little tight in the toe box. I should have ordered a half size up or a size wide."
  },
  {
    "user": "Vanessa",
    "rating": 4.0,
    "message": "It’s a little big for my tiny foot but I like the way it looks and it was pretty easily cleaned when I got color dust on it from walking in Rome"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Cute and comfy, nice as casual wear without socks."
  },
  {
    "user": "Megan",
    "rating": 5.0,
    "message": "At first the shoes hurt the back of my foot until the shoe got broken I. But now they are so comfortable"
  },
  {
    "user": "Erin",
    "rating": 4.0,
    "message": "Love everything about these shoes except for how hard they are to keep clean. The mesh on top seems to attract dirt and when you try wiping it off with a little soap and water on a towel it doesn’t really help. Love them overall just wish they held up better"
  },
  {
    "user": "Sasha Webb",
    "rating": 5.0,
    "message": "Nice shoe I wear a 7 or 7 1/2 and I ordered the 7 1/2 I have a little room in the front but they fit well."
  },
  {
    "user": "Ivy",
    "rating": 5.0,
    "message": "Cheap"
  },
  {
    "user": "Sharon K Zins",
    "rating": 5.0,
    "message": "I work in a school and am on my feet all day running back and forth, up and down stairs. These shoes are very comfortable!"
  },
  {
    "user": "TJ",
    "rating": 5.0,
    "message": "Great shoes!  Very comfortable."
  },
  {
    "user": "Krystal",
    "rating": 5.0,
    "message": "These sneakers are comfortable, a pair that I didn’t need to exchange thankfully. I’ve received many compliments as well."
  },
  {
    "user": "Melissa",
    "rating": 5.0,
    "message": "Quick FYI the pink is not a hot pink it is more of a glittery or shimmery pink. However it just makes them cuter."
  },
  {
    "user": "Dani",
    "rating": 5.0,
    "message": "I struggle with comfortable shoes as I have planters and numbness. These shoes fit like a glove but not too crowded. They are support cute, best support and all around amazing!"
  },
  {
    "user": "JENNIFER BEALL",
    "rating": 5.0,
    "message": "Perfect everyday shoe! Feet do not get tired. Did have to go up 1/2 size"
  },
  {
    "user": "Robert Joseph",
    "rating": 5.0,
    "message": "I bought these for my wife’s birthday and they are now her favorite shoes. So comfortable that she wants to wear them all the time."
  },
  {
    "user": "genevieve courteau",
    "rating": 5.0,
    "message": "Very nice color and super comfy"
  },
  {
    "user": "Shannon",
    "rating": 5.0,
    "message": "I’ve had these sneakers for almost 2 months. The sizing is perfect for my foot. I get complements all the time. I work in a doctors office and am on my feet all day plus I walk 5 miles in addition to work and my feet feel fine at the end of the day. I’ve recommended these shoes to coworkers and patients."
  },
  {
    "user": "Emma",
    "rating": 5.0,
    "message": "I wear this on my 12 hour shifts and they are the most wonderful shoes!"
  },
  {
    "user": "Emily",
    "rating": 5.0,
    "message": "Really comfortable shoe and after reading the reviews I sized up 1/2 and glad I did. They are great. Only negative is that the Black/Grey is not black, it’s dark Navy. I still like them but I need a black pair and they are out in my size. Keeping the navy and will order black when it’s available."
  },
  {
    "user": "Danielle",
    "rating": 5.0,
    "message": "I love these shoes. Cute and comfy. I put in a Dr scholls insert for extra support. Needed to size up to 8.5. 8 was much too tight in the toe"
  },
  {
    "user": "Escarly Fernandez",
    "rating": 5.0,
    "message": "I used this shoe for work. I love it"
  },
  {
    "user": "Ma. Isabel Rubio",
    "rating": 5.0,
    "message": "Buena calidad y buen servicio"
  },
  {
    "user": "The 4th House",
    "rating": 4.0,
    "message": "These are a bit expensive for being basic. The design is nice they run small and the material feels flimsy. I hate how running shoes are made now with such weak material around the toe. I opted for a cheaper shoe but comparable in quality."
  },
  {
    "user": "gia",
    "rating": 5.0,
    "message": "The only brand I wear for workout. Comfortable and it provides plenty of space for my bunion."
  },
  {
    "user": "Toe",
    "rating": 4.0,
    "message": "Comfortable"
  },
  {
    "user": "Jo",
    "rating": 4.0,
    "message": "I ordered the black/gray, but the shoes I received are blue. Fit is comfortable and supportive, though."
  },
  {
    "user": "Katie Wells",
    "rating": 5.0,
    "message": "Best tennis shoes I’ve ever bought"
  },
  {
    "user": "Gracie",
    "rating": 5.0,
    "message": "I ordered these shoes in size 5.5 but they were too tight, I returned the shoes and ordered size 6 and they fit perfect.  The shoes are light and comfortable.  The color matches with everything. Super Comfortable!"
  },
  {
    "user": "Ronda Johnson",
    "rating": 4.0,
    "message": "Highly recommend"
  },
  {
    "user": "Rebecca Flores",
    "rating": 4.0,
    "message": "Arch support. I have a Achilles tendinitis and plantar fasciitis. I will buy in another color if they have"
  },
  {
    "user": "Robin L. Singleterry",
    "rating": 4.0,
    "message": "I should’ve listened to the other reviews and got a wide. I ended up returning them."
  },
  {
    "user": "TABITHA",
    "rating": 5.0,
    "message": "I am a registered nurse at the bedside, and these shoes are extremely comfortable! They fit true to size."
  },
  {
    "user": "Amazon Reviewer",
    "rating": 5.0,
    "message": "I work on my feet all day for 10 hour shifts on concrete. I need a shoe that's supportive, comfortable, durable, and lightweight. I've only had these shoes for a day and I can say so far they're comfortable, supportive, and lightweight. The first thing I noticed is they're very true to size. I typically wear a 43 EU wide shoe, so I checked the size chart and ordered the corresponding 11 wide. They fit like a glove right out of the box. I also like the wide variety of colors they come in. It's very hard to find fun, colorful shoes if you have larger feet, much less ones that also come in wide widths. So finding these in my size was a huge plus (I got the raspberry and electric lime on black). I like the thin, stretchy heel cup that hugs my heel rather than the typical thick, plushy heel cups that most shoes have, which is just foam that covers a sharp plastic stabilizer. The first place my shoes always wear out is the heel cup, and I'm being stabbed in the heel with that plastic stabilizer. I'm hoping this shoe won't have that issue due to the different heel cup design. They are definitely supportive and I can feel the arch support on the inside of my feet. I tend to underpronate so arch support is important for me. While they are true to size, there isn't much vertical room in the shoe for any additional insert. I typically put some odor eaters inserts in my shoes (again, 10 hour shifts) and they made the shoe a little snug on top. I'm sure they'll loosen up as they wear in, but it's something to keep in mind if you typically wear an orthotic or use another type of insert. They're also very lightweight. I don't feel like I'm clunking around in a heavy brick of a shoe, like I sometimes get with very cushiony shoes. Shoes that are too heavy tend to fatigue my feet and legs after long shifts. They're not so light that I forget I'm wearing a shoe, but they're also not noticeably heavy either. I wish the toe box was just a little wider, but it's not squishing my toes a noticeable amount. I just tend to prefer a wide, roomy toe box. This one is probably a little wider than a typical athletic shoe, but just not as wide as I wish it was. Overall, so far very happy with the shoe. Will update if I run into any problems, but if they continue to perform excellently I can see myself buying another pair."
  },
  {
    "user": "Carmen Perdomo",
    "rating": 5.0,
    "message": "Bonito y fuertes"
  },
  {
    "user": "Tony McManus",
    "rating": 5.0,
    "message": "I got them for my wife she is a teacher and stands most of the time the new balance helps her back."
  },
  {
    "user": "Sarah Batson",
    "rating": 5.0,
    "message": "So sneakers usually hurt my feet. They’re either too thin (yes, even the wide sizes) or have too much arch. The sides of my feet will start hurting working a few minutes and party’s over. This has left me wearing converse or vans in the gym or at work. I work in a kitchen and I am on my feet 40+ a week on concrete…in converse. Yea. Ouch. I had developed a killer case of plantar fasciitis. But these… THESE!…. I LOVE THESE! Now, by no means did these shoes cure me, but with stretching, Epsom salt, a lacrosse ball and these babies I’m feeling a whole lot better. The fit is perfect. Zero pain from the get go. The arch support is just enough. I feel way less fatigue in my legs, hips, and lower back by the end of my day. Also, I’m sleeping better with less pain. I couldn’t be happier with these sneakers and plan to grab another pair for the gym."
  },
  {
    "user": "SC-Amazonian",
    "rating": 5.0,
    "message": "Love the bright periwinkle blue color!  Really comfy, cushy shoe.  Fits as expected, great price, too."
  },
  {
    "user": "Dan Mays",
    "rating": 5.0,
    "message": "I absolutely love these shoes. However, I have had them less than 6 months and they were already becoming ‘see through’ in the toes. Now a couple of months after that a hole is developing in one toe area. So disappointed because I loved to slip them on and run errands. I didn’t even wear them everyday."
  },
  {
    "user": "Elle",
    "rating": 5.0,
    "message": "I never write reviews so this means a lot--these shoes are so comfortable! You can slip them on without untying the shoe which is a huge time saver for a mom. The back of the shoe comes up higher on your heel and doesn't slip up and down like most. The arch support is always great from NB and these shoes are no exception. I highly recommend for anyone that is active or on their feet a lot."
  },
  {
    "user": "TLB",
    "rating": 4.0,
    "message": "These are very light weight. They fit well and don't slip. I've only worn them for a couple of hours, so I can't speak to how well they will hold up, but so far, so good."
  },
  {
    "user": "Lynne Callace",
    "rating": 4.0,
    "message": "Not the colors I ordered but so comfortable I don’t even care!"
  },
  {
    "user": "Sharon D",
    "rating": 5.0,
    "message": "I bought these for walking. They’re very comfortable and felt broken-in on the first wearing. I love them!"
  },
  {
    "user": "AWA CO",
    "rating": 5.0,
    "message": "I turned my pair into a Slip on memory foam shoe took out the laces and now they’re even better"
  },
  {
    "user": "Christy",
    "rating": 5.0,
    "message": "Trendy shoes! Fits as expected, comfy, light weight. I’ll be back for more in different colors!"
  },
  {
    "user": "B. T.",
    "rating": 4.0,
    "message": "Great support, great ventilation. The only issue I had was getting them on my feet. Because of the design, at first it was difficult to slip on. But now they're loosening up a bit and are much easier. I recommend these. New Balance has done it agian!!👍"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoe is great for my workouts. I ordered the size that I wear and felt that they were a little tight to fit. It is a little hard to get into them. I have not had that issue with any other NB shoe I have bought. That is the only reason I am giving it a 4 and not a 5."
  },
  {
    "user": "katrine mcanulty",
    "rating": 4.0,
    "message": "Beautiful shoes, comfy insoles, Size up a half size!!!!"
  },
  {
    "user": "Jimi",
    "rating": 5.0,
    "message": "Bought these shoes because of additional support shown.  I walk 3+ miles every day.  These shoes have helped with some orthopedic issues.  I would buy again"
  },
  {
    "user": "Cris",
    "rating": 5.0,
    "message": "Son muy lindos y muy cómodos"
  },
  {
    "user": "LauraWilson",
    "rating": 5.0,
    "message": "These shoes are so incredibly comfortable and they look stylish as well, definitely recommend. I wear an 8.5, ordered an 8.5, and they fit perfectly."
  },
  {
    "user": "Shayna",
    "rating": 5.0,
    "message": "I’m on my feet all day long, and never have sore feet. The sole is wide in the front and back and allows great support. With these I’m not nearly as prone to twisting my ankles. This is my second pair, my first pair lasted me 1.5 years as a Lube Tech. Highly recommend."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "fits perfect no problems"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Ok so I loved the way these shoes look. They are slip on, the laces are just for show. I wear size 8 in every shoe I’ve ever bought. In sandals I can size down to 7-71/2. The 8s in these shoes were too tight and too small. Exchanged for 81/2 and they fit much better. I work in health care so I bought to wear with figs. So yes, they’re really cute, but size up."
  },
  {
    "user": "Kyla Sbrusch",
    "rating": 5.0,
    "message": "Exactly what i was needing! So cute, very comfortable and fit as expected!"
  },
  {
    "user": "Ricky Schaeffer III",
    "rating": 5.0,
    "message": "I am a lady and wear a size 11 and alot of shoes just aren't cute that big, but these look awesome and feel great!  I want more already."
  },
  {
    "user": "Brenda M Gates",
    "rating": 5.0,
    "message": "Love new balance shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Description it that these shoes are black but they appear navy and after looking at other sites they are also listed there as navy/ grey/ white"
  },
  {
    "user": "Stephannie",
    "rating": 5.0,
    "message": "Literally my all time favorite pair of sneaks"
  },
  {
    "user": "nancy",
    "rating": 5.0,
    "message": "These are very comfortable shoes!"
  },
  {
    "user": "Savannah",
    "rating": 3.0,
    "message": "I love these shoes and they are super comfy but they aren’t holding up at all. I ordered them in August and it’s only the beginning of October and the toe is starting to break through. I even tried to order a men’s size but the toe was even smaller and tighter so I don’t think a men’s would hold up any better."
  },
  {
    "user": "Telia N. Goodman",
    "rating": 5.0,
    "message": "This style of NB is probably my most favorite EVER. I’ve ordered 2pair previously. This being my 3rd pair. The only issue I’ve had is the back of the shoe rubs the Achilles (back of foot). If you put bandaids on, it’s perfectly fine (yeahhh… I’m that person, haha!) but other than that, THEY ARE WORTH EVERY CENT! I only gave 3-4 stars because I’m tired of buying bandaids 😂"
  },
  {
    "user": "Shayla Wallace",
    "rating": 5.0,
    "message": "I really love these shoes. I normally run wide but just went up half a size and they fit perfect. They are better than my on clouds (show brand) shoes. And the price is very fair"
  },
  {
    "user": "Ann Marie",
    "rating": 5.0,
    "message": "Great fit, cushion sole, snug fit-very sturdy feeling"
  }
]