[
  {
    "user": "Judy",
    "rating": 4.0,
    "message": "Ordered these in the wide size and half inch up to see if they gave me room for the swelling. They fit fine so I will wear them till the swelling goes away hopefully and see how I like the way they feel then. But for now all I can say is thanks Amazon. Oh and love the color."
  },
  {
    "user": "Kat",
    "rating": 5.0,
    "message": "Working in a hospital, you're on your feet a lot and I'm surprised these held up as long as they did. Usually the $60-$80 shoes end up breaking down over a 3 month period but these lasted past that (and probably would have lasted longer if my puppies hadn't found them lol.) Definitely worth the buy, it fit really well and I had almost no problems breaking them in + they had enough cushion that at the end of the day my feet weren't even sore for once."
  },
  {
    "user": "Rebecca",
    "rating": 4.0,
    "message": "The insert slides and have to pull strings tight for them to fit."
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "They are comfortable on bottom of shoe.  The problem is the shoes are cut too close to the big toe and rubs the toe."
  },
  {
    "user": "Goracker",
    "rating": 4.0,
    "message": "Daughter used these for cheer and loves them."
  },
  {
    "user": "Anthony",
    "rating": 5.0,
    "message": "Love these...comfy,  clean up in washer great. Perfect  for travel"
  },
  {
    "user": "Jennifer Waltz",
    "rating": 5.0,
    "message": "They needed better padding so I replaced w better padding foot inserts and I love them get lots of complements on them"
  },
  {
    "user": "Cassie",
    "rating": 4.0,
    "message": "Cute shoes for a decent price. Unfortunately, they came with a yellowish stain on the back of one of the shoes."
  },
  {
    "user": "Lisu",
    "rating": 5.0,
    "message": "Muy bueno como y perfecto me encantó 😍"
  },
  {
    "user": "Fayette Scott",
    "rating": 4.0,
    "message": "Online photo looks nicer but they are comfortable"
  },
  {
    "user": "Sylvia Rodriguez Delgado",
    "rating": 5.0,
    "message": "Bonito color y buena calidad"
  },
  {
    "user": "Codi Lyn Cole",
    "rating": 4.0,
    "message": "I wear a women's 11, these were 11's and too short in length so my toe was pressing too hard to the front. So disappointing,  bc there's no size up for that in this color! Color is beautiful and the comfort was great,  just too short. Labeled Euro size 40 when I received them. 😓"
  },
  {
    "user": "Ayanna Gibson",
    "rating": 4.0,
    "message": "I ordered these shoes for comfort to walk in an all day parade however the size 8 is too big, so I am returning them. I probably could’ve gotten a size 7. When I tried on the shoe it felt very comfortable so I would recommend just sizing down an entire size"
  },
  {
    "user": "Jasmine thornburg",
    "rating": 4.0,
    "message": "Comfortable and very slip resistant! I love these other than the fact that it doesn’t give me much support on my ankles. I have bad knees and it started pinching once I started wearing these. If you have the same problem as me I wouldn’t recommend these"
  },
  {
    "user": "Melissa Moon",
    "rating": 5.0,
    "message": "I ordered a 5 and they run just a bit small. Not so small that they are uncomfortable. After a few uses they stretched out enough not to hurt, but are still quite snug.  I would have liked a half size larger."
  },
  {
    "user": "Irvin",
    "rating": 5.0,
    "message": "Súper cómodos Tallas viene grande solo pide 1/2 número menos de lo habitual y listo"
  },
  {
    "user": "Charlie",
    "rating": 4.0,
    "message": "Nice knit sneaker but we're a little too large, could have gone down a half size."
  },
  {
    "user": "D. Morris",
    "rating": 4.0,
    "message": "The sneakers looked nice but I couldn't wear them"
  },
  {
    "user": "Kelli Mooney",
    "rating": 5.0,
    "message": "Great product very comfortable I work at TMobile so I am litterly on my feet all day long so comfortable shoes are a must and these are great! I have a hard time finding shoes that after a couple hours my feet don't start hurting . I wheat these for 9 hours a day and my feet are fine so I give them a 10"
  },
  {
    "user": "Vicjac",
    "rating": 4.0,
    "message": "I wear a brace because I have  drop foot, I also have to order up a size to accommodate my brace, these fit great. I usually wear skechers but decided to try these because the price was right and I'm glad I did!!"
  },
  {
    "user": "Diane",
    "rating": 4.0,
    "message": "I’m a 5 1/2 but the size 6 was too big and the five was a little snug. After wearing the size 5 for two days, they stretched enough and were comfortable. Very cute shoes. I bought the pink and lime green shoes because I liked that the bottom of the shoes are the same color as the top"
  },
  {
    "user": "tjhair",
    "rating": 5.0,
    "message": "Great color! Look expensive! Fit true to size."
  },
  {
    "user": "daphne",
    "rating": 5.0,
    "message": "Due to all those things I can't wear sneakers with much of an arch or that fit too tight in the toe box or that don't have much cushioning. I've tried dozens of sneakers from Oofos, OrthoFoot and Hooka to Sketchers, Brooks and Merrill. Nothing felt comfortable. UNTIL THESE!!! They fit the bill! They have great cushioning, just enough height in the heel. Plenty of room in the toe box and they provide a lot of stability for my poor tired ankles with the wide sole. I did replace the insole with my favorite insole from Dr. Sholl's for even more cushioning but its not necessary. These sneakers have quite a bit. Am I totally pain free? No. I never will be. But I can actually walk without limping now and for more than 10 minutes at a time. I normally take a 7.5 or 8. Went with the 8s. They run a little wide but nothing socks or pulling the laces tight can't fix. I highly recommend at least trying them!!"
  },
  {
    "user": "das",
    "rating": 4.0,
    "message": "Very comfortable!"
  },
  {
    "user": "C H.",
    "rating": 4.0,
    "message": "Fits fine"
  },
  {
    "user": "Cari",
    "rating": 5.0,
    "message": "I have really narrow feet and was having problems finding something I liked in local stores. I purchased this and one other from a different brand. The other pair had the bill sewn in and no reel heel so I had to tie it extreeeemly tight to make sure it stayed on. With this pair it had a separate piece for the bill and a heel which is a big plus for me ( low standards.) the shoes are nice and comfortable and if you have planar faciitis just take the sole out and put in ur schols or whatever. 8/10 Would probably buy again."
  },
  {
    "user": "ginnysue",
    "rating": 3.0,
    "message": "I order my usual 6.5 Regular....but this was wide.  Also this style makes my feet look large."
  },
  {
    "user": "donna nunamaker",
    "rating": 4.0,
    "message": "Shoe was too small"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Hermoso regalo me encanto 💖"
  },
  {
    "user": "Cynthia McClain",
    "rating": 5.0,
    "message": "The color wasn't what I expected. I was hoping it were  darker. Overall, I pleased  with the tennis shoe."
  },
  {
    "user": "Amanda Scheider",
    "rating": 5.0,
    "message": "I got these shoes for work because I was tired of slipping around all the time in my vans and these are perfect. They are so comfortable to wear and are exactly like the pictures and description. I wear them to work all the time now, and I highly recommend them if you work somewhere that requires nonslip shoes and being on your feet all day."
  },
  {
    "user": "Louise",
    "rating": 5.0,
    "message": "Bought for my granddaughter. She says they’re one of the most comfortable shoes she’s ever owned and she gets lots of compliments on then."
  },
  {
    "user": "Carmelita Calpito",
    "rating": 3.0,
    "message": "I like it my foot is not hurting"
  },
  {
    "user": "BgH",
    "rating": 5.0,
    "message": "I usually wear a wide shoe but these are super comfortable just in the medium width in my reg size. Love the color ( bright green) I only hope this mesh outside stands up to the weather we sometimes get caught in. Price is great!!!! Arrived early."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I like the shoes for their style and comfort.  I wore them during an event that entailed a lot of walking and dancing."
  },
  {
    "user": "Denise C.",
    "rating": 5.0,
    "message": "its very nice light weight , i order a 7 get 7.5 ..it is big... my only disappointment im all the way in Jamaica, cant make a return  so i guess i just have to wear it ....but it is a nice shoes overall."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I use these as more work shoes and so far they have held up nicely. I have even washed them a few times. I would recommend buying them and they come in such fun colors!"
  },
  {
    "user": "Evelyn Rodriguez",
    "rating": 5.0,
    "message": "Return because run small"
  },
  {
    "user": "Lynnette prescott",
    "rating": 5.0,
    "message": "I haven’t had the opportunity to wear them yet, however they are super cute."
  },
  {
    "user": "Lisa Ska",
    "rating": 5.0,
    "message": "They’re pretty cheap but considering she can’t destroy a name brand with in a month I’m really impressed with how well these have held up. And they don’t stain or get dirty. Not sure what kind of magic material it’s made of but yes I would definitely recommend. And I’m going to get a white pair for myself"
  },
  {
    "user": "Sandra J. Keeran",
    "rating": 3.0,
    "message": "Didn’t like the fit"
  },
  {
    "user": "Tee Jay",
    "rating": 5.0,
    "message": "This sneaker is super lightweight and comfortable."
  },
  {
    "user": "Deanie Brown",
    "rating": 5.0,
    "message": "I love these shoes"
  },
  {
    "user": "Donna",
    "rating": 5.0,
    "message": "Was able to take a long walk with no problem 😊"
  },
  {
    "user": "Angela Handleyn",
    "rating": 5.0,
    "message": "I bought these shoes for a costume. They are perfect and I will enjoy wearing them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love- love these shoes.  Color is true to photo & my feet are comfortable in them."
  },
  {
    "user": "Shari Gardner",
    "rating": 5.0,
    "message": "These shoes are very soft and comfortable."
  },
  {
    "user": "T. C",
    "rating": 5.0,
    "message": "Shoes are super cute, very comfortable and look good on my feet."
  },
  {
    "user": "lmb usa",
    "rating": 4.0,
    "message": "Nice shoes, smaller than expected. Ordered next size up. Tongue a little narrow. Fave color."
  },
  {
    "user": "Ana",
    "rating": 5.0,
    "message": "Very confortable love them"
  },
  {
    "user": "Ann g.",
    "rating": 4.0,
    "message": "fit & support"
  },
  {
    "user": "Roger Botts",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "sandra williams",
    "rating": 3.0,
    "message": "I dont mind the shoes but the tip of the toe is a bit smaller  so I have to wear them with out sox till I break them in"
  },
  {
    "user": "Mikala Garcia",
    "rating": 5.0,
    "message": "I frecking love it so much! I feel like walking on cloud!"
  },
  {
    "user": "Party Girl in Big D",
    "rating": 5.0,
    "message": "These are nice slip on sneakers."
  },
  {
    "user": "Paula carr",
    "rating": 5.0,
    "message": "Fits perfect"
  },
  {
    "user": "Divine Hilton",
    "rating": 5.0,
    "message": "Fit to size super comfy i work standing all day these are worth the buy ☺"
  },
  {
    "user": "Amber",
    "rating": 5.0,
    "message": "I bought the pink ones and they are adorable. Perfect for wide feet and fit amazing. Extra room in the toe box to boot. You will NOT be disappointed!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fit good, look good"
  },
  {
    "user": "Gabriela",
    "rating": 3.0,
    "message": "These shoes are cute and look good, size fits as expected.  However , they are not comfortable at all. I don’t have a problem with the non-slip"
  },
  {
    "user": "Carmen",
    "rating": 5.0,
    "message": "Me encanto xq tus dedos tiene espacio para movers,"
  },
  {
    "user": "Michelle Burke",
    "rating": 5.0,
    "message": "Very comfortable.  I hAve a wide foot and these were very very comfortable.  I wear between a size 7 1/2 and 8, but I bought the 8 just to be sure, and they fit perfectly!  No sore spots!"
  },
  {
    "user": "Emily Armstrong",
    "rating": 3.0,
    "message": "They get you by until you’re able to buy a better pair. They squeak when you walk which is super annoying: Insoles are super thin."
  },
  {
    "user": "Joanne D Reasor",
    "rating": 5.0,
    "message": "Love the comfort and support of the shoe when walking."
  },
  {
    "user": "JackandCyn1",
    "rating": 5.0,
    "message": "My 16 y/o got her 1sr job - and needed no-slip shoes.  She actually picked these out and likes them (so unusual for a teen 😂)"
  },
  {
    "user": "Amber",
    "rating": 5.0,
    "message": "Exactly what I expected. Very bright and noticeable."
  },
  {
    "user": "Megan",
    "rating": 5.0,
    "message": "I love the shoe"
  },
  {
    "user": "Rita Roy",
    "rating": 5.0,
    "message": "These shoes  are nice and light. I used them for walking."
  },
  {
    "user": "Annabelle",
    "rating": 2.0,
    "message": "Not well made. Looked cheap."
  },
  {
    "user": "Kat",
    "rating": 5.0,
    "message": "Comfortable quality shoe.  I love the color too!"
  },
  {
    "user": "Jacqueline Shepherd",
    "rating": 5.0,
    "message": "Work"
  },
  {
    "user": "Taxlady",
    "rating": 5.0,
    "message": "These fit great.  They are comfortable.  They have good soles. I have wide feet and they fit great.  They ate made well and are sturdy and durable."
  },
  {
    "user": "miriam hernandez",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Gail Stoudemire",
    "rating": 5.0,
    "message": "They are quite Comfortable and neat"
  },
  {
    "user": "Alicia Mattox",
    "rating": 5.0,
    "message": "I used it for school"
  },
  {
    "user": "Miguel Moreno",
    "rating": 5.0,
    "message": "Cómodos y muy ligeros para caminar"
  },
  {
    "user": "Jill",
    "rating": 2.0,
    "message": "I got them today. They are not blue and pink as advertised They are solid blue. I'm disappointed."
  },
  {
    "user": "Alison W.",
    "rating": 1.0,
    "message": "I did not like the material of the shoe I did not like the tongue of the shoe Definitely not for someone with a wide foot. It look like tongue is going to unravel. I didn't really like the Soul, but you would not feel every rock on the ground because it is a least thick. But you can feel the groves of the construction of the soul, you cannot go out without socks on with this gym shoe. It doesn't look bad on, but the quality is not good. Waste your money at Walmart at they will last longer than a week."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Unable to walk comfortably; tip of my toes rub the front; had to be adjusting my walk; at the end of the day, my toes were sore."
  },
  {
    "user": "Loney Patrick",
    "rating": 2.0,
    "message": "Very cheaply made. Would make a good cheap hiking shoe or shoes to buy that you are going to get dirty."
  },
  {
    "user": "Teresa Fox",
    "rating": 5.0,
    "message": "I love these no complaints at all"
  },
  {
    "user": "E.Lee",
    "rating": 2.0,
    "message": "I had to return this shoe for a size up because they don't have half sizes. I wear a 10 but now have to get an 11 because my toe is at the top of the shoe. Definitely not true to size. 😫"
  },
  {
    "user": "Jacque",
    "rating": 2.0,
    "message": "These non slip shoes are cheaply made and aren’t true to size.  There is little support."
  },
  {
    "user": "trenno tye",
    "rating": 5.0,
    "message": "A little  to big. Great color."
  },
  {
    "user": "Coleshubertversanne",
    "rating": 5.0,
    "message": "It's comfortable it nice feels a little too soft but that's ok 👍"
  },
  {
    "user": "Patricia Brueckner",
    "rating": 1.0,
    "message": "I have purchased MANY pairs of AKK Shoes (and similar brands)-that I absolutely love!-they have ALL arrived in perfect condition EXCEPT for this pair.  Each shoe has black sole marks on the side, as if someone stepped on the pair with dirty workboots on.  They're NOT wearable!!  Products should be condition-checked prior to shipping.  Waste of money!!"
  },
  {
    "user": "Brenda Simien",
    "rating": 5.0,
    "message": "Comfort"
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "They are comfy but looklikecdiscounttt CD store sneakers but you gettt CD what you pay for. They have a terrible tire factory smell"
  },
  {
    "user": "PjStone",
    "rating": 1.0,
    "message": "The fabric is scratchy inside and out. You cannot wear them without socks Very scratchy! This is a cheap shoe, no arch support. Very little support at all. The only thing I liked was the color."
  },
  {
    "user": "D.Roemhildt",
    "rating": 1.0,
    "message": "I bought these knowing they are not a premium brand shoe, but really they are NOT worth paying what I did for them, sorry !!!"
  },
  {
    "user": "Lucy martinez",
    "rating": 5.0,
    "message": "I  like the shoes"
  },
  {
    "user": "Babygirl",
    "rating": 1.0,
    "message": "The color was true but the product was very poorly made. Not just one shoe but both shoes had raw material hanging out. They should have NEVER Passed Inspection!!! There were places on the tongue of the shoe the sewing machine never touched. It was like they forgot to go back and close up the hole."
  },
  {
    "user": "Sally Potts",
    "rating": 1.0,
    "message": "The shoes fit well and were comfortable. They were sold as non slip. They are so slippery that I am wearing my old shoes again."
  },
  {
    "user": "Fernando Gonzalez",
    "rating": 2.0,
    "message": "I bought these work but after standing on them after a few shifts, they were killing my feet. I have a high arch so maybe that's why. Nice looking shoe tho."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Shoes arrived timely but were in a ziplock bag.  Look like they came out of a dollar store she bin and we’re way too small.  Return and refund was quick."
  },
  {
    "user": "Agnes C.",
    "rating": 2.0,
    "message": "Anuncio engañoso..no son deslizantes"
  },
  {
    "user": "Frankie",
    "rating": 1.0,
    "message": "I order size 7 shoes,the size is small than a size 7,the color orange way much bright than it is in the picture I saw"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "The tennis shoe was gold not yellow"
  },
  {
    "user": "Kindle Customer",
    "rating": 1.0,
    "message": "Everything"
  },
  {
    "user": "Betty Kim Foster",
    "rating": 2.0,
    "message": "These shoes are comfy but get dirty quick."
  }
]