[
  {
    "user": "Racquel Rutzler",
    "rating": 4.0,
    "message": "These shoes are comfortable and cute. I especially love the height they give me. I work in a medical office and constantly walking around and these are super comfortable. At first, they can feel snug on the foot, but they eventually formed to my foot and no longer caused me any discomfort. The only downside is the scuff marks. The office I work in has white floors and I noticed that I was leaving scuff marks behind. They easily are removed, but something to point out! Overall, I receive compliments all day long and love the way they look."
  },
  {
    "user": "juturna",
    "rating": 5.0,
    "message": "These run small as SM shoes do so order up half a size and you should be groovy! Also - I’ve never received so many compliments on a pair of sneakers 😍"
  },
  {
    "user": "LMC007",
    "rating": 5.0,
    "message": "I ordered my actual size the first time around and they were a bit snug, I returned them and got a half size up and they fit perfectly."
  },
  {
    "user": "Kalala Siaosi",
    "rating": 4.0,
    "message": "I bought this last minute cause it matches my airport outfit and it came out as expected!!! HIGHLY RECOMMENDED!!!!"
  },
  {
    "user": "Roxan",
    "rating": 5.0,
    "message": "I wear size 5 and wide. but I followed what reviews said. I size 1 up and it fits perfect got room for socks."
  },
  {
    "user": "baconlover1",
    "rating": 5.0,
    "message": "Very cute. But I’m a size 7-7 1/2 and I had to buy an 8 1/2 to fix comfortably."
  },
  {
    "user": "Sammy",
    "rating": 5.0,
    "message": "They give height, they are comfortable and received multiple compliments already."
  },
  {
    "user": "B",
    "rating": 5.0,
    "message": "Very cute, very comfy, true to size"
  },
  {
    "user": "JN Hups",
    "rating": 4.0,
    "message": "Such a cute shoe. I read the reviews about it running small but only went up half a size. Size up a whole size!"
  },
  {
    "user": "Veronica",
    "rating": 5.0,
    "message": "Absolutely love these shoes. So comfortable"
  },
  {
    "user": "Phi phi",
    "rating": 5.0,
    "message": "They were cute but not for me"
  },
  {
    "user": "Schneider njifunuh",
    "rating": 5.0,
    "message": "Very comfy and it increases your height by a couple of inches"
  },
  {
    "user": "Lylianna D.",
    "rating": 5.0,
    "message": "Really comfortable and work well with my array of scrubs. I bought another pair in all black as well."
  },
  {
    "user": "Rikki Shay",
    "rating": 5.0,
    "message": "Love love!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love the styling of these shoes with the color accents, although they are slightly bulkier than I realized.  They run a bit small or short in the toe box.  You may need to order 1/2 size larger than your usual size for that reason.  They also do not have the air cushioned insole that another popular brand always uses.  Overall, I think they seem to be a well designed and manufactured shoe.  They should stand out when I wear them."
  },
  {
    "user": "Rachel L.",
    "rating": 5.0,
    "message": "Exactly as expected. Very cute! The toes are a little tight for my wide feet, but the slight discomfort is worth it. I get compliments every time I go out with them."
  },
  {
    "user": "Jose",
    "rating": 5.0,
    "message": "I love the quality of the sneakers. The hold on the bottom of the shoes were definitely what I was looking for."
  },
  {
    "user": "Tafaria",
    "rating": 4.0,
    "message": "It’s a bit bigger than expected. Ordered size 7.5 in which I normally wear but shoes looks and feel really good."
  },
  {
    "user": "weezy",
    "rating": 5.0,
    "message": "Love these shoes!! I’m n love with Steve Madden"
  },
  {
    "user": "Toun Smith",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Reina",
    "rating": 4.0,
    "message": "I really liked the shoe it fitted very nicely. The shoe was just too high it looks very big but it is nice looking and makes you a inch or two taller"
  },
  {
    "user": "Shardae",
    "rating": 5.0,
    "message": "Love it fits perfectly"
  },
  {
    "user": "Ducky",
    "rating": 4.0,
    "message": "The shoes themselves are great however they are small so u should definitely size up for a better fit."
  },
  {
    "user": "Anicha galarza",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "J’Nel",
    "rating": 5.0,
    "message": "So cute in person. Great for the fall season."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I loved these shoes! I’m a size 7 and they fit perfect! Super comfy. I’m not used to the chunky big shoe but these I absolutely fell in love with as soon as I saw them. They’re a must buy!"
  },
  {
    "user": "Melissa",
    "rating": 5.0,
    "message": "Comfortable and looks so cute with sweatpants."
  },
  {
    "user": "Valentina",
    "rating": 5.0,
    "message": "Me encantaron. Los había visto hace tiempo, pero a Chile llegaron pocos colores, y los negros-bronceados definitivamente no aparecieron por acá, así que finalmente me decidí por pedirlos directamente en la tienda de Amazon (sale más caro obviamente, pero es algo que se asume al comprar fuera), y los ame. Son muy cómodos, y la calidad es súper buena, y preciosos, el color es exactamente igual a la imagen. Y basándome en lo que sale en la misma página de Steve Madden, pedí medio numero mas grande de lo habitual; normalmente soy 37 chile (7 US) y los 7.5 US me quedaron perfectos. Valen totalmente la pena!"
  },
  {
    "user": "Rachel Starr⭐️",
    "rating": 5.0,
    "message": "Feels like you’re walking on clouds. All they had left was white in my size! 11W but definitely getting the pink and teal when they restock😘"
  },
  {
    "user": "A.M.J.",
    "rating": 3.0,
    "message": "So super cute shoe but very uncomfortable. They fit good maybe would have got a half size bigger because the side of my foot scraped the shoe and could not walk after 5 mins in them."
  },
  {
    "user": "Dawn Berry",
    "rating": 5.0,
    "message": "Fits a bit smaller than expected so had to go a half size up, but otherwise great buy."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Got my usual sneaker size and fits perfect. Very sturdy and comfortable shoe!"
  },
  {
    "user": "Mery",
    "rating": 4.0,
    "message": "Esto es un regalo."
  },
  {
    "user": "olga abramovsky",
    "rating": 3.0,
    "message": "Got it for my daughter. She wanted it. But i would never buy it for myself. Sooooo heavy."
  },
  {
    "user": "Gracie Richie",
    "rating": 5.0,
    "message": "My granddaughter loves them"
  },
  {
    "user": "8701",
    "rating": 3.0,
    "message": "Runs a bit small."
  },
  {
    "user": "Joanne",
    "rating": 5.0,
    "message": "The media could not be loaded. Sharp and playful at the same time, subdued yet bold. My kinda shoe. Comfy and stylish paired with Hanes ankle socks."
  },
  {
    "user": "Terri Kramp",
    "rating": 5.0,
    "message": "Perfect fit and comfortable"
  },
  {
    "user": "YOCASTA ALMEIDA",
    "rating": 5.0,
    "message": "Cómodos y bellos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They definitely run a lil small If you have wide feet order a whole size up, if you have more narrow feet order half a size up. They look and feel amazing"
  },
  {
    "user": "Cynt86",
    "rating": 3.0,
    "message": "Pros: 1. The shoes are super comfy 2. Very cute 3. The best dupes for Balenciagas Cons: The grommets are not on the laces as pictured, nor on the back tab of the shoes"
  },
  {
    "user": "Zachary Whitt",
    "rating": 3.0,
    "message": "I bought these because I wanted a pair of all tan walking shoes. The color and look of these is great. However, I find them too hot and the sole too stiff. I thought they would be cooler since they were a fabric/net shoe, but they are not. Also, they are not very flexible - the sole does not flex at all. Will probably put them away until Fall when the weather is cooler.  A good looking shoe, but not the most comfortable."
  },
  {
    "user": "Bridget McCord",
    "rating": 4.0,
    "message": "I absolutely love ❤️  these shoes they remind me of barbie doll shoes especially in this color pink super cute for going out or just casual wear"
  },
  {
    "user": "kiyanna",
    "rating": 5.0,
    "message": "I am completely in love with these shoes! They were a little snug at first, but I do not see half sizes being offered. I maybe could wear a 10.5, but I don’t think there’s anyway I could wear an 11. I was told that you just have to break them in, but they don’t hurt. At most they’re uncomfortable. I love them and they’re super cute!"
  },
  {
    "user": "Azalia Munoz",
    "rating": 5.0,
    "message": "The media could not be loaded. Súper bonitos talla 8 y me quedaron perfectos, excelente calidad los amo 🥰🥰"
  },
  {
    "user": "kkrayzien8tive",
    "rating": 3.0,
    "message": "Got this for my daughter who I know wears an 8.5, when she got them, they were very snug with thin socks. Returning them to get a refund."
  },
  {
    "user": "Jsb",
    "rating": 5.0,
    "message": "I wanted some chunky shoes so bad and my husband bought me these! Sooooo happy! They're so comfortable and trendy!! I wear them with jeans shorts, leggings, pants, just about everything. They're perfect. One of my favorite pairs of sneakers now!"
  },
  {
    "user": "Aracely",
    "rating": 5.0,
    "message": "Muy buen producto tal como lo esperaba"
  },
  {
    "user": "Alex Warren",
    "rating": 5.0,
    "message": "Love these! So stylish, my go to shoe with shorts. They’re a little heavy but I still love them."
  },
  {
    "user": "K. B.",
    "rating": 5.0,
    "message": "Steve Madden site has a shipping delay till Aug!! Got them here within the week, Same Price! Another Amazon WIN!!"
  },
  {
    "user": "Vimarys Leon",
    "rating": 5.0,
    "message": "Buena calidad"
  },
  {
    "user": "Jordan Carara",
    "rating": 5.0,
    "message": "Very stylish. Always get so many compliments when I wear these!!"
  },
  {
    "user": "ezekiel baker",
    "rating": 5.0,
    "message": "My daughter loves them"
  },
  {
    "user": "PAOLA",
    "rating": 5.0,
    "message": "In love. I want them in every color!"
  },
  {
    "user": "Caitlyn breslin",
    "rating": 5.0,
    "message": "Size fit perfectly. I wear a 7.5 usually and ordered that size, if I went up it would be too large they have enough room to be comfortable and not too suffocating."
  },
  {
    "user": "Rachel G",
    "rating": 2.0,
    "message": "Bought these shoes with the reviews in mind. I like the look of them, but they are extremely uncomfortable. Will have to buy an insole to be able to wear them for a long period of time. Tongue moves around, does not stay in place, and I’m not sure why. Overall they are okay."
  },
  {
    "user": "Jasmine Harper",
    "rating": 5.0,
    "message": "So cute I get lots of compliments! They are priced same as if you purchased at Steve Madden, comfy too! Love love love"
  },
  {
    "user": "Gabriela Hernández",
    "rating": 5.0,
    "message": "Fabuloso lo ame"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Omg i would love to have every color of these shoes very comfortable and the colors are just as in the picture"
  },
  {
    "user": "Antoinette Morris",
    "rating": 5.0,
    "message": "Highyly recommend Love the color Doesn't look cheap like other Amazon products As shown in photos I am normally at 9 or 9.5 I purchased a 9.5W a little snug on one foot. We all have a foot that's bigger than the other."
  },
  {
    "user": "Julia",
    "rating": 3.0,
    "message": "Was exited for these shoes but when I got them they were ripped and had a stain i was so sad Cute shoes overall"
  },
  {
    "user": "Carlos",
    "rating": 5.0,
    "message": "Exactly what I was expecting, and surprisingly comfy! I love the high end style, if you like this trend, you’ll love these sneakers!"
  },
  {
    "user": "Erica",
    "rating": 2.0,
    "message": "love the shoe style. unfortunately, quality is subpar. The tab on the tongue of the sneaker ripped within 3 wears. photo attached"
  },
  {
    "user": "Erika",
    "rating": 2.0,
    "message": "Me gusta el comor y la plataforma que tienen, pero estan muy duros, me duelen los pies al usarlos mucho tiempo  , si fuesen mas flexibles estarian perfectos. Pero desgraciadamente no es asi... creo que no vale la pena  gastarmas de 100 por ellos!"
  },
  {
    "user": "jose rojas",
    "rating": 5.0,
    "message": "Super cute, love the color, perfect fit!"
  },
  {
    "user": "Nathan Sahme",
    "rating": 5.0,
    "message": "Size up"
  },
  {
    "user": "DARIUS NETTLES",
    "rating": 5.0,
    "message": "It came perfectly just order a size up for safety"
  },
  {
    "user": "Wendy V.",
    "rating": 5.0,
    "message": "Super cute"
  },
  {
    "user": "Meya R.",
    "rating": 5.0,
    "message": "Soooo many compliments!! Everyone thought they were $1000 Balenciga Triple S shoes but these Steve Madden are way cuter for $100! 💕"
  },
  {
    "user": "Sharonda",
    "rating": 5.0,
    "message": "They are comfortable & look just like the advertisement picture highly recommended."
  },
  {
    "user": "Pedro Tejada",
    "rating": 2.0,
    "message": "This sneaker aren’t confortable at all. Very chunky and stylish!"
  },
  {
    "user": "stepan",
    "rating": 5.0,
    "message": "👍"
  },
  {
    "user": "Danna",
    "rating": 2.0,
    "message": "I bought these shoes for vacation and they ripped after approximately 10 days of use. I didn't expect them to ripped inside this way. Very unhappy considering the brand/cost."
  },
  {
    "user": "William isaacks",
    "rating": 1.0,
    "message": "I would have got a bigger size if i seen someone say they ran small"
  },
  {
    "user": "Samantha Rae",
    "rating": 1.0,
    "message": "Not good for wide feet and runs small"
  },
  {
    "user": "Kendra",
    "rating": 1.0,
    "message": "I love the shoes but it was too tight"
  },
  {
    "user": "Alison Amaya",
    "rating": 2.0,
    "message": "Runs small"
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Too small"
  },
  {
    "user": "shaina",
    "rating": 1.0,
    "message": "Meh… it’s the aesthetic of the shoe. As far as comfort no. Need half sizes"
  },
  {
    "user": "K. benford",
    "rating": 4.0,
    "message": "They do run short, size up.  Love the teal color.  They are lightweight and the extra height is great for me.  You want shoes to fit?  1st - Measure your foot, place paper on floor, place foot on paper and drawl line across at heel and at across your longest toe.  Measure.  Now, go to chart website for that brand of shoe.  It will list in inches and cm’s.  Remember sandals, closed toed shoes and boots will all be different."
  },
  {
    "user": "Tarah",
    "rating": 5.0,
    "message": "I ordered the Dark Mauve color size 8 & i loooove it! I always get discouraged when buying shoes online, but I was very surprised with good the quality of the shoe was and how comfortable and supportive they actually are. I just had ankle surgery 3 months ago so I was hoping that these sneakers feel okay on my feet. AND bayy-beee lemme tell ya'll something, these are more comfortable then my nikes and other sneakers I wear. I definitely will be getting another pair in a different color. They look great with skinny jeans, wide or straight leg jeans and definitely cute with sweat suits! So happy with my purchase! Must have in sneakers collection!"
  },
  {
    "user": "SANDRA",
    "rating": 3.0,
    "message": "No toe room at all!!! And OVERPRICED FOR THE QUALITY!!!"
  },
  {
    "user": "Thistle",
    "rating": 5.0,
    "message": "I have like, 3 pairs of these sneakers. They're so cute and comfy! I bought 2 in person, so I was able to try them on before ordering online. I currently have the white, pink, and tan/black pairs and they look exactly as depicted online. I would recommend sizing up a half-size, just to give your toes some room. I tend to wear between a 9-9.5 and I bought a 9.5. That being said, the shoes are still snug enough that thicker socks can make them feel tight."
  },
  {
    "user": "Melodie Ellison",
    "rating": 3.0,
    "message": "I wanted to like these SOOOOOO bad, since I know this sort of sneaker is the trendy thing right now. But these run super small (or I should say--super short). I'm pretty solidly an 8.5 in tennis shoes. Sometimes an 8. I would need at least a 9 in these. Maybe a 9.5."
  },
  {
    "user": "Pamela Denise",
    "rating": 5.0,
    "message": "at first i thought i wasn’t going to like them because i’m not a big tennis shoes person but i love them so much so cute pair with anything HIGHLY RECOMMEND getting you a pair ❤️"
  },
  {
    "user": "Cleo caffee",
    "rating": 2.0,
    "message": "Shoes run so small and if I get a 9 it’s too big  I wear a size 8  I got an 8.5"
  },
  {
    "user": "Jaz’Maine dunn",
    "rating": 5.0,
    "message": "Cute"
  },
  {
    "user": "Taylor",
    "rating": 5.0,
    "message": "I love these sneakers. They are very stylish and fit well!"
  },
  {
    "user": "Darious Burt",
    "rating": 5.0,
    "message": "Love everything"
  },
  {
    "user": "SPARKLE CI",
    "rating": 5.0,
    "message": "EVERYTHING was as expected, I would recommend it to anyone, fits perfectly also"
  },
  {
    "user": "Lolli",
    "rating": 5.0,
    "message": "I got these for work and I am limited on colors I can wear. I was gonna go with safe black but I really wanted something fun and loud. I think this is pushing it a little but I know they will let it slide because they all love seeing my fun outfits. They fit just right. It felt a bit tight on the instep of my larger foot at first. Which is almost always a problem for me but after wearing it out for a day they are pretty comfortable. They are light weight but they are not like walking on the moon. The material is fairly stiff. I like them I could see myself getting them in black in the future."
  },
  {
    "user": "TONJOLA/JAMES",
    "rating": 5.0,
    "message": "Good deal"
  },
  {
    "user": "Jay",
    "rating": 5.0,
    "message": "The shoes are cute, I’d recommend you size Up by at least a 1/2 size"
  },
  {
    "user": "Ericka m.",
    "rating": 5.0,
    "message": "The media could not be loaded. I WANT MORE I love these sneaks they go with all my outfits!!!! 💜💜💜💜"
  },
  {
    "user": "Breana Wilbon",
    "rating": 5.0,
    "message": "The media could not be loaded. Super cute. I love the platform to give me a little height lol"
  },
  {
    "user": "Taijoura",
    "rating": 5.0,
    "message": "The media could not be loaded. Don’t even second guess, if you saw them and liked them, go ahead and cop you a pair sis. A staple in my show collection for sure"
  },
  {
    "user": "Trailasia smith",
    "rating": 5.0,
    "message": "These shoes run small so definitely size up. Normally I wear a 9 and in these I needed a 10. They’re a bit bulky in person but that’s as expected but either that they’re super cute and can’t wait to wear them."
  },
  {
    "user": "ana",
    "rating": 5.0,
    "message": "Beautiful pink ! Comfortable wear, get so many compliments , stunning shoes !"
  },
  {
    "user": null,
    "rating": null,
    "message": "Son muy ligeros , están cómodos y el Color es un blanco luz."
  },
  {
    "user": null,
    "rating": null,
    "message": "Son bonitos Pero vienen un poco altos cómo 3 cm más o menos, no vi en la descripción ese detalle,"
  }
]