[
  {
    "user": "Sharon",
    "rating": 4.0,
    "message": "I dont know if I wrote a review yet, but this is my second time owning these shoes because I think they are so cute with the pop of cheetah print, I wore them until I needed new ones. The first time I bought from DSW and I believe they were my true size (7.5). After reading the comments on Amazon I bought a half size up (8) and im very thankful I did because they fit perfectly. These are great to wear for errands and walking. If you are looking to run in these or lift weights I do not suggest buying these and looking from running/training shoes instead. My takeaways are 1. Order a half size up from your true size 2. These shoes are not meant to handle heavy cardio/weight oriented work outs 3. I am in love with the way they look"
  },
  {
    "user": "LaurnieT",
    "rating": 4.0,
    "message": "3.5 stars. They still fit-ish. I am usually a 10 1/2 and most shoes. I have had new balances (cross trainer type) before and they were my normal size. These are a women’s 11 and my toes stop just a centimeter before they’d be jammed up to the tip. Being that they are stretchy fabric these still work and I wear them often. They will wear out fast bc the memory foam insole doesn’t seem to be a high enough density to support all day wear multiple times a week. But I like the look and they are great for working at an elementary school where I can’t wear “sneaker sneakers” due to dress code. If the outside holds up I may put in an insert when the insole is done."
  },
  {
    "user": "Mz Spoon",
    "rating": 5.0,
    "message": "I love, love, love these shoes! I have two pairs and waiting for the white ones to be back in stock in my size (hint, hint)! I have a set for the gym and a set for everyday. As a matter of fact, I just wore them ALL DAY at Disneyland without any problems. Lightweight, comfortable, decent arch support and dry quickly when getting soaked on “Splash Mountain”! Fit is true to size."
  },
  {
    "user": "Janine R",
    "rating": 4.0,
    "message": "I buy these because they’re comfortable and I don’t have to guess how they’ll feel. Meanwhile- I know I am going to have to Replace them within a few months bc the soles break down quickly. It’s not just when I’m running a lot, it’s also when I’m just walking the dog a few days a week. comfortable but cheap quality. Eventually I’ll get real running shoes."
  },
  {
    "user": "Janice",
    "rating": 5.0,
    "message": "The lightest shoe ever! They are awesome, when I put on the left shoe it was like putting on slippers. Soft, cushioned, supportive slippers but slipper like nonetheless. The right shoe was too short. I’m looking in a store so I can try them both one before I buy them. But have no doubt I’ll be buying several pairs in different colors!"
  },
  {
    "user": "Dawn Philhart",
    "rating": 5.0,
    "message": "These have a nice cushion inside for comfort. The style is even more gorgeous in person (ordered leopard). The size is very true to size. I range from an 8 to 8.5 and the 8 in these fit with no room left. They are extremely light weight and I can wear them all day. I ordered for my walking/jogging shoes but have ended up wearing them for everything!!! They are adorable with leggings."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are wonderfully light and are excellent for the treadmill or walking indoors. The rubber tread on the bottom is very thin, which allows the shoe to be light but I wouldn’t use it harshly outdoors as I’m afraid it’s gonna tear that bottom down quickly. Much thinner than my Nike running shoes. They breathe nicely and are true to size, toe box a little tighter than I’m used to but not uncomfortable. Overall a nice light workout shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "This pair of shoes is super comfortable and provides great support for those of us with arches. It fits a little snug in the toe box but I am hoping that it loosens up a little after use but it feels like walking on air."
  },
  {
    "user": "Lawndale",
    "rating": 4.0,
    "message": "I wish I had ordered a half size bigger.  My big toes are almost touching the top.  It was still comfortable but at the end of 4 hours use at home, my feet were very happy to be “free.” I am wary about walking long distance in them."
  },
  {
    "user": "BAM",
    "rating": 4.0,
    "message": "These shoes are so cute but I kept inspecting the logo as they are far from any New Balance quality I am used to. This is a wear as a comfort shoe with a jeans or shirt outfit type of shoe. It is not meant for any type of exercise because there isn’t a lot of support. The shoes feel thin like my canvas fashion sneakers. Still not convinced they aren’t a knock offs using New Balance logo. Still love them but the use is comfort fashion only."
  },
  {
    "user": "Katie Riedmaier",
    "rating": 4.0,
    "message": "I love the look of these. Very sleek looking with the all black. They do fit a bit snug. I own several pairs of New Balance shoes, all size 11. These ones, in a size 11 are a bit tight. I may keep them though because of the hope that they may stretch."
  },
  {
    "user": "L. T.",
    "rating": 4.0,
    "message": "Love the look and feel of these shoes! Perfect for walking, workouts, and outings where you’re on your feet all day. They definitely run a half size small, so order a half size up and you’re good to go."
  },
  {
    "user": "Angela Smith",
    "rating": 4.0,
    "message": "I can generally wear an 8 in most brands.  These seem to run shorter than others. The width is okay but not as wide as some. They are comfortable just a little tight as far as length in the toe area."
  },
  {
    "user": "Cara Kuplesky",
    "rating": 4.0,
    "message": "Size up at least a half size. And they’re pretty narrow and I have a narrow foot. I usually wear a 7-7.5 and got an 8. They fit perfect with maybe 1cm of room at the toe. They’re super cute and nice to wear for everyday stuff, not working out!"
  },
  {
    "user": "E. C.",
    "rating": 4.0,
    "message": "I cannot speak of longevity yet but I could almost live in these shoes. I've worn 3x in a row and I don't do that often. I normally wear 9.5W and I feel these might fit a bit more generously than most of other 9.5W shoes or booties I have bought and I wear slightly thick socks with sneakers (yes, even in summer). I think you could size down about 1/2 size actually. Depending on longevity (i'll try to re-review these in 3-6 months) I will repurchase in a 9W. Could use a little more arch support but these are the most comfy sneakers i've bought in the better part of 18 months (in store or online)."
  },
  {
    "user": "B. Reed",
    "rating": 4.0,
    "message": "I wear a 10 1/2 and ordered an 11M. They run a little small in length.  My toes are at the end but the fabric stretches and provides a little more toe room."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love this shoe! I wear them when doing weight training and cardio. Important thing I will note is that I have not worn them outside to walk around in. I primarily use them in my house or at the gym on a mat. But the support is really good. And I love the design."
  },
  {
    "user": "Kate",
    "rating": 5.0,
    "message": "I use these as my gym shies and they are perfect for all my various workouts and cardio exercises. 10/10 I love that they are flat but have the perfect amount of cushion. Doesn't hurt my feet when I run or lift weights and east for me to maintain my balance."
  },
  {
    "user": "Hemps",
    "rating": 4.0,
    "message": "I bought these for an international trip where I knew we would be walking a lot. I was hesitant to purchase after reading other reviews but decided to purchase. They don’t have a ton of support but they did the job for 10 days. I think they will be better for running errands and trips to kids sporting events."
  },
  {
    "user": "Jennifer Bodary",
    "rating": 4.0,
    "message": "I liked these shoes, but as soon as I put them on and tied them up I could feel that the arch area of the right shoe wasn't wide enough, it was made too short. So, I'm returning"
  },
  {
    "user": "David",
    "rating": 5.0,
    "message": "I love NB sneakers and these did not disappoint.  They run true to size and are super comfortable. Gave plenty of support and room for my toes. I bought them as a lightening deal and saved 15%. Mine are black with white bottoms. My next pair will be black on black!"
  },
  {
    "user": "Hazel",
    "rating": 4.0,
    "message": "Extremely cute. Can’t speak if it will last or not but you’ll definitely need to size up half a size because they seem to run a bit small.  I returned and got a bigger size."
  },
  {
    "user": "crybabyjj",
    "rating": 4.0,
    "message": "I bought this from Amazon after buying the exact pair 6 months before. I waited to wear them so I would wear the old pair out more. I can’t wear these without my toes hurting! I figured they would for like the others."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Great shoe for the price I paid and comfortable but does not have any traction like my sneakers.  I slipped on my tile flooring where as my sneakers would have happened.  Over all it is a nice shoe for show"
  },
  {
    "user": "Elizabeth Stapp",
    "rating": 4.0,
    "message": "These are cute no support but the bottom of sole is microfiber thin but cute with outfits and walking"
  },
  {
    "user": "Cheryl Kennedy",
    "rating": 5.0,
    "message": "I previously purchased a pair of these NB sneakers two years ago, and I love them. They are super light and very comfortable with foam insoles. I had to get another pair, and these don't disappoint...love them!!"
  },
  {
    "user": "demasha Aldridge",
    "rating": 4.0,
    "message": "I’m a 6.5 and these fit so tight I probably could have went with a 7. If you have wide feet, these are not for you. Has made my ingrown big toe very angry. There’s no room to wiggle my toes."
  },
  {
    "user": "Brian",
    "rating": 5.0,
    "message": "I love these shoes they are comfortable from day one. They are light and comfy so it doesn't even feel like I am wearing shoes. New shoes usually are to narrow for my pinky toe but these are a perfect fit."
  },
  {
    "user": "Benjamin Bucio",
    "rating": 4.0,
    "message": "I’m a size 6 but these run a bit small so I should have ordered a 6.5. They are ok over all though."
  },
  {
    "user": "Shaneque",
    "rating": 4.0,
    "message": "I bought the black on black for work. They are extremely comfortable shoes but are cut way too small. I usually wear a 6.5 with no problem but these have my toes screaming at the end of the day, I can’t even drive home in them. So I’m ordering a size up and returning the current ones."
  },
  {
    "user": "Shopper",
    "rating": 5.0,
    "message": "Ordered these for my daughter during Amazon Days.  They fit her perfectly which is not always the case with so many sneakers.  It was such a great buy and fit......I ordered a second pair!"
  },
  {
    "user": "Mary Margaret Unger",
    "rating": 5.0,
    "message": "I ordered the shoe in black magnet.  It fits great & looks great.  BUT the shoe appears to be blue?  Is that the way black magnet looks or did I receive a blue pair.  There is no color listed on the box they came in."
  },
  {
    "user": "S. Whitwam",
    "rating": 5.0,
    "message": "I've been wearing these shoes for work and I gotta say, they're the most comfortable close-toed shoes I've had in my life. They required ZERO break-in and have been comfortable from the start! They're cushioned just enough and I can slide them on and off without using my hands by holding the heel down with my toes. No tie or untie required if you have a good knot for the laces. I'm going to buy a second pair to replace the first ones if they become worn out."
  },
  {
    "user": "Lillian Rakovic",
    "rating": 4.0,
    "message": "Liked the comfort and the look  very nice shoes,  but run small in toe box, the width was fine and arch support..  Order at least a half size up."
  },
  {
    "user": "Meghan",
    "rating": 5.0,
    "message": "Great shoes but did need about a half size bigger. Other than that very durable and light weight shoes. Really hold their own for as active as I am on the daily."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love the looks but definitely runs small.  I wish I would’ve got a bigger size."
  },
  {
    "user": "Mary Jane Berman",
    "rating": 4.0,
    "message": "Like the look. Just remember to order a half size bigger."
  },
  {
    "user": "kbsurvive",
    "rating": 5.0,
    "message": "These were as advertised.  Support, fit perfectly yet feel like you have nothing on they are so light. Slip right on.  Love them"
  },
  {
    "user": "Rena McGee",
    "rating": 4.0,
    "message": "These shoes turned out to be extremely comfortable to wear. The shoe laces however, keep coming untied. (But given the design of the shoe, which doesn't have a tongue, the shoe laces don't have much to do with anything except maybe decoration.)"
  },
  {
    "user": "Mrs. K",
    "rating": 4.0,
    "message": "These are not going to get you through training for a marathon, but they work fine for running errands, shoes to run out and meet the deliveryman, etc.  The insoles started popping up after I wore them a few times, but they go back into place easily."
  },
  {
    "user": "Mars",
    "rating": 4.0,
    "message": "These shoes are very comfortable and will do the trick! They are true to size but if you like a little extra room, I would recommend going half a size up. I ordered the wide version as I have flat feet so these are extremely comfy!"
  },
  {
    "user": "JLS",
    "rating": 5.0,
    "message": "I struggle to find shoes that work well with my past surgeries, but these worked great and I wasn't exhausted at the end of my day. Well definitely buy again!"
  },
  {
    "user": "Empress J.",
    "rating": 4.0,
    "message": "The shoes needs at least 2-3 inches to make it work for me as my feet are flat and needs elevation"
  },
  {
    "user": "Linza Hayden",
    "rating": 5.0,
    "message": "Perfect width for my nerve damaged toes. So comfortable....I've been looking for shoes like these for two years since I got neuropathy and these shoes are game changers! Perfect"
  },
  {
    "user": "Xóchitl castanon",
    "rating": 5.0,
    "message": "Excelente compra ya que new balances son los zapatos favoritos para comprar ya que son super cómodos y puedo andar con ellos todo el Dia y no me canso."
  },
  {
    "user": "Rosemary Arocha",
    "rating": 5.0,
    "message": "I love love these shoes they don’t hurt your feet and I work 8-10 hour days and at the end of the day my feet don’t ache at all.."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I LOVE these sneakers so much that I bought 3 in different colors all in the same 8.5 size.  The gray fits perfect, but  the black with white was smaller than my gray one on the same size. I also bought the black on black which was even Smaller than both of them! I measure and it was over 1/2 inch smaller.  I still love these so much I returned and will rebuy a size up! I also still 100% recommend since they are so lightweight and comfortable, but be mindful of the black on black and black with white bottom May run smaller and you may need to size up!"
  },
  {
    "user": "Kathie",
    "rating": 4.0,
    "message": "Did not fit"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love these shoes, I ordered them for my 79 yo grandma. They are adorable and very sleek. We ordered wides and they fit a bit tight for wides. My grandma loves them and looks good in them. I love seeing her wear them they look great."
  },
  {
    "user": "bheidenreich",
    "rating": 4.0,
    "message": "I have narrow feet and this was too loose on my heels. loved these though and looked nice"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoe is comfortable and lightweight.  Not a whole lot of support but my feet don't hurt at the end of the day. Due to the slip on type, I had to size up from my regular New Balance shoe size."
  },
  {
    "user": "Jeanette",
    "rating": 5.0,
    "message": "I Love love these shoes. I have absolutely no complaints about the shoes they look good they are comfortable and they fit well."
  },
  {
    "user": "Elly Levine",
    "rating": 4.0,
    "message": "I don't like that thw shoelaces untie all the time. The pices is a little high for what type of sneaker ot is"
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "I was told to order a 1/2 size bigger and I'm glad I did.  They give great support without giving up comfort."
  },
  {
    "user": "Mysti777",
    "rating": 4.0,
    "message": "Like the shoes but tried to cancel order and Amazon said they were on their way. I think I wanted the v3!?"
  },
  {
    "user": "Irene S. Bucior",
    "rating": 5.0,
    "message": "I walk about 1.5-2.0 miles on my walk every day. These shoes are light, comfortable, and they look great. I’d been looking for a good walking shoe for some time, and I always loved New Balance sneakers, so I thought I’d give these a try. I LOVE them. I have flat, wide feet, ordered a 7.5 wide, and they are perfect."
  },
  {
    "user": "Lucas Hastings",
    "rating": 5.0,
    "message": "I had these in my Amazon cart for months waiting for them to go and sale and honestly wish I would have bought them sooner! Super comfortable, incredibly lightweight and very cute. I’ll be getting another pair in a darker color."
  },
  {
    "user": "Michelle Brelsford",
    "rating": 5.0,
    "message": "I bought them for work and they are so very comfortable. I will be ordering more."
  },
  {
    "user": "Memaw",
    "rating": 5.0,
    "message": "I absolutely love this training shoe! It’s a perfect fit and very attractive. Clunky shoes make a workout more difficult, but this shoe is lightweight with enough support to make it highly useful in every day. The price was right, so I thought I’d try it. I’m so glad I did!"
  },
  {
    "user": "Kim Stone",
    "rating": 5.0,
    "message": "They were not as good as expected for working all day on your feet. I returned them. I need a better supportive shoe"
  },
  {
    "user": "jacksonian",
    "rating": 4.0,
    "message": "Nice looking but the size is way off.  I ordered a 8 1/2 but nooo way.  7 1/2 if you’re lucky..such a shame really nice looking. Returned them."
  },
  {
    "user": "Adrienne M. Lee",
    "rating": 5.0,
    "message": "I have a hard time finding shoes to fit me in my size because I have a small wide foot. These fit perfect, conforms comfortably, like wearing nothing but a cloud. Love them."
  },
  {
    "user": "Tanja84",
    "rating": 5.0,
    "message": "These were definitely a good buy when I saw they were on sale. So light and airy to wear. They also are slide ons technically even though they have laces that you can \"lace up\". Super comfy. Great shoe for walking/running around in."
  },
  {
    "user": "5125296338",
    "rating": 5.0,
    "message": "This is a very comfortable shoe, I wish I bought a white one too"
  },
  {
    "user": "Michelle M Robinson",
    "rating": 5.0,
    "message": "I wish all shoes were like these! New Balance have always been a perfect shoe for my very wide feet."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great walking shoe. No breaking in needed. The all black design looks sleek. My friend liked them so much she bought a pair as well."
  },
  {
    "user": "Kim R",
    "rating": 5.0,
    "message": "They are very comfortable and make my feet look smaller than most sneakers."
  },
  {
    "user": "Leonore Fleming",
    "rating": 4.0,
    "message": "The toe box is a little tight, but I probably could have gone a half size larger.  They fit good otherwise"
  },
  {
    "user": "Giavanna Miller",
    "rating": 5.0,
    "message": "I have bought 2 pairs of shoes, once in 2020 and again in August 2022. My first pair is still fine, I just wanted another color! They are perfect for a walk or just casual activity but I wouldn't recommend to go running in them, or intense gym sessions. Light gym sessions are fine, but running I go with my brooks. But for most the time wear, these fit the bill just fine. For reference, I am a size 11W, I tried the 11 but they were too narrow for my orthotics (inserts), so I went with wide and that did the trick. They also make your foot look small, if that matters to my larger feet ladies."
  },
  {
    "user": "Sara Houston",
    "rating": 4.0,
    "message": "Product as described, shoes are lightweight and comfortable . I ordered my regular size,however I will recommend ordering a half size bigger of you planned to wear thick footers or doing alot of activity to get your toes extra room."
  },
  {
    "user": "Starry eyes",
    "rating": 5.0,
    "message": "Love these shoes! Got them in basic black for work, and my feet feel great all day. Lightweight and very comfortable, highly recommended!"
  },
  {
    "user": "wart",
    "rating": 4.0,
    "message": "it's great, but it's kinda slippery"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have trouble with my feet. Usually when I use shoes sometimes I get home with my feet hurting. But with this shoe I haven't had any trouble. I've recommended these shoes to family and friends."
  },
  {
    "user": "pottamus",
    "rating": 5.0,
    "message": "Very comfortable and sleek looking. Wore my Reeboks out and thought I'd  try these. I love them.  Great at the gym!!!"
  },
  {
    "user": "Gloria N",
    "rating": 5.0,
    "message": "Love these shoes! I was hesitant at first, but they fit great and are light and comfy!"
  },
  {
    "user": "mikayla",
    "rating": 5.0,
    "message": "This sneaker is super comfy and light weight. Almost like your not even wearing sneakers"
  },
  {
    "user": "kristen",
    "rating": 5.0,
    "message": "Love the way the shoes fit. Lightweight and comfy."
  },
  {
    "user": "Jamila Rigsby",
    "rating": 4.0,
    "message": "Only dislike is inner sole of shoe slipped out immediately soon as I took shoe off"
  },
  {
    "user": "Deborah Martin",
    "rating": 4.0,
    "message": "I wear these teaching all day, and my feet actually feel good at the end. They are somewhat narrow, if your feet run wider, and I am always a true size 7.5 but wish I had ordered an 8 for a little more room. Not too uncomfortable though!"
  },
  {
    "user": "Betty",
    "rating": 4.0,
    "message": "It us soft . The material is durable and slightly elastic and the laces  are a little stretchy.  Also it gets kinda sweaty. I never have sweaty hands nor feet so it is very unusual. I’ll watch this as I amusing my normal sock. I am hoping it’s because of it being such a hot day today."
  },
  {
    "user": "Bemboo",
    "rating": 4.0,
    "message": "Had to go up a half size. Comfortable and light weight."
  },
  {
    "user": "Lynn Ramer",
    "rating": 5.0,
    "message": "They look good and are very comfortable"
  },
  {
    "user": "Wzm",
    "rating": 4.0,
    "message": "Very comfortable for short walks and not intensive workouts. Wish had more support."
  },
  {
    "user": "Ruth S.",
    "rating": 5.0,
    "message": "It's very comfortable and supportive.. best sneaker I've worn in a long time!!"
  },
  {
    "user": "dinky",
    "rating": 4.0,
    "message": "I ordered up a half size as many reviewers suggested.  It was a wise decision as I’ve plenty of room and the toe box is accommodating. Super super comfortable but the lack of support will keep these shoes in the closet for walking any distance. They are great for around the house or a short walk with the dog. I’ve owned many a pair of NewBalance and while these are clearly the most comfortable I cannot depend on them to not leave my feet/arches aching after a long day on my feet."
  },
  {
    "user": "Kim",
    "rating": 5.0,
    "message": "These shoes are very lightweight, very comfortable, and they are true to size. These are great for walking."
  },
  {
    "user": "viviana",
    "rating": 5.0,
    "message": "Love how my new balance feel"
  },
  {
    "user": "One Way Trippe",
    "rating": 5.0,
    "message": "I got these on prime day, and I'm so glad I did. These shoes are so comfortable and lightweight. I usually wear sketchers but these are my new favorite shoes. I always wear a size 10 and ordered a size 10. They were tight lengthwise at first, but now they are perfect."
  },
  {
    "user": "Shamus",
    "rating": 5.0,
    "message": "very comfortable on feet when walking"
  },
  {
    "user": "Candy",
    "rating": 5.0,
    "message": "My new fav shoes. I love how comfy these and and the touch of leopard on the back is super fashionable. The mesh in the front keeps my feet cool."
  },
  {
    "user": "Loraine B.",
    "rating": 5.0,
    "message": "Like walking on a cloud"
  },
  {
    "user": "conkie",
    "rating": 5.0,
    "message": "I love these shoes! Fit great, comfortable, easy to put on. This is my second pair"
  },
  {
    "user": "Ingykay",
    "rating": 5.0,
    "message": "I own this shoe in three different sizes/styles. I absolutely love them. Super comfortable and cute."
  },
  {
    "user": "Anna S.",
    "rating": 5.0,
    "message": "Love these shoes!! Will be buying another pair for sure!! Very comfortable, stylish and sturdy! I actually put these on when my feet hurt from other shoes. They have perfect arches and compression for my feet anyway, lol."
  },
  {
    "user": "Kim Richards",
    "rating": 5.0,
    "message": "I love everything about these shoes. The perfect fit and color. I highly recommend these"
  },
  {
    "user": "Kari Marcoz",
    "rating": 5.0,
    "message": "Super comfortable and really helps to relieve my plantar fasciitis pain!"
  },
  {
    "user": "chandra s.",
    "rating": 5.0,
    "message": "need a bigger size"
  },
  {
    "user": "Santana",
    "rating": 5.0,
    "message": "I love these shoes. They're low profile and can still fit my heel insoles comfortably. The toe box is wide and roomy; I don't have to worry about toes rubbing or making holes. They're not that \"squishy\" but they're closer to the floor, which I like. They're also great for spin cycling."
  },
  {
    "user": "Brianna Torres",
    "rating": 5.0,
    "message": "after trying many different sneakers, these are the perfect ones! soft, lightweight, great support, cute style. I am so happy to finally have a pair of sneakers i can wear that are comfortable during this pregnancy. most shoes have been so uncomfortable, but these are perfect."
  },
  {
    "user": "Ashley",
    "rating": 4.0,
    "message": "Got these shoes on Prime day for $35. Good shoe for that price, but wouldn’t pay full price with such little arch support."
  }
]