[
  {
    "user": "Tyesh Johnson",
    "rating": 4.0,
    "message": "This shoe was just too narrow for me, however it was still comfortable to walk in because they material had some give, which is why I rated it as high, even though it needs to say \"narrow\" instead of true to size. Even ordered a half size bigger, still too narrow for me."
  },
  {
    "user": "Rebekah Brewster",
    "rating": 5.0,
    "message": "This is my second pair of these. They are the best shoes I’ve ever had!"
  },
  {
    "user": "nicole jackson",
    "rating": 4.0,
    "message": "Love the color of these Adidas sneakers! They are comfortable to wear throughout the day ."
  },
  {
    "user": "Michael J. Kelley",
    "rating": 5.0,
    "message": "If it satisfied my wife, I'm happy and she loves them."
  },
  {
    "user": "Ray",
    "rating": 5.0,
    "message": "These might be the only pair of sneakers I’ve had fit me really well. With narrow feet, normally I’m tightening the straps to death just to have some stability, and with these, I didn’t have to do that. They’re very comfy, I get through an eight hour shift in healthcare with these without having absurdly sore feet. When these inevitably break down, because I wear them literally every day, I’ll be getting another pair. I’ve had them for over six months now though, and they still look darn near new, so that might be a while. Here’s to hoping they don’t discontinue them."
  },
  {
    "user": "Hanna",
    "rating": 4.0,
    "message": "I got these shoes mainly for work. I do really like how they fit and look but overall they just aren’t my favorite for work and long term standing."
  },
  {
    "user": "Klady",
    "rating": 5.0,
    "message": "These shoes are so comfortable. Fit as expected. And offer good support."
  },
  {
    "user": "Alphanumeric",
    "rating": 5.0,
    "message": "Bought this as a gift and it was a success. I was told it was very comfortable, light, and perfect for someone who works on their feet a lot during the day. Looks good too."
  },
  {
    "user": "Rachel Collins",
    "rating": 4.0,
    "message": "Very comfortable, love the soft insole. The fit is a little narrow and they were not available in Wide."
  },
  {
    "user": "WifeySW",
    "rating": 5.0,
    "message": "I'm on my feet for 12+ hrs for work with lots of walking, running and bending, stooping and these shoes, my 2nd pair, are what helps keep me going throughout the day.  Plus they look great on my 8 1/2 feet, black is always a minimizer. Bonus!"
  },
  {
    "user": "H. Brink",
    "rating": 4.0,
    "message": "I purchased 2 pairs, size 9, of these shoes because I previously purchased a pair, size 9, when they first hit the market and loved them. I have somewhat narrow feet, but it wasn’t a problem with the shoes that I purchased previously—the new shoes are too wide, bulky and run about 1/2 size too big."
  },
  {
    "user": "Satan",
    "rating": 5.0,
    "message": "Not a good shoe style super easy to rip"
  },
  {
    "user": "Heather Adam-Cerri",
    "rating": 5.0,
    "message": "Nothing to dislike here…very comfortable sneaker! I do ALOT of day hiking…so lots of woods trails and rock and roots to navigate….these sneakers serve their  purpose and do it well!! Highly reccommend!!"
  },
  {
    "user": "Sarah",
    "rating": 4.0,
    "message": "I have no real complaints with these.  Would I buy them again from here, probably not considering the other terrible reviews, but I'm definitely satisfied for the price I paid. Normally I would have picked a shoe in black or gray, but there was a sale going on, and so I paid $35 for the pink pair.  To be honest, I can't tell if these are fake or not.  Everything appears to be symmetrical on both sneakers, the stitching looks good, laces are the same size, all shoe lace holes are the same size, they both fit the same, etc.  I will admit, I'm not a sneaker connoisseur so they might very well be knockoffs,  but for $35.00 I really don't care.  Had I paid double that, it might be more of an issue, so my best advice would be to wait for your size to be on sale, or buy another color that is. They look cute, they're hella comfortable and I can run in them in ease. I'm normally a 7.5 but I ordered these in an 8 just in case, and they fit comfortably with or without socks."
  },
  {
    "user": "ABee",
    "rating": 5.0,
    "message": "These shoes are so lightweight! They seemed a little tight/small at first, but they seem to be relaxing as I’m running more. I like ‘em!"
  },
  {
    "user": "Denise M Frasier",
    "rating": 4.0,
    "message": "I bought these shoes for a summer trip to Flordia. They were great to wear and went well with outfits I paired them with. If you are looking for nice white sneakers,this is it."
  },
  {
    "user": "Katie M.",
    "rating": 5.0,
    "message": "This is a great sneaker. I was looking for a sturdy but comfortable sneaker in all black and these are perfect! They last and fit great!"
  },
  {
    "user": "Deborah Davis",
    "rating": 5.0,
    "message": "Color was what I was wanting and comfort level also. Completely satisfied."
  },
  {
    "user": "Nicole",
    "rating": 4.0,
    "message": "I’m a road walker/jogger averaging around 25 miles per week.  I go through shoes quickly. I got these in hopes they would last longer than the 2-3 months I get from cheaper brands. Unfortunately, that wasn’t the case. The pros are that the shoes are comfortable and lightweight. I never had any issues wearing them until the soles were worn thin. I think of you are wearing these as an every day shoe and not for active purposes then they would probably last 6 months+."
  },
  {
    "user": "Jennifer Engel",
    "rating": 4.0,
    "message": "Normally I buy Nike, but since Amazon had it's promotional days, I gave these a try. They look nice, fit well, I'm just used to a shoe being a bit lighter.  With that said, some people may like the extra support this shoe provides."
  },
  {
    "user": "BETZAIDA ARROYO",
    "rating": 5.0,
    "message": "Good shoes. But, not great on tennis courts."
  },
  {
    "user": "Sunny",
    "rating": 5.0,
    "message": "I like a shoe that's sporty and cute at the same time."
  },
  {
    "user": "Lili RR",
    "rating": 5.0,
    "message": "Perfect fit, and I love how they look."
  },
  {
    "user": "Tabitha Berninger",
    "rating": 4.0,
    "message": "These shoes fit great and are comfortable, but the soles are thin. You can feel gravel when you're walking on it."
  },
  {
    "user": "Carolyn H.",
    "rating": 5.0,
    "message": "Wow, no break in time. Super comfortable from the minute I put them on."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love the black/white and the comfort of the shoe but I don't like the strap going across the top with Adidas written on it. I wish adidas made a slide on shoe without it."
  },
  {
    "user": "jasmine",
    "rating": 4.0,
    "message": "Love this color but honestly should have gotten a bigger size"
  },
  {
    "user": "Allyson W.",
    "rating": 5.0,
    "message": "My tween loves these shoes. They give her the support she needs while providing the look that she wants. The run true to size."
  },
  {
    "user": "Christian",
    "rating": 4.0,
    "message": "Not much for support but comfortable for a short time"
  },
  {
    "user": "Tho Phan",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "I am on my feet all day in a medical setting and these have kept up great! They’re much more comfortable than I expected and they’re super cute. I sprayed mine first with scotch guard to prevent them from getting dirty and they look brand new!"
  },
  {
    "user": "Corey Flanagan",
    "rating": 5.0,
    "message": "I love these shoes I buy them over and over again they are so comfortable and cute and are very well when I do track.👍🏻 Definitely recommend"
  },
  {
    "user": "Marlen y ruiz",
    "rating": 4.0,
    "message": "Verry confortable"
  },
  {
    "user": "Ana I Altamirano",
    "rating": 3.0,
    "message": "Not as comfortable as previous years models."
  },
  {
    "user": "Lisamcd12",
    "rating": 5.0,
    "message": "Great for work"
  },
  {
    "user": "Kristen Oviatt",
    "rating": 3.0,
    "message": "Great looking shoe, but I bought them thinking they would be as comfortable as the cloudfoams, but they definitely aren’t."
  },
  {
    "user": "Elena",
    "rating": 4.0,
    "message": "I'm a pandemic runner, and this was my first pair of running shoes.  They did the job, but after running in them a year I'm retiring them and upgrading.  One thing I appreciated about them is they held up to repeating laundering, and I know manufacturers discourage that.  But even new, they looked like shapeless, puffy marshmallows to me, and I'm glad to be moving on to a pair of Salomon's that hug my feet more closely, and give me a secure, locked-in feel.  Affordable, hold up in the wash and comfortable enough, but happy to be moving on."
  },
  {
    "user": "Mandi Sue",
    "rating": 5.0,
    "message": "Comfy and great for running!"
  },
  {
    "user": "jcurnutt",
    "rating": 3.0,
    "message": "These are very narrow. They also feel a bit cheaply made and I’m not sure if they are authentic Adidas…"
  },
  {
    "user": "LJF",
    "rating": 4.0,
    "message": "Comfortable but with a slightly narrow toe box.  Wish it came in a 'wide.'"
  },
  {
    "user": "Megan",
    "rating": 4.0,
    "message": "Their really comfortable they just run a  smaller get a size & half bigger"
  },
  {
    "user": "Erin H.",
    "rating": 4.0,
    "message": "Shoes fit well, but the fabric makes noise when you walk."
  },
  {
    "user": "Alejo LDU",
    "rating": 4.0,
    "message": "La talla está muy pequeña la orma del zapato es angosta"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "A bit disappointed in this shoe! They gape at the top of the shoe even when tied tightly. I tried many opportunities to just see if it was a \"me\" problem with wearing these shoes. Even after walking less than a mile the shoes gape and do not remained tied. These will now become \"Work Shoes\"."
  },
  {
    "user": "Aliya",
    "rating": 4.0,
    "message": "Price is 5/5 for shoes dedicated to working out, but it runs thin around the toe area. It has good heel support but it feels like I'm wearing open toe sandals in front and all the support moved to the back. I won't recommend this for running, but if you're doing light cardio or pilates/yoga then it's good."
  },
  {
    "user": "Shannon",
    "rating": 5.0,
    "message": "Comfy and cute everyday shoes, not for exercising."
  },
  {
    "user": "cal80",
    "rating": 3.0,
    "message": "This is not the Adidas I thought I was getting. Cheaply made and not like the Adidas I purchased elsewhere. Very disappointed."
  },
  {
    "user": "Norm_ee_zee",
    "rating": 3.0,
    "message": "I've had cheaper shoes that were more comfortable.. these were ok.. not great for walking on a daily.. at least for me.."
  },
  {
    "user": "Erin",
    "rating": 3.0,
    "message": "I don't really reach for them because they make a noise every time I take a step."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Satisfied with this purchase"
  },
  {
    "user": "Maryellen Connolly",
    "rating": 5.0,
    "message": "Adidas... they never fail me! Always fit perfect (sometimes they vary on the style and/or material.. but that's understandable, just like yoga pants), the colors are vibrant,  they are crazy comfortable yet cute enough to wear out on a Friday night. Love these! They may replace my beloved swifts!"
  },
  {
    "user": "AmazonRainforest",
    "rating": 3.0,
    "message": "These came in however there’s a stain on the back of the shoes."
  },
  {
    "user": "DMARIE",
    "rating": 4.0,
    "message": "Muy bueno un poco estrecho al frente pero de lo demás súper bien"
  },
  {
    "user": "Crystal Horning",
    "rating": 4.0,
    "message": "A little uncomfortable until you break them in. If you're on your feet alot I would suggest getting some insoles. Other than that they look and feel great."
  },
  {
    "user": "olga",
    "rating": 5.0,
    "message": "So comfortable but are only for walking ."
  },
  {
    "user": "Tannice Jensen",
    "rating": 3.0,
    "message": "I usually order a half size up for sneakers, and these were very small even with the half size up."
  },
  {
    "user": "sharon",
    "rating": 3.0,
    "message": "Not a vety comfortable shoe without added inserts."
  },
  {
    "user": "Amber Dawn",
    "rating": 5.0,
    "message": "These are very comfortable but no air can pass through...so they are pretty hot. But still super cute 😍"
  },
  {
    "user": "Mohammad H",
    "rating": 3.0,
    "message": "Go up half a size for this one. The gold is more of a green gold color. Not like the picture"
  },
  {
    "user": "Allison Parfejewiec",
    "rating": 4.0,
    "message": "Overall comfortable shoes. The laces do not stay tied (even double knotting), which is the one down fall for me. Overall, a good tennis shoe for everyday wear."
  },
  {
    "user": "C",
    "rating": 5.0,
    "message": "Got this shoe as an early gift for a relative She's size 9 and after reading some reviews that you should size up because shoes runs small a size or two I was worried and got size 10 That was huge! Then 9.5, too big! But 9 was just right! Like the partridge in that bear story , or was it wolf story ? Anyways,  this shoe is true to size.  And recepitient LOVES IT! Hope this review helps Go Amazon!"
  },
  {
    "user": "skyy",
    "rating": 5.0,
    "message": "I really love this simple but stylish  shoe"
  },
  {
    "user": "katie",
    "rating": 4.0,
    "message": "The fit is really good - and they’re super lightweight which I really like. I have long narrow feet and these feel pretty comfortable. I wear a women’s size 12, and these seem to have a little bit of extra room in them which I like. There’s not a ton of padding inside and the sole of the shoe doesn’t really feel like a sturdy rubber, almost sort of more like a foam plastic. Like, they almost feel like fake Adidas. It’s hard to explain. They do feel very cheap, but surprisingly I really like them because they fit so well and seem to be pretty comfortable. I’ll probably put some inserts inside. I would not use these for jogging but just for walking in general. I would actually order more if they had other colors. So this is sort of a mixed review, but overall I’m glad I purchased them."
  },
  {
    "user": "Donna",
    "rating": 5.0,
    "message": "This is a great work out walking shoe.luv the color.I had bought this from Amazon before I GOT 20.00 OFF.SO HAPPY TO HAVE IT AGAIN SO LIGHT. COMFORT.GOOD FOR SUMMER THANKS Amazon 😊👟Durability, great price"
  },
  {
    "user": "JenBone",
    "rating": 3.0,
    "message": "Very small and surprising considering I have ordered Adidas for my child before. Ordered again 1.5 sizes up in this shoe.  (Gave the first pair away)"
  },
  {
    "user": "Heather Butler",
    "rating": 2.0,
    "message": "I was not aware the shoes would not come in a Adidas box or even have tags on them. The shoes came in the mail as as shown in the first picture. I’m almost wondering if these were used? -I did not purchase them used! No wonder the deal was so good and shipping took a minute. Found a hair that is nowhere near long enough to be mine in one of the shoes😅 10/10 do not recommend if you are purchasing for a gift?"
  },
  {
    "user": "Milana Kovalev",
    "rating": 3.0,
    "message": "Fits true to size, comfy, don’t seem to be fake like the other reviews… but the soles look used. Definitely used. The box they came in was just a basic cardboard box, not an authentic adidas box."
  },
  {
    "user": "Wanda grant",
    "rating": 5.0,
    "message": "Yeah Excited they fit comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are supportive of my feet and ankles.  Very comfortable to wear all day. I'm going to buy a second pair."
  },
  {
    "user": "K.Wase",
    "rating": 3.0,
    "message": "The insoles have a weird edge or rim around the sole that does not have the soft insole so you can feel the edges. These shoes remind me of the skater shoes of the 2000s where there is all puff on top of the shoe but not enough under your feet. I work 12 hour shifts on my feet the whole time and these shoes to not hold up in comfort or in support."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "True to size. It fit perfectly and able to wear as soon as it arrived. Wide width. Well pleased with my purchase."
  },
  {
    "user": "arlene Bates",
    "rating": 4.0,
    "message": "They fit good size wise but they are very narrow across the top of my foot where my foot and toes meet other than that there perfect"
  },
  {
    "user": "Tom H.",
    "rating": 4.0,
    "message": "Im a nurse bought these for work and they are comfortable."
  },
  {
    "user": "Chara",
    "rating": 3.0,
    "message": "The glue was really noticeable and the size was smaller then expected. I love adidasand have a ton of them. But this one was Not my favorite."
  },
  {
    "user": "Lauren",
    "rating": 5.0,
    "message": "These shoes look exactly as pictured and are so so comfortable! I wear them for working out, if I have a long day of walking or just for casual wear. I’ve had them for a little while now and they have held up great and I’m still obsessed!"
  },
  {
    "user": "Andrea D.",
    "rating": 5.0,
    "message": "My daughter got these for her school trip to Washington DC. Walking all day for 3 days straight and she said they were great. They came home very dirty so I threw them in the washing machine, they look brand new!"
  },
  {
    "user": "Arev N. Miller",
    "rating": 5.0,
    "message": "This is my second pair of these adidas, I love them for walking around Disney!!! They are so comfortable!  They don't offer a ton of support for intense workouts but they are so light and great for walking!!!"
  },
  {
    "user": "e-beth",
    "rating": 5.0,
    "message": "They started out fantastic, but are already losing the soles and the comfort level is fading fast, probably great for a less active person,"
  },
  {
    "user": "Sandra K Hunter",
    "rating": 5.0,
    "message": "Loved them, they fit as the should."
  },
  {
    "user": "Diana Ayala",
    "rating": 5.0,
    "message": "Son excelentes para hacer ejercicio, su diseño es muy lindo y son muy comodos"
  },
  {
    "user": "sheaj",
    "rating": 4.0,
    "message": "Nice shoes. I love Adidas. They fit good. Super comfy. They just aren’t as light weight as the previous cloud I have owned. The only reason I made them a 4!"
  },
  {
    "user": "Lisa Devinner",
    "rating": 5.0,
    "message": "This is a light and comfortable shoe!"
  },
  {
    "user": "Evelyn",
    "rating": 5.0,
    "message": "Me encantó  son cómodos pero ay solo una cosa que no me gustó y es la parte donde se agarra al tobillo pero d3 ahí me facino"
  },
  {
    "user": "Aileen",
    "rating": 5.0,
    "message": "Great fit and love the style"
  },
  {
    "user": "Cerulean",
    "rating": 3.0,
    "message": "The back warped permanently after accidentally bending it while putting it on. Won’t fix."
  },
  {
    "user": "Daniel Merejildo",
    "rating": 5.0,
    "message": "Cómodos y versátiles, tanto para correr como para usarlos en salidas o cuando vayas a estar mucho tiempo de pie"
  },
  {
    "user": "C",
    "rating": 5.0,
    "message": "It was a birthday gift. And the recipient loves these shoes I bought another pair I believe for my aunt too"
  },
  {
    "user": "Heather M Rupert",
    "rating": 5.0,
    "message": "Super cute and comfortable"
  },
  {
    "user": "Amanda L.",
    "rating": 2.0,
    "message": "This shoe was fine for casually working out, but 1.5 months in when I was jogging, something broke or dislodged and part of the shoe started stabbing me in the insole of both feet. I cannot wear them anymore which is disappointing since they are only 1.5 months old and they were comfortable up until that point"
  },
  {
    "user": "Makayla G.",
    "rating": 3.0,
    "message": "Very nice show but it has absolutely no support, I had to buy insoles to be able to wear them cause without them they are not comfortable to walk in at all."
  },
  {
    "user": "Art Khan",
    "rating": 5.0,
    "message": "These are not for real exercise. These are excellent casual, daily shoes. Super comfy to go walking in. By design, they have a super flexible sole so you will not have stability if you're walking on uneven ground."
  },
  {
    "user": "AppleFan",
    "rating": 5.0,
    "message": "These shoes feel like walking on a cloud. Very comfy and high quality. I use them to run errands or for the gym. I definitely recommend!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This shoe is easier to get on and off than similar pull on adidas shoe and cheaper than outlets adidas. Very comfy and glad I got them."
  },
  {
    "user": "Tracie cress",
    "rating": 3.0,
    "message": "These are so cute and comfy but the cushion doesn’t last.  They’re flat and have no support all ready.  Definitely not good for someone on their feet all day."
  },
  {
    "user": "Szaftoo",
    "rating": 5.0,
    "message": "I ordered a 7 which is what I wear and the fit was perfect. They are well made, comfortable and stylish."
  },
  {
    "user": "Samantha",
    "rating": 5.0,
    "message": "I’m a big girl aiming to get fit. I have the hardest time finding shoes that fit my wide hobbit feet that are comfortable. Nike doesn’t cut it. I spent $95 on a pair of Nikes and they sucked. These however, very comfy. I use them on my treadmill and my feet are in clouds. Highly recommend."
  },
  {
    "user": "Gigi",
    "rating": 2.0,
    "message": "Had the shoes for a couple of months and had holes in the bottom of both of them. Id try to wear them with the holes, but I would get a blister and holes straight through a couple pair of socks, wouldn't recommend."
  },
  {
    "user": "Cake",
    "rating": 3.0,
    "message": "They were as pictured and length of the fit was fine, but there is a tight band across the top of the foot just at the base of the laces that made wearing really uncomfortable. Not good for wider feet or high arches. I couldn’t wear them for more than 20 minutes."
  },
  {
    "user": "Chad De Frang",
    "rating": 4.0,
    "message": "Very comfortable"
  },
  {
    "user": "Mary Sue Judd",
    "rating": 5.0,
    "message": "I use these shoes for working out Nd walking"
  }
]