[
  {
    "user": "Latoya",
    "rating": 4.0,
    "message": "Super cute! NOT NON-SLIP!! I wanted non-slip shoes for work. I work at a restaurant and these shoes are most definitely slippery. A little water on those restaurant floors and you will be on your ass!"
  },
  {
    "user": "Ice",
    "rating": 4.0,
    "message": "Wife likes them"
  },
  {
    "user": "Dona",
    "rating": 4.0,
    "message": "I wear a 6.5/7 ordered a 7 sent back for 6.5 fits perfectly… sharp  shoe…I did order Dr Sholl’s inserts for them"
  },
  {
    "user": "Kirsti M. Fleming",
    "rating": 5.0,
    "message": "I can't believe how many compliments I get on these shoes! I plan to order more colors. They aren't super easy to get on, especially since one of my loops is smaller than the left shoe so I can't fit my finger in it."
  },
  {
    "user": "Lamont",
    "rating": 5.0,
    "message": "…. Nothing further to write"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought the yellow ones. I've had so many compliments on them, which is nice, but the most important thing is they are comfy!! I have achilles tendonitis and i'm always in pain. Its in both of my heels and it hurts to walk long distances. I've tried a few different kinds of shoes and these are the best. Do my heels still hurt, yea its not a miracle. Its a dang shoe. But...the shoes don't make it worse and it actually helps because of the way the blades on the bottom compress and take most of the strain. Hard to explain, but i'm going to get these in every color."
  },
  {
    "user": "Rabi A. Jones",
    "rating": 5.0,
    "message": "Definitely will buy more colors"
  },
  {
    "user": "Catherine Hahn",
    "rating": 4.0,
    "message": "Purchase these for a local golf outing hosted by my employer. They are tight to get on but once I had them on, I loved them. They are pretty snug so I'm still trying to get them broken in. They are pretty cool looking but they DO feel different when you walk due to the construction of the shoe. They are comfortable outside of being a \"sock\" shoe."
  },
  {
    "user": "Angel",
    "rating": 5.0,
    "message": "These are awesome I am going to order more pairs..."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect for work when standing all day"
  },
  {
    "user": "Darcel Carter",
    "rating": 5.0,
    "message": "Love the color and the fit"
  },
  {
    "user": "Monica Briseno",
    "rating": 3.0,
    "message": "No es comodo El tenis"
  },
  {
    "user": "Sabrina",
    "rating": 3.0,
    "message": "They are my favorite shoes. At first they did have that \"extra plastic\" thing across the balls of your feet but it goes away as you break them in. I've washed them a couple times and the print is starting to come off. Other than that I'm getting another pair."
  },
  {
    "user": "Sade",
    "rating": 5.0,
    "message": "Love hear shoes 👞"
  },
  {
    "user": "Sue Wilson",
    "rating": 4.0,
    "message": "My daughter loved these shoes. Style. Weight (she’s an athlete). But the shoe ran smaller than usual. I ordered her a 6 and she couldn’t get her foot in at all. Was going to reorder but decided not to."
  },
  {
    "user": "Jean",
    "rating": 4.0,
    "message": "I Love the look of these tennis shoes They really look good but they’re snug and I have a narrow foot. I’m wondering if and possibly they will loosen up as they’re worn"
  },
  {
    "user": "Mary L Harris",
    "rating": 4.0,
    "message": "I Love This Items,Right Sizes Hard Time Pulling Them Up From Behind"
  },
  {
    "user": "Cassandra Lloyd",
    "rating": 5.0,
    "message": "Very durable, have decent support and have gotten lots of compliments, great way to dress up scrubs!"
  },
  {
    "user": "Jaime Wilson",
    "rating": 2.0,
    "message": "When I first got the they were a little snug. I wore them 5 weeks. They definitely loosened up.  They are actually to big for me.  I also noticed that the sole of the shoe is turning loose. So I’m not sure exactly how to feel cause I can usually get at least a year out of a pair of tennis shoes and I only got a month or so out of this pair."
  },
  {
    "user": "Maya",
    "rating": 3.0,
    "message": "The shoe fits tight and is a small fit so if you order try to order one size larger"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "They didnt fit me with socks I wear a size 8 and they was to tight"
  },
  {
    "user": "Ernestine Whitehead",
    "rating": 5.0,
    "message": "Great sneakers they are very comfortable! I have a black pair also. I wear them more than I wear my Nikes now."
  },
  {
    "user": "Kewi30",
    "rating": 3.0,
    "message": "I bought these for softball season to match my kiddos colors. I wear a 7 or 6.5. I bought the 7 and they are tight. They will prob stretch out some, but it's snug for now. The shoes are not extremely cushy but will work. For the price, not bad. If I had more room would prob add an insole. Maybe size up a step if you want to add an insole."
  },
  {
    "user": "swalton",
    "rating": 3.0,
    "message": "after about 7 or 8th time of wearing the laces busted through the rubber & now they are trash. very upset ☹️"
  },
  {
    "user": "Amanda Markewicz",
    "rating": 5.0,
    "message": "Very hard to put on because there is nothing to grab onto, but I now use a ink pen to help slip them on."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Very cute/stylish. They fit great and I ordered  (I’m a 9.5 and ordered a 10) for a trip that would require hiking bans walking for long periods of time. Very little support and now cushion. I will end up using these to go to the grocery store or errands that are short periods of time."
  },
  {
    "user": "Janet Frydenberg",
    "rating": 5.0,
    "message": "Sizes runs smaller. Get next size up."
  },
  {
    "user": "Ashlea",
    "rating": 3.0,
    "message": "These are very cute. I wear and 8.5 but they don't have that size. I read they run small so ordered a nine. They fit great, they look great. But they have this spot in both shoes where it feels like there is something in them. Like a straight line across the ball of the foot. It's where the break in the tread is. I'm gonna put insoles in them and hope it helps."
  },
  {
    "user": "diane lawson-taylor",
    "rating": 5.0,
    "message": "gym/classes"
  },
  {
    "user": "Khris",
    "rating": 5.0,
    "message": "Great comfort and fit. Little snug with socks.  Wear with thin socks. Great spring action in every step.not meant for gravel roads but super comfortable."
  },
  {
    "user": "Jaquita C.",
    "rating": 3.0,
    "message": "I like the style of the shoe but it fits too tight."
  },
  {
    "user": "Jessica Mills",
    "rating": 5.0,
    "message": "I read different comments on the same shoe different sellers & alot said to size up. I'm a 9.5 I ordered a 10 and they are a good fit. Slightly narrow, was kinda hard to get my foot in at first but then loosened up after a day or 2. I get ALOT of compliments on these shoes and people asking where I got them. I walk alot at work and they seem to be holding up and are pretty comfortable. I'll buy another pair for back up."
  },
  {
    "user": "JM",
    "rating": 5.0,
    "message": "I found myself liking these shoes way more than I had expected. I bought another pair in a different color. They are surprisingly comfortable for their no-name brand and cheap price."
  },
  {
    "user": "Jamie Swift",
    "rating": 5.0,
    "message": "Cute shoes! I wear a size 8,  I like the red bottom grip looks like a named brand from a distance. I am very pleased and satisfied of my order."
  },
  {
    "user": "Julissa",
    "rating": 4.0,
    "message": "Me encantaron los tenis"
  },
  {
    "user": "rachelle judkins",
    "rating": 5.0,
    "message": "Great fit I need another pair"
  },
  {
    "user": "Detenn",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Neleh",
    "rating": 3.0,
    "message": "It's not as cushiony as I had expected, looking for a more cushiony shoe to walk a mile on a daily basis, it's cute and different! Not sure if I will return or keep."
  },
  {
    "user": "Linnéa Piazza",
    "rating": 2.0,
    "message": "I feel like I’m walking in heels not sneakers so not really practical for everyday wear at work at a job I’m on my feet."
  },
  {
    "user": "Jackie",
    "rating": 3.0,
    "message": "They just require some effort to get on."
  },
  {
    "user": "Regena Yancey",
    "rating": 2.0,
    "message": "They were shoes ill fitted"
  },
  {
    "user": "Laurie",
    "rating": 5.0,
    "message": "I get so many compliments on these shoes. The waffle tread is unique, & the fabic is flexible. They are both light weight & comfortable and the colors are awesome too!"
  },
  {
    "user": "Tifaan",
    "rating": 5.0,
    "message": "These are the most comfortable shoes everrrr! I've gotten SOOOO many compliments on them! I've been shopping to find more clothing to match my bright neon yellow shoes! I will def buy more colors!"
  },
  {
    "user": "L A Bettencourtt",
    "rating": 2.0,
    "message": "I wear a size 10 in every shoe, but these are so narrow. Also very stiff and you clunk around when walking in them. Would recommend for anyone who has normal size feet no matter what size you wear."
  },
  {
    "user": "Valerie H.",
    "rating": 5.0,
    "message": "Very nice and light.  Attractive and vibrant color (I ordered the yellow). I bought my true size of 8.5 but I suggest  sizing up as they are a little snug. I intend to buy other colors soon!"
  },
  {
    "user": "KK",
    "rating": 5.0,
    "message": "Very Comfortable Great for the price Lots of compliments on them"
  },
  {
    "user": "Lakeyra Ross",
    "rating": 3.0,
    "message": "these shoes are cute but hard to put on"
  },
  {
    "user": "Brenda H.",
    "rating": 5.0,
    "message": "Much more comfortable than my more expensive sports shoes . Lots of support, wear them all day as a nurse and don’t have sore feet at the end . Only down side is they are a little to put on because of the strap on the heel ."
  },
  {
    "user": "C Maura",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "L.E.S. Lawn Care Service LLC",
    "rating": 2.0,
    "message": "I love the color but it was a very poor fit for me. I ordered a size 7 women's and I couldn't get my foot in it at all. There's no give with the fabric. I loosened all the laces and I still couldn't get it on."
  },
  {
    "user": "Gina Sierra",
    "rating": 2.0,
    "message": "They are comfortable but I slip on water not so good in food service"
  },
  {
    "user": "barbara h.",
    "rating": 5.0,
    "message": "This sneaker fits well ! I get many compliments when I wear them."
  },
  {
    "user": "Magdalena Rodríguez",
    "rating": 5.0,
    "message": "Me gusta el color y la comodidad"
  },
  {
    "user": "April jenkins",
    "rating": 5.0,
    "message": "Love my sneakers fit as excited very comfortable."
  },
  {
    "user": "Gloria",
    "rating": 5.0,
    "message": "Todo estuvo excelente👍Y muy bonitos y comos"
  },
  {
    "user": "Polet Negron",
    "rating": 3.0,
    "message": "No me sirvieron"
  },
  {
    "user": "JAN",
    "rating": 1.0,
    "message": "I have the red shoes and they’re very comfortable. So when I ordered the green ones I thought it would the same fit. Unfortunately that’s not the case. It feels as if your feet are sitting on the design of the shoe. The sole needs to be thicker. Instead of sending it back I’ve decided to purchase a extra fitting to go inside the shoe. Just awful"
  },
  {
    "user": "ZGT",
    "rating": 5.0,
    "message": "N/A"
  },
  {
    "user": "Lorena Gomez",
    "rating": 5.0,
    "message": "I absolutely love how cute these shoes are literally! They fit perfect and are comfy. So glad that I bought these!"
  },
  {
    "user": "Latonya Basilone",
    "rating": 5.0,
    "message": "The color is awesome and they are very comfortable."
  },
  {
    "user": "Sharon Dinterman",
    "rating": 5.0,
    "message": "Haven’t worn yet but tried on very comfortable!"
  },
  {
    "user": "stephanie thomas",
    "rating": 5.0,
    "message": "Colors and style"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Light weight and great fit"
  },
  {
    "user": "Tae Allen",
    "rating": 5.0,
    "message": "Just got the white pair and these are really nice! 😊"
  },
  {
    "user": "Jean Corson",
    "rating": 5.0,
    "message": "The media could not be loaded."
  },
  {
    "user": "Charmer",
    "rating": 1.0,
    "message": "The bottom of the shoes are plastic, not rubber. Don’t bother. I returned them immediately."
  },
  {
    "user": "karen m. cole",
    "rating": 1.0,
    "message": "Very hard footbed- no support or cushioning- right sneaker squeaked continuously through the day"
  },
  {
    "user": "Yolanda Gonzalrz",
    "rating": 1.0,
    "message": "Dislike too small"
  },
  {
    "user": "Sandra",
    "rating": 1.0,
    "message": "Even though it was a oppose to be slide in they didn’t fit or slide"
  },
  {
    "user": "Woodsmiriam",
    "rating": 1.0,
    "message": "To small"
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Size defintely run small"
  },
  {
    "user": "tyesha hill",
    "rating": 1.0,
    "message": "Too small"
  },
  {
    "user": "Joanne Marino",
    "rating": 1.0,
    "message": "They are very hard to get on the style is great but I have to send back sorry Charlie"
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Shoes feel horrid on feet. They are sized a whole size too small. I ordered an 8 and it fits like a 7..will never order again"
  },
  {
    "user": "Melinda Hall",
    "rating": 1.0,
    "message": "The shoes are difficult to pull on.  The soles are hard with very little cushioning. Very cool pink color, but I can't wear them."
  },
  {
    "user": "Grace Porter",
    "rating": 1.0,
    "message": "Sending them back for a replacement pair could not wear them"
  },
  {
    "user": "Rocky Top Rachel",
    "rating": 1.0,
    "message": "The color is not red.. It is burnt orange"
  },
  {
    "user": "JuneButterfly",
    "rating": 1.0,
    "message": "Too narrow had to return very disappointed"
  },
  {
    "user": "Lisa Calhoun",
    "rating": 1.0,
    "message": "N9o"
  },
  {
    "user": "shannon walton",
    "rating": 4.0,
    "message": "alittle tuff getting over heal but once on they are great. i got them for work, im a guard at a warehouse so alot of walking."
  },
  {
    "user": "Jalessa Moses",
    "rating": 5.0,
    "message": "It didn’t take long for me to break them in. I wear them weekly. Easy to slide on and go. I love it for the height and comfort. Will definitely recommend to others."
  },
  {
    "user": "Joyce Randolph",
    "rating": 5.0,
    "message": "I love them, they make their own fashion statement"
  },
  {
    "user": "Rachel crisp",
    "rating": 2.0,
    "message": "I like the color but the sizes are really small but hard to get on but very comfy when on your feet"
  },
  {
    "user": "Geminis",
    "rating": 5.0,
    "message": "Camino asta 6 millas al dia y me Han funcionado super bien Para el soporte y mi talon"
  },
  {
    "user": null,
    "rating": null,
    "message": "These are great shoes, but they do fit half a size small in my experience. I ordered an 8 and they fit, but barely, so my partner who wears a 7.5 women's wears them and she loves them."
  }
]