[
  {
    "user": "Sshl8",
    "rating": 5.0,
    "message": "I have worked in retail 8+ years and it wasn’t towards year 6 that I realized how important it was to find a shoe with the right support. At age 28 I started having problems with my right foot and lower back from wearing crappy shoes and working on my feet all day long. Luckily I started seeking help from a chiropractor and started wearing the correct shoes before it became a long term issue.  So anyway, I’m just going to get to the point. I’ve worn a lot of different brands, Clarke’s were my favorite for a couple of years. I started having extreme pain in my right knee at the end of my workdays recently. So I decided to do some research and I found these shoes and they are amazing! No knee pain anymore!!! They are very comfy, provide great support, and the heal absorbs any shock that contributed to the knee pain I was experiencing. I was a little reluctant at first to purchase these when I saw someone’s review that said these slip, because I’m already clumsy as it is. But I assure you that these don’t slip and I walk on not just tile floor, but concrete as well while at work. At home I’m fine walking on hardwood without slipping as well. I felt it necessary to write a review in hopes that it helps anyone who is struggling to find a good pair of work shoes that provides them with support and comfort they need! I absolutely recommend these. One thing I do want to mention is with work shoes and gym shoes I always go a half size up. So normally I’m a 7, so with these I ordered 7 1/2 and they fit comfortably and perfect"
  },
  {
    "user": "B. Hunt",
    "rating": 5.0,
    "message": "For many years I have dealt with aging feet issues-plantar fasciitis, toe ligament issues, etc. I am on my feet most of the day so wearing supportive, comfortable shoes is imperative. I found these shoes while searching for orthopedic footwear. The cushioned, supportive soles as well as the price lured me in. The reviews were mixed but decided to try them. Also based on reviews, I ordered a half size up to be safe. The shoes arrived quickly. There is good support as well as flexibility in sole. The shoes come with a removable arch support and while it was not heavy duty, it is not overly flimsy either. I tried the shoes on with the provided support and with my own arch orthotic. I chose to wear with my orthotic and there was ample space to do so. The shoes is not difficult to get on yet still felt comfortably snug. I debated about ordering a wide shoe as I have in the past for sufficient toe space but did not in this case. The toe box is tall enough and it does not rub on my toes at all which is huge. Way more comfortable. The shoes have great cushioning! No pain in sole of foot even after 14 hours of continuous wear. The shoes are light with great traction. I highly recommend for anyone with similar issues. Already debating whether I should order another pair!!"
  },
  {
    "user": "Larissa Becerra",
    "rating": 4.0,
    "message": "I think for the price these shoes are great. I walked on wet surfaces during my shift as a server and did not fall so that is good. My only concern is the lack of support around the heels. These shoes are slip on and I was scared of breaking/rolling an ankle. Also, my feet are a bit slim so maybe that is why I had so much room for error. I think they are great for the price but will probably invest in other shoes for work when I have the money."
  },
  {
    "user": "Patty & Roger",
    "rating": 5.0,
    "message": "I recently had bunion and hammertoe surgery.  I bought these shoes to wear as I transition out of the air cast.  As I’m still dealing with swelling I bought them 1/2 size larger than my normal size. They are perfect!  I do use a shoe horn which makes it easier to slip them on.  Once my swelling goes down I don’t think the shoe horn will be necessary.  They’re very cute and comfortable and I plan to buy more in another color."
  },
  {
    "user": "PreciousMetals18",
    "rating": 4.0,
    "message": "The only reason I'm giving this product four stars instead of five is because I haven't yet worn them for a full day at work in the healthcare setting to see how they hold up, but for the little bit I tried them on they were comfortable and they look very sleek!"
  },
  {
    "user": "ERE",
    "rating": 4.0,
    "message": "Exact fit for size.  Possibly a little narrow but a snug, flexible fit is good.  Slightly difficult to get on but just have to get use to it. Fun and cute to wear."
  },
  {
    "user": "D. Bradley, C.A.",
    "rating": 4.0,
    "message": "Bought these shoes because I needed the height on the sole because I was in a boot and needed to level up.  However I will use them for everyday wear as they are very comfortable."
  },
  {
    "user": "Michelle Bahr",
    "rating": 4.0,
    "message": "These shoes are very comfortable. I did some moving over the weekend and they were amazing. The reason for 4 stars vs 5 is there is not much ankle support being that it is all material mesh around top of foot and ankle. Otherwise, it's a great shoe and for the price too."
  },
  {
    "user": "Hollie Viol",
    "rating": 5.0,
    "message": "I've been wearing these shoes everyday to work and they have held up great. I am on me feet all day and moving around alot and needed new shoes to give me better support to relieve ankle pain. For reference I am plus size and do have wide feet and suffer from foot and ankle pain. These have been awesome. The lift in the heel gives good posture. They are super light weight and soft and easy to put on. I have gotten nice compliments from co-works and customers. Everyone at work noticed them the first day I wore them. I really enjoy them alot. When I finially distroy them from wearing them everyday for work, I will purchase another pair."
  },
  {
    "user": "mom from MN",
    "rating": 5.0,
    "message": "I was searching for a shoe I could wear to work for long days on my feet(I’m a hairstylist).  I have terrible planter fasciitis and heel spurs.  I came across these in my search and wore them to work for the first time and they were fantastic! No heel pain after my shift and they were comfy the whole day. I usually wear a size 9, but went down a 1/2 size and they were perfect."
  },
  {
    "user": "L",
    "rating": 4.0,
    "message": "I love sketchers. Love them all but looking closely at this, I should have considered it may not fit snug at the ankles. It is the correct shoe size but without thick socks, if you want a nice snug fit & have narrow feet, not well suited."
  },
  {
    "user": "Marta",
    "rating": 4.0,
    "message": "Son un poco mas Altos de lo que esperaba ,hay que usarlos un poco para acomod acomodarlos"
  },
  {
    "user": "Catherine A",
    "rating": 5.0,
    "message": "Recovering from an ankle break I thought that I was doomed for really ugly shoes but these are not only somewhat stylish, they are really the ONLY shoes I can wear all day without issue. I would recommend them HIGHLY to anyone that is recovering from running or injury but also to anyone that has to be on their feet a  lot."
  },
  {
    "user": "barbara sykes",
    "rating": 4.0,
    "message": "I am still trying to get use to this shoe.  It is a slip on but it is not that easy to “slip on”.  I would recommend a shoehorn, especially if you have arthritis.The heel has a slight elevation that maybe too much for me to wear for an extended period.  It is a roomy shoe, I ordered a half size down, and the fit is perfect, but if you have any problems with your feet, I would not recommend."
  },
  {
    "user": "susie q",
    "rating": 4.0,
    "message": "I like them. Good/ light work shoes. They are made big. I usually wear a 10 but got a 9.5 based on other reviews. They fit just right. The 10 would have been too big.  Would recommend."
  },
  {
    "user": "Donya Carter",
    "rating": 5.0,
    "message": "Out of the box: Size 8, white. Delivered quickly and on schedule. Packed nicely. Bright white, true to color. I generally wear a size 8 in tennis shoes/walking shoes. My go to pair most of the time are sketchers. I chose these for work because they were basic white and after reading reviews thought I would give them a try, at the price point I was not sure but figured they could be donated and replaced if I didn't like them. I thought I would need \"break in\" time. Realized shortly that I was wrong, it was not necessary. I am a caregiver by trade so I spend most of my day on my feet and wanted to see how well they worked for a while before writing a review. I am 50 years old and have developed arthritis in my ankles, knees, hips, and back so I needed a shoe that would support, cushion, and lessen overall impact on my joints. I have a moderate instep and have some heel pain from time to time. Purchased these shoes in early January and have been working in them since. These have become my go to shoes of choice for everything. They fit like a glove, good support, very light and breathable, my feet do not sweat inside these shoes and if they do it seems that the material of the shoe wicks away the moisture. I do wear them with Peds no show socks, I don't wear sneaker shoes without socks, just a personal preference, I feel that they could easily be worn without socks if that is your preference, the top material is like a stretchy, breathable knit material. I would compare it to pulling on a heavy knit sock with a sole. Different than any shoe I have ever owned, but in a good way. I was pleasantly surprised by the fit and comfort. They add a slight spring or bounce to my steps and provide great impact support for my joints, even when I am having an arthritis flare up. The insoles are easily removed for cleaning and airing out, it is a memory foam insert and quickly started molding to my personal foot shape. Since they are white,, I was concerned that they would be hard to clean and restore the true white. I found that the shoes are easily cleaned. I removed the insoles before cleaning and cleaned those by hand separately. On the shoes I use a little baking soda with some Dawn dish soap as a paste and scrub them a few minutes, and rinse them. I know that the manufacturer says do not machine wash but after I rinsed them I put them in my top load HE washer (no agitator) and washed them on a delicate cycle in tap cold water. I layed them out to dry, I did not put them in the dryer. As you can see in the photo, they are as white now as they were when they first arrived. They have retained their shape, no shrinking, no loss of shape or stretch, still fit the same. I can truly say that I am in love with these shoes. I choose these shoes for all my outings now, to the grocery store, walking, and everything in between where sneakers are an acceptable wardrobe choice. People stop me to ask about my shoes and they get rave compliments. I will be buying more and highly recommend them. Give them a try if you are looking for a supportive, light, easy option for your feet!"
  },
  {
    "user": "Buffy",
    "rating": 4.0,
    "message": "Fast delivery, looks exactly as pictured & comfortable. They seem to run a little larger. I’m a 9 but could’ve maybe used a 8.5 because it was a little loose in the heel."
  },
  {
    "user": "Rebecca A.",
    "rating": 4.0,
    "message": "I wore these on my vacation, in fact me and my bestie both ordered these. We lived in these shoes the entire vacation. Walked almost 15-20K steps each day. They were super comfortable and light. I think we ordered .5 size larger than our regular size, but I don't think that was necessary."
  },
  {
    "user": "Calypso",
    "rating": 4.0,
    "message": "I love that they have support and are easy to slip on and off. I do wish i had ordered my regular size. I ordered a half a size up because i worried about my feet swelling up. Definitely order your normal size. I use these for working as I have to be on my feet all night."
  },
  {
    "user": "Julie Holm",
    "rating": 4.0,
    "message": "Good stiff sole. I removed the insole and out in my own. Needs more arch support. Upper is nice and stretchy. A little difficult to put on without messing up your socks. Not weatherproof but breathable. Might be slippery on slick surfaces. Fit as expected."
  },
  {
    "user": "Ariana",
    "rating": 5.0,
    "message": "I bought these to wear with compression socks to alleviate peripheral neuropathy when on my feet at work. Best compliment I got on them? Man: \"are those Balenciaga's?\" Me: \"Heh, not unless you buyin 'em. I didn't realize they looked like a designer I liked, thanks!\" And they do. 🤷🏼‍♀️ Lucky for me, my style doesn't really change as much as designers might want lol"
  },
  {
    "user": "Krysta stillwell",
    "rating": 4.0,
    "message": "Fit very comfortably, with or without socks"
  },
  {
    "user": "Shy",
    "rating": 4.0,
    "message": "The shoe (once I wrestled my foot into the opening) was a good fit, but there isn't much give to the opening to squeeze through, just fyi. If you have any edema or swelling on the top of the foot, get help. You'll need it."
  },
  {
    "user": "Teresa",
    "rating": 4.0,
    "message": "Lots of comfort"
  },
  {
    "user": "Nina",
    "rating": 5.0,
    "message": "This is a comfortable shoe, I would not wear it working out because I need more support when at the gym, however, it is comfy and easy to slip into when I am running out to walk the dog, or getting mail etc."
  },
  {
    "user": "Cheli",
    "rating": 4.0,
    "message": "They look nice. Not so much like sneakers."
  },
  {
    "user": "alice phrakonkham",
    "rating": 4.0,
    "message": "I ended up giving this to my mom. I fit a 9 and a 1/2 wide normally. But this was just a bit too tight. She said that it was comfortable and supportive. Glad it worked out for her at least."
  },
  {
    "user": "Michael S.",
    "rating": 4.0,
    "message": "SATISFIED WITH THIS PRODUCT AND PURCHASE"
  },
  {
    "user": "Mary Beth",
    "rating": 4.0,
    "message": "Very comfortable and great price!"
  },
  {
    "user": "Nora Flaherty",
    "rating": 3.0,
    "message": "Amended Review: I've had these shoes for a few weeks. Today was the first time I wore them when the sidewalk was wet. I walked into the grocery store from the street which has lino tiles and I went FLYING! I wasn't really hurt but I was sliding all over the place! Very dangerous for me. I'm extremely disappointed. Previous review: Got them yesterday. They are very comfortable. I like them overall. However, they in NO WAY are a slip on shoe, which they kind of state. You can not step into them. Especially with socks on. In fact, because they are basically a soft, fabric shoe, I had to wrestle with them a bit to get them on. You have to get your fingers in the back and move them around to get them up un your foot. That part id disappointing. However, once on, whey appear to be comfortable. I will be doing a lot of walking in the next week so I'll see how they really are."
  },
  {
    "user": "patricia partin",
    "rating": 4.0,
    "message": "The support is wonderful and it also put me a little taller than what I am and didn’t expect that which was nice."
  },
  {
    "user": "Vickie McLaughlin",
    "rating": 4.0,
    "message": "Great shoe.  Very comfortable. Fits great."
  },
  {
    "user": "Dawn Wolfram",
    "rating": 4.0,
    "message": "Hard to submit because they’re to big"
  },
  {
    "user": "Maite Ayala Suarez",
    "rating": 5.0,
    "message": "Lo único que no me gustó de éstos zapatos es que el elástico de la parte de arriba está muy apretado también para ponértelo es muy incómodo puesto que tiene muy cerrada la entrada para el pies, recordando siempre que todos los pies no son del mismo ancho,para una persona con pies delgado son especiales,para una person de pies ancho deben hacerlos doble ancho.Gracias ."
  },
  {
    "user": "Marianne",
    "rating": 5.0,
    "message": "I like these shoes most of all, because they do not have to be tied and are easy to slip into...They have a vibrant color,I chose purple...There is nothing to dislike"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I found it a little high. It felt as though I was wearing heels. It's great shoes to wear daily. It is comfortable."
  },
  {
    "user": "Yaumara Lopez",
    "rating": 4.0,
    "message": "They were pretty but not comfortable enough to be walking or standing for a long time"
  },
  {
    "user": "Shai Blocker",
    "rating": 4.0,
    "message": "I may need to get thinner socks! They feel amazing but don't fit with my current choice of socks. I've been wearing them for about 2 weeks and I feel so much more support I have a flat wide foot and these don't have alot of flex too them. I added powder and spray to keep my feet dry and comfy but I'm definitely gonna invest in a size 10 just to have more room."
  },
  {
    "user": "roberta reyes",
    "rating": 4.0,
    "message": "Love color price comfort perfect fit"
  },
  {
    "user": "Patricia",
    "rating": 4.0,
    "message": "I like the casual look, and the  mess color. The  size  10 is a little too big."
  },
  {
    "user": "Margaret N",
    "rating": 5.0,
    "message": "The shoes were comfortable enough to wear all day long working on my feet.  I put them on and the stretchy fabric hugged my feet firmly but gently.  I live these shoes."
  },
  {
    "user": "Lisa J McKeen",
    "rating": 5.0,
    "message": "These are the most comfortable walking shoes I have ever had. Order your regular size; I ordere these in size 7. I bought these immediately after ordering a black pair in 7.5; I will keep the 7.5 but if I order a 3rd pair it will be in a size 7."
  },
  {
    "user": "Foluké John",
    "rating": 4.0,
    "message": "I bought these shoes to wear to school. They fit really well and look great, and are very comfortable. However, in my opinion, they do not provide arch support for prolonged walking. Notwithstanding,  i still like them"
  },
  {
    "user": "Carol",
    "rating": 4.0,
    "message": "Purchased as after a hip replacement I can't put shoes with laces on by myself and was frustrated with tongues of other sneakers/walking shoes getting stuck.  Overall, these are ok.  Easy to get on with long shoehorn.  Look just fine.  Support though - I guess an all day wear for me isn't in the cards just yet.  Spent about 4 hours on my feet with about 2 - 20 minute breaks in there and my feet were sore.  It could be just part of my recovery, or the support in the shoes - it was more of the ball of my feet than the entire foot.  We'll see- if they seem to work out more in the future I will be getting another pair."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I work on my feet 16+ hours a day and once I got these broken in they are like wearing socks. I couldn't give a higher praise for a shoe.  I swear by Dansko's but these are more comfortable, and I don't have to worry about the high soles that I turn my ankles on sometimes.  Plus, they're way easier on the pocketbook.  I've only had mine a couple of months so I don't know about longevity but for the price I can always order another pair."
  },
  {
    "user": "Sandra",
    "rating": 4.0,
    "message": "The bottom sole was coming off. Waiting on replacements.  Have a pair of purple, black, navy blue very comfortable."
  },
  {
    "user": "Betsy Duckworth",
    "rating": 5.0,
    "message": "I bought them, for Disney and they were amazing - no rubbing, no discomfort, and they don't look like old lady shoes. I accidentally bought a second pair bc I misplaced the first but I'm going to give them to my mom rather than return them bc they're so awesome."
  },
  {
    "user": "YKennedy",
    "rating": 5.0,
    "message": "I can’t say enough how comfortable this shoe is.  I work in them anywhere from 6-8 hours straight all standing/walking and at the end of the shift I have no pain.  Highly Recommend this shoe!"
  },
  {
    "user": "Rachael Gammage",
    "rating": 5.0,
    "message": "I got these shoes for work and I love them. There easy to put on and provide a support for my feet."
  },
  {
    "user": "MariaBernarda Vásquez García",
    "rating": 4.0,
    "message": "Zapatos bastante cómodos y casuales"
  },
  {
    "user": "Casey",
    "rating": 5.0,
    "message": "Just got these today and was pleasantly surprised!  Ordering shoes online is always a crapshoot, but so far, I love these.  Got the all black and they will look great with bootcut jeans without looking orthopedic.  Also love that they have a bit of a heel but still feel like slippers.  I am either a 7.5 or an 8.  I ordered the 7.5 and they are perfect.  Not sure how they will wear but will update review if it's not well."
  },
  {
    "user": "Christina Pixton",
    "rating": 4.0,
    "message": "Light weight and added inserts to have more even pressure on my feet and I love them now."
  },
  {
    "user": "luckisha townsend",
    "rating": 5.0,
    "message": "I like them so much that I bought this pair in blue.  It's hard to find a 10.5 for women and the width that fits."
  },
  {
    "user": "Renee H.",
    "rating": 4.0,
    "message": "Shoes are fine. I thought good for walking included the treadmill, NO! They are good for everyday walking at work but not long walks for exercise walking. Heels are too narrow to exercise in. Tall heels! They look good with long pants."
  },
  {
    "user": "Alyssa evangelist",
    "rating": 5.0,
    "message": "I love these shoes! They’re super comfortable. I bought these for vegas to walk around in while Pregnant and honestly they fit true to size, breathable, light weight and bouncy definitely Recommend"
  },
  {
    "user": "Tracey Warren",
    "rating": 5.0,
    "message": "I've only worn them twice so far, once around the office and once for working out.  Good support, easy to walk in them, even on the treadmill."
  },
  {
    "user": "Donna",
    "rating": 5.0,
    "message": "I love the shoes I’d buy them a little big because I wear bulky socks in the winter. I’m 67 years old and have a lot of problems with my feet and they feel so good on. I have four pairs of them different colors."
  },
  {
    "user": "Mirella S.",
    "rating": 5.0,
    "message": "Love how comfortable they are, fit perfectly and look great. The price is reasonable."
  },
  {
    "user": "trees",
    "rating": 5.0,
    "message": "These lightweight slip-ons are comfortable and versatile. I can wear them all day long without aching feet or legs. They’re perfect for any casual activity or event. You’ll love in them!"
  },
  {
    "user": "Denia lara",
    "rating": 4.0,
    "message": "Bonito, buen ajuste y comodos"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are great for people who work long shifts. I can work 10-12 hours without sitting down and my feet don’t hurt at the end of the day. The only downside is they are a little funny looking. So you gotta choose comfort over style on these ones"
  },
  {
    "user": "Nancy Kidwell",
    "rating": 5.0,
    "message": "Fits as expected and great feel for wearing all day I would give them 5 stars."
  },
  {
    "user": "Carla Basden",
    "rating": 4.0,
    "message": "I like that I am  able to wear these sneakers without socks and still have the comfort as if I had them on."
  },
  {
    "user": "Mrs. Davis",
    "rating": 3.0,
    "message": "These shoes have comfortable heel support and are soft, requiring no break-in.  If you are looking for a shoe that is easy to kick on and off, look further.  The tops of these are soft, pliable fabric that crushes down when you insert your foot.  They require the wearer to bend over and grip the tops, so there is no advantage over a lace-up tennis shoe.  I was looking for a shoe i could kick off at the door when my hands are full and quickly slip on when leaving without bending down.  Guess I'll have to look  for a different band."
  },
  {
    "user": "tracey schultz",
    "rating": 4.0,
    "message": "They're actually quite comfortable. My feet slide forward because the heel is a little high I don't really like that but that's not the fault of the shoe I should have bought a smaller size but I wouldn't have known."
  },
  {
    "user": "Unicorn70",
    "rating": 5.0,
    "message": "I love these. They are so comfy. Vibrant color. Very light weight"
  },
  {
    "user": "Laura Mc521",
    "rating": 5.0,
    "message": "Love the fit, comfort and look of the shoe-I wore them to church then went shopping…for the first time wearing the shoes they were super comfortable! I was apprehensive when I received them in a bag rather than a box, but so far so good!"
  },
  {
    "user": "I'm shy",
    "rating": 4.0,
    "message": "These were for my wife. She’s had a pair I got  for her a year ago and wanted another pair. I ordered the same thing but the new ones are much smaller in width than the original pair. The difference is visibly noticeable in the picture even though they are the same size.  She opted to go with the next size up so we will see. She loves the shoes, on her feet all day at work and the original pair has lasted over a year. Hopefully we can find some that fit again."
  },
  {
    "user": "JErlinger",
    "rating": 5.0,
    "message": "Love that there are no laces and they are comfy. Slip on is really not how I would describe them because you do have to use your hands and wiggle into them, but they are not hard to get on and they are very comfortable. The are nice enough looking that I have worn them to work under a nice pair of dress pants."
  },
  {
    "user": "Twinel L Bradford",
    "rating": 5.0,
    "message": "Love the shoes have bad feet and they are comfortable"
  },
  {
    "user": "Rob Hiatt",
    "rating": 5.0,
    "message": "Slip on, comfortable for long days on feet and durable."
  },
  {
    "user": "Nisha",
    "rating": 5.0,
    "message": "I like it. Light weight, comfortable."
  },
  {
    "user": "rebecca c robbins",
    "rating": 5.0,
    "message": "I bought a second pair to have when the first pair is worn out. That is how good they feel and look. I have looked at ortho shoes and would not be caught dead in them. These have style and comfort, at a great price."
  },
  {
    "user": "Felipe Tovar",
    "rating": 5.0,
    "message": "this was for my wife and she loved them"
  },
  {
    "user": "Tiffany E",
    "rating": 5.0,
    "message": "Iam amputee, this is the best most comfortable shoe ever. Great support"
  },
  {
    "user": "Peggy Fedrick",
    "rating": 5.0,
    "message": "I like the support, comfort, light weight and the appearance they are shape!  I’ve had several compliments from strangers and I have only worn them out twice."
  },
  {
    "user": "Angelica R.",
    "rating": 4.0,
    "message": "I have not worn them long enough to say they are very comfortable. They have a thick insole and have arch support to help with comfort. I am sure they will be great in comfort. My ankle is too small or the shoe fabric is too big for my small ankle. Too me, I was not expecting because the picture image, the tope of the je Kline of the shoe was form fitting to her ankle."
  },
  {
    "user": "Lori",
    "rating": 4.0,
    "message": "Overall I like the shoe but it could use a bit more arch support.  Decent value for the price."
  },
  {
    "user": "Sarah Lyon Liley",
    "rating": 5.0,
    "message": "The shoes are so comfortable but I ordered them a half a size too big. I just got back from Europe. Is there anyway I can exchange them for a half a size smaller? Please let me know thanks, Sarah"
  },
  {
    "user": "Cindy Coy",
    "rating": 4.0,
    "message": "I work on a cement floor in a retail store all day.....I have a high arch and it's so hard to find shoes that are comfortable for me.  These are pretty good....not the best but for a normal foot should be a great shoe.  They are easy to slip on and comfortable with no socks, too."
  },
  {
    "user": "V",
    "rating": 5.0,
    "message": "I have been suffering with so much pain i can hardly stand. These came in and they are nearly as comfortable as the pillow sandals. I wore them most of the day. They are pretty cute for slip on shoes. I bought the taupe and i think i can wear them with most things. Im truly impressed."
  },
  {
    "user": "Cindy Balderson",
    "rating": 5.0,
    "message": "They are the most comfortable shoes ever!  Love them"
  },
  {
    "user": "Jessica",
    "rating": 3.0,
    "message": "I wanted a sneaker that was comfortable, breathable and slip on since my current laced-sneakers I treat as slip-ons anyway. Maybe I bought a 1/2 size too small but while it is comfortable and does the job, I realize my big toe hurts after a while and I eventually start slowing down and maybe even get to the point of just giving up entirely and resorting to another mode of transportation. I live in NYC so walking is done a ton. The other day I just walked from 48th St & 6th Ave to 14th St & 3rd Ave before deciding I couldn't walk in these anymore and took the bus home. I also used to wear these to stand on my feet for about 7.5 hours when I worked as a doggy daycare receptionist where a lot of being on your feet was done and I would just hate the shoe so much at the end of the day and not wear it again for another week. If you need a pair of shoes for a short while say... a quick errand, sure! But if you're looking for a pair of shoes to stand on all day, this isn't it."
  },
  {
    "user": "J9",
    "rating": 5.0,
    "message": "Waitressing and this shoe is great.  Easy to slip on and great arch support.  Highly recommend"
  },
  {
    "user": "Sharon Blickley",
    "rating": 4.0,
    "message": "They are comfortable for walking."
  },
  {
    "user": "Steph",
    "rating": 5.0,
    "message": "I was concerned about the ridges on the insoles. I have inflamed tendons on my feet. While at first uncomfortable my tendons are much improved. The shoes or natural healing I’m not sure but nothing helped for the previous two months. Will definitely buy more pairs."
  },
  {
    "user": "marie gauthier",
    "rating": 5.0,
    "message": "I was able to work 12 hours shift with no discomfort. Good to work at hospital nursing home , overall excellent to work long hours standing. I enjoy them and everyone else love them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes. Very comfortable and they look dressy."
  },
  {
    "user": "Wendy Jackson",
    "rating": 5.0,
    "message": "I’ve only had them for 24 hours but I’ve worn them since I took them out of the packaging. Super lightweight, I’m usually an 8.5 in sneakers, sometimes a 9, I got an 8.5 and they fit perfect. Very comfortable and not slippery to walk on at all. I’ll be getting in white too soon. They really are exactly what I was hoping for at about $40."
  },
  {
    "user": "Faith Abigail Givens",
    "rating": 5.0,
    "message": "I wear these shoes all day at work. They have great cushion and really good arch support."
  },
  {
    "user": "Beverly Davis",
    "rating": 5.0,
    "message": "Will purchase more."
  },
  {
    "user": "Cheryl L. Richardson",
    "rating": 5.0,
    "message": "They were on the narrow side and while comfortable I couldn't wear them to walk a lot because of the slender toe box."
  },
  {
    "user": "Daisey",
    "rating": 4.0,
    "message": "Had to send these back. They were too big in my normal size. A little clunky for  my style. I do think they would be very comfortable to they fit properly."
  },
  {
    "user": "Debra Hayes",
    "rating": 5.0,
    "message": "The fit was very comfortable and true to size."
  },
  {
    "user": "Jo A Rizzutto",
    "rating": 4.0,
    "message": "Would like more arch support"
  },
  {
    "user": "Sheryl Dlugolecki",
    "rating": 5.0,
    "message": "I like the style and comfort of these shoes.  I am on my feet at numerous sporting venues and they work well"
  },
  {
    "user": "crocaddict",
    "rating": 5.0,
    "message": "I purchased the Purple to wear at my son's football games. Love that it is slip on but also love how comfortable they are! The insoles are padded at the ball and heel of the foot. I highly recommend these. they run true to size. I  wear a 9 and bought a 9 and they fit perfectly!!"
  },
  {
    "user": "Patrice Walker",
    "rating": 5.0,
    "message": "Wearing."
  },
  {
    "user": "GT",
    "rating": 5.0,
    "message": "Comfortable fit in my regular size (true to size 7.5) slipping them on is a little bit more cumbersome than I thought, but once on they feel comfortably snug and secure.  They are perfect for me currently because I am just starting to bear weight on my other foot after foot surgery, and most of my flat shoes were to flat and too low compared to the air boot on the other foot .  These ones are the perfect height to allow me to stand and walk straight, with even hips."
  },
  {
    "user": "D. Corso",
    "rating": 4.0,
    "message": "Great comfortable shoe. But the heel a tad too  elevated for me. I felt like I was walking down hill and food wanted to slide forward. But standing it was extremely comfortable but I needed this for walking and standing."
  }
]