[
  {
    "user": "HeyRed",
    "rating": 4.0,
    "message": "I'll admit, I've wanted these purely for the aesthetic—so I'm more willing to push through a rough break-in stage because they're so versatile. They're pretty stiff right out of the box. I wore them for about an hour for the first time to run errands and ended up with horribly clawed up, bleeding sores on my achilles tendon that took a couple of weeks to heal. In fairness, I wore them without socks so that's on me but the back of the heels on these shoes come up higher, are super stiff, and are going to take some wear to get them to be comfortably malleable. I have other leather sneakers of the same style that didn't have the same break-in pain. So buyer beware. I currently have them on for a second wearing, protected with cushier socks to see if that helps with the rubbing. I don't find the cloudfoam insole to be any cushier than other non-athletic sneakers that I have. Other than that, they're as expected. They look good. Decent quality for the price."
  },
  {
    "user": "Kayleigh",
    "rating": 5.0,
    "message": "Quality shoes, which I would expect from Adidas! The heel took a little breaking in, it gave me blisters on the back of my ankle, so I would wear long socks and blister bandages the first few times to prevent rubbing. I found on the third wear they were much better and now they are my go-to shoes!"
  },
  {
    "user": "Jolene C.",
    "rating": 5.0,
    "message": "These are my favorite shoes I buy the same ones over and over mostly because I have wide feet and these are very comfortable, and I got them here for a great price and fast delivery without having to go to the store what else can you ask for"
  },
  {
    "user": "Nancee Hall",
    "rating": 5.0,
    "message": "I really love these shoes. I’ve worn them for hours and hours two days in a row, all through Disneyland and California Adventure. I have a bad ankle from two sprains and a broken foot over the years. These shoes are very comfortable and  support my ankle. I haven’t had any issues with the backs rubbing my ankles, but I’m wearing low athletic socks with high back tabs (also Adidas). I also love that these are really easy to keep clean, and also easy to clean off if they do get a little mark on them. Great buy."
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "I love these shoes.  They are so comfy and I can walk around stores and wear them all day without any issues.  They have a wider toe so they are comfortable all around.  They are true to size."
  },
  {
    "user": "Chelsie",
    "rating": 5.0,
    "message": "I love these shoes! They've made me a true adidas fan. Wider fit than Nike which is perfect for me (I'm borderline on wide fit shoes) and they didnt tare my feet up while being broken in. Highly recommend 👌"
  },
  {
    "user": "Cookielishious",
    "rating": 5.0,
    "message": "This is my 2nd or 3rd pair of these sneakers. I like them to look fresh, so I replace them every spring. I wear them with everything: dresses, capris, skirts & jeans. They're super cute, clean, classic & very street style and they're also comfortable! I wear them to work bartending- where they take a beating, and when I ride my motorcycle. Perfect for work or a fun day out!"
  },
  {
    "user": "Andi",
    "rating": 5.0,
    "message": "These shoes are so cute and so comfortable. I am usually a 6.5/7 and I sized down to 6.5 and they are perfect! They are great for walking around and are heat quality. These are legitimate Adidas and a great price. I wouldn’t recommend them for working out since they are not that flexible and would crease/fall off your feet. But just for everyday waking and wear they are great!"
  },
  {
    "user": "cmt",
    "rating": 5.0,
    "message": "These are cute, cute, cuuuute! They are leather and great for walking on wet grass and mud  during the several walks in the park i take with my dog daily.  They wipe clean and stay looking adidas fresh!  I have gotten numerous compliments.  The metallic trademark \"three stripes\"  really pop.  Love them!"
  },
  {
    "user": "Lux123",
    "rating": 5.0,
    "message": "I bought for my 14 year old daughter , a size 7 shoes , it fits her perfectly !  . We are really happy with the purchase!"
  },
  {
    "user": "Martha A.",
    "rating": 5.0,
    "message": "Siempre quise este tipo de tennis, y por fin los compré son tal cual como salen en la foto y son cómodos"
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "They are all around great shoe. Can dress up or down. I wore them after right after buying to a concert and walked long distance and they did not disappoint. Would highly recommend"
  },
  {
    "user": "Chloe L",
    "rating": 5.0,
    "message": "I was nervous to buy these since there were many reviews stating people received fakes. I received real Adidas, or at least they are indistinguishable from the real shoes. I even researched ways to check online. Very comfortable. I usually wear a size 9 but went with an 8 and a half; I actually could have gone with an 8. These are slightly longer than my size 9 Van's. Overall very satisfied!"
  },
  {
    "user": "Leonardo herrera",
    "rating": 5.0,
    "message": "Just as expected, my wife loves this shoes"
  },
  {
    "user": "Jeffery Wood",
    "rating": 4.0,
    "message": "I usually wear a 9, so that’s what I got, they’re only a little bit too big, but I’d rather them be bigger than too small.  Very comfortable, great for fall shoes."
  },
  {
    "user": "Sonia Masterson",
    "rating": 5.0,
    "message": "These match almost everything! They are cute and comfy!"
  },
  {
    "user": "Paula G.",
    "rating": 5.0,
    "message": "My wife Loves these Shoes , fit & look as Expected !! Thank You 😊"
  },
  {
    "user": "sandey",
    "rating": 5.0,
    "message": "They are more comfortable than I expected. Super cute and versatile"
  },
  {
    "user": "MARY SMITH",
    "rating": 4.0,
    "message": "Love the look of these sneaks , heel to toe is correct size however , the upper heel is very stiff, has given me a calouse.  Leather needs to be broken in for a comfortable fit."
  },
  {
    "user": "Elisa Pilarte",
    "rating": 5.0,
    "message": "Lo utilicè para mi viaje a Alemania :) muy cómodos! y combinable con todo outfit."
  },
  {
    "user": "MAIN",
    "rating": 5.0,
    "message": "This is my most honest review. I hate reviews that just say “perfect” or “it sucks” because you’re not sure if you should trust the reviews. But theses shoes are honestly so amazing. I re bought these in black because my old ones were pink but they lasted 6 years!! They’re are sutil nice just a bit dirty and the bottom was worn, it still had some years but it was time for a change. These shoes are nice, pretty, and will last you a while!"
  },
  {
    "user": "yolanda cornejo",
    "rating": 5.0,
    "message": "Me gusto porque Son cómodos y un excelente precio"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Read above message"
  },
  {
    "user": "Earl R. Miranda",
    "rating": 5.0,
    "message": "My daughter can't stop wearing. Now if I can only get her to put them away at night ..."
  },
  {
    "user": "Katie F S",
    "rating": 5.0,
    "message": "These shoes are classic! So comfy & fit as expected. I wear several other ADIDAS styles but needed a clean pair for a casual mama look. I love the reflective stripes & I swear these shoes make such a difference. I can wear workout clothes but then look so “put together” with these on!"
  },
  {
    "user": "Diana Montero",
    "rating": 5.0,
    "message": "Son excelente, llegaron en perfectas condiciones, lo recomiendo al 100%"
  },
  {
    "user": "Gaby Mora",
    "rating": 5.0,
    "message": "Muy comodos simplemente hermosos"
  },
  {
    "user": "Patricia",
    "rating": 5.0,
    "message": "Fits perfectly well and it’s comfortable"
  },
  {
    "user": "AmazonQueen",
    "rating": 5.0,
    "message": "The shoes are comfortable as ever , fit true to size and had a great sale price.. Win!"
  },
  {
    "user": "Mishel Vasquez",
    "rating": 5.0,
    "message": "Siempre pido este tipo de zapatillas y son las mejores. Me encantan 😍"
  },
  {
    "user": "Lalah",
    "rating": 5.0,
    "message": "I like everything the sizing was perfect O have no complaint."
  },
  {
    "user": "K Frerichs",
    "rating": 5.0,
    "message": "I love these shoes so much for casual everyday wear. I don’t think they’d be great for working out in. It took me a couple of days to break them in. The first few times I wore them, they were rubbing my ankles, and I was worried. I loved them so much I stuck with wearing them. Happy I did! They do longer bother me, and I can wear them all day. I usually wear a 7.5 tennis shoe and occasionally an 8 in boots and some shoes. I stuck with my normal 7.5 size, and they fit great. Recommend 1,000%."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They have great support and cushion for the sole of the foot. They are great looking! The only thing is that they squeak when I walk because they are synthetic leather. I’m all for vegan shoes though so I don’t mind it."
  },
  {
    "user": "christina",
    "rating": 4.0,
    "message": "The cloud foam is nice. I wear them to work and it feels like I'm walking on clouds or on air."
  },
  {
    "user": "Norymar Gómez",
    "rating": 5.0,
    "message": "Talla perfecta 8.5 corren normal y son muy bellos"
  },
  {
    "user": "Dover",
    "rating": 4.0,
    "message": "Cute shoes but heavy. Don’t think they would work well for workouts. More of a fashion shoe. The toe-box was small and caused discomfort."
  },
  {
    "user": "Laura S.",
    "rating": 5.0,
    "message": "Was my mistake I order wrong size , but they were beautiful 🤩"
  },
  {
    "user": "Heather S",
    "rating": 5.0,
    "message": "Came exactly as pictured/described. Squeaky clean and in great shape. Love the iridescent stripes!"
  },
  {
    "user": "laneylord",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Meg Slope",
    "rating": 5.0,
    "message": "I usually wear a 7.5, went with the 7 after reading reviews. I have a narrow foot and the 7 is perfect. They are a bit stiff and need to be broken in."
  },
  {
    "user": "isabel de lima",
    "rating": 5.0,
    "message": "I use this shoes for work , they are comfy but I should have down 1/2 size . But it’s ok"
  },
  {
    "user": "S. YEAKEL",
    "rating": 5.0,
    "message": "I love Adidas shoes, one of the only brands I’ll wear!  Stan Smith and Super Stars are the best for fashion, I have plenty!  These are so cute, we are a Disney family so had to have them!"
  },
  {
    "user": "Olivia Gores",
    "rating": 5.0,
    "message": "I don't wear tennis shoes too often and these are perfect. They're nice, comfortable, and match just about anything!"
  },
  {
    "user": "13Flowers",
    "rating": 5.0,
    "message": "Love the look and feel of these shoes! I wore these working a concession standing for 5 hours. My feet didn’t hurt."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Love these shoes they were perfect"
  },
  {
    "user": "Nicklas Vang",
    "rating": 5.0,
    "message": "I bought this when it was on sale and I love it. I almost bought one at the store for 80 but thank goodness I have Amazon lol. Buy this, you won't regret it."
  },
  {
    "user": "Jackey",
    "rating": 5.0,
    "message": "Shoes were a good fit, as expected. Good quality and durable."
  },
  {
    "user": "Jb",
    "rating": 5.0,
    "message": "Great for both comfort and work out"
  },
  {
    "user": "Dori D.",
    "rating": 4.0,
    "message": "These are adorable but way over priced. But my daughter-in-law is a Disney addict and I will do anything for my kids"
  },
  {
    "user": "Cindy",
    "rating": 5.0,
    "message": "Love then, very comfortable"
  },
  {
    "user": "BeckyRene",
    "rating": 5.0,
    "message": "These are so super cute and very comfortable.  The ONLY issue I have is the back/heel part is kinda high and rubs a bit on ankle, but am hoping with wear it will get better.  Can't tell if these are or aren't REAL addidas (price) - but no one else has been able to tell, sooooooooo?"
  },
  {
    "user": "Ann Muia",
    "rating": 4.0,
    "message": "This is a lovely shoe. it is very comfortable and ideal for walking."
  },
  {
    "user": "Jordan Blewett",
    "rating": 5.0,
    "message": "For the price I was expecting more of a lesser of value sneaker however walking in them while traveling, they were perfect for casual wear and comfort. Overall 10/10"
  },
  {
    "user": "Joan Shown",
    "rating": 5.0,
    "message": "Gift for my daughter she loved them"
  },
  {
    "user": "K. Hoffman",
    "rating": 5.0,
    "message": "I tried the Adidas cloud workout shoes and was so disappointed in the design and quality but these are very high quality. Not a ton of arch support but that can be remedies with an insert."
  },
  {
    "user": "Alejandra Mayorga Lecona",
    "rating": 5.0,
    "message": "I use mis Adidas sneaker for my job and the support for my soles are very good! highly recommend!! thanks ADIDAS!!!!"
  },
  {
    "user": "Carolyne",
    "rating": 5.0,
    "message": "These shoes look very stylish and are very comfortable."
  },
  {
    "user": "Mitchell",
    "rating": 5.0,
    "message": "I absolutely love my shoes. I am a teacher and they are perfect for all day wear. I also get so many compliments about these shoes."
  },
  {
    "user": "Elan Telem",
    "rating": 4.0,
    "message": "I used to be a 6.5 but I always sized up to 7s in workout sneakers. I had a baby 2.5 years ago and my feet rebel in any of my 6.5 shoes now so I bought the 7 thinking they’d fit nicely for a walking shoe but they’re like boats. I’m so disappointed because they were a great prime deal and they’re BEAUTIFUL but c’est la vie. Don’t be sad like me!"
  },
  {
    "user": "KS",
    "rating": 4.0,
    "message": "The shoes are real, not a counterfeit, it passed all the checklist. Came in a adidas box, not a sketchy non-logo box. The adidas logo matches the real one with side by side comparisons, I have another pair of shoes I bought from a physical adidas store. Quality stitches, and the tags with different serial number, etc. I got the White/Silver Metallic/Silver Metallic color, the holographic looking one. It's very cute, absolutely loved the design. BUT The material it's made of is super stiff. The collar is a bit too high, and if I wear my shoes tight like I do with running shoes, it rubs against the heels and make it blister/bleed. So I always have to wear it kind of loose. Because how stiff the material is, the section between your toes and the top of your feet, where it normally bends as you walk, the shoe presses down on it and it's very painful. I am a college student, so I walk about 1-2miles to classes and back everyday. I wore it at least 3 times a week since Sep. 2021, it's now Feb 2021. The materials have soften a bit, but still never completely \"broken in\". The part where it bends is still stiff and painful if walking a long distance. Definitely worth it for a girl's day out kind of shoe. But not for everyday or long distance walking."
  },
  {
    "user": "BD Reynolds",
    "rating": 3.0,
    "message": "Let me start this with these are probably the most comfortable tennis shoes I own. I can wear them all day at work (hairdresser) and my feet and legs don’t bother me at the end of the day. They do run a little on the big side. My only complaint is I think I got a defective shoe. My right toe area is all wrinkled and feels significantly softer/different from the left shoe’s toe area, which has stayed firm and not wrinkled. My right shoe isn’t going to last as long as the left simply because of this defect :(. I probably won’t purchase another pair of these from Amazon because I was to be able to feel the toe surface of the shoe before I purchase to make sure they are the same."
  },
  {
    "user": "Tehya",
    "rating": 3.0,
    "message": "Amazon Prime Day Purchase - Bought these for a Disney trip coming up, had been deliberating between these and sketchers as they were both highly rated on the Disney forums for comfort. I did buy the sketchers but then they had these discounted on prime day so I thought- why not? Well I guess you really get what you pay for because they came damaged. A bit stiff so I'll likely be wearing them up until Disney to break them in."
  },
  {
    "user": "Mohamed",
    "rating": 5.0,
    "message": "Love them! Very comfy!"
  },
  {
    "user": "Dani",
    "rating": 4.0,
    "message": "I am pretty sure I've worn an 11 for half my life. I have what we refer to as \"Flintstones\" feet in my family. Squares with toes. Even with big wide feet, these are big. So, don't be afraid to order your size or order down a half. I kinda wish I did."
  },
  {
    "user": "Julie J.",
    "rating": 5.0,
    "message": "These are so comfortable. I love adidas. I’m a teacher and on my feet all day. They are supportive."
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "These shoes are a must-have! I would not recommend purchasing them for working out, but if you want a good shoe for casual outfits, I highly recommend. These were very affordable as well which is always a plus!"
  },
  {
    "user": "KAL Bear",
    "rating": 5.0,
    "message": "This sneaker was everything I hoped for and so much more.  They are now my favorite shoe.  The leather wipes clean, the width is roomy but not too roomy, the inside of the shoes are like a pillow for my feet. The arch is not really supportive but I'm wearing them as a casual shoe, not for working out.  The only actual issue I had was a one day break in of the heel of the shoe.  It was rubbing the back of my heel.  I solved it by pulling back on them several times throughout the day and they were perfect from then on.  I want more colors. Buy this shoe!"
  },
  {
    "user": "Rose",
    "rating": 5.0,
    "message": "Nice combination, good shoes."
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "Like a dressing shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Ok I ordered down a 1/2 size and wish I ordered down even more,  I wear a 10 with my  Brooks and On’s, so I ordered a 91/2, a 9 would have  been perfect, these are the real deal and the look is too cute and sporty"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are comfortable, practical, and actually cute."
  },
  {
    "user": "E kenad",
    "rating": 5.0,
    "message": "I wear these almost every day to work. Very comfortable and stylish looking."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Cute shoe. Runs a little big."
  },
  {
    "user": "Elizabeth H.",
    "rating": 4.0,
    "message": "I love the look of these and can wear them all day as long as I am not doing a lot of activity or walking."
  },
  {
    "user": "Kendallmarie00",
    "rating": 5.0,
    "message": "I wear these all the time with all my casual fits. Super cute and stylish"
  },
  {
    "user": "Patti H",
    "rating": 5.0,
    "message": "My 3rd pair. Look great, fit great. Perfect for my walks in the morning."
  },
  {
    "user": "Malka",
    "rating": 3.0,
    "message": "firstly, it's fake i checked the numbers in the tounge and they're the same one way to tell they're fake also its not a nice design its too rounded and matte, and if i remeber correctly it had a small stain on them otherwise it was fine i took two stars off; one for the lack of asethetic beauty, and one for the little support it seemed to give in any case it was too large for my feet so it could be that it would support your feet it just didn't seem to be super supportive in a nutshell if you don't mind not getting the real thing (as long as everyone else sees the logo:) its a fine fashion shoe read not sports or running shoe"
  },
  {
    "user": "Mom of 2",
    "rating": 4.0,
    "message": "Really cute comfy shoes, I wear a 8.5, fits a Lil loose but don't want to chance getting half a size smaller and be too tight. Overall still happy with my purchase"
  },
  {
    "user": "E",
    "rating": 5.0,
    "message": "They fit pretty true to size, if anything they run a little big. Love these shoes."
  },
  {
    "user": "Robert Anthony",
    "rating": 5.0,
    "message": "I have plantar fasciitis and I have struggled for years to find a good shoe that won’t kill my arches. I was even fitted for a shoe specifically for foot pain, and 30 minutes into walking it still hurt. These shoes have been a lifesaver for me. I can walk and my feet don’t hurt!! They’re so comfortable and stylish. I never write reviews but I love these shoes and in a way, they’ve given me some freedom. Highly recommend!!"
  },
  {
    "user": "Michel'le",
    "rating": 5.0,
    "message": "Pleased to say I received a genuine pair of shoes! They’re gorgeous & I can’t wait to wear them. Highly recommend."
  },
  {
    "user": "glenda l.",
    "rating": 5.0,
    "message": "Quality of shoe is excellent, comfortable and holding up very well."
  },
  {
    "user": "LAURYN",
    "rating": 5.0,
    "message": "This sneaker model are best known as tennis kicks. I am a size 6 and purchased a 6, however,  I have 3/4” remaining space within the shoe. I have added an extra insole and fixed this issue without my toes & toenails smashed at the front, yey! Really great price. perfect, supportive sneaker for squats, lunges and walking."
  },
  {
    "user": "Noe G Rodriguez",
    "rating": 5.0,
    "message": "Arrived on time and fit as expected. No issues wearing all day at Disney World on one of the first few wears. Would purchase again!"
  },
  {
    "user": "Karla",
    "rating": 5.0,
    "message": "Todo muy bién"
  },
  {
    "user": "Juan Palacios",
    "rating": 5.0,
    "message": "Cómodo y de calidad"
  },
  {
    "user": "Lisandra Gonzalez",
    "rating": 5.0,
    "message": "These are comfy for walking around all day. I bought them for a trip where I did tons of walking and they were nice and comfortable, however they did hit the back of my ankles so I recommend wearing them with socks that cover the back of your ankles"
  },
  {
    "user": "Andrea Martin",
    "rating": 5.0,
    "message": "I bought these for Pickle Ball (which if you haven’t tried it you really need to, it is SO fun!!). I bought a pair of ADIDAS on Amazon before and they had a smooth leather, these have a texture to the surface. I was concerned that I got a fake pair (read some reviews about that after I received them) but did some research and they are authentic ADIDAS.  They fit as expected and I love them."
  },
  {
    "user": "Pamela",
    "rating": 5.0,
    "message": "Wore these to a baseball game, ended up walking several miles in these brand new and they were super comfortable. And did I mention how cute they are? Classic adidas’s with some leopard flare. Yes, please!"
  },
  {
    "user": "Meaghan",
    "rating": 5.0,
    "message": "I scored a really great deal on these shoes during Prime Days.  I'm a huge fan of Adidas in general, but their cost has gone up more than I'm willing to spend on them, so I was very pleased to find this on sale.  If you don't mind paying crazy prices for sneakers, these are a good buy for what you get anyway."
  },
  {
    "user": "Sherry Dickson",
    "rating": 5.0,
    "message": "True to size, sharp looking and comfortable."
  },
  {
    "user": "kuti flewellen",
    "rating": 5.0,
    "message": "Daughter following in her dads footsteps"
  },
  {
    "user": "Clay & Becky Hendrix",
    "rating": 4.0,
    "message": "I have received a ton of compliments while wearing these. I was nervous to order white, but they clean up so easily."
  },
  {
    "user": "CJ",
    "rating": 4.0,
    "message": "I’m a true 10, ordered these in a 10 and they were too big. I immediately sent them back and ordered a 9.5. At first I thought they were fine so I wore them to go out. But they are also too big and rub the back of my heel because I can’t tie them tightly enough.  I’ve already worn them several times because they’re cute and it was too late to return them, but I wish I would have ordered a 9. My advice, be prepared to possibly order two half sizes down, depending on your foot.  I don’t know if these are sized for men by mistake? Other than the length issue, they really are super comfy through the footbed, roomy in the toe, are easy to slip on and off which is great for airport travel - overall I’m happy with them. Next time I’ll size down again, though."
  },
  {
    "user": "Carolina Hernández",
    "rating": 5.0,
    "message": "Quedan bien"
  },
  {
    "user": "MaxWilliams",
    "rating": 5.0,
    "message": "Zapatos de buena calidad, le quedaro muy bonitos, llegaron en la talla adecuada"
  },
  {
    "user": "Maria luisa Hurtado",
    "rating": 5.0,
    "message": "Muy buenos como esperaba"
  },
  {
    "user": "AHM314",
    "rating": 5.0,
    "message": "I'm a Size 8 in women's, but other reviews here convinced me to order Size 7.5 - so glad I did. They fit perfectly, but did take a couple wears to break in. Notably, I have had to wear taller socks with these because I immediately sensed that the backs would rub against/cut my ankles if I wore crew cut socks with them. This is the only reason I give them 4/5 stars for comfort; hopefully with continued wear this won't be an issue. Great sneakers, fashionable enough to wear with dresses and skirts, too."
  },
  {
    "user": "Toni Megna-Graham",
    "rating": 5.0,
    "message": "Comfortable and cute"
  },
  {
    "user": "Gigi E",
    "rating": 5.0,
    "message": "Ohhhh my gooodness!! Can we just look at these?? As a huge Dis-nerd and lover of adidas it’s like the best of both worlds!! I purchased Minnie Mouse adidas for my little one like 3 years ago. But when I stumbled across these as I was looking for Red adidas for the 4th I knew without a doubt I had found “the shoes” 😂 Love love love!!!"
  }
]