[
  {
    "user": "Raed Alzahrani",
    "rating": 5.0,
    "message": "I bought the shoes for my sister as a gift, who's on the other end of the world (Middle East). It's kind of amazing how I got the right size. to me the shoes looks beautiful and can be integrated with any fit. The quality is perfect, no excess glue on the sides, no loose strings and the shoes didn't get squashed in the box. as it turned out these shoes are kind of trendy at the moment, many female relatives asked me to get them the same shoes from the US. so it's safe to assume that this would make a good gift to any girl."
  },
  {
    "user": "Yasmin Wong",
    "rating": 5.0,
    "message": "Le gusto mucho los zapatos que enseguida se los puso era el modelo que ella quería"
  },
  {
    "user": "Zoe C.",
    "rating": 5.0,
    "message": "Shoes exactly like the picture.  I like it because it’s pretty and comfortable."
  },
  {
    "user": "Benjamin C.",
    "rating": 5.0,
    "message": "She wanted them. She got them. She is extremely happy with them! Shipping was quick too."
  },
  {
    "user": "ANNA SOTELO",
    "rating": 5.0,
    "message": "This item runs a little big I sized down 1/2 a size . It was perfect. The are a bit bulky but ok"
  },
  {
    "user": "Liliana Barahona",
    "rating": 5.0,
    "message": "Son muy cómodos me encanta"
  },
  {
    "user": "fesy Oloye",
    "rating": 5.0,
    "message": "Very comfortable, and good quality. My daughter likes it and wears it almost daily."
  },
  {
    "user": "Rebecca",
    "rating": 5.0,
    "message": "I ordered this for my daughter. It fit and just as she was  expecting.  It did take a little bit of time to break it in as she also expected."
  },
  {
    "user": "Beth",
    "rating": 5.0,
    "message": "Get these they will not disappoint..goes great with jeans, skirts and sneaker dresses"
  },
  {
    "user": "Sandy",
    "rating": 5.0,
    "message": "My granddaughter loves these shoes!  She has 2 pair-one of which is the design-yourself shoes!  She loved that process.  Wears them everywhere -she looks great!!"
  },
  {
    "user": "Lesley",
    "rating": 5.0,
    "message": "These converse sneakers are so great!  Go with everything thing and extremely cool. Comfy and perfect support."
  },
  {
    "user": "Marion B",
    "rating": 4.0,
    "message": "Let me start by saying you could NEVER GO WRONG with a pair of converse! They do fit a bit loose on me but are comfy. I typically get low tops and wear a size 7.5 wide or 8 US women size. I went with the 8 and kept it only because I didn’t want the hassle of returning them and reordering. When I got the shoes and box were all smashed and the shoes were already scuffed and dirty. So if you are a stickler about your shoes being perfect upon arrival you may be disappointed. Luckily, I got these to kick around in so it wasn’t a big deal."
  },
  {
    "user": "Teresa Rivera",
    "rating": 5.0,
    "message": "I really love them, i got a size 7.5 and fit perfectly."
  },
  {
    "user": "Jacqueline",
    "rating": 5.0,
    "message": "Great"
  },
  {
    "user": "nikila mcmillian",
    "rating": 5.0,
    "message": "I didn't dislike it I bought it for my granddaughter 20th birthday she loved it thanks ☺️"
  },
  {
    "user": "Ángela Avila Martínez",
    "rating": 5.0,
    "message": "Llegaron a tiempo y son como los que pedí muchas gracias"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "No disike"
  },
  {
    "user": "Kelley andrews",
    "rating": 5.0,
    "message": "They are even better! Well this platform style was super comfortable! The fit is right on point. No need for break in time! Love these!"
  },
  {
    "user": "PJ",
    "rating": 4.0,
    "message": "These came in a nearly destroyed box so I was suspect about the source.  But my daughter loves them and the smell went away pretty quickly."
  },
  {
    "user": "Katty",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My granddaughter is happy with the sneakers"
  },
  {
    "user": "Jennifer R",
    "rating": 5.0,
    "message": "So adorable"
  },
  {
    "user": "barneo92",
    "rating": 5.0,
    "message": "I love them so much. So cute and comfy."
  },
  {
    "user": "Rena",
    "rating": 3.0,
    "message": "I know their platform but they are really not very easy to maneuver in. I'm not very fashionable so don't really know what to wear with. Cute though maybe no age approaches I'm 57."
  },
  {
    "user": "Linda",
    "rating": 5.0,
    "message": "I love the Converse and they fit perfect"
  },
  {
    "user": "Nichole Jayne",
    "rating": 5.0,
    "message": "I love how you can wear them with anything and how comfy they are! Great quality shoe and good price."
  },
  {
    "user": "RT",
    "rating": 5.0,
    "message": "Comfortable and stylish"
  },
  {
    "user": "Dora landaverde",
    "rating": 5.0,
    "message": "Me encantan ya tengo meses con ellos y la verdad esta súper cómodos"
  },
  {
    "user": "Janet Datil",
    "rating": 4.0,
    "message": "It was a GIF"
  },
  {
    "user": "Mellowhead",
    "rating": 4.0,
    "message": "My granddaughter loves them"
  },
  {
    "user": "Irvin Mariano",
    "rating": 4.0,
    "message": "Fits good"
  },
  {
    "user": "Valued customer",
    "rating": 5.0,
    "message": "Thankfully the shoes were actually pink and not closer to a purple on the spectrum. Thank you!"
  },
  {
    "user": "Vickie Pratt",
    "rating": 5.0,
    "message": "Loved everything ❤️"
  },
  {
    "user": "Tianna",
    "rating": 5.0,
    "message": "Love them so much! Fit perfect and are very cute!"
  },
  {
    "user": "Brenna",
    "rating": 5.0,
    "message": "Love the style, very comfortable!"
  },
  {
    "user": "Sarah e wise brown",
    "rating": 5.0,
    "message": "My daughter loves these, perfect back to school shoes"
  },
  {
    "user": "Brooke H",
    "rating": 5.0,
    "message": "These are one of the most comfortable sneakers I own. Very quality, cute, and wearable."
  },
  {
    "user": "Jenniffer bonifacio",
    "rating": 5.0,
    "message": "They fit perfectly and arrived in a timely matter"
  },
  {
    "user": "Pepa",
    "rating": 5.0,
    "message": "Compré el calzado en talle femenino que es el que figuraba en la pagina pero yo debía comprar masculino. Solo hay q prestar atención"
  },
  {
    "user": "Rani",
    "rating": 5.0,
    "message": "These are SO cute! I was skeptical because there weren’t many reviews, but these shoes are so comfy and high quality. These fit true to size for me. I know that they tend to run a smidge larger, so just be sure you do your research on chuck taylor sizing! All in all- this was a 10/10 purchase & they are so worth the price."
  },
  {
    "user": "Taylor Dederick",
    "rating": 5.0,
    "message": "They fit so perfectly be the quality is exactly what I expected. I used to buy converse when I was younger and these are my first new pair in years and I’m so happy! The color is beautiful!"
  },
  {
    "user": "Cilene Montaña",
    "rating": 5.0,
    "message": "Envío rápido, talla correcta . Genial!"
  },
  {
    "user": "Romero family",
    "rating": 3.0,
    "message": "Even tho they were new it had a couple of stains, my daughter didn’t mind them but I definitely would have return them if I could."
  },
  {
    "user": "ana maria avalos",
    "rating": 5.0,
    "message": "El producto me gusto. Me molesto la equivocacion del color"
  },
  {
    "user": "D. Hockaday",
    "rating": 3.0,
    "message": "These sneakers were beautiful, but they sent the wrong size. Returned for refund."
  },
  {
    "user": "Maria",
    "rating": 5.0,
    "message": "Exactamente lo que ordene en el tiempo indicado"
  },
  {
    "user": "Paul Nelson",
    "rating": 5.0,
    "message": "Sweet Shoes 🤗"
  },
  {
    "user": "marcela villarreal",
    "rating": 5.0,
    "message": "El producto llegó como esperabamos, la talla es correcta y están muy bien los converse. Llego en la fecha programada, sin contratiempos."
  },
  {
    "user": "Mary Messineo",
    "rating": 5.0,
    "message": "Have gotten a lot of compliments on these shoes, the lifted sole adds a lot of cushion and comfort and added style that is trendy right now"
  },
  {
    "user": "Christina",
    "rating": 5.0,
    "message": "Shoes are super cute! The fit is comfortable. I’m typically a 7.5 and ordered a 7.5. It did fit a tiny bit loose but it didn’t make much of significant difference."
  },
  {
    "user": "Samsung",
    "rating": 5.0,
    "message": "Excellent quality"
  },
  {
    "user": "Jennmend",
    "rating": 5.0,
    "message": "Son perfectas"
  },
  {
    "user": "Ana sofia",
    "rating": 5.0,
    "message": "Igual a como se ven en la foto"
  },
  {
    "user": "Alyson R.",
    "rating": 5.0,
    "message": "Arrived in a timely manner and fit perfect. My Daughter loves these shoes."
  },
  {
    "user": "Gisell Correa Valencia",
    "rating": 5.0,
    "message": "Great"
  },
  {
    "user": "Alejandra",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Belmontegirl",
    "rating": 5.0,
    "message": "Super comfortable and they look great. Just size up one size. Fits small"
  },
  {
    "user": "Jasmine",
    "rating": 2.0,
    "message": "These shoes are cute but they gave me huge blistered on both my heels . Too scared to wear them again. Wish I could return"
  },
  {
    "user": "Deborah Martin",
    "rating": 2.0,
    "message": "Probably would have loved these shoes, very cute, however they sent a size 9.5 in the 7.5 box. When I wanted a return, sale had ended and could only get gift card amount. Really disappointed."
  },
  {
    "user": "yes",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Rytsy",
    "rating": 5.0,
    "message": "Me encantan"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "She loved them and arrived on time."
  },
  {
    "user": "brittni fernandez",
    "rating": 2.0,
    "message": "Size down at least a whole size. Way too huge"
  },
  {
    "user": "Eku",
    "rating": 2.0,
    "message": "The product quality was good but they sent the wrong size. I ordered 7 but they sent 7.5 and it was too big. It costed me $10 to return the product. So disappointed that the size was wrong. Wasted my time and money."
  },
  {
    "user": "Castle",
    "rating": 1.0,
    "message": "Description says WOMENS CONVERSE so I ordered an 8 but these are huuuge! These are mens sizes! Convert to womens sizes when ordering! Should have gotten a 6!"
  },
  {
    "user": "Joseph Sparapani",
    "rating": 1.0,
    "message": "I didn’t like how I got the wrong shoe The shoe I got had white insides and the logo is not on the right sides Now the shoe I had ordered had gold insides and the logo was facing the out side like actual legit converse shoes do"
  },
  {
    "user": "Kelly Bonawitz",
    "rating": 1.0,
    "message": ""
  },
  {
    "user": "Dani",
    "rating": 1.0,
    "message": ""
  },
  {
    "user": "Liz",
    "rating": 1.0,
    "message": "Box came busted up. The converse patch on wrong side of shoe and very messed up. Definitely a scam definitely shouldn’t pay 80$ for some fakes."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Please order 2 size down. This is a very oversized shoe. I ordered  size 9.5 and I had to send it back. It’s like a sailing boat to China. Too big 😂"
  },
  {
    "user": "Sharon Clark",
    "rating": 1.0,
    "message": "My grand daughter was terribly disappointed with the fact that she was sent two left shoes!!!"
  },
  {
    "user": "Anne",
    "rating": 1.0,
    "message": "VERY NARROW!"
  },
  {
    "user": "Gloria",
    "rating": 4.0,
    "message": "Hola buenos días !! No me gusta los zapatos y me gustaría devolver este producto ya que no son  lo que me imaginaba"
  },
  {
    "user": "Rachel",
    "rating": 3.0,
    "message": "I've never had a pair before, so not sure if this is how it's supposed to be.  They are soft, and feel nice but my feet slid too much to the side while walking."
  },
  {
    "user": "Paws;)",
    "rating": 5.0,
    "message": "I like everything about it because it came earlier than expected and in perfect condition and it also fits perfectly and matches all my outfits even dresses"
  },
  {
    "user": "💖",
    "rating": 5.0,
    "message": "Todo el color la talla"
  },
  {
    "user": "Sheila Stodder",
    "rating": 5.0,
    "message": "Ordered for my granddaughter and she loves them  Prefect"
  },
  {
    "user": "HA",
    "rating": 5.0,
    "message": "big base like high tops"
  },
  {
    "user": "E. Giraldo",
    "rating": 5.0,
    "message": "My daughter loved them.  They got there on time for her birthday."
  },
  {
    "user": "Ligia Soto Gonzalez",
    "rating": 5.0,
    "message": "Perfecta la talla, super lindas y cómodas"
  },
  {
    "user": "Stephanie Falcon",
    "rating": 5.0,
    "message": "More comfort than another converse"
  },
  {
    "user": "Aaliyah Staffold",
    "rating": 5.0,
    "message": "Very cute came as expected just like the pictures🖤!!"
  },
  {
    "user": "Stephanie",
    "rating": 5.0,
    "message": "Can't wait to pair these with some leather leggings so cute get em"
  },
  {
    "user": null,
    "rating": null,
    "message": "Love these trainers ❤️ Just be ware of sizing as it’s not Uk standard."
  },
  {
    "user": null,
    "rating": null,
    "message": "I was hesitant at first because I couldn’t try them on obviously but they are perfect, on the converse website their sizing chart size to do a half size down for this style of shoe, I’m usually an 7 and got 6.5 womens and they fit perfect so I suggest to do the same!"
  },
  {
    "user": null,
    "rating": null,
    "message": "I have 4 pairs of chucks. 1 pair of high tops, two low and low platforms. These feel thicker than all my other pairs. Im not sure if they are knock offs or converse started making their shoes thicker with double layers if textiles but something just seems off! They fit large in comparison to my others but they are good  quality!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Excellent product, quite pricey and high duty that got refunded which was a surprise.  Delivery was very prompt.  Granddaughter loves her grampa🥰"
  },
  {
    "user": null,
    "rating": null,
    "message": "Usage personnel... produit de qualité..."
  }
]