[
  {
    "user": "NitaK",
    "rating": 5.0,
    "message": "This is my fourth pair of these shoes.  I've had these for many years, they never go out of style.  I wear a 7N and the 7M fits my foot perfectly.  I love these shoes!"
  },
  {
    "user": "Tamalyn Dawson",
    "rating": 5.0,
    "message": "Happy with product. Like the brand because these shoes last a long time. They are also good for walking outside. I need this because I spend so much time outside and I take long walks for exercise. I have had the soles of shoes wear out quickly due to  time spent walking outside especially on hard areas. This brand seems to last longer and better."
  },
  {
    "user": "Anika J.",
    "rating": 5.0,
    "message": "I had to exchange this shoe. I bough a 9.5 for my 11year old and it was too small. Shoe is a little narrow and the sizes run small. I exchanged it for a 10.5 which fit her. So I would suggest sizing up by one size. Other than that the shoe is cute on her feet, easy to clean and seems comfortable so far"
  },
  {
    "user": "Sharon",
    "rating": 4.0,
    "message": "The product was perfect just didn't fit my foot."
  },
  {
    "user": "Liz Granillo",
    "rating": 4.0,
    "message": "I ordered 1/2 number bigger because of other reviews, they’re comfortable, however my feet are narrow, ordered size. 8.5 and normally wear size 8."
  },
  {
    "user": "Jackie Daugherty",
    "rating": 5.0,
    "message": "I bought Reebok products for years and then kind of drifted away for a while. Saw them again on Amazon and bought a pair. I like them because they are comfy and not the chunky look of a lot of other brands. Very good price and got them almost within hours of placing my order"
  },
  {
    "user": "Barbara",
    "rating": 5.0,
    "message": "Love the look. So far quite comfortable without sox. I ordered my regular size, 8.5, and they fit perfectly."
  },
  {
    "user": "victoria",
    "rating": 5.0,
    "message": "I love it. Are very comfortable y nice"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great supportive fit and great looking style and very comfortable to wear all day (I am a nurse and love these shoes)."
  },
  {
    "user": "Kimmie K.",
    "rating": 5.0,
    "message": "Love these sneakers. I've been wearing this style since the 1980s when I was in high school.  They are the only sneakers that give me the perfect fit and comfort for my narrow feet and high arches. I buy a couple pair a year."
  },
  {
    "user": "Bobbye Lavery",
    "rating": 5.0,
    "message": "Have worn these for years and they never disappoint.  Fits well, washes off well if you get them dirty.  Very comfortable!"
  },
  {
    "user": "Fab_African_Finds",
    "rating": 5.0,
    "message": "I’m super happy with my purchase. So far no complaints."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Have lived the reebok princess for years. They are still great."
  },
  {
    "user": "Winsome",
    "rating": 5.0,
    "message": "True to size"
  },
  {
    "user": "Linda Goggin",
    "rating": 5.0,
    "message": "This has been my favorite shoe for years. Had not found it again until recently.Not satisfied with others that I had bought!"
  },
  {
    "user": "Nohemi Cotto",
    "rating": 5.0,
    "message": "Voy a usarlo"
  },
  {
    "user": "Sara",
    "rating": 4.0,
    "message": "I think this review is for size 7. They were a little too tight. Then got a 7.5. A little too loose. I don’t know which pair I’ll keep. They’re very nice. I need a 7.25!"
  },
  {
    "user": "HerMommy",
    "rating": 4.0,
    "message": "I ordered these shoes for my Mom, who was lamenting the fact that she loved how the “original” Reebok Princess was the only style of shoe that was truly comfortable for her… but, sadly could no longer find them. So, she was thrilled to find them in a random Ladies wear catalog for $59…and promptly ordered them in a size 6M.  Unfortunately, they were too small for her….and was about to send them back and “wait” for who knows how long to re-send her a larger shoe in 6.5M…that is, until I said I’d “check on Amazon” to see what they have…and found that very size 6.5M for $47 she needed…and promptly placed the order, which came 2-days later as promised. She tried them on and loved how comfortable they felt…..and then I noticed that the box said 6.5M……and the shoes said 7M. Well, they did fit her..she’s a very tiny person with a small foot, so we were both surprised they fit. This is why I’m only giving 4 stars instead of 5….(can I say 4.75?) because the box was marked incorrectly and it could have turned out to be another frustrating wait for yet another shoe size…..but it wasn’t…and she loved them. The end. :)"
  },
  {
    "user": "Sheila Wolf",
    "rating": 5.0,
    "message": "Needed 2 x larger than usual"
  },
  {
    "user": "raul arias",
    "rating": 5.0,
    "message": "excellent"
  },
  {
    "user": "Sherri A  Dub",
    "rating": 5.0,
    "message": "I had these shoes about 20 years ago. They are a classic that never goes out of style. Comfy."
  },
  {
    "user": "Jim York",
    "rating": 5.0,
    "message": "These are old school great looking shoes, that still offer a great fit, comfort, and style. Jim"
  },
  {
    "user": "Wendy",
    "rating": 5.0,
    "message": "I love them for comfort and the look."
  },
  {
    "user": "Peggy Cole",
    "rating": 5.0,
    "message": "comfortable and fit well."
  },
  {
    "user": "Dianna Cintron",
    "rating": 5.0,
    "message": "I love my Reeboks I wear them to go running"
  },
  {
    "user": "Lisa M. Marino",
    "rating": 5.0,
    "message": "Was delivered fast.  Fits true to size."
  },
  {
    "user": "Florene Westphal",
    "rating": 5.0,
    "message": "They are light and always fit just right !"
  },
  {
    "user": "Courtney Frazier",
    "rating": 4.0,
    "message": "These sneakers are much narrower and the toe box is tighter than I expected. I stretch them every night with my shoe stretcher but I can only wear them for a limited amount of time. I have awful bunions as it is and I don’t want to make them worse. I do like the way they look."
  },
  {
    "user": "Schere J Allen",
    "rating": 5.0,
    "message": "Love this style of tennis shoe. Supports my feet and ankles."
  },
  {
    "user": "jada",
    "rating": 4.0,
    "message": "My mom is a big sneakers fan and these are her favorite"
  },
  {
    "user": "Toni Clark",
    "rating": 4.0,
    "message": "Runs small. Order a size up!"
  },
  {
    "user": "Rena Johnson",
    "rating": 5.0,
    "message": "Neat and comfortable thank you"
  },
  {
    "user": "D.",
    "rating": 5.0,
    "message": "This is a shoe I find to be very comfortable.  And reasonably priced. They arrived much faster than expected and feel great."
  },
  {
    "user": "JoAnn",
    "rating": 5.0,
    "message": "These have been my favorite sneakers for years!  They look clean- and they don't have any crazy colors.  I love the fact that they are just white.  I always have a extra one or two pairs in my closet.  When I see a good price I stock up on them.  They are soft to walk in and my feet never bother me in them."
  },
  {
    "user": "Wana40",
    "rating": 5.0,
    "message": "All time favorite shoe"
  },
  {
    "user": "Sparrow",
    "rating": 5.0,
    "message": "Love the Reebok PRINCESS style sneaker.  The only one I always buy for years now. Perfect for everyday wear to work, for walking, etc.  Doesn't look too sporty so is great for casual office look. Has super comfortable fit.  Have white for spring, summer, fall, - wear the black pair during winter.  I hope they never stop making this style."
  },
  {
    "user": "Susanh",
    "rating": 5.0,
    "message": "I tried other sneakers and pricey ones at that they are not comfortable. Reebok is more my style and you can’t miss with them"
  },
  {
    "user": "J Lee",
    "rating": 5.0,
    "message": "Use to wear these shoes years ago.  Bought these to wear for walking.  Also bought a black pair.  They are very comfortable."
  },
  {
    "user": "Barbara Sorrell",
    "rating": 5.0,
    "message": "Great shoe very comfortable"
  },
  {
    "user": "Angela Harris",
    "rating": 5.0,
    "message": "Love these old school Reeboks"
  },
  {
    "user": "ava silverman",
    "rating": 5.0,
    "message": "Reebok always fits true to size. Perfect classic sneaker. Very comfortable."
  },
  {
    "user": "Julie",
    "rating": 5.0,
    "message": "Love these. They fit snug, but super comfortable."
  },
  {
    "user": "K",
    "rating": 5.0,
    "message": "These are super cute and comfy, I have two pairs! Easy to clean!"
  },
  {
    "user": "Débora",
    "rating": 5.0,
    "message": "Regalo"
  },
  {
    "user": "Jackie Sauder",
    "rating": 5.0,
    "message": "I will be traveling  soon and want to wear these shoes while doing so."
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "Glad they still have this classic but classy sneaker...was a gift which they love....very comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great sneaker"
  },
  {
    "user": "ted",
    "rating": 5.0,
    "message": "repeat buyer"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "A mi hija le encantaron"
  },
  {
    "user": "Kimberli Allen",
    "rating": 5.0,
    "message": "The reebok shoes fit perfectly!"
  },
  {
    "user": "korin ross",
    "rating": 5.0,
    "message": "I like Reebok - the style is consistent! You know what you want and it’s there"
  },
  {
    "user": "Elizabeth A. Tierney",
    "rating": 4.0,
    "message": "I was disappointed in these shoes. They run at least a size too small and are very narrow. I have other Reeboks in my closet and they are true to size. As someone else said, I have a difficult time believing these are authentic Reebok."
  },
  {
    "user": "Thom Putney",
    "rating": 5.0,
    "message": "her second pair and she loves them"
  },
  {
    "user": "William H. Brown",
    "rating": 5.0,
    "message": "My wife has always liked the Reebok Women's Princess Sneakers.  We were happy to find them on Amazon.  They were delivered in a timely manner, were not damaged, and were exactly what we wanted.  My wife is a happy customer."
  },
  {
    "user": "Jesus Lesta",
    "rating": 5.0,
    "message": "MY MOM LOVE ❤ IT."
  },
  {
    "user": "N. Hanson",
    "rating": 4.0,
    "message": "These are pretty comfortable shoes. I noticed the difference right away to the cushioning when I switched back to my old converse. They feel a bit manufactured (mass made), but other than that - not a bad purchase (bang for the buck)."
  },
  {
    "user": "Alda Byron",
    "rating": 4.0,
    "message": "These are nice shoes, they just come small and tight."
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "I was not expecting much considering they are pretty cheap shoes, but I wear them all the time and they are definitely worth it to me!"
  },
  {
    "user": "Joan Crowley",
    "rating": 4.0,
    "message": "Liked a lot!!!"
  },
  {
    "user": "Luciano",
    "rating": 5.0,
    "message": "Her thoughts: Very comfort. Wow. Impress. Looks like they stain easily, so I’ll be keeping her away from molten tar and things of that nature."
  },
  {
    "user": "L GARY",
    "rating": 4.0,
    "message": "I have purchased these before, but this time the shoes are a lot narrower in toe area"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The sneakers is very slim fit for persons with narrow feet."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The Reebok sneakers fit good and are comfortable"
  },
  {
    "user": "Alison",
    "rating": 5.0,
    "message": "I have worn these for years, the only ones I want!"
  },
  {
    "user": "Aaron Thomas",
    "rating": 4.0,
    "message": "Good"
  },
  {
    "user": "Chrissy prifer",
    "rating": 4.0,
    "message": "Bought these for my daughter in a size 9.5 and that's what she usually wears but they were really tight on her so I wear them I usually wear size 9 and they fit me well so I suggest ordering a half size up I really like the shoe though and my daughter liked them as well so I'm going to order her a bigger size"
  },
  {
    "user": "Lizzard",
    "rating": 3.0,
    "message": "Updated review: these shoes are still so comfortable (I have wide feet) and still so adorable and go perfect with everything, but after having them for only 2 months the soles are already falling apart! You should still get them if you don't plan to wear them often or everyday. But if you need an everyday white sneaker, save your money by buying a cheaper brand that will last the same amount of time anyway. Original review: These shoes are my new favorite go-to, I wear them everyday! They really do match with everything and gives a perfect, casual look to anything you are wearing."
  },
  {
    "user": "SC Hawk",
    "rating": 4.0,
    "message": "This shoe was good thirty years ago and hasn't changed"
  },
  {
    "user": "Jeffer",
    "rating": 5.0,
    "message": "The media could not be loaded. Muy planos . El material por fuera sintético. Nada que ver con la marca de hace años . Han desmejorado el producto."
  },
  {
    "user": "Nina Rodriguez",
    "rating": 5.0,
    "message": "I read all the reviews. And I’ll update this post when I put them back on my feet. But immediately when I got home I put them on my feet and felt like these shoes were pillows. I don’t even have narrow feet! I saw a lot of reviews said they were for narrow feet, that’s not true. I got worried myself but I ordered true to size (I’m always an 8.5) and it’s perfect. Just order these shoes. Don’t second guess it."
  },
  {
    "user": "gramy",
    "rating": 4.0,
    "message": "Love these light weight sneakers. Seems they are making them smaller over the years. Bought a 1/2 size bigger and are prefect"
  },
  {
    "user": "BB",
    "rating": 3.0,
    "message": "I got a Size 7 in a size 8 box."
  },
  {
    "user": "Quality Shopper",
    "rating": 4.0,
    "message": "The shoes are comfortable and fits perfectly."
  },
  {
    "user": "Colleen P.",
    "rating": 4.0,
    "message": "Not overly generous in toe box but not too tight. Reasonable arch support and standard width."
  },
  {
    "user": "Faylene Nausadis",
    "rating": 3.0,
    "message": "I sent them back - to short"
  },
  {
    "user": "Dale Spencer",
    "rating": 5.0,
    "message": "I have loved the Rebok Princess shoes for 20 years!  I just keep buying them when they become worn out!"
  },
  {
    "user": "Melody B Lombardo",
    "rating": 4.0,
    "message": "Exactly what I was looking for.  Unfortunately, ran much narrower than other styles in the brand."
  },
  {
    "user": "Ray Cutler",
    "rating": 5.0,
    "message": "My wife has been ordering these for 40 years> She loes the fit, look and the consistency"
  },
  {
    "user": "Golden Girl",
    "rating": 5.0,
    "message": "These shoes are great!  They fit the bill for a white, inexpensive, great looking and comfy shoe.  You can slip them on with a summer dress, shorts or pants and feel just a bit more dressed up.  I wear a size 10 and the fit is exactly how I like it, just right.  There is a bit of room but no slippage when I walk."
  },
  {
    "user": "Jennifer",
    "rating": 3.0,
    "message": "I wasn't thrilled with these, but I will have just do with them.  I have very petite feet and these shoes had to have been mislabeled, they are extremely too tight!"
  },
  {
    "user": "JP",
    "rating": 4.0,
    "message": "I had a pair when I was younger and I went down memory lane and bought a new pair. Still a comfortable shoe."
  },
  {
    "user": "Nicky2022",
    "rating": 3.0,
    "message": "These are sneakers I wore them on my feet to help support them while working."
  },
  {
    "user": "Lena Toney",
    "rating": 5.0,
    "message": "Loved the comfort of this shoe. I used this shoe for Cheer camp. A whole lot of walking."
  },
  {
    "user": "Mabel Hernandez",
    "rating": 4.0,
    "message": "Muy cómodo me gusto mucho lo recomiendo"
  },
  {
    "user": "Peggy",
    "rating": 5.0,
    "message": "I like these! They are exactly what I have been looking for and the fit is right"
  },
  {
    "user": "Opinionated",
    "rating": 5.0,
    "message": "Narrower than I thought, but stretchy.  I wear them only for indoor exercise (indoor bicycle).  Time will tell whether they hold up to constant use.  They are super lightweight on my feet, which is a plus for indoor exercise.  They seem a bit dainty.  I would buy these again, but a half-size up, or a wide width.  Still, I recommend these sneakers.  I enjoy wearing them!"
  },
  {
    "user": "MKS",
    "rating": 5.0,
    "message": "Reebok gives me the support I need and they look cool! Affordable! TY Reebok ❣️"
  },
  {
    "user": "Hannah",
    "rating": 4.0,
    "message": "I ordered a half size larger than I usually wear and they’re still too tight, even with my feet being very narrow. I think it may just be because of the specific style and fit of this shoe, but I need to return and order a half size or a whole size larger. They’re perfectly cute though and I love them!"
  },
  {
    "user": "Linda Rognier",
    "rating": 5.0,
    "message": "I have purchased these for years. I can count on them being perfect."
  },
  {
    "user": "Beaconolight",
    "rating": 5.0,
    "message": "Have been wearing these a long time.  Lucky to be able to purchase them here."
  },
  {
    "user": "D",
    "rating": 5.0,
    "message": "No seams that make the shoe feel too tight in areas. Perfect. I’ll definitely buy these again. Reebok makes great shoes for walking."
  },
  {
    "user": "Riehl",
    "rating": 5.0,
    "message": "They are so comfortable and cheap!"
  },
  {
    "user": "M.K.P.",
    "rating": 4.0,
    "message": "I've always liked these shoes. But I ordered a wide and got a medium. I can loosen the shoe laces to make them more comfortable but I may return them"
  },
  {
    "user": "PDA",
    "rating": 5.0,
    "message": "This is my wife's favorite shoe. Perfect fit."
  },
  {
    "user": "gee",
    "rating": 5.0,
    "message": "They fit as expected…. Reminds me of the 80’s"
  },
  {
    "user": "Dickpohlabel",
    "rating": 5.0,
    "message": "I am very pleased with my purchase."
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "These are used for my everyday go to white tennis shoes.  I’ve been wearing this same shoe for 40 years and also love the high tops.  They  last, easy to clean and look great."
  },
  {
    "user": "Doraida",
    "rating": 5.0,
    "message": "Son súper cómodos, voy a comprar un par en negros"
  },
  {
    "user": "C",
    "rating": 5.0,
    "message": "n/a"
  },
  {
    "user": "Oregon B.",
    "rating": 5.0,
    "message": "Comfortable,  cute shoe. Bought 2 pair"
  }
]