[
  {
    "user": "D.",
    "rating": 4.0,
    "message": "I've been wearing NB shoes for many years and when I couldn't find my favorite model I tried these.  As so many others said, they do run small. I wear an 8 medium, and thankfully they will work for me.  I put them up to my other NB pairs, same size, and these are a good 1/2\" shorter.  They look great and have nice arch support, but don't have enough cushion at the balls of my feet.  I had to buy inserts at a shoe store to provide more padding."
  },
  {
    "user": "C.Jarmon",
    "rating": 5.0,
    "message": "This shoe replaced my NB Hierro after their Vibram sole wore away after a year of use. The NB 410 trail shoe fits the same in every respect as the Hierro - I believe they are made on the same or nearly the same last. The main difference between the 410 and Hierro is the absence of the heel stabilizer extension. Since I walk rough chip-and-tar streets in my neighborhood, rather than trails, I do not miss the stabilizer. These shoes are more budget friendly so I hope to make these my go-to when I need replacements. One weird thing about these shoes was the original shoelaces - they have ridges (sort of corduroy-like) that made it hard to pull the laces tight - the friction of the ridges didn't allow the laces to slide in the holes.  I simply replaced the laces with an old pair and the shoes are easy to get on and off now."
  },
  {
    "user": "Izzylovesfood",
    "rating": 4.0,
    "message": "A great price for trail runners in comparison to Salomon, Altra, and Topos.  The laces are way too small for the shoe.  I would suggest buying a wide if you are putting on big miles as your feet will swell and they will just be more comfortable at the end of the day.  Will buy again but will replace the laces."
  },
  {
    "user": "greenreddew",
    "rating": 4.0,
    "message": "I been buying these shoes for a couple years now. Love how great they are for jobs where you are walking 10k steps in 6 hours. My only con is they get worn down quickly with use. About 5 to 6 months, I notice my back hurts more when on my feet for long periods of time."
  },
  {
    "user": "John Gupton",
    "rating": 5.0,
    "message": "These fit perfectly and are so comfortable. I was able to work a 9 hour shift on my feet the whole time with no discomfort. I honestly was surprised I didn't have to break them in before wearing to work. New balances are definitely my favorite go to for shoes to work in ( I walk about 6 miles a day at my job, so comfort is extremely important to me) my only dislike is the box they came in was smashed pretty bad but that has nothing to do with the actual product itself."
  },
  {
    "user": "pcj",
    "rating": 4.0,
    "message": "Love the looks of the shoes.  They do run a little tight in the front foot box, from arch forward.  I put a new arch support in it and it helped a lot."
  },
  {
    "user": "Rozy",
    "rating": 5.0,
    "message": "It was a little uncomfortable in the beginning and I think it is because it was new.  However, 3 months later I feel good wearing it. I also get complimented a lot wearing them!"
  },
  {
    "user": "Janette",
    "rating": 5.0,
    "message": "I love it. Love the color. I always take a size down with New balance. I am a size 7.5 I took a size 7. Fits perfect"
  },
  {
    "user": "Tosha Kowal",
    "rating": 4.0,
    "message": "I’ve never been brave enough to order shoes online. I finally decided to go for it and figured I was safe since I’ve been wearing size 9 New Balance shoes for years. Didn’t even bother to read the reviews, which was a mistake. My toes were touching the end. But I sent them back, ordered a full size up and now I’m happy as a clam."
  },
  {
    "user": "Mariane H.",
    "rating": 5.0,
    "message": "I had to return this for a smaller size, as I chose to go larger because of other brands I had purchased recently. This runs very true to New Balance sizes  - I didn't need to go larger. The soles are great, the insoles are not as smooth as I would like, but I've had foot surgery and have very sensitive feet."
  },
  {
    "user": "william h carney",
    "rating": 4.0,
    "message": "Arrived fairly quickly and are comfortable so far.I do not like the mesh top as I'm afraid that  eventually my big toe will poke through like other mesh shoes I've purchased but that remains to be seen since I have not had them that long."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "👍👍 Great support Love the vibrant colors I use them for work (RN on my feet always) and work outs too!"
  },
  {
    "user": "Marvelous mama",
    "rating": 5.0,
    "message": "As a nurse I do a lot of walking, the NB 410 are wonderful!!!"
  },
  {
    "user": "Mommyto4",
    "rating": 4.0,
    "message": "Really like these shoes and the camo green/orange color.  The cushioning in this shoe is wonderful.  The toe box is average and the shoe hugs my feet nicely.  The only issue that I had is the sizing.  I have other New Balance shoes and size 7 fits perfectly with some room in the toe box area.  For these shoes, my big toe was almost to the top, with the nail of my big toe rubbing on the seam of the shoe.  Definitely need to size up either half or one full size.  Unfortunately, I had to return these shoes.  But, I do recommend them to others that are looking for a well cushioned shoe."
  },
  {
    "user": "krissypoo1731",
    "rating": 4.0,
    "message": "They run a half size small , the last generation of the 410 we’re bigger , other then that they are fine"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "It was wide enough for my daughters feet and the color fits well."
  },
  {
    "user": "Tina",
    "rating": 5.0,
    "message": "I bought these to help correct a small problem in one of my feet. When I wear these, I don’t feel much pain!"
  },
  {
    "user": "Ashlee Topping",
    "rating": 5.0,
    "message": "For the price they are perfect!"
  },
  {
    "user": "Kalynne",
    "rating": 4.0,
    "message": "Why are the shoelaces SO SHORT?? Even tightening them across top of foot, barely enough lace length to tie them at all. Stop being stingy with laces, shoe makers. Also, they run small, order at least 1.5 or 2 sizes up from your normal street shoe size. I ordered 1.5 sizes up and they’re still a little too snug."
  },
  {
    "user": "katie baker",
    "rating": 5.0,
    "message": "Super comfortable and good quality!"
  },
  {
    "user": "ESMERALDA",
    "rating": 5.0,
    "message": "Cómodos para viajes y caminatas"
  },
  {
    "user": "Liz",
    "rating": 4.0,
    "message": "I have terrible balance issues due to back surgeries These are comfortable and make me feel stable"
  },
  {
    "user": "Linda",
    "rating": 5.0,
    "message": "Sturdy for trail running/walking and cute colors."
  },
  {
    "user": "Beth",
    "rating": 5.0,
    "message": "I love New balance shoes. Them are the only thing I wear for work I do a lot of walking."
  },
  {
    "user": "Susan W",
    "rating": 4.0,
    "message": "The laces are way too short. I bought new laces and now I can tie a bow and even double tie when necessary. The wide width fits my foot very snugly. No bulky socks with these shoes. The length is fine. Plenty of toe room. This is a good-looking shoe."
  },
  {
    "user": "Vanessa H",
    "rating": 5.0,
    "message": "Great support"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "LOVE THEM! Don't hesitate to buy if you're unsure. Very comfortable and lightweight"
  },
  {
    "user": "Kat",
    "rating": 5.0,
    "message": "Great for long distance road/trail running,  right out of the box. At an amazing price. Highly recommend!"
  },
  {
    "user": "cristela martinez",
    "rating": 5.0,
    "message": "Muy buenas para caminar y hacer ejercicio"
  },
  {
    "user": "Deborah Gust",
    "rating": 5.0,
    "message": "They are comfortable and very stable for my ankles.  I have Rheumatoid Arthritis and need the comfort of this shoe and for that reason I also need the stability of the shoe."
  },
  {
    "user": "Kindle Customer",
    "rating": 3.0,
    "message": "I have worn New Balance to walk five miles a day for almost 15 years and never had any problems until the last two pairs. This pair is comfortable and provides great stability but has two main problems. When I put them on, the heels (backs) of the shoes want to fold in as if they were slides and are very difficult to pull back up.  I finally used tweezers to pull them up  and they are better now that I've worn them several times but I have to be very careful putting them on, holding the loop until my foot is well seated. Also, the shoelaces are too short so I tried not putting them through the last set of holes but had to replace them because the shoes slipped without that final lacing. Unfortunately, it is impossible to find garnet laces so I had to use black. I know, not a performance issue but I really liked the garnet."
  },
  {
    "user": "Dan",
    "rating": 5.0,
    "message": "Great fit and good looking shoe. My wife loves these shoes. I bought them for her."
  },
  {
    "user": "ssj",
    "rating": 5.0,
    "message": "Had to order online because they changed the way the shoes fit they now fit smaller than they use too I was a size 8 1/2 and had to go up to a size 9 for them to fit perfectly. Love the style and color of these shoes there are more colors to choose from online then in stores"
  },
  {
    "user": "S Rudolph",
    "rating": 4.0,
    "message": "I bought 2 pairs of these and both of them came with places that didn't fit the shoes. Once I got my foot in them, I had to tie tiny little bows. I had to buy new laces for them or I would've given them 5 stars. Sweet shoes though. Comfy and I get compliments all the time. Buy laces if you order! They don't even send extra in the box like some do. I'm sure those would be too short as well."
  },
  {
    "user": "no name",
    "rating": 5.0,
    "message": "Nice fit, comfortable"
  },
  {
    "user": "grranny",
    "rating": 5.0,
    "message": "I have plantars  fiberitus and I have a dog that needs to be walked a lot these shoes are comfortable and they keep my feet steady I absolutely love them"
  },
  {
    "user": "tamara ward",
    "rating": 4.0,
    "message": "I have always liked New Balance for their price and value"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These sneakers are great for walking in dirt, sand, grass and on trails. We enjoy playing disc golf and these shoes are perfect for the different terrains on the courses. Very comfortable cushioning on the feet, great color scheme and good grip on the soles. Notes: Some of the color choices have ripstop uppers and some have mesh. You can kind of tell if you zoom in on the pictures and look at the fabric across the toes. Ripstop seems to be listed specifically in the descriptions for those shoes with it. I got a pair of Steel/Light Mango that has ripstop and a pair of Ocean Grey/Outerspace/Vivid Coral that are mesh. Also, I took other reviewer’s advice and ordered a slightly larger size than normal and my normal size. Glad I did because the 9.5 was just a little too small, even though that’s my usual size. The size 10 works best for me on these shoes. Overall, really happy with the shoes!"
  },
  {
    "user": "Ron.D",
    "rating": 5.0,
    "message": "This product was gift"
  },
  {
    "user": "brattchild66",
    "rating": 5.0,
    "message": "Very comfortable and Cute!"
  },
  {
    "user": "Debbie C.",
    "rating": 5.0,
    "message": "Super cute and great color.  Already have had several compliments. 😊"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "To Small by one size in this style. Always buy New Balance. Love this brand for support and comfort"
  },
  {
    "user": "Pt1980",
    "rating": 4.0,
    "message": "Bought this as a walking shoe because I have no arches and have been doing a lot of walking. My back has been hurting because of lack of support. I wore these once so far and they are super comfortable. I did have to return and get a 1/2 size bigger. My only issue is that my right foot toe is pressing into top of sneaker. I don't know if it is the sneaker or the way my foot is formed now that I am older. I am hopefully it will get better when broken in."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfortable and supportive. I like the color too."
  },
  {
    "user": "Z",
    "rating": 5.0,
    "message": "Great stability"
  },
  {
    "user": "becky smith",
    "rating": 5.0,
    "message": "Very comfortable for all day walking, does run a size too small"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I use this shoe for walking 3 miles a day."
  },
  {
    "user": "Cecelia e.",
    "rating": 5.0,
    "message": "I really like these shoes. Love the color and very comfortable."
  },
  {
    "user": "Beatrice Oquendo",
    "rating": 5.0,
    "message": "Like"
  },
  {
    "user": "Spy Girl",
    "rating": 4.0,
    "message": "It’s a good sturdy shoe but for size 10 runs very small.  I should have sent them back but will wear them with thin socks.  This is an example of why I don’t like ordering on-line… it’s quite obvious that this shoe was not correctly sized."
  },
  {
    "user": "Vera M.",
    "rating": 5.0,
    "message": "Great buy"
  },
  {
    "user": "KrisC",
    "rating": 5.0,
    "message": "I love these shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "great price and product"
  },
  {
    "user": "Ardith W.",
    "rating": 5.0,
    "message": "I have a small wide foot and this New Balance tennis shoe is so comfortable as were the other pair I’ve purchased in the past. Love the color too. Highly recommend!"
  },
  {
    "user": "Sandra Collett",
    "rating": 5.0,
    "message": "I love them overall"
  },
  {
    "user": "Jenny Marie",
    "rating": 4.0,
    "message": "I like the light purple"
  },
  {
    "user": "Jmt",
    "rating": 3.0,
    "message": "If you are satisfied with your shoe I am somewhat but not like I usually offer new balance. The shoes on the top were snug and they were nylon I thought they were leather so maybe that’s what makes a difference I wear new balance all the time but these are a different type of new balance I was looking for more of the leather"
  },
  {
    "user": "Paulett Jones",
    "rating": 4.0,
    "message": "Feels so comfortable"
  },
  {
    "user": "Deborah W.",
    "rating": 4.0,
    "message": "I always struggle to get good fitting shoes for my wider feet, these fit great, very comfortable on trails and regular surfaces.  Will purchase again when needed."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Cute shoe. But I usually wear a 9 1/2 and these ran a little bit smaller wish I would’ve gotten a 10"
  },
  {
    "user": "DOUGLAS A GROTE",
    "rating": 3.0,
    "message": "I love New Balance for comfort. They have been my go to for many years. This pair not loved because they tore after about 12 - 2-4 hour wears. As you can see the bottoms are not worn but they tore on inside/tops on both shoes.  The tears just keep getting bigger. No way to fix."
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "As I’m on my feet a lot bc my job requires me to walk a lot and I just love the brand bc with flat feet it’s the only ones to really be comfortable for me."
  },
  {
    "user": "marivelis Serrano",
    "rating": 5.0,
    "message": "Great shoe very comfortable"
  },
  {
    "user": "Kerry D.",
    "rating": 5.0,
    "message": "Supports my narrow flat feet. Love the colors"
  },
  {
    "user": "Keri",
    "rating": 3.0,
    "message": "Brought this shoes for working out...mostly running and it has help with prevent my shin splits I was having with the other shoes. So far so good. Watching to see if it will hold up to my extensive workout routine."
  },
  {
    "user": "jodyraew",
    "rating": 5.0,
    "message": "Nicely made and comfortable to wear even on wide feet."
  },
  {
    "user": "Sophia",
    "rating": 4.0,
    "message": "These are light and VERY comfortable. Love the colors and very cute. I'm a taller woman so finding shoes my size is often a challenge. Wasn't disappointed in the least. I would order either a 1/2 size or 1 full size up; they tend to run a wee but smaller than expected. I'd recommend these, especially to taller women who have difficulty finding good fitting shoes!"
  },
  {
    "user": "Emerson Rae",
    "rating": 5.0,
    "message": "I used to be a long-distance runner and I have dropped some dough on good shoes such as Asics and Newtons so I know what a good running shoe is. However, I have turned to sprinting and short-distance trail running and was looking for something that fit my current budget. I have had NB shoes before, but these were like walking on clouds. There is great support and stability in these shoes. Totally worth the $ to buy them. [The last review was great, but apparently, someone got angry about my selection of verbs, adjectives, and nouns]"
  },
  {
    "user": "Kendra Bubeck",
    "rating": 4.0,
    "message": "Colors are great. Shoe fits a little different than most NB shoes."
  },
  {
    "user": "AS",
    "rating": 4.0,
    "message": "I usually wear 7.5 reg in new balance comfortably and im up to 8 wide and still haven't found a size that fits. Starting to wonder if these are true new balance or fakes. Very light weight with foam like soles. Good rubber tread though. Mesh ventilation on toes and sides. Seems like a decent enough shoe just wish it was true to size."
  },
  {
    "user": "Jewel",
    "rating": 5.0,
    "message": "Very comfortable. I used them for work"
  },
  {
    "user": "Kelly Horrocks",
    "rating": 5.0,
    "message": "They're not the same in quality amd size. Not very comfortable either. Sad because this brand was the best in my opinion."
  },
  {
    "user": "Pamela Lorusso",
    "rating": 4.0,
    "message": "Well-made, looks great but I had to return because the “toe box” in this style was very small/tight for my foot. I take either 7.5 or 8 depending on fit, I ordered 8 because of other reviews said they run small, and even that was too small."
  },
  {
    "user": "Jenn Reed",
    "rating": 5.0,
    "message": "Love these!  Very comfortable with good arch support.  Very light but holds up well for daily use"
  },
  {
    "user": "J. Grenfell",
    "rating": 5.0,
    "message": "Comfortable great fit.  I love mine! True to color as shown too."
  },
  {
    "user": "Jsti14",
    "rating": 5.0,
    "message": "Great shoe, came fast, exactly what I expected!"
  },
  {
    "user": "Debbie",
    "rating": 5.0,
    "message": "Purchased for my son’s girlfriend as a gift. She loves the New Balance line for the support and quality of the products."
  },
  {
    "user": "leighanne greeley",
    "rating": 4.0,
    "message": "❤ New Balance. Only brand of sport shoe I will buy. These are comfortable especially if you spend long hours on your feet. I don't know what I would do if I had to wear steel toe shoes for my job. Only down side with New Balance is I wish they would create more stylish/eye pleasing variety. They are not always the best to look at but my body appreciates the comfort and durability that is the brand. The only brand of athletic shoe that I can wear a year before retiring."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great shoes and decent price"
  },
  {
    "user": "Graciela Maldonado",
    "rating": 5.0,
    "message": "The media could not be loaded. Son exactamente como mostraba la foto. Muy buena calidad y son hermosos. Me encantan!!!"
  },
  {
    "user": "Krafty1",
    "rating": 3.0,
    "message": "These shoes are extremely hard to lace up and the laces seem way to short."
  },
  {
    "user": "Collin Pinson",
    "rating": 5.0,
    "message": "My wife like the way they fit"
  },
  {
    "user": "Savvy Shopper",
    "rating": 4.0,
    "message": "Love the NB 510 and 410 series. Just be aware that the \"N\" on these is as purple as the soles. Kinda disappointed as it looked more of a dark blue on the phone. Returned them as the color difference wouldn't work for the intended use."
  },
  {
    "user": "musicbiker",
    "rating": 3.0,
    "message": "All I wear are NB but this pair was just “off”, felt clunky and like the arches were too far back"
  },
  {
    "user": "AM",
    "rating": 4.0,
    "message": "Overall, this sneaker will work well for what I need.  The wide width is not super-wide though. Fits me more like a regular width shoe."
  },
  {
    "user": "iRead",
    "rating": 3.0,
    "message": "Nice shoe, but I ordered wide and it's so not wide enough."
  },
  {
    "user": "S.H.",
    "rating": 3.0,
    "message": "The colors are perfect.  Runs a little small. I got a 9.5 but a 10 wouldve fit better.  My toes tend to jam into the toe of the shoe when walking.  If you like comfortable room in your shoe I'd recommend half size up. My feet are tired and a little sore at the end of wearing them. Be it 8 hours or 2. Grip is great."
  },
  {
    "user": "KimberlyR",
    "rating": 5.0,
    "message": "Walk the dog 1-2 miles a day. Needed a sturdy, comfortable sneaker that would support arch, ankles & be comfortable. From Day 1, these sneakers were like walking on a cloud. Totally comfortable. Have received compliments on the style. Looking for a sturdy walking or running show? Look no further."
  },
  {
    "user": "Rai",
    "rating": 3.0,
    "message": "Most of the time New Balance is comfortable from the start, but these hurt my toe on one foot. After I wore them about a week the pain went away. They are hard to put on for some reason, now I know what the loop on the back of tennis shoes is for. Mostly their ok, but I don't think I would buy them again."
  },
  {
    "user": "Jacquie Energy",
    "rating": 5.0,
    "message": "I am stand on my feet all day. These sneakers make me feel so comfortable to stand and walk in.  I also work out in these sneakers. Love it."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "They fit me well and they are very light.  I'm pleased."
  },
  {
    "user": "S. B. Cinco",
    "rating": 5.0,
    "message": "I used these to walk through England"
  },
  {
    "user": "theflash",
    "rating": 5.0,
    "message": "Fits fine right size but maybe go one size up in case you wear thick socks and stuff"
  },
  {
    "user": "lanette edmondson",
    "rating": 4.0,
    "message": "were not quite a wide as i hoped but fit ok."
  },
  {
    "user": "Sirpfaf",
    "rating": 4.0,
    "message": "Little more narrow than expected. Otherwise a lightweight shoe and length fits as expected"
  },
  {
    "user": "Jean",
    "rating": 4.0,
    "message": "New Balance is the sneaker that fits me best. This is my first one with a comfort insert. I don’t think I will buy another without one. As for sturdiness I’ve only worn them daily for a month. Would recommend."
  },
  {
    "user": "Miss D",
    "rating": 5.0,
    "message": "Never ordered sneakers from Amazon...so Happy I did! 😊 I will definitely be looking on Amazon for more future shopping needs before going to the store and being disappointed, not only with the lack of selection but the Extreme Difference in Price."
  },
  {
    "user": "SK",
    "rating": 3.0,
    "message": "I've worn New Balance athletic shoes for 15 years and have always been pleased. I ordered 3 pairs of athletic shoes and all had to be returned. Shoes were way too short. Big toe had no additional room. I could have returned shoes and purchased a half-size larger, but I decided to try comparable brands instead. Too bad. I liked the appearance of all three shoes."
  },
  {
    "user": "nieve",
    "rating": 5.0,
    "message": "Me gusto y Agrado todo , Lo Estoy disfrutando mucho"
  },
  {
    "user": "Alfreda Wise my Antenna is Awesome picture is clear",
    "rating": 5.0,
    "message": "I love them"
  }
]