[
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "Lightweight. Easy to put on. Love that there's no shoe strings. Velcro is good quailty.  Got the wide fit. My son's foot isn't overly wide and it fit perfectly. He walks on his toes, ALWAYS! So it difficult finding shoes that work and don't slip up and down and eventually completely come off. This is by far best shoes I've found for him that stay on.  Holding up well so far 1 month into school. Looks good dressed up or down. Very happy with shoes!"
  },
  {
    "user": "JOHANNA RODRIGUEZ",
    "rating": 5.0,
    "message": "Excelente, el size le quedó perfectamente a mi niño y eso casi nunca lo logro en una primera compra, muy buena la calidad y comodidad. A mi hijo le encantan. Los recomiendo."
  },
  {
    "user": "MARIA ANTONIA GARCIA",
    "rating": 5.0,
    "message": "Perfect fit and good quality! Great for school"
  },
  {
    "user": "Tiffany",
    "rating": 5.0,
    "message": "These shoes are awesome! They go with almost everything and very comfortable. I will purchase another size up when my daughter grows out of these."
  },
  {
    "user": "vsfin",
    "rating": 5.0,
    "message": "These fit my son perfectly! The toe box is wider to allow room for his toes. We will stick with the under armor brand for the wider toe box for him!"
  },
  {
    "user": "Ascamero",
    "rating": 5.0,
    "message": "My youngest seven years old has a bigger foot while he likes vans some converse and many running ones they can rarely if ever be found in wide for kids. These were comfortable no complains and not crushing his feet inside"
  },
  {
    "user": "Bryan",
    "rating": 5.0,
    "message": "Great fit and stays on while running and playing!"
  },
  {
    "user": "Meranda Lawrence",
    "rating": 5.0,
    "message": "We love this UA tennis shoe style! Under Armour seems to hold up better than other brands. I have a boy who plays hard while wearing them. These are perfect for school."
  },
  {
    "user": "Jimmy A. Brown",
    "rating": 5.0,
    "message": "My Grandson likes his Under Armor Tennis shoes. They fit well and are well made."
  },
  {
    "user": "C. Schultz",
    "rating": 5.0,
    "message": "Fudjdd"
  },
  {
    "user": "Kortney Shropshire",
    "rating": 5.0,
    "message": "Love love love"
  },
  {
    "user": "Trinea Gonczar",
    "rating": 5.0,
    "message": "Love these"
  },
  {
    "user": "Connie",
    "rating": 4.0,
    "message": "True to size. Bought these for my 6 year old. A little difficult for her to put on at first. Just make sure the child knows to pull the top strap way loose, then put the foot in, and strap back down. She got the hang of it, in about a weeks time. Durable and washable shoes."
  },
  {
    "user": "Alexander Beato",
    "rating": 5.0,
    "message": "Comodos para ir al colegio"
  },
  {
    "user": "adrienakers",
    "rating": 5.0,
    "message": "Love! Fit as expected. Daughter says they are super comfy!"
  },
  {
    "user": "Dy Pan",
    "rating": 5.0,
    "message": "We’ve had them for about a month and they are still in great shape. Didn’t need to break them in. No blisters or discomfort the first time wearing them. Kid is comfortable and mom is happy."
  },
  {
    "user": "Karen Stanfield",
    "rating": 4.0,
    "message": "Great shoes, great quality and comfortable"
  },
  {
    "user": "Jayme Alexander",
    "rating": 5.0,
    "message": "These shoes are super cute.  Light weight and durable.  Perfect fit.  My daughter loves them!  Plus, I got them on discount.  They arrived when Amazon said they would.  I would definitely recommend these shoes."
  },
  {
    "user": "Bridgette Hamilton",
    "rating": 5.0,
    "message": "Quality. vibrant"
  },
  {
    "user": "amie",
    "rating": 4.0,
    "message": "They fit my preschooler and came just in time before school starts. He loves them."
  },
  {
    "user": "KARLA BEATRIZ SOARES LUCENA",
    "rating": 5.0,
    "message": "I like the design and super confy"
  },
  {
    "user": "randy johnson",
    "rating": 5.0,
    "message": "Got these for my son who’s in Kindergarten, these sneakers fit as expected and are durable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Granddaughter loves them"
  },
  {
    "user": "ImJustPeachy",
    "rating": 5.0,
    "message": "I waited a year to write this review. These shoes have held up so well.  I cannot be more pleased."
  },
  {
    "user": "Katie Score",
    "rating": 4.0,
    "message": "Not sure what is up with these but they came in a weird after market box and with no tags. The style of the shoe themselves is cute and looks fine but I payed for new shoes for a reason and to get shoes that aren’t new as expected is frustrating."
  },
  {
    "user": "LVJ",
    "rating": 5.0,
    "message": "Bought this shoes for my 7 year old son. He loves them! They’re very comfortable and stylish."
  },
  {
    "user": "Danielle Ward",
    "rating": 3.0,
    "message": "The velcro wears off of these sneakers pretty quickly. My son likes them and he's picky, but after about 2 months the velcro just peels right off of the strip"
  },
  {
    "user": "Emily",
    "rating": 3.0,
    "message": "We’ve bought several pairs of under armor shoes but this last paid my son only wore for a week and the sole started coming off."
  },
  {
    "user": "Michael Raymond",
    "rating": 5.0,
    "message": "Shoes were worn out in less than 3 months"
  },
  {
    "user": "William",
    "rating": 5.0,
    "message": "Second pair.  Both grandkids wear them.  Dad too!"
  },
  {
    "user": "Ashley Love",
    "rating": 4.0,
    "message": "Great quality but fit is too tight"
  },
  {
    "user": "Crystal",
    "rating": 5.0,
    "message": "So I bought my daughter these shoes and she loves pink to use to ride her bike. And not only that she feels very comfortable in those shoes worth every penny thank you!!"
  },
  {
    "user": "carrie",
    "rating": 4.0,
    "message": "Super narrow"
  },
  {
    "user": "Glenda Fox",
    "rating": 3.0,
    "message": "These really aren’t for wide feet. They are more narrow. Even went a size up and still too tight."
  },
  {
    "user": "ginnie",
    "rating": 3.0,
    "message": "I bought these shoes for my daughter and when we opened the box the soles were dirty and the shoes were not new."
  },
  {
    "user": "Jodie Schaap",
    "rating": 3.0,
    "message": "Cute shoe. Son loved it. On second west the rubber toe started pulling away from the shoe. I expected more from a $50 shoe :/"
  },
  {
    "user": "Alana",
    "rating": 3.0,
    "message": "Although they lightweight which is great but they are hard with no flexibility. My daughter has a hard time getting them on."
  },
  {
    "user": "adriana",
    "rating": 4.0,
    "message": "Such cute shoes! Little tight on the width part of the shoe, but stretches out. Only thing is after a month the seems are coming a little undone."
  },
  {
    "user": "Jason",
    "rating": 3.0,
    "message": "The shoes were too narrow despite ordering the wide size- the same size new balance shoes fit."
  },
  {
    "user": "Molly",
    "rating": 5.0,
    "message": "Under armor shoes fit a little snug and smaller. These aren’t for kids with wide feet."
  },
  {
    "user": "Nancy Xin Yan",
    "rating": 5.0,
    "message": "Compared to other shoes we’ve purchased in the past, these definitely held up better so far.  My kids put their shoes through the ringer everyday.  I’ve bought other brands and most lasted no more than a month.  If these last more than 3 months, I’ll be buying again!"
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "My son has a wide foot. I ordered a wide, and these work great! The Velcro is more than long enough to go over the closure, which can sometimes be a problem for him. Definitely recommend"
  },
  {
    "user": "oscar",
    "rating": 5.0,
    "message": "Will be great to have for school!!"
  },
  {
    "user": "glarbogast",
    "rating": 4.0,
    "message": "They are very hard to take off and on. Our 5 year old granddaughter can not do it herself. It’s a tug and struggle."
  },
  {
    "user": "Joanna",
    "rating": 5.0,
    "message": "They don't get dirty very easily and are holding up well, not falling apart at all and my 5 year old is tough on shoes. He has had these for a while and still in great shape."
  },
  {
    "user": "Michele",
    "rating": 5.0,
    "message": "My son is picky and he really likes these shoes. He is convinced they make him run faster. I like them as well. They fit as they should and are easy to put on for him."
  },
  {
    "user": "Genay",
    "rating": 5.0,
    "message": "Fits well, and easy to put on!"
  },
  {
    "user": "Lacey Howard",
    "rating": 5.0,
    "message": "My son loves them fits him very well. He always wearing them."
  },
  {
    "user": "Jules22",
    "rating": 4.0,
    "message": "These felt very stiff and odd to us. My son us wearing them... but they feel hard and cheap compared to other pairs we have."
  },
  {
    "user": "Kaylyn Perez",
    "rating": 5.0,
    "message": "Perfect, pretty and good for wide foot. Goes with everything."
  },
  {
    "user": "Donna Steiner",
    "rating": 5.0,
    "message": "My son is very abusive to his shoes and requires Velcro closure.  This is the 3rd pair of athletic shoes this school year. They have made it past the 3 month mark. Definitely a win!"
  },
  {
    "user": "FS16",
    "rating": 2.0,
    "message": "We purchased these shoes as a cheap option for our three ever-growing kiddos. We have a seven year old, six year old and three year old. The three year old’s shoes held up tolerably well. The shoes for our older two SHREDDED apart very quickly. These photos are from four months later. Worn during normal school and outdoor play. The soles are literally falling apart. The back tabs started unraveling days after we received them. There are holes in the body of the shoe. Needless to say, we will not be wasting our money on this brand of tennis shoes again."
  },
  {
    "user": "JoAnn Nemeth",
    "rating": 5.0,
    "message": "Love the slip on, Velcro close features.  Attractive. Would buy again. True to size."
  },
  {
    "user": "Bianca Jimenez",
    "rating": 5.0,
    "message": "Flexible and great shoe my son loves it..he has 3 colors in this type."
  },
  {
    "user": "VanWithaCall",
    "rating": 5.0,
    "message": "My child likes it and wears everyday to school and play. Easy off and on, I cleaned  with damp cloth. Value for money"
  },
  {
    "user": "Josh",
    "rating": 2.0,
    "message": "These were great at first, but they started to come unstitched after about a month. The velcro came loose (and off one shoe completely) and the fronts of the shoes were separating so badly at the seams, we decided to replace."
  },
  {
    "user": "Cindy M.",
    "rating": 4.0,
    "message": "My son loves these shoes, but the soles are the squeakiest ones I have ever come across! We have tried so many times to rough them up and they still squeak… but they are good quality so the purchase was still worth it, especially for the price, compared to in-store."
  },
  {
    "user": "Ana Cristina Sanchez",
    "rating": 5.0,
    "message": "Mi hijo siempre compra estos zapatos y le duran todo el año escolar. Los recomiendo 100% además de que son cómodos"
  },
  {
    "user": "Keri",
    "rating": 2.0,
    "message": "Bought these shoes for both my boys, and they’ve only been wearing them to school for a month and after a few weeks they black starting rubbing off. These can’t be the real deal, because I’ve never had this happen on any other pair of Under Armor shoes."
  },
  {
    "user": "Food Junky",
    "rating": 4.0,
    "message": "But they for the 5 year old and he likes them for school old worn then a couple weeks will have to wait and see how they last. He did not destroy shoes. He can put them on and take them off easily and says in the heat they are keeping his feet cold (not sweetly)."
  },
  {
    "user": "Michelle",
    "rating": 4.0,
    "message": "They are taking a beating and still hanging in there! The Velcro is still in tact as well as the soles. My 7 year old is hard on shoes and these have been great after a month or so."
  },
  {
    "user": "Justin Moore",
    "rating": 4.0,
    "message": "These shoes look and feel great! Which is the only reason for a good review, It not their fault my kid has wide feet like myself! These fit like Nikes! The size says they are wides! Definitely not wides compared to Sketchers. Had to return as they hurt my sons feet!"
  },
  {
    "user": "Lindsay May",
    "rating": 5.0,
    "message": "These shoes fit my son well. He loves the color and that it’s under armor!"
  },
  {
    "user": "BoyMom",
    "rating": 4.0,
    "message": "Really nice quality shoe. Just runs narrow. It's a little long for my son, but a smaller size and he wouldn't get it on his foot. He doesn't have wides feet either. Overall he likes it though."
  },
  {
    "user": "Marcel M.",
    "rating": 5.0,
    "message": "Cute shoes. They fit true to size and have held up to everyday use by my daughter."
  },
  {
    "user": "EC",
    "rating": 5.0,
    "message": "Under Armour by far holds up bettrr than any other brand I’ve bought for my boys.  My son outgrew his last pair so I got him another, these are so cute too with the accent colors.  My son loves them!"
  },
  {
    "user": "adriana",
    "rating": 5.0,
    "message": "A little tight at first on the width part of the shoe, but it stretches out! Cute shoes!"
  },
  {
    "user": "Cristina",
    "rating": 2.0,
    "message": "I’m not sure what happened to the quality of this sneaker. I’ve purchased this style for my son for years and the last 2 times have been so disappointing. We got around 3-4 months out of the pair for before this before the rubber started peeling off of the bottom but this time was a few WEEKS so I’m thinking they were either not authentic or that we received a defective pair. We purchased them on 1/13/22 and got them a few days later and it’s now 2/22/22 and they are falling apart. My son only wears them to school, they barely go outside there due to weather and the back fabric has completely frayed and looks ridiculous. For the price of these shoes, I’d expect to get longer than a MONTH with them of normal use. I’m really disappointed and now my son needs another pair of new sneakers less than 5 weeks after getting these. Does UA stand behind their sneakers? What can I do about these sneakers that are a mere several weeks old that can no longer be worn?"
  },
  {
    "user": "Jamie",
    "rating": 5.0,
    "message": "We have been buying these exact shoes for the past couple years now in bigger sizes as we go along. They hold up so well and go with so many outfits! So cute! Sizing is spot on."
  },
  {
    "user": "Book Girl",
    "rating": 5.0,
    "message": "My daughter is hard on shoes, and these have survived better than any other shoes I’ve bought her. I will definitely be buying more."
  },
  {
    "user": "Faith Chesoli",
    "rating": 5.0,
    "message": "Very cormfortable and fits true to size."
  },
  {
    "user": "Kamela A Clackum",
    "rating": 5.0,
    "message": "This is my son’s third pair. He loves them and they hold up well. Light weight and wash good."
  },
  {
    "user": "Jacqueline",
    "rating": 3.0,
    "message": "These must not be very comfortable. I bought two pairs and neither of my daughters will wear them. I thought because they were under armor and not cheap they would be great quality. Seem to be holding up all right but it’s an argument to get them to put the things on. Won’t buy them again wouldn’t recommend."
  },
  {
    "user": "kari b.",
    "rating": 5.0,
    "message": "these shoes are great quality, reasonably priced, and they’ve held up in better shape than most shoes for my 7yr old who plays outside and doesn’t go easy on her clothes or shoes. they fit true to size, and are easy to get on and off. would purchase again."
  },
  {
    "user": "SheShe8",
    "rating": 1.0,
    "message": "After having these shoes for 13 days, I noticed my son's right shoe looked terrible for being new. He did not wear this shoe every day and did not do any sports or unusual activities that would explain the damage, especially since the left shoe is fine. I contacted Under Armour directly with my receipt and images. I thought this may have been a manufacturing fluke since we have other UA tennis shoes that are more than a year old and on their second kid that look better than this shoe that is less than 2 weeks old. I was shocked that UA did not stand by their product either. They offered me a 15% off coupon to buy another pair. No way will I spend nearly $50 for a kid's shoe that won't hold up well for even 2 weeks."
  },
  {
    "user": "Supermomie",
    "rating": 5.0,
    "message": "Last a long time for my son. Great shoe."
  },
  {
    "user": "bruce",
    "rating": 5.0,
    "message": "First time buying under armour shoes for my 6 yr old, and she absolutely likes them...they fit her well with comfort. And she also has grip under shoes for slip and falls....great shoes 👍"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Less than a month of wear and the stitching in the back of one sneaker is coming apart."
  },
  {
    "user": "Roc",
    "rating": 4.0,
    "message": "So far, these shoes fit well.  Hopefully they stay in good shape after a few months of running around the playground."
  },
  {
    "user": "rose",
    "rating": 5.0,
    "message": "My son wears these to school every day. He hates wearing  shoes in general, but he doesn’t seem to have a problem wearing these all day. They are wide enough for chubby feet, but ran quite larger than expected. I had to order a half size smaller than his typical size, and they are perfect."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My granddaughter loves them"
  },
  {
    "user": "Brie Zentil",
    "rating": 5.0,
    "message": "My kids all wear Under Armour Asserts, as well as my husband and myself. The tread is substantial and grips asphalt well and does pretty good on easy family hikes as well. The toe box width seems larger than other brands, which works well for our wide feet. I find these to run half size big. My son's both wear a half size smaller in adidas shoes."
  },
  {
    "user": "tim hughes jr",
    "rating": 5.0,
    "message": "They’re adorable and fit as expected."
  },
  {
    "user": "MrsMiller",
    "rating": 5.0,
    "message": "My son will only wear UA shoes and these did not disappoint."
  },
  {
    "user": "Alex Huneycutt",
    "rating": 5.0,
    "message": "Color and fit as described. My daughter loved them."
  },
  {
    "user": "Devery",
    "rating": 5.0,
    "message": "Fit true to size! They have held up with the first half of the school year with a very active 7 year old! He is definitely not easy on them!"
  },
  {
    "user": "Ben Gelhaus",
    "rating": 2.0,
    "message": "The shoes fit well and look great, but I’m about a dozen wears they are already falling apart. So disappointed."
  },
  {
    "user": "CC",
    "rating": 5.0,
    "message": "These are my favorite shoes I’ve ever gotten for my son.  He says they are very comfortable and I think the color combo is too cute. True to size, and great quality. My son has had them for months now and they are still clean and not falling apart. Winning!"
  },
  {
    "user": "Maribel Perez",
    "rating": 5.0,
    "message": "2 nd pair bought for some ! He runs every 1 mile in them and then school. Sturdy shoe he loves them . Super comfy."
  },
  {
    "user": "Tamelka",
    "rating": 4.0,
    "message": "True to size"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Slim fit which is what we were looking for. My daughter loves them!"
  },
  {
    "user": "Alter_Avatar",
    "rating": 5.0,
    "message": "A very comfortable shoe, that is easy to fit due to the hook-and-loop closure.  Great for small kids."
  },
  {
    "user": "Katg",
    "rating": 5.0,
    "message": "These are great for wide feet and easy to put on. My grandson has outgrown 3 pair that were still in great shape so they are very durable."
  },
  {
    "user": "Mommybuyer",
    "rating": 3.0,
    "message": "Purchased the correct size 12 for my 6 year old and they where to narrow. Size up or buy wide."
  },
  {
    "user": "Erin Schmolzi",
    "rating": 5.0,
    "message": "My daughter loves them her confidence is so much more. At first she said they was tight but absolutely still wore them and now no complaints. Probably just the break in phase."
  },
  {
    "user": "John B. Robbins",
    "rating": 5.0,
    "message": "Velcro closure works fine, she runs in them with no problems."
  },
  {
    "user": "Roey",
    "rating": 5.0,
    "message": "Great shoes! My 4 yr old loves them!"
  },
  {
    "user": "Johnni Franks",
    "rating": 5.0,
    "message": "Got these for my 6 year old son and they are perfect!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My daughter loves wearing this for school. She said it is so comfortable and good for running and recess. So far so good!"
  },
  {
    "user": "Raj",
    "rating": 1.0,
    "message": "Not a good quality shoe. I invested this price to make sure my son gets a decent pair which lasts atleast a year or school. Hardly a month of usage, that too not daily, the stitches came off at one part and found 2 holes in the net, where the shoe would usually bend. Dissappointing."
  }
]