[
  {
    "user": "Amisha",
    "rating": 5.0,
    "message": "I bought mine on sale and worried the quality would suffer…but wow, was I wrong. These are my new favorite everyday shoe. Not too tight in the toe, laces secure my feet but do not hurt them. No issues with slipping. Not to mention the color is so vibrant. I get So many compliments on these shoes. The insole is Great. Soft and supportive. So glad I bought them. 💛 I prefer a Womens size 11, so I bought a Mens 9 and they are perfect."
  },
  {
    "user": "christopher s",
    "rating": 5.0,
    "message": "Sizing was good, shipping speed was good. They even got dirty, so I threw them in the laundry & they came out spotless.  I thought they were gonna be ruined, but I was pleasantly surprised. I'm actually looking at other colors now"
  },
  {
    "user": "Benjamin",
    "rating": 5.0,
    "message": "New balance is the worst at releasing a shoe that is amazing, then never making it again."
  },
  {
    "user": "josh kline",
    "rating": 5.0,
    "message": "These have to be some of the most comfortable shoes i've ever owned, and they look great. This was also the quickest adjustment/break in period i've ever had with a pair of sneakers cuz they just fit that well."
  },
  {
    "user": "Chris Pryor",
    "rating": 5.0,
    "message": "Lots of compliments on shoe!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I love the color, they would get 5 stars if they didn't run small and narrow. Consider going up a size if you plan to buy them."
  },
  {
    "user": "King C.",
    "rating": 5.0,
    "message": "This shoe is very comfortable casual walking shoe and the color is very  nice."
  },
  {
    "user": "Kristina Connolly",
    "rating": 5.0,
    "message": "Fit great, exactly as pictured."
  },
  {
    "user": "Sarah",
    "rating": 4.0,
    "message": "The shoes are a great color, which is why I ordered them. The quality seems less than ideal, but they will probably last a year or so, if you only wear them occasionally. Be aware, they run almost two sizes too small. I wear a men's 8.5, but had to return them for a 9, which are still borderline too small. I will keep them, but will need to wear very thin socks."
  },
  {
    "user": "Cara",
    "rating": 5.0,
    "message": "Love new balance and these pair are one of the best. I am an 11 in womens so I get a 9.5 in mens. I’m a nurse in my feet in an OR all day and these are just simply the best. Originally I didn’t want to leave a review because now I’ll never find this color again but they deserve all the love here…"
  },
  {
    "user": "Shelley Biggens",
    "rating": 5.0,
    "message": "Very comfortable shoe"
  },
  {
    "user": "Thomas Smith",
    "rating": 5.0,
    "message": "Everything worked out good"
  },
  {
    "user": "iCAN",
    "rating": 5.0,
    "message": "For my son, 6th grade.  Lots of compliments.  Will probably get another color"
  },
  {
    "user": "ChefKev",
    "rating": 5.0,
    "message": "Great. About to order another pair, different color!"
  },
  {
    "user": "Tbock",
    "rating": 5.0,
    "message": "Had to send the first round back but I ordered a larger size I love them, great color."
  },
  {
    "user": "Scott Krehbiel",
    "rating": 4.0,
    "message": "The color is brilliant, and the quality seems great.  I have other New Balance shoes (cross trainers) which fit great at 10.5, as do pretty much all of my shoes.  For these, I really should have ordered size 11.  They really do run a bit small."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Bought these to wear around the house because my podiatrist said being barefoot at home is causing plantar fascia issues. Nice and comfy and my kids like the style in green."
  },
  {
    "user": "el Grafadurro",
    "rating": 5.0,
    "message": "Fit great. Look great. Smell like brand new shoes."
  },
  {
    "user": "Ramona",
    "rating": 5.0,
    "message": "They were perfect"
  },
  {
    "user": "ECDC",
    "rating": 3.0,
    "message": "This shoe is more for looks than comfort, wouldn’t wear them for more than a couple of hours…wouldn’t travel with them…they’re just ok"
  },
  {
    "user": "Easy Maribel Núñez langarica",
    "rating": 5.0,
    "message": "me quedo muy pequeno el articulo"
  },
  {
    "user": "Angel",
    "rating": 5.0,
    "message": "Excellent sizing information, very accurate colors and description, recommended!"
  },
  {
    "user": "Gustavo D. Mattiello",
    "rating": 5.0,
    "message": "Item is just as seen on the pic. just have in consideration is a little tight so order half size bigger"
  },
  {
    "user": "mrsmwright-roberts",
    "rating": 5.0,
    "message": "Great color.  Looks exactly like the pictures. I bought them to match my shirts."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love the green"
  },
  {
    "user": "Tracey Mitchell",
    "rating": 5.0,
    "message": "Fits perfectly. Very comfortable."
  },
  {
    "user": "Walter franco",
    "rating": 2.0,
    "message": "Usually a huge fan of NB sneakers. These run shockingly narrow. I’d suggest you order a size up. I can’t wear these in my normal size. Super disappointed"
  },
  {
    "user": "Roz",
    "rating": 2.0,
    "message": "We're uncomfortable, I was very disappointed, usually New Balance are very comfortable, that's why I wear them.  The inside needs more padding.  Don't slack on shoes because of online ordering.  Please keep the quality # 1"
  },
  {
    "user": "KAT D",
    "rating": 1.0,
    "message": "I really wanted to off like these shoes, but there is no support at all. I don’t think I would wear them. Furthermore, there’s a warning on the shoes that they can never get wet or there will be blue dye everywhere. I am sending them back"
  },
  {
    "user": "Jacki Corbett",
    "rating": 1.0,
    "message": "I gifted them to him"
  },
  {
    "user": "Edwin Viera",
    "rating": 1.0,
    "message": "Walking sneakers however too big"
  },
  {
    "user": "Elvia R. Reyna",
    "rating": 1.0,
    "message": "Too small in width and length.  Probably needed to get 2 sizes bigger.  Missed return window."
  },
  {
    "user": "Bibi",
    "rating": 5.0,
    "message": "I've gotta do a few 2-3 mile walks in these in the next few days to see how they pan out, but right out of the box, the fit, quality, look and support are incredible. My foot profile is pretty simple. I'm 6ft 3, and my feet are quite thin from top to bottom, ...but also kinda that crazy torpedo shape from heel to toe tall guys get. NB has almost always worked the best for my foot profile. They're good at not OVER doing the padding features in the wrong areas for my feet, while adding a TON of support to the downforce areas. I also love the simple top design...very breathable, plenty of room but not too loose, and a very accommodating toe end, which flexes and adjusts to my wider top foot profile the more I use the shoes. Other shoes, I've found can have better support, more padding, etc...but either my feet can't breathe, they sweat too much and start chaffing my upper and lower foot (which leads to blistering), they start pissing off my lower middle foot from too much padding, or they're just plain constrictive feeling and way too hot in terms of everyday wearability. I'm hoping these work out, if not, i'm pretty sure another model of NB will work fine after some trial and error. I also love the fact NB offers \"wide\" profile shoes as well as standard. These are sneakers, not dress shoes, and that's a next level offering for someone like me. Regardless, NB deserves a gold medal in terms of affordable, high end, carefully researched sneakers. PS...this is coming from an ex \"Vintage to Vintage Reissue Nike Air ONLY\" sneaker lover. Unfortunately, I got old, ...so I can still collect those beauties, I just can't wear'em 14 hours a day nonstop on my feet."
  },
  {
    "user": "David Stradley",
    "rating": 1.0,
    "message": "Terrible sizing issue"
  },
  {
    "user": "natausha",
    "rating": 5.0,
    "message": "I absolutely love them, brought the green and the color looks just like the picture! But I recommend going a size up. Fits a little tight."
  },
  {
    "user": "KindleKindle",
    "rating": 5.0,
    "message": "They (?) requested a review.  A unique device used to cover a human’s feet. Someone should patent this concept.  I think I could also use them for snack mix storage.  I elected to use them as a foot covering.  They work quite well when walking, running, sitting and even sleeping. I tried them on my hands, but the results weren’t as good."
  },
  {
    "user": "Soledad",
    "rating": 4.0,
    "message": "Comodos"
  },
  {
    "user": "Paul Lisun",
    "rating": 5.0,
    "message": "By far the best style NB.ever made …574….I owned a pair when they first came out…Got all my boyz rockin them in the city…these are Slappin for sure"
  },
  {
    "user": "Johnbeacham",
    "rating": 5.0,
    "message": "Love them."
  },
  {
    "user": "Bkromey",
    "rating": 5.0,
    "message": "I got The Green color been a NB fan Since the 80’s I knick name the all green pair NY Jets Setter!!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Fällt mindestens eine Nummer kleiner aus ansonsten schöner Schuh."
  },
  {
    "user": null,
    "rating": null,
    "message": "Ottima scarpa calza bene! Ne acquisterò  ancora di altri colori."
  },
  {
    "user": null,
    "rating": null,
    "message": "Pur avendo prime, le scarpe non sono arrivate subito. Comode e rapporto qualità-prezzo ottimo. Arrivate nuove e in ottime condizioni."
  },
  {
    "user": null,
    "rating": null,
    "message": "Alles Super"
  },
  {
    "user": null,
    "rating": null,
    "message": "Top! Immer wieder"
  },
  {
    "user": null,
    "rating": null,
    "message": "Scarpe comode per tutti giorni"
  },
  {
    "user": null,
    "rating": null,
    "message": "Leggere, morbide e comode!"
  },
  {
    "user": null,
    "rating": null,
    "message": "Ich hab diese Schuhe für mein Schwager gekauft. Er sagte mir das die Schuhe genau seine Größe entsprechen und sie total bequem sind. Farbe wie auf den Bilder"
  },
  {
    "user": null,
    "rating": null,
    "message": "Prodotto come descritto. Tutto ok. Ottimo"
  },
  {
    "user": null,
    "rating": null,
    "message": "Belles et confortables !"
  },
  {
    "user": null,
    "rating": null,
    "message": "Scarpe comprate poco più di un mese fa,sono lacerate all'altezza dei fori dei lacci, premetto che le uso solo per camminare,non gioco a calcio ne per altre attività. Valutate voi se acquistarle,pessima fattura e sono molto scettico che siano originali,mai più scarpe su Amazon visto che ho avuto problemi anche con un altro paio in passato"
  },
  {
    "user": null,
    "rating": null,
    "message": "Die Schuhe waren zu groß, so dass ich sie zurückschicken musste. Aber ich musste fast 20€ selber bezahlen."
  }
]