[
  {
    "user": "anonymousbadger",
    "rating": 5.0,
    "message": "If you’re in between sizes and have narrow/normal feet, get the smaller one. I’m usually a 6.5-7 and got a 6.5W. Fits well and looks great"
  },
  {
    "user": "Jeep girl",
    "rating": 5.0,
    "message": "These are very comfortable, memory foam inside to comfort and support arches and heels. Can wear these for over 12 hours and still feel amazing! Great choice in shoes!"
  },
  {
    "user": "Denise Rodriguez",
    "rating": 4.0,
    "message": "Shoe came damaged. Waiting for a new pair"
  },
  {
    "user": "Mre",
    "rating": 5.0,
    "message": "Good value.  Daughter loves them and they are for her dance team.  They fit as indicated.  We bought them in 7.5 and they worked."
  },
  {
    "user": "Beatrice Rivera",
    "rating": 4.0,
    "message": "Couldn't fit even after buying a size up from my normal size."
  },
  {
    "user": "Sabrina",
    "rating": 5.0,
    "message": "Definitely do a half size smaller than your normal shoe size! Very nice looking shoes that are light weight. After just trying them on they’re super comfortable."
  },
  {
    "user": "Mel",
    "rating": 4.0,
    "message": "They run slightly big.....I was wondering why one was so much bigger than the other while wearing it and realized they sent me 2 different sizes!!!! But Great shoe"
  },
  {
    "user": "Olivia",
    "rating": 5.0,
    "message": "Super cute basic sneaker. The white is classic. Would recommend"
  },
  {
    "user": "djh66",
    "rating": 4.0,
    "message": "Great fit"
  },
  {
    "user": "raul arias",
    "rating": 5.0,
    "message": "excellent"
  },
  {
    "user": "chamaka",
    "rating": 5.0,
    "message": "i love them"
  },
  {
    "user": "Katie Gonano",
    "rating": 5.0,
    "message": "I love these and it’s one of my pair of sneakers I try to keep clean. Lol! I do sometimes wear them to the gym however. Mostly I wear them with a casual, comfortable outfit and like the clean white, classic Reebok look. Usually Reebok’s are cut a little small, but these are not and a little bigger for Reebok’s. So, in my opinion, they’re more true to size! I feel like you can’t go wrong with these!"
  },
  {
    "user": "jerry",
    "rating": 5.0,
    "message": "what  i was looking for"
  },
  {
    "user": "Maria A Vega-Viera",
    "rating": 5.0,
    "message": "They are my favorite sneaker.  Good fit, roomy and easy to style with"
  },
  {
    "user": "Tai Belle",
    "rating": 5.0,
    "message": "This is the second time I am purchasing this shoe for my daughter. I just upped by half size as she has long feet. The size 7.5 fits her comfortably. Her feet are long and she has a longer great toe than usual so I had to add the .5 as she wore size 7 last school year which ended in June."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "It’s a good product at the right price."
  },
  {
    "user": "Lita Rodriguez",
    "rating": 5.0,
    "message": "These shoes are absolutely a great buy, on trend great support comfortable I have a high arch and they are comfortable they are made well packaged nicely and arrived on time. Thank you !"
  },
  {
    "user": "Hannah",
    "rating": 4.0,
    "message": "I love these shoes! I only thing I would say is they run a little big. I usually am around a 7-7.5 for most shoes but I feel for these I should of bought a 6.5. Nothing a thick pair of socks & some tissue in the front can’t fix. Would highly recommend!"
  },
  {
    "user": "June smith",
    "rating": 5.0,
    "message": "I use this shoe as my classy run about shoe for shopping, casual dining, and cardio exercise.  It is supportive, light, and comfortable. Reebok is👍for me!!"
  },
  {
    "user": "Azadeh",
    "rating": 4.0,
    "message": "Great quality"
  },
  {
    "user": "Ruth C",
    "rating": 5.0,
    "message": "They are light weight and comfortable. I wouldn’t wear them to exercise or a long hike, but that’s not what i got them for. They’re a good basic for a teacher that might not want to wear dressy shoes with a dress or skirt."
  },
  {
    "user": "Margaret Duncan",
    "rating": 5.0,
    "message": "I ordered my usual size 8 but sent back as tight. 8 1/2 fit fine. Compared to earlier Reebok size 8, this time the shoes are smaller. So, order next shoes 1/2 - size larger."
  },
  {
    "user": "jada",
    "rating": 5.0,
    "message": "Fit nice and a little weight to it and got here on a reasonable time"
  },
  {
    "user": "Roseanna Martinez",
    "rating": 4.0,
    "message": "These are cute, but they run long/big. My fault I couldn't exchange them bc I wore them out before really assessing how they fit. I'm a 6 1/2 in 95% of sneakers so i just didnt expect them to be big and just threw them on and ran out the door. A half size down...maybe even a full size would have been much better. The style really cute and on trend. They're fairly comfortable, but theyre only average in support like a 6/10 on support and comfort. (You can buy new ones and change the insoles if this is your only concernt though) I've worn them a bit even though they're too big and I love that they don't look dirty or get stained. I'm torn on whether I should order another pair smaller bc I think they're really great."
  },
  {
    "user": "Jessica Parker",
    "rating": 5.0,
    "message": "My favorite shoes for work and I'm on my feet 10-12 hours a day in a factory. They do wear out after a few months, but I'm short and do a lot of walking and tiptoeing to reach things."
  },
  {
    "user": "Jess",
    "rating": 5.0,
    "message": "legit love this sneaker & I wanna buy more"
  },
  {
    "user": "jjesse",
    "rating": 4.0,
    "message": "I love these. White sneakers are scary because they dirty easily but these are super easy to wipe down. I got my regular size 8 but my heel kept slipping up when I walked. I switched to a 7.5 and they fit perfectly"
  },
  {
    "user": "Bels",
    "rating": 3.0,
    "message": "I bought these as working shoes, I have other rebooks that I love and I thought these were going To be kind of soft because the soles are very similar to the new balance staples. But it's actually even more hard than the shoes with flat soles that I own. Also I saw one comment saying that one shoe was more narrow than the other, and at least in my case, it's true. Is not bad, not good, it's just mid."
  },
  {
    "user": "Roberto Lluch",
    "rating": 5.0,
    "message": "LOVE LOVE LOVE. They run a 1/2 size big. I typically wear a 9, but ordered an 8.5, as the reviews advised, and they fit perfectly! They are stylish and comfortable. The insole is also removable so you are able to take that out and replace it with an orthotic if you want, which is what I did."
  },
  {
    "user": "me",
    "rating": 5.0,
    "message": "They have been falling apart, strangely."
  },
  {
    "user": "Nicole Miller",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "peter mohan",
    "rating": 5.0,
    "message": "School physical education"
  },
  {
    "user": "Stefany",
    "rating": 5.0,
    "message": "I have wide feet so I did size up and at first it seemed like it fit slightly large but it’s perfect for me since it gives more room for my toes. They’re also super cute and go great with a variety of outfits"
  },
  {
    "user": "Dorothea Pieters",
    "rating": 5.0,
    "message": "Constable"
  },
  {
    "user": "Hannah Weigant",
    "rating": 4.0,
    "message": "A tad roomier than expected but I do have a narrow foot.  The shoe came with a yellow mark, almost like candle wax on the laces in two spots and a huge sharpie mark hidden in the lace where it was tied. Totally random things and I can change the laces out and there will be no issue but seller should have seen this before sending."
  },
  {
    "user": "Tamala S. Scott",
    "rating": 5.0,
    "message": "Everything about them"
  },
  {
    "user": "jmetuna",
    "rating": 5.0,
    "message": "This sneaker is cute enough to wear with a casual outfit but also has enough support to wear for a quick run. Lightweight and very comfortable out of the box. Did not need to break them in at all."
  },
  {
    "user": "Ana",
    "rating": 5.0,
    "message": "Me encanto, solo que pensé que me podría quedar un poco grande y pedí una talla más de lo cual me arrepentí cuando el producto llego."
  },
  {
    "user": "CRodriguez",
    "rating": 5.0,
    "message": "I’ve purchased these sneakers twice and wear them a lot as they are easy to clean, very comfortable, and versatile as they  look stylish with different outfits."
  },
  {
    "user": "Araca Wadsworth",
    "rating": 4.0,
    "message": "Hi, Could I get new shoelaces for this product? The shoelace on one shoe has a shredded part. I can send a picture."
  },
  {
    "user": "Hayley Dykes",
    "rating": 5.0,
    "message": "Not very comfortable. Tight around the toes."
  },
  {
    "user": "TooFLy",
    "rating": 4.0,
    "message": "I wore these for the first time 2 days ago to walk my dogs and they are comfortable. However, I have fallen arches and definitely need more support on the inside. I don't feel much built in arch support here. So if you are like me, you'll need to get that. Otherwise, these fit perfectly. They are stylish 😎."
  },
  {
    "user": "Susanne Littlechild",
    "rating": 5.0,
    "message": "What I like the most about this shoe, is that it keeps it's shape and doesn't look worn out even thought I wear these all day 5 days a week."
  },
  {
    "user": "shante smith",
    "rating": 3.0,
    "message": "Not the old fashioned reeboks I hoped for, these had the weird shape"
  },
  {
    "user": "KimMcc",
    "rating": 3.0,
    "message": "When these shoes arrived they were obviously already lightly used. The laces were dirty. There was long hair inside. I didn't bother to see if they were comfortable. The return process was easy though. They were cute and the quality seemed okay."
  },
  {
    "user": "Nancy Reed",
    "rating": 3.0,
    "message": "My feet were hurting from all the different sneakers that I was wearing. I paid up to $250 for other brand sneakers and then I switched back to Reebok classic sneakers and my foot problems pretty much went away. They have good support while still being soft and I am on feet walking and running much of the day. Lately from Amazon I have received several knockoffs. They were not real Reebok Classic sneakers. I took them to the store and compared and spoke with the people selling sneakers and theses were knock offs. This has happened several times. I sent the ones I did not wear back to amazon and now I go to the store to get my Reeboks. They are a little more expensive but they are real. It is a waste of money to get knockoffs because they do not have the support or hold up very long. This is the first disappointment that I have had with Amazon."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I  so love my sneakers it is just what I have been searching for. Fit to size and so lightweight. I will surely buy it again."
  },
  {
    "user": "Cayla Reeves",
    "rating": 4.0,
    "message": "I am always a size 8 but these ran a little big for me. Otherwise happy with my purchase"
  },
  {
    "user": "Amanda",
    "rating": 5.0,
    "message": "I love these shoes. Took them to Europe for two weeks as my only shoes and they did an great job with walking 7-8 miles a day. I’ve worn them with causal dresses, jeans and shorts."
  },
  {
    "user": "amanda",
    "rating": 5.0,
    "message": "They fit a little big so size down. Very lightweight and comfy for nursing shifts!"
  },
  {
    "user": "kathleen cremeans",
    "rating": 5.0,
    "message": "I love this shoe ! It fits great great arch support so comfortable!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Sneaker seems good but need to size down. I am normally a 6 and it is too big for me. 5.5 would have been good."
  },
  {
    "user": "D. Bishop",
    "rating": 5.0,
    "message": "Very durable shoes"
  },
  {
    "user": "Annie B.",
    "rating": 4.0,
    "message": "Like the sleek black look. Light weight,  I will need to break them in. They are a little snug on my pinky toes. Otherwise pretty comfortable."
  },
  {
    "user": "Natalie Cazar",
    "rating": 5.0,
    "message": "These sneakers were true to size and are so comfortable I am on my feet all day comfortable and stylish."
  },
  {
    "user": "LD",
    "rating": 5.0,
    "message": "They are the same ones I buy all the time."
  },
  {
    "user": "Toby Williams",
    "rating": 4.0,
    "message": "The cushioning is terrific but could use a bit more arch support. And they tend to run on the narrow side. I will order, if available, a Wide on my next order. Good overall product."
  },
  {
    "user": "Jazmin Sanchez",
    "rating": 4.0,
    "message": "Great shoes but not good for long walks"
  },
  {
    "user": "Alicia",
    "rating": 4.0,
    "message": "Super cute shoe, I'm very bummed I didn't buy a 7.5 instead of my normal size 8.5 since they run so large they felt clunky and clownlike. I tried to where them anyways and kept tripping."
  },
  {
    "user": "M.Vander",
    "rating": 5.0,
    "message": "I'm on my feet all day and was suffering from leg pain. The first day I wore these, I had no leg pain."
  },
  {
    "user": "Fiona",
    "rating": 5.0,
    "message": "Fits perfectly!"
  },
  {
    "user": "Cliente de Amazon",
    "rating": 4.0,
    "message": "Son muy cómodos y bellos pero amoldan grandes me quedaron muy grandes"
  },
  {
    "user": "Caridad chavez",
    "rating": 5.0,
    "message": "Son cómodos y los utilice para caminar,grandes caminatas."
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "Super cute, can be dressed up or down, but felt fairly big. I'm usually a true 8.5, sometimes a 9, and I had to double-check the size to make sure I got the right one and that it wasn't mens. This is my first pair of Reeboks in many years so they might just run bigger than I knew"
  },
  {
    "user": "Whitney",
    "rating": 3.0,
    "message": "I wore these around the mall and my feet started to ache. I generally don’t have a lot of discomfort in my feet. Super cute though"
  },
  {
    "user": "Kathy Gonzalez",
    "rating": 5.0,
    "message": "These shoes are so comfortable for going out to run errands."
  },
  {
    "user": "sanita pellam",
    "rating": 5.0,
    "message": "The 1st time I ordered these I was soo excited I didn't pay attention to the size. I got a child's size 5 and had to send them back for an exchange. I reordered the correct size, 10 in women and they fit perfectly. So cute and I love the retro look with this bubblegum sole. I'd recommend them 100%!"
  },
  {
    "user": "No Big Ting",
    "rating": 5.0,
    "message": "I was so happy to receive these and they fit perfectly! They are Reeboks and my other Reeboks are half a size smaller than my other shoes so that’s what I ordered. If you do not own Reeboks, I would order a half size less than your other shoes. I have had many compliments on them and, so far, they are working perfectly. I do like their arch support as well."
  },
  {
    "user": "JJ",
    "rating": 4.0,
    "message": "I've been eyeing these for a while. They look so cute when I see other people wear them. At first they felt like huge orthopedic shoes but you get used to them. And seeing them in a mirror is a lot better. They're super comfortable. The sole is nice and squishy and there is actually a little arch support. Keep in mind when ordering though, the sizing is way off. I'd tried them on in a store so I knew what size I needed but if I'd have ordered my regular size it would have been a waste of time. I'm normally a size 8 in athletic shoes like this. Very occasionally I have to size down to a 7.5. I bought these in a size 7 and they are still a little more roomy in the toe box than I prefer but sizing down even more to the 6.5 makes them too short and my toe hits the end. I'll just have to get used to them a little bit but they are really cute and super comfortable. There's nothing like a nice fresh white pair of sneakers to make you feel good!"
  },
  {
    "user": "Pranali Taskar",
    "rating": 4.0,
    "message": "The shoes came in a somewhat damaged box without any tissue inside the shoe or in the box, which leads me to believe they might have been previously returned. Overall, I am happy with the shoes as I wanted easy to clean white shoes."
  },
  {
    "user": "Yesenia Beltran",
    "rating": 5.0,
    "message": "I've been rocking these with some cute outfits. They stay white white, are super comfy and very trendy. Other comfortable tennis shoes give off old lady and these and youthful. I love them. I want to get another pair. I got them a little big based on the reviews but they are narrow naturally so you can't even tell. I LOVE them!!"
  },
  {
    "user": "Emily Borne",
    "rating": 5.0,
    "message": "Love these shoes! Very comfy and good support. Exactly what I was looking for. Reminds me of my white nike air forces I used to have. I wanted something similar to them without having to spend the money. 10/10 would recommend"
  },
  {
    "user": "TickTockAlice",
    "rating": 2.0,
    "message": "I was really hoping this would be the pair of the multiple pairs of white shoes I have now purchased for my server job that I would keep. Nooooope. I waited to try these in after getting home from work because my feel swell and hurt after over 9 hours on them, running around and carrying heavy wine boxes, dishes, whatever. First of all they’re too big and slip. But the shoe itself is super narrow. The soles squeak, the leather is so stiff that it hurts the top of the foot when you step. The insoles are hard as a rock. They have a thin “memory” foam lining but I’ll tell you right now that even my Adidas Cloudfoam sneakers that have zero support (and I have 4 different pairs) are WAY more comfortable in the sole. There’s no spring back when you step, it’s like walking on 2x4 with a thin layer of foam. I can’t imagine why they even call this a running shoe. No one should wear these running. Back to the search."
  },
  {
    "user": "Carol",
    "rating": 4.0,
    "message": "This look really nice but seems like not enough comfort to long walks."
  },
  {
    "user": "Gunn",
    "rating": 5.0,
    "message": "Love the support and style these shoes have. They are true to size. Easy to clean and super cute with everything you’ll wear."
  },
  {
    "user": "Alex Page",
    "rating": 3.0,
    "message": "For the style I was going for these shoes are great. However, no show socks won’t stay up and get bunched up under my feet. Plus the soles are not very supportive and makes my feet hurt if I’m walking a lot."
  },
  {
    "user": "Nataly",
    "rating": 4.0,
    "message": "One shoe falls off while walking"
  },
  {
    "user": "W.J Cabada",
    "rating": 3.0,
    "message": "The media could not be loaded. they don’t arrive in a Reebok shoe box. I think they look a little fake but who knows I haven’t had Redbox in years. I think they run half a size big also they arrived with a big cut on the side like they sliced it with a blade. One shoes seem some what deform from the inside which made it uncomfortable to walk in."
  },
  {
    "user": "Jamie",
    "rating": 5.0,
    "message": "Good for the price! Stylish, comfortable. Go with almost any outfit. For me, they run about  a half size larger, so I returned my usual size 7 for a 6.5. These were perfect. I also like how lightweight they are. The gum bottom is a nice little touch."
  },
  {
    "user": "Kelly Thoma",
    "rating": 4.0,
    "message": "Super cute and comfy"
  },
  {
    "user": "MEM",
    "rating": 5.0,
    "message": "The media could not be loaded. Look as pictured. I’m usually a 7-7.5 and got the 7. It’s a perfect fit. Super cute, feel comfortable but a little stiff."
  },
  {
    "user": "I.E.Lewis",
    "rating": 3.0,
    "message": "Have purchase Reeboks in the past and love them,  but not so much this time.  There is little support and they are extremely stiff with no bend at all.  I purchase these to walk in but am hesitant to do so as they have given me blisters.  Would not recommend for wearing any length of time."
  },
  {
    "user": "Mike kirby",
    "rating": 4.0,
    "message": "Was size to small"
  },
  {
    "user": "SLC",
    "rating": 3.0,
    "message": "I bought these to wear on a trip. Needless to say I only wore them in the airport due to how uncomfortable they were after several hours. I had to loosen them, my foot was very uncomfortable where the laces are."
  },
  {
    "user": "Courtney Gores",
    "rating": 3.0,
    "message": "I love these shoes, they go with everything and comfortable. However I’m thinking I got a knock off, the rubber soled are starting to peel away from the shoe."
  },
  {
    "user": "M Nelson",
    "rating": 4.0,
    "message": "Comfortable and nice. I gave it 4 stars because I'm not sure they are the authentic reebok"
  },
  {
    "user": "Amazonfan",
    "rating": 5.0,
    "message": "The shoes are classic and comfortable. They run big I usually wear 9.5 had to exchange for a 9. I like the gum bottle. They are comfortable. I bought them for nursing school and they pair well with jeans. Must buy everyday comfortable white classic shoe!"
  },
  {
    "user": "miss diva",
    "rating": 5.0,
    "message": "sneakers are great for walking working out and plus they’re making a comeback"
  },
  {
    "user": "Sam",
    "rating": 5.0,
    "message": "This shoe looks and fits great! Reminded me of that retro look since they are the classic Rebook style. Sadly, I returned them, never worn, because I realized I bought them for the nostalgia and would unlikely wear an all white shoe."
  },
  {
    "user": "Samantha A Ramirez",
    "rating": 5.0,
    "message": "I absolutely love these shoes! The size was perfect so was the fit. I’m still absolutely amazed on the cushioning on these shoes it feels like walking on a matress."
  },
  {
    "user": "M. Feliciano",
    "rating": 4.0,
    "message": "These sneakers were a gift for my daughter for Mother's Day. They came on time and the sneaker itself is very nice and she loved them. The problem was the sizing. Ordinarily she uses a size 11. The size 11 fit big/loose. So then I ordered the 10.5 and those were too small. So both are to be returned and perhaps she will stick to a brand that the size is more consistent."
  },
  {
    "user": "Raina E.",
    "rating": 5.0,
    "message": "Took a walk from TS to Brooklyn to CT and after 20k steps not a blemish and my feet only hurt a little from all the walking. Great support"
  },
  {
    "user": "meeeeee",
    "rating": 4.0,
    "message": "Everyone said size down because they run big so I ordered half a size down but they were super tight on me. They look just like the picture and really comfortable but sadly were not approved for me to wear so I had to send them back."
  },
  {
    "user": "Natalie R. Neopolitano-Salmon",
    "rating": 3.0,
    "message": "Wide and runs big wish I went down a half size"
  },
  {
    "user": "Ashanti",
    "rating": 5.0,
    "message": "I use to wear these back in the day but needed some good walking shoes for work and these are so comfortable. I wore them for style then now I’m wearing them for comfort lol"
  },
  {
    "user": "jordan",
    "rating": 4.0,
    "message": "I’m a size 7 and these feel like a 7.5 easy. Super comfortable and cute."
  },
  {
    "user": "Sunshine",
    "rating": 5.0,
    "message": "I love these shoes. I have several pairs in this same style. They last a while, with proper care."
  },
  {
    "user": "Maria Thomas",
    "rating": 3.0,
    "message": "These shoes are not very comfortable my foot feels like it’s"
  },
  {
    "user": "marco",
    "rating": 5.0,
    "message": "Perfecto, tal como lo esperaba. Me encanta."
  },
  {
    "user": "Edith N.",
    "rating": 5.0,
    "message": "They are exactly as described. Just a little bit bigger than I thought. But they're nice."
  }
]