{
  "id": "B09YDRXBNK",
  "title": "Fila Men's Memory Workshift-m Shoes",
  "description": "Feel comfortable without sacrificing performance and protection in your work day with the Fila Memory Workshift slip resistant safety shoe. Where premium meets utility, the Memory Workshift is constructed from durable leather and synthetic overlays to give you a dependable work shoe that meets your occupational needs. Our Fila Memory Workshift shoe features a rubber slip resistant outsole to provide traction against slick or wet surfaces – tested in accordance with the applicable industry standards, including: ASTM F2913-11. Though designed to help prevent slips, you should always exercise caution on slick surfaces. The memory foam sockliner and midsole work in unison to provide additional comfort with every step of your day. Face your daily challenges with ease and support with built in perforations for breathability and a variable lace up front closure. Our work shoes are designed to fulfill work in every industry. From healthcare to restaurant, to construction and industrial - when the work day gets long, Fila is there with a shoe that defies expectations to deliver another level of performance and quality design. Fila began in 1911, in the small alpine town of Biella, Italy, a place renowned for manufacturing the world's finest textiles, and weaving fabrics with impeccable quality, true innovation and extraordinary beauty. Born of the city and its traditions, Fila is inexorably derived from Biella's dedication to artistry, luxury and elegance. This is our birthright, it's in our soul, and it defines our future. We continue to enrich the athletic experience by improving comfort and performance with Italian design, quality craftsmanship and refined materials. There is no feeling quite as luxurious as that of playing in Fila, and that is the reason for our existence. We create what is desired, not what is necessary. Not just enough, but more than you need. This is Fila.",
  "images": [
    [
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX575_.jpg",
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX695_.jpg",
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX535_.jpg",
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX675_.jpg",
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX625_.jpg",
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX395_.jpg",
      "https://m.media-amazon.com/images/I/61U5JL9EZTL._AC_UX500_.jpg"
    ]
  ],
  "rating": 4.3,
  "reviews_count": 29365,
  "reviews_link": "https://www.amazon.com/Fila-Mens-Memory-Workshift-m-Shoes/product-reviews/B09YDRXBNK/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews",
  "price_range": {
    "from": 32.0,
    "to": 80.0
  },
  "variants": [
    {
      "url": "https://www.amazon.com/dp/B00B8ITKQI/ref=twister_B09YDRXBNK",
      "id": "B00B8ITKQI"
    },
    {
      "url": "https://www.amazon.com/dp/B06W5GNTSV/ref=twister_B09YDRXBNK",
      "id": "B06W5GNTSV"
    }
  ]
}