[
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Even though I don't like the tread pattern on them ( collects mud easily ), this is the second pair of these shoes I have purchased. They are about the only ones that takes care of my problem with out buying two pairs of shoes. I wear an 11 on my right foot and on my size 11 left foot I wear an AFO Arizona brace because of Charcart's  foot. These shoes in a 12 extra wide lets me get in the left shoe wearing my brace and I can chinch the right foot down tight enough to wear. I find them very durable. I am a very active 70 year old that maintains a 70 acre RV park. Lots of mowing and moving things about."
  },
  {
    "user": "Matt D",
    "rating": 4.0,
    "message": "For me these ran one size smaller than I usually wear.  I purchased a size 13 which I normally wear now from a store.  When I put them on they felt fine, but after walking around with them after a shift they felt too small.  I then ordered two pair of these from amazon in size 14.  I have plenty of toe room with the 14's and they feel much better.  I have only worn them for three weeks.  They are light weight, comfortable, and are holding up great so far.  I have never worn a size 14 ever (was a 12 for long time) but the 14's work for me with plenty of toe room.  The size issue may just be me I don't know but I do like them and I have a back up pair when these wear out."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love fila and have had this shoe before and it feit and felt great.  This pair feels rough and is not comfortable to wear.  The memory foam doesn’t seem to exist in them.  Going to stick with avias from now on.  I get the same comfort with every pair of those I’ve bought.  Disappointed with the filas"
  },
  {
    "user": "Keith",
    "rating": 5.0,
    "message": "These are good shoes. worth the money.  very comfortable all around. the one problem is the soles aren't sticky enough for the shoe so it moves around some. so i ended up just buying dr Scholes inserts to replace the stock sole. if you've got wide feet get the extra wide. they're perfect"
  },
  {
    "user": "Daniel Hesse",
    "rating": 4.0,
    "message": "These shoes are great for walking, and for work! This is the third pair I bought from Amazon. The shoes are reliable, fit nicely. Certainly not the best tennis shoes, but they’ll last you a good 9 months to a year or so with heavy wear. Very much worth the price."
  },
  {
    "user": "Samuel Sutton",
    "rating": 4.0,
    "message": "I’m a big guy and work in the restaurant industry and these do well enough and last a fair amount of time. Comfortable and can make them last longer by changing the inserts after a little while. Super non-slip grip. Sure, there’s better shoes out there, but for under $40 on sale? I bought a couple pairs to keep them clean, fresh, and well maintained by rotating."
  },
  {
    "user": "Goldiev1",
    "rating": 4.0,
    "message": "Great traction on most surfaces, but mid-section comfort is somewhat lacking. You must be careful not to overtighten the laces in the middle of the shoe, or else it rubs against the skin, even while wearing thick socks."
  },
  {
    "user": "Robert S.",
    "rating": 4.0,
    "message": "I would give it a 5 star, but the first week was hard and my feet hurt from the cement floors. After they broke in, I had no problem and feet don't hurt. Cement floors are killers on the feet."
  },
  {
    "user": "Robert",
    "rating": 5.0,
    "message": "I bought this shoe because I needed a shoe that was slip resistant. I took a job at a local grocery store and was advised to buy these. The fit is great. I am a 9 1/2 WWand these fit just right.The arch support is good and after a shift my feet didnt bother me. I like the color. I have no dislikes. The price was a good value."
  },
  {
    "user": "Jason",
    "rating": 4.0,
    "message": "The shoes look great and definitely feel durable. Price is very good for the quality. I've had mine for a while now, and despite having a walk-heavy job, they still have that rigid new-shoe feel. They are pretty tight for the size, though. I read reviews saying that you should order a size larger, and while I didn't do that, I did make sure to get the wider model, and it's still pretty dang snug. It's nothing terrible, but it does make me want to listen and order at least a half-size larger next time."
  },
  {
    "user": "Patrick",
    "rating": 4.0,
    "message": "Bought these for clinicals at a hospital. They’re perfect for me because it’s memory foam, nonslip and comfortable. I’ve stood on them sometimes for 16 hours between school and work right after and my feet don’t hurt as much as I’d expect compared to my other shoes"
  },
  {
    "user": "Ron Daugherty",
    "rating": 4.0,
    "message": "Right out of the box these shoes were comfortable but a bit stiff.  I normally shop in store to make certain of the fit.  I would buy again from this store."
  },
  {
    "user": "Joe Hunt",
    "rating": 5.0,
    "message": "I waited to write this review to see how long the shoes lasted. Well it has been almost 2 yrs. They held up great. I recommend them."
  },
  {
    "user": "Leslie D.",
    "rating": 4.0,
    "message": "The eyelets are not in the same position on both sides of the shoe.  You would think that they should be exactly across from each other. Nope!.  Guess quality control has gone to crap in China or Vietnam, where ever thay are made"
  },
  {
    "user": "Donato Dellorso",
    "rating": 5.0,
    "message": "Very comfortable work sneaker especially being on my feet for 12 hours a day"
  },
  {
    "user": "harold blythe",
    "rating": 5.0,
    "message": "Used to wear Nike monarch but these are just as good I order a size larger than I wear"
  },
  {
    "user": "Mark C. Otto",
    "rating": 5.0,
    "message": "Perfect fit. Fila quality. Like the wide option. Excellent show at an affordable price. Go buy 'em."
  },
  {
    "user": "Sarah Anne",
    "rating": 5.0,
    "message": "He found these very comfortable! My son is a dishwasher at perkins so these are a must! He wore them 5 days a week for all over a year before they started falling a part which is really good for a pair of shoes worn in a greasy wet kitchen that were under 50 dollars!"
  },
  {
    "user": "cassandra finucane",
    "rating": 5.0,
    "message": "My husband loves these sneakers and the only ones he will wear for work in the summer. He is a hvac tech and always moving and says these sneakers are so comfortable. He only likes them in white which is very hard to find. Everyone only sells them in black. I was so happy to find them in white on here"
  },
  {
    "user": "ASH",
    "rating": 5.0,
    "message": "These shoes were a surprise as they actually fit in all areas.  The toe, the heel, the arch and the width.  Exactly as a extra wide shoe should fit.  I couldn't ask for a better fit."
  },
  {
    "user": "b hosa",
    "rating": 5.0,
    "message": "pretty happy with these so far"
  },
  {
    "user": "Thrifty Shopper Girl",
    "rating": 4.0,
    "message": "I have worn Fila before did expect it not to be such a flat shoe"
  },
  {
    "user": "Pablo Martinez",
    "rating": 4.0,
    "message": "what i liked is that they are true to the grip, I did not slip.What I dislike about it is that I still have hill pain."
  },
  {
    "user": "Nathan",
    "rating": 5.0,
    "message": "It’s been rare finding a shoe that fits right. First off, 8.5 shoe is near impossible to find but finding one which is is also wide, impossible!  Thank you for a shoe my exact size."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very comfortable n lightweight great low price will buy again 4sure"
  },
  {
    "user": "Coach C",
    "rating": 5.0,
    "message": "This is my second pair and I walk in them daily. Very comfortable and good support."
  },
  {
    "user": "Pete d.",
    "rating": 4.0,
    "message": "I like these b/c they're cheap. I don't like that they only last about 2 or 3 months."
  },
  {
    "user": "Harold Smith",
    "rating": 4.0,
    "message": "For work, my feet are hurting"
  },
  {
    "user": "geoffrey m. coats",
    "rating": 5.0,
    "message": "Not one thing"
  },
  {
    "user": "brian c",
    "rating": 4.0,
    "message": "ok shoe nice price but thin tread on bottom of shoe not going to last me that  long walking a lot as I do."
  },
  {
    "user": "who dat",
    "rating": 5.0,
    "message": "Great fit! Quality product. Will definitely buy another pair!! Best slip resistant shoes I have owned in the last 5 years! Two thumbs up."
  },
  {
    "user": "Robert Crane",
    "rating": 4.0,
    "message": "Big toe touches sometimes"
  },
  {
    "user": "Patricia Madourie",
    "rating": 4.0,
    "message": "All is well"
  },
  {
    "user": "Lonzo",
    "rating": 5.0,
    "message": "These are very nice shoes for the price and they fit to my size. I was a little surprised that these shoes were so nice a pair for what I paid for them. They came on time in great shape."
  },
  {
    "user": "Albert Reid",
    "rating": 4.0,
    "message": "great product thank you"
  },
  {
    "user": "NILA",
    "rating": 5.0,
    "message": "Excelente zapato"
  },
  {
    "user": "Jeffrey Summers",
    "rating": 5.0,
    "message": "Very good. Was more than pleasantly surprised at the fit and comfort. I ordered another pair. Sizing was true."
  },
  {
    "user": "Marta",
    "rating": 5.0,
    "message": "My husband has been buying these shoes for years, he uses them as walking tennis."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Size was as it was supposed to be and fits nicely"
  },
  {
    "user": "Jane M.",
    "rating": 5.0,
    "message": "The shoes are comfortable, the toe box is just right and they don’t slip up and down on your heel.  They are great work shoes."
  },
  {
    "user": "A-to-Z Customer",
    "rating": 5.0,
    "message": "So all new shoes usually require a breaking-in period, correct? Yes, usually, but not with these shoes. I've been wearing them quite happily all day. My feet feel like they're being massaged from the ground up, even when I am not walking with them. I ordered them in the extra-wide width, which does not make them looser, it just allows your feet to better utilize and spread out into the memory foam sockliner, still without being constricted by the edges of the shoes. Consider me a very satisfied customer who is highly recommending these shoes to you."
  },
  {
    "user": "John M Cunningham",
    "rating": 5.0,
    "message": "These sneakers fit perfectly, and the laces were the correct length which is almost impossible to find in a retail store."
  },
  {
    "user": "Kamerade",
    "rating": 5.0,
    "message": "Had to buy these because my workplace (food service) required their workers to wear non-slip shoes. The shoes fit perfectly and did not come with any visible flaws as other reviewers have mentioned; plus it was on sale so I was surprised by the quality of the shoes. They feel sturdy for now, but I'll have to see how they hold up once I start going back to work with them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes wear well for the price. I wear them daily to work and the gym They seem to last between 9-12 months. The soles on mine wear out faster than the upper portion. Overall a good product for the value. I buy 3 pairs at a time to keep \"stocked up\""
  },
  {
    "user": "Reginald V. Presley",
    "rating": 4.0,
    "message": "The fit is good. Plenty of toe room. Nice cushioned insole. Have to try them out before I can say more."
  },
  {
    "user": "James F",
    "rating": 5.0,
    "message": "Great shoe.."
  },
  {
    "user": "Richard d.",
    "rating": 4.0,
    "message": "Like the fit.what do I use them for? Believe it or not.. walking 🚶‍♂️ around... the only other thing I could think of.?  Kicken' butt??"
  },
  {
    "user": "allen",
    "rating": 4.0,
    "message": "I usually order a size 7 1/2 in shoes, I ordered an 8 and the toe area is a little tight. I will order this shoe again as they are comfortable but will order an 8 1/2 this time. You still have to be careful walking on slippery floors as I still slip a bit, but not bad."
  },
  {
    "user": "Victoria Barone",
    "rating": 5.0,
    "message": "My son does a lot of working at his job and he likes these sturdy comfy sneakers"
  },
  {
    "user": "Michael P.",
    "rating": 5.0,
    "message": "I work in a CNC shop where water based coolant is used. I usually use New Balance 609's. Price was the reason for trying these. I've had them for 9 months now. The sole handled the chemicals well and the toe did not curl up like some shoes. Always had great grip on wet and dry floors. They never even felt slick at all. I work 50 hour weeks and they've just about seen their last shift. I typically get 6 months out of my other brand choice.  I would suggest breaking them in before using them."
  },
  {
    "user": "shirley shields",
    "rating": 5.0,
    "message": "Shoes feel good in my feet,"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Nothing to dislike"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is a great pair of working shoes. I walk at work all day and surprisingly the shoe holds up. My feet are not aching at end of a work day."
  },
  {
    "user": "mike latchman",
    "rating": 5.0,
    "message": "Working everyday"
  },
  {
    "user": "Ronald W. Medlock",
    "rating": 4.0,
    "message": "Like it."
  },
  {
    "user": "derek clarke",
    "rating": 4.0,
    "message": "Shoes fitted ok andbis light weight but after a few months it started to rub and squeeze my 2 pinky toes. I had to stop wearing them. Loojsblike the seam on the shoes is the problem"
  },
  {
    "user": "Francesca Henning",
    "rating": 4.0,
    "message": "souls wear quickly"
  },
  {
    "user": "Randy B. Peden",
    "rating": 5.0,
    "message": "Good valve  - light to wear"
  },
  {
    "user": "Mike",
    "rating": 4.0,
    "message": "I wear a 4E and have a touch of neuropathy. These shoes are comfortable and the no slip soles are great"
  },
  {
    "user": "Ivy Smith",
    "rating": 5.0,
    "message": "They are true to size and perfect for my son for work"
  },
  {
    "user": "Alexander p.",
    "rating": 5.0,
    "message": "El calzado lleno la espectativa"
  },
  {
    "user": "Osvaldo Lopez",
    "rating": 4.0,
    "message": "Only have had for few days, but shoe is comfortable it feels good and I believe gives be pretty good support."
  },
  {
    "user": "Boots Nichols",
    "rating": 4.0,
    "message": "I bought these work shoes for my son, he works at grocery store in meT department, they are no slip so that's great, fit is good, comfortable. He is on his feet all day long so he needs co.fort for sure..The only thing is they last about 6 months but to be far he gets them wet nearly everyday because he has to clean meat department with water hose. He really needs rain boots! All in all good pair of shoes for work!"
  },
  {
    "user": "Jim Nolan",
    "rating": 5.0,
    "message": "Fair price; fit well; easy to break in."
  },
  {
    "user": "Angel pantoja",
    "rating": 4.0,
    "message": "Es muy comodo"
  },
  {
    "user": "Takumi Inui",
    "rating": 4.0,
    "message": "So anyone buying slip proof work shoes like myself are probably working in a wet environment dealing with presumably food adjacent work. For me, it's a fishery. All my work shoes last roughly 90 days. These Fila shoes were a good price, took longer to break in then I'd like (about 3 weeks, were tight at the toes for a 9.5 Wide but got to shape in time). The pleather coating only started falling off about 80 days in or so, which for constantly having scalding hot shrimp oil, poached salmon water, or lobster fat on it was pretty good I'd say. The foam cushioning gave way after about 5 weeks but still offered good support for 8 hour shifts. Work shoes for under 70$ are never going to last longer then 4 months, once these broke in they're the second most compostable work shoes I've ever had. Not enough to buy another pair, I got mine for around 34-ish. However if the pair I replaced these with don't work out, I'm buying another pair if they're under 42$ and dear reader I suggest you do the same. The actual slip resistance was really solid too, light treads so nothing really got stuck in there. Stink resistant too tying back into the fact again, fishery work. The material is good at not absorbing water, oils, or scents. Anyone in food services should know that if it gets in above 4 inches of water or gets directly blasted with a hose though, they will stay soggy for about 4 hours. Otherwise they're great actually. Shoes are expensive if you're buying in this price range it's for comport not for a long, lasting relationship with some toe containers."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I liked the shoes so much, within 3 days I ordered a second pair."
  },
  {
    "user": "Mario77",
    "rating": 4.0,
    "message": "Slip resistance is inconvenience when walk for sand or hummed soil.  The sole of the shoe becomes filled with sand or dirt."
  },
  {
    "user": "Kelz W.",
    "rating": 3.0,
    "message": "I used these shoes heavy, I needed cheap yet long-time shoes for work so I didn't slip on any slippery surface. The shoes felt awesome. It really did help with not making my feet feel like they were on fire at the end of my long 8 hour shifts. However, the shoes only lasted for half a month before the bottom of my shoes began to hurt my fee. Inside the shoes on the bottom got flat and hard. Overall, I don't regret the purchase because it did its job until I got something better but I was definitely disappointed."
  },
  {
    "user": "Perry Allen Smith",
    "rating": 4.0,
    "message": "I used to wear steel toe shoes, recently made the switch for two reasons: first, my feet were in serious pain even with multiple gel pads and gel insoles because the model I wore previously had a bad design; and I got tired of having heavy shoes rather than something light and comfy. I got these in, have been trying them out for a couple weeks now, and I am quite satisfied. They're light, comfortable, flexible, and even without an additional insole they are good to wear for standing during an eight-hour shift with plenty of walking. I was concerned they would be too tight but the fit is actually pretty good, only real drawback is if you want an additional insole you have to use a pretty thin one because a standard Dr. Scholl's insert made it almost cramped in this shoe; I had to remove it in order to feel comfortable again. Other than that there are no serious issues and the shoe has a good grip on flooring so they're perfectly fine for the work site (my job requires slip-resistant shoes but not steel-toed, so I'm good to go). Highly recommend."
  },
  {
    "user": "GLENN 4",
    "rating": 4.0,
    "message": "Very comfortable shoe but the soul were out very fast for outdoor use"
  },
  {
    "user": "C. Vickers",
    "rating": 4.0,
    "message": "Fits well comfortable shoes."
  },
  {
    "user": "Monique R",
    "rating": 4.0,
    "message": "They are comfortable"
  },
  {
    "user": "Guillermo",
    "rating": 4.0,
    "message": "Excelente precio"
  },
  {
    "user": "Deb",
    "rating": 4.0,
    "message": "Shoe fits great. Very comfy"
  },
  {
    "user": "Big Sarge",
    "rating": 5.0,
    "message": "Fell fit and definitely buy again."
  },
  {
    "user": "al",
    "rating": 5.0,
    "message": "Saved me a trip to kohl's and money 💰 Along with having Shipped to my door Quality working shoe"
  },
  {
    "user": "Michael Manicone",
    "rating": 5.0,
    "message": "This shoe fits and looks nice. A good price as well!"
  },
  {
    "user": "Maria ponce",
    "rating": 5.0,
    "message": "Lo ancho perfecto y el arco muy bien lo recomiendo 👍"
  },
  {
    "user": "Mostly Reign",
    "rating": 4.0,
    "message": "I use for work.  the non slip traction burned off in about 4 months.  a slip on bungee lace would be better.  I recommend these,  if you don't work on a rough surface floor like me."
  },
  {
    "user": "CLAUDE H BARRON JR",
    "rating": 4.0,
    "message": "Excellent"
  },
  {
    "user": "Jeremy Binkley",
    "rating": 4.0,
    "message": "The best shoes ever for being on steep roofs"
  },
  {
    "user": "Bart Fargo",
    "rating": 4.0,
    "message": "They fit perfectly..no complaints I recommend them highly"
  },
  {
    "user": "alan f.",
    "rating": 4.0,
    "message": "Very comfortable."
  },
  {
    "user": "L. Brown",
    "rating": 5.0,
    "message": "These feel really comfortable! Very impressive shoes IMO. I walk a lot at work (4-6 miles according to my smartwatch) & while it does feel good when I take them off (what shoe don't afterwards?!) my feet feel better then they have in many other shoes. Very happy with them!"
  },
  {
    "user": "Horseyone",
    "rating": 4.0,
    "message": "squeeky on tile floor, otherwise very good."
  },
  {
    "user": "Joyce",
    "rating": 5.0,
    "message": "I cannot stress how much I absolutely LOVE these shoes for work! I have a bunion, wide flat feet, AND I’m an 11 in women’s shoes so finding work shoes for me is an absolute NIGHTMARE because everything is uncomfortable and nothing fits me right! I’ve gotten this exact pair 3 times now and they never fail! They last a good amount of time, about 6-8 months, and it’s the only pair of work shoes I’ll ever get. As a server and being on my feet all day these really pull through for me! :)"
  },
  {
    "user": "Paul",
    "rating": 4.0,
    "message": "I bought these for walking my dogs on pavement mostly. At first they seems kind of tight and I only wore them on the short walks to see if breaking them in would help. It did and now I wear them on all the walks. They are pretty comfortable for my walking the 2 miles I walk. not sure how they would feel after having them on for 8 hours though. The one minor issue I have with them is that the treads catch and hold everything from dog crap to dirt and mud. I step in dog crap one day and had to use a hose at full stream to remove it all as a stick and shuffling on the grass didn't help at all. Mud is the same. Minus 1 star for that. Stick to regular roads and I have no issue. Don't know if they will keep water out as it has been very dry here this fall. Time will tell."
  },
  {
    "user": "Jerad Reimers",
    "rating": 5.0,
    "message": "These shoes are great, this is the second pair that I have purchased."
  },
  {
    "user": "Mocha Lover",
    "rating": 5.0,
    "message": "Comfortable, dependable, supportive foot ware. Good for 3 mile sidewalk commute."
  },
  {
    "user": "Bookseller",
    "rating": 4.0,
    "message": "I like the fit of these shoes (I've had three pair) and they wear pretty good - I've worn the soles out on three pairs in three years. But on a hot day my feet feel like they're wrapped in cellophane. These shoes do not breathe and consequently my feet sweat pretty bad which makes them uncomfortable by the end of the day."
  },
  {
    "user": "Sprio Can",
    "rating": 5.0,
    "message": "Nice sneakers light wait and comfortable  .I don’t recommend for the summer ,for the other season should be fine,I highly recommend it nice shoes."
  },
  {
    "user": "Derek Celestino Ginn",
    "rating": 5.0,
    "message": "Great fit. Memory foam is a dream."
  },
  {
    "user": "davidgrandma",
    "rating": 5.0,
    "message": "very comfortable and the price is right"
  },
  {
    "user": "C. Mandel",
    "rating": 5.0,
    "message": "The shoes fit fine, I've been buying these for years. The only issue I have is the insoles which don't have much cushion in them."
  },
  {
    "user": "Carmine",
    "rating": 3.0,
    "message": "Seem to wear out fast"
  },
  {
    "user": "Zachary Wyzinski",
    "rating": 4.0,
    "message": "I mow lawns in these shoes."
  },
  {
    "user": "jonah",
    "rating": 5.0,
    "message": "Some of the better shoes I have bought. They are great for my work. I work in a mechanic shop and they do not disappoint. They do not slip on wet concrete floors or other fluids that gets spilled. They remain comfortable all day. Not my first pair or last."
  },
  {
    "user": "Joe S.",
    "rating": 5.0,
    "message": "I like wearing these shoes.  They are highly comfortable."
  },
  {
    "user": "EmanVman",
    "rating": 4.0,
    "message": "I work serving people food and my foot is arched so I need solid arch support but the way the shoe is made is better if your flat footed. The memory foam is good but again the arch support is very minor and personally I need more than what it comes with. I’d say I need Mabye half an inch or more of arch support and the shoe comes with Mabye 1/4inch or less"
  }
]