[
  {
    "user": "Ashley Wilkins",
    "rating": 5.0,
    "message": "I have had these shoes for almost 1.5 years and I still love them. They are light and comfortable. I wear them to workout, work or anywhere even walking 10 miles around Disney World and my feet did not hurt. There is a spot in mine currently that is starting to wear thin on the bottom because I wear them so much. Will definitely buy a new pair soon!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Exceeded my expectations. Incredible value. More comfortable than my Nikes! If I’m running errands I don’t need socks. If I’m working out, I’ll wear socks. They are waterproof, breathable, and they offer great support. I’m hoping they restock these soon I want them in another color."
  },
  {
    "user": "Mack",
    "rating": 5.0,
    "message": "this is my second pair, my first pair lasted about 2 1/2 years, I work at an animal Hospital/boarding facility so they definitely get roughed up during the day. The holes are nice for when water or liquid gets in my shoes it’s able to air out easier so I’m not sitting in wet socks all day. good support, the inside is more of a rubber than a cloth which is a plus for me."
  },
  {
    "user": "Amanda Laddie",
    "rating": 4.0,
    "message": "I bought these shoes for our upcoming trip to Disney. These fit the bill perfectly. I have a high arch, wide foot. I'd say these fit pretty well considering they aren't marketed to either. Arch support isn't as good as the standard clog, but I didn't have any back pain after wearing them which is a win in my book. In fact, I just bought a pair in mens for my husband."
  },
  {
    "user": "Daniela Lozano",
    "rating": 4.0,
    "message": "These shoes are really comfortable, especially for standing for long periods of time. After about 4 months of use, the part where the laces go through broke on one side. I'm not sure if it is just me, or if they are not meant for every day use."
  },
  {
    "user": "Serena",
    "rating": 5.0,
    "message": "im a housekeeper and am squatting walking and rushing around all day and my feet dont even hurt at the end of the day"
  },
  {
    "user": "Becky Bailey",
    "rating": 5.0,
    "message": "These are the original Light Rider style. I find these to be wonderful and I'm on my feet all day at work. I tried the 360s, but just couldn't get used to them after 2 days. Snatch these up while you can. I'm not sure if they'll keep making them."
  },
  {
    "user": "jennifer",
    "rating": 5.0,
    "message": "They are comfortable and great for wearing to the river or lake."
  },
  {
    "user": "tasha Shepherd",
    "rating": 5.0,
    "message": "The shoes are nice and comfortable,  easy to clean and real cool never seen anything like them before"
  },
  {
    "user": "yomar Hernandez",
    "rating": 5.0,
    "message": "The customer service was truly trash, i have to pay to return the package even when it say free return. But overall the product itself is very comfort."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comfortable and stylish. I wore these walking around all day today and was so impressed. No need for socks feet stayed cool, dry, and comfy all day. Unlike the regular Crocs, these are cute enough to wear just about anywhere!"
  },
  {
    "user": "Mykayla",
    "rating": 5.0,
    "message": "I originally bought these shoes for a cruise. I knew I was going to be very active supporting children with disabilities on the ship, so it was important to me that I had shoes that were comfortable and that could dry quickly. I have worn these in the pool, to the beach, and every day. These are so perfect!"
  },
  {
    "user": "Let Them Eat Gluten Free Cake",
    "rating": 5.0,
    "message": "I should've known that Crocs would make a tennis shoe that is perfect for my feet!  Regular traditional Crocs have always been so comfortable on my feet, but I wanted something more like a sneaker.  These are so light, they barely weigh a thing, which is what I like because it doesn't feel like your feet are heavy when walking.  The inside is just like the lining of regular Crocs and the entire shoe is rubber, except for the tongue and the shoe laces.  I love them!"
  },
  {
    "user": "Kerez shaw",
    "rating": 5.0,
    "message": "I’m a 7.5 in sneakers, ordered a size 8 they fit perfect. They are so easy to get on and off and are very comfortable! I love them and will definitely be ordering again."
  },
  {
    "user": "Whit",
    "rating": 5.0,
    "message": "I love the off white and they look sleek"
  },
  {
    "user": "slawson",
    "rating": 5.0,
    "message": "The most comfortable tennis shoes I’ve ever put on my feet."
  },
  {
    "user": "Mary S.",
    "rating": 5.0,
    "message": "I love these but they run a little small"
  },
  {
    "user": "Mariah",
    "rating": 4.0,
    "message": "I loved these crocs! They were so comfortable and since I work with animals, I wanted shoes that were both comfortable for long days on my feet and are breathable. Unfortunately, the bottom layer of the sneaker did start peeling off after less than 6 months of wear. I'm so disappointed because I loved how these felt."
  },
  {
    "user": "GGC aka citizen",
    "rating": 5.0,
    "message": "I wanted to be cautious and wait to right this review. It’s been over 4 months now, so here we go. I was one of many people that rolled my eyes when Crocs first showed up. I still can’t stand the look of the garden shoe style but I now understand that these shoes are accessibility aids! They actually help many people with all sorts of conditions with their feet! My problem: I started working a job in a building with hard, tiled floors after years of being away from carpeted retail floors. I’m fat (love that I am). My feet hurt so bad every night that I had to take hot foot baths everyday —and they still hurt bad enough afterward. I found myself hurting so much I was having trouble falling asleep because my feet were in such pain! What I tried: I was wearing Dr. Scholls and tried every foot insert they offered from the overweight women type, the plantar fasciitis type, etc. They’re garbage and a waste of money. These Crocs: I bought both these and the nursing shoe type of crocs in a size 10. The fit and feel of the LiteStride was the better of the two for my job. The nursing shoe type had a platform and felt a little large so it rolled on my foot and didn’t feel secure or like it wrapped around my foot. My feet hurt after wearing that nurse one. The Lite Stride breathed. It was sturdy and the shoe didn’t roll around my foot if I accidentally stepped on my outstep. And the fit was very good and felt secure on my feet. Then the material that the sole is made out of brought me the most unbelievable relief. My feet have not hurt one day since wearing the lite strides! I didn’t add inserts either! Downside: Don’t walk through puddles or spill anything on your feet. The shoe has holes. Overall: Buy these. You deserve to be comfortable while you work."
  },
  {
    "user": "Dianna Cintron",
    "rating": 5.0,
    "message": "They fit pretty good"
  },
  {
    "user": "BerlyBlake67",
    "rating": 5.0,
    "message": "The croc literide are the only shoe my feet are happy wearing! These are a little snug on the toe box area. I wish I had ordered a wide instead but still feel good. My problematic feet do not get traumatized at all in crocs. Love these!"
  },
  {
    "user": "Kristin Hugall",
    "rating": 5.0,
    "message": "By far the most comfortable shoe when you have to be on your feet all day"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these but wish they came in half sizes."
  },
  {
    "user": "Taylor Langlois",
    "rating": 5.0,
    "message": "I am a vet asst and I’m on my feet for 12 hrs a day. I have searched for the best and I think I found it! Very affordable."
  },
  {
    "user": "AnginSan99",
    "rating": 4.0,
    "message": "I love how these look, they're everything I was looking for in a walking shoe. The color, the design, and cushioning are all fine. However, I must point out the fact that these fit me comfortably without socks, but when I wear socks they're a bit snug and the rubber inside makes it hard for your foot to slip in with socks which is super strange in a sneaker. Maybe I should have ordered a bigger size? But the length is perfect, so i don't know. I bought these looking for shoes to wear socks with. I live in Florida, so this is a real issue for me. As Floridians we tend to default to flip flops when at home or even outside because it's so hot all the time that's all you feel like wearing. Since I work from home this has become my every day shoes which is terrible for dry, cracked feet. So I wanted shoes that were comfortable enough that will motivate me to wear socks more for my dry/cracked feet. The reality with these for me is Without socks = sweaty, hot feet, if it's really hot outside, which is common here. With socks 🧦 = too tight, almost claustrophobic get-me-out-of-these-shoes-now feeling. The rubber bottom makes it feel weird with socks too, like you can't scrunch your toes there, it's just not that comfy feeling you get when you're wearing a fabric-lined-bottom sneaker. So I'm left with a dilemma that makes me not want to wear them most of the time....I really wanted these to become my go-to shoes 👟 In reality they'll probably be my \"sometimes\" shoe."
  },
  {
    "user": "Ayl",
    "rating": 5.0,
    "message": "I hate normal sneakers. All the bulky padding at the top feels claustrophobic and is easily made disgusting by sweat or water. The foot beds are always mediocre, and putting good insoles in them only makes the shoe even tighter and stuffier. I wear sneakers for hiking and general outdoor stuff and they get disgusting if they get wet, which is unavoidable. I love fashionable light colors but they get ruined even walking only in the city. These crocs sneakers solve literally all my problems with sneakers. The top feels a lot like silicone, but I don’t know what it actually is. The sole is a firm crocs EVA and the footbed...ooooooh the footbed!!! LiteRide is incredible. I don’t like squishy shoes. I like THESE squishy shoes. Extremely comfortable and felt just as great after a 3 mile walk as they did when I first put them on. Unlike other cushioned footbeds, these are EVA so they don’t get wet with sweat etc and thus remain nice and springy. The top of the shoe having no padding and being VERY ventilated is great. I can wear them with socks without feeling like my feet are swaddled in a duvet, and I can wear them without socks without worrying about ruining them. I wore these in some muddy conditions and the mud washed right off. Light colored sneakers that won’t get stained by dirt?? YES. And I can just hose them off without hurting them or having wet shoes the next day. No need to wonder if the washing machine & dryer are going to destroy the glue. My foot is a size 7 in length but I sized up since I have a high arch that often makes shoes tight. The 8 fits great with room in the front so I would say they fit true to size. I probably could have gone with a 7, and I would if I were going to wear without socks. Without socks I would want a 7, but with socks the 8 fits comfortably. The tongue is thin and a quick drying fabric. There is a strip  of the same fabric around the opening. This would make them comfy without socks, no rubber edge rubbing your ankles. I have never really loved a pair of sneakers before now!! The only thing I would ever change would be to add a better sole. The crocs sole is great for the gym and sidewalk, but I find it a little slick everywhere else. I don’t expect crocs to make a lugged trail running sole or anything, but even a normal outdoor running sole would be just a little better. I will probably be modifying the sole myself."
  },
  {
    "user": "RaiyaMoonVisions",
    "rating": 5.0,
    "message": "These are the best shoes I have bought in a long time. I love them!! Definitely will be buying more of these! Thanks croc.. my family and I are big fans of your company."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I absolutely love the shoes, I love the fit. I just wish they were a half size longer. I bought a 10 but wish they came in a 10-1/2."
  },
  {
    "user": "Kim Hernandez",
    "rating": 4.0,
    "message": "The shoes are super comfortable! The were a little tight when wearing at first but broke in well after a few shifts at work."
  },
  {
    "user": "Bryan",
    "rating": 5.0,
    "message": "laces too long and the color i got (off white) got scuffed and dirty easily but for obvious reasons. No complaints at all."
  },
  {
    "user": "Corey W.",
    "rating": 5.0,
    "message": "I wear a size 4 and Croc is one of the rare brands that carry my size. The fit is great and these are SO comfortable. I was worried about the rain because of the holes in the top but that was surprisingly not an issue. I wore them through a rain storm and puddles with socks on and my socks were nice and dry! These are great travel shoes and these are now my favorite go to shoes for vacation and work. The only bad thing: the material of the inside of the shoe makes it difficult to wear with socks because it rides up the sock, causing it to be tight around the toes and bunch around the heel, so I had to learn to figure that out. It took a good while, but I have system for it now."
  },
  {
    "user": "Mississippi Momma",
    "rating": 4.0,
    "message": "These shoes are very comfortable and supportive, but they ran a little wide at the heel. I also didn’t think about all the dirt that was going to get in the shoe as I just walked around until I actually had them. If you are only walking inside, that might not be an issue for you, but we are outside all the time, so it didn’t work for me."
  },
  {
    "user": "Rosie",
    "rating": 3.0,
    "message": "I really wanted to love these. I love the idea of them and a lot better looking and more sleek/trim fit. However the left shoe is just not comfortable and I can’t wear them. Not sure if it is the stitching or what. I tried without socks, with socks doesn’t matter. :("
  },
  {
    "user": "momarch",
    "rating": 4.0,
    "message": "of all the shoes, whodda thought it would be crocs that i am really liking the most :)  Since they have no 1/2 sizes I went up a size which is great for wearing socks which i am doing while i hike our exercise hill daily.  I like that i have extra room in the toes...some shoes were causing my toes to totally fall asleep while wearing them, these do not.  The support seems to be ok so far, i am not running, just walking in them so not sure how they would do if you actually ran in them but the impact for a heavy set person walking is pretty good.  I do feel some sharp rocks i step on but overall its pretty comfortable.  I went ahead and got a mens pair for my husband, we will see how he does with them"
  },
  {
    "user": "Ashes DiMaria",
    "rating": 4.0,
    "message": "I fell in love with these and HAD to order them. I read through the reviews. I am a fan of normal crocs, and wanted something better to wear to work (I work in an animal hospital.) I wear a true 8, so luckily I didn't need a half size. I ordered the 8 (also, \"Pearl White\" is a light grey and white trim and I love them!). They fit a bit tight, but needed to be broken in. I wore them on a day off with ankle socks- do not recommend. There is a tiny trim of fabric on the inside lining that can rub your heel. I wore them for a 10 hour shift at work with crew socks and they did better. No heel pain. So you do need to break them in a bit. I also wear thin socks (yes I know it's December...)and it's a tight fit to get your foot into the shoe because of the inside of the shoe itself. The foam bottom is nice and feels great- but it's more effort to get your foot into. That may just be me, though. I loosened the shoelaces so it fits more to my foot. Overall, I do recommend these. They're light, airy. I don't mind the tiny holes, as I'm on my feet ALL DAY and I like to be cooled off. I gave 4 stars just for the tight fit and the lining of fabric around the ankle that kind of rubs your heel. I'm on day three of wearing them at work, and I do love them. I'll get another pair if these prove well over the next few months. Edit: I wear them everyday! It's still a tight fit when you first put them on but after a few minutes they become comfortable. I did get the pearl white and I now have some blue staining on the shoes that I can't get off (I wear blue scrubs!!!) So walking in the rain (yay curbside) wet scrubs = rubs the color on the shoes. It's not a dealbreaker though, since I just wear them for work. They're still light and comfortable, and my definite go-to shoe everyday for work. I do still recommend crew socks, since the fabric trim catches and pulls socks down into your shoe lol. It could still just be me though. 9/10!"
  },
  {
    "user": "Becky",
    "rating": 3.0,
    "message": "I have plantar fasciitis and I thought because the regular crocs helped with it, these tennis shoes would too, but unfortunately they did not. They are still great tennis shoes though and look great!"
  },
  {
    "user": "Olga Vesselchakova",
    "rating": 5.0,
    "message": "Perfect!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Best shoe I have ever bought"
  },
  {
    "user": "Megan Olle",
    "rating": 5.0,
    "message": "I needed shoes for bartending and these have exceeded my expectations. Will definitely buy more."
  },
  {
    "user": "Lanisa Jenkins",
    "rating": 4.0,
    "message": "The fit is good except at the toe were it bends even with socks on there is an uncomfortable bend as you walk if it wasn't for that the fit and walk would be great"
  },
  {
    "user": "KitKat 19",
    "rating": 5.0,
    "message": "Never thought I’d say this, but I LOVE my new croc sneakers. They are lightweight, breathable and by far immediately the most comfortable shoes. No breaking them in. Buy them you won’t regret. Side note ok for light work out but not meant for running or heavy gym."
  },
  {
    "user": "Melanie",
    "rating": 4.0,
    "message": "These shoes are comfortable and easy to clean. My feet never hurt, but it doesn't have the best support for back pain. I didn't like that I couldn't wear these to work during the winter or when it rains without my feet getting wet due to the holes."
  },
  {
    "user": "Afton",
    "rating": 5.0,
    "message": "Y’all. I have let my dignity drain out the Croc holes of the clogs already and love to be comfy, so I figured I’d try these for easy to dry shoes to wear to Disney World. GUYS. They are UNBELIEVABLY comfortable, and I did wear them to Disney and to Busch Gardens, and to the gym to work out, and to take walks with! I love them, and that says a lot because I hate tennis shoes of any kind. They’re not even ugly when you put them on, they really stand out or don’t look any different than any other shoes anyone else is using to exercise. Do recommend. Worth the money, for real."
  },
  {
    "user": "Analee",
    "rating": 5.0,
    "message": "Omg I love these !!! I will be buying more."
  },
  {
    "user": "Jessica",
    "rating": 5.0,
    "message": "Okay I love these shoes. Like really really love them. They are crazy comfortable standing on my feet 10-12 hours a day. Needless to say I was extremely disappointed when I went to order a second pair and there wasn’t any color available in my size unless I wanted to pay a private seller upwards of $100. (If you’re a size 8/9 you feel my pain). So here is what I did- I looked up online the comparable mens size and ordered some of those. They have more available and had the color I wanted. I’m a 9 in Womens and got a 7 in mens. They fit almost exactly the same! These shoes have saved me from so much foot pain and so many headaches (from trying to find the right shoes). I am happy. My feet are happy. My knees and back are happy. All is well in the world now that I’ve found these shoes!!!"
  },
  {
    "user": "My3girls66",
    "rating": 5.0,
    "message": "These are my far the most comfortable shoes I have ever worn ri work all day!! I want another pair.  I do not like the new design with the laces inside. I won’t buy those. I hope these come back in stock because I’ve told everyone about them!!! Thank you croc for making my work day so much easier!!"
  },
  {
    "user": "Katrina",
    "rating": 3.0,
    "message": "I will just preface this by saying that I do not like crocs I think their regular shoe is ugly before/after the jibits: I think they look cute and better on kids. tho I have tried them on before and they are very comfy. But I walk a different path than most! I initially bought these for the Sole purpose to be comfortable standing long periods of time (10+ hrs at work). I have flat feet and over pronation because of it. In the past, I’ve had plantar fasciitis. I’m resigned to say that no shoe has ever been comfortable to wear after a few ours. This is a very nice shoe, it’s mate, basic/classic shoe design, and familiar crocs design (holes); and I believe you could probably wear these with any casual outfit. When I initially tried them on, I wore socks. So with the croc material against the fabric; there was some resistance with sliding my foot in. So I untied the shoe strings; which are thin (tho understandable because it was design to be lightweight and comfortable.) Im glad I got them one size bigger, because with the sock or not, it was a bit snug. I even loosened the shoe string which helped a little bit. When standing, it felt okay, still a little snug around the arch/heel of my foot. Walking around, it felt loose in the front of the shoe. [My heel felt cradled (if you know what I mean by that) it was comfortable.] Tho after two hours of standing/walking, I felt discomfort in the arch of my foot. But for standing 10 hours it did not rise up to the occasion. A little disappointed. But I do think this is the cute shoe I’ve seen Crocs have. It has medium arch support. Shoe laces are thin and made for show. Not good in puddles or rain btw! I’ll hang on to these tho for now!"
  },
  {
    "user": "aloyscius",
    "rating": 5.0,
    "message": "This is my second pair. I had to buy another color of the old style before they sold out because I do not like the look of Croc's latest version. These are great because they can get wet, they clean easily, and the cushion in the bottom helps keep my feet comfortable on long walks. I've already gotten two other people to buy these and will continue to encourage others to try them!"
  },
  {
    "user": "Nicole",
    "rating": 5.0,
    "message": "I had plantar fasciitis last year. I tried many different sneakers nothing helped. Im a dog groomer and needed something that can get wet and not be slippery. I stand all day on concrete. These sneakers once i got them, my planter fasciitis went away within 2 weeks (i already had it for 8 months). These are a great find! This is my second pair now as my planter fasciitis started coming back after a year of using these sneakers. I can now see the difference in wear from the first and second pair so i will be more aware for when its tie to replace. Love these sneakers for work!!!!"
  },
  {
    "user": "Camilo T.",
    "rating": 4.0,
    "message": "Estan muy bonitos y todo, pero me quedaron pequeños, los importe a Ecuador y tuve que venderlos, el mismo día que llegaron los vendí. Una pena."
  },
  {
    "user": "Dylan Walls",
    "rating": 5.0,
    "message": "Ok, I'm going to start off by letting you know that I typically HATE Crocs. Of course, my husband owns every color of the croc sandals and because he loves to torture me he even owns leather Crocs (his \"fancy\" Crocs). This man has been determined to get me wearing these ugly ass Crocs for years and I REFUSE...until, these tennis shoe Crocs. Not only are these Crocs the most comfortable shoes to grace my feet but they actually look cute, fit true to size, and you would never guess that they are Crocs brand. I still will not ever be purchasing the standard sandal Crocs because they're ugly AF but these shoes make me want to purchase every single color. GET THE SHOES!"
  },
  {
    "user": "alex",
    "rating": 5.0,
    "message": "These are so so comfortable. I have a pair of crocs swifwater sandals that I liveeeee in, so I wanted a pair of sneakers similar in comfort. I’ve had my eyes on these for about 2 years and finally went for it. CROCS: PLEASE KEEP MAKING THESE !!!! Everyone says the new model isn’t the same. And honestly I’m obsessed with these ! Please restock!!!"
  },
  {
    "user": "Matthew Johnson",
    "rating": 5.0,
    "message": "I purchased these because I have been having hip pain that has taken me off my feet. I spend a lot of time on my feet at work and not wearing a good supportive shoe was wreaking havoc on me. I purchased the regular Crocs clogs for use at home to see if I liked them. The clogs were super comfy, so I bought these sneakers to wear to work. They're very comfortable and squishy and I can go all day without getting pain in my heels or my hips. They're made of a light-weight foam or rubber and the outside has little holes in it for air flow. They're super light, my feet don't get sweaty or slip around, and I can wear them comfortably without socks (this was a big plus, since I don't like socks). They look very nice on, like a higher-end sneaker, and you can't tell they're not fabric. RE sizing: I purchased the Crocs original clog in a size 10 and noted that it had a lot of room in the toe. After reading comments on the sneaker, I ordered a size 9. I usually wear somewhere between 9 and 10 but Crocs doesn't do half sizing. The 9 fit well in the toe but was way, WAY too small across the top of my foot. After wearing them for less than 30 minutes, I was in pain and had to take them off. There was just no way they were going to work, even if they did happen to stretch a bit. I returned them and purchased a size 10. The 10s are slightly too big in the toe, but I don't notice it at all while I'm on my feet. More importantly, I can lace them up without the tongue digging into the top of my foot and causing pain. I do think they stretched out a little bit, but not enough to make them too big."
  },
  {
    "user": "Miscellaneous",
    "rating": 5.0,
    "message": "Buy them you won’t regret it!"
  },
  {
    "user": "Sridevi Chhorn",
    "rating": 5.0,
    "message": "Whether you’re going to Disneyland or Legoland, these shoes will save your feet! I got these for a Disneyland trip but ended up trying them at Legoland first; @chasingmagicdaily raves about these and she did not disappoint! These are soo light and comfortable. You can wear these with or without socks! If these are comfortable at a theme park, they’re definitely good enough to go on walks, runs, etc."
  },
  {
    "user": "William",
    "rating": 4.0,
    "message": "I got the white ones and fell in love. Glad to have a pair in black.  I suffer from plantar fasciitis and I need good shoes.  These are perfect.  They are a slimming shoe and look good even in my office wear.  I will warn to look out for shoe defect.  Mine came with a little glue on them.  I just got these shoes yesterday and noticed the glue today after already wearing to work.  I don’t think I can return now so just be careful with that. It’s not very noticeable."
  },
  {
    "user": "Britany",
    "rating": 4.0,
    "message": "Jean stains from the fabric are real with these and it will NOT come off!!! I got the tan color and it has blue jean stains, the croc material will not lift it. watch for that when wearing these with the lighter colored shoes!"
  },
  {
    "user": "Amy S",
    "rating": 5.0,
    "message": "I am a respiratory therapist who bought these at the beginning of the pandemic because I needed something that I could easily clean. These have lasted two years and could go longer. I just bought a replacement as some of the color was worn on my original pair. I wash them every week in my washing machine with a Clorox sanitizing rinse. The arches wore down after about a year requiring inserts, but after 48 hours a week wear that was understandable."
  },
  {
    "user": "YGB",
    "rating": 5.0,
    "message": "Great fit. Comfortable but as for any Crocs, they need to be broken in a bit for a complete comfort. Rubs against back ankle a little if I don't wear socks high enough to block the friction. Mine came with uneven length laces but it's no big deal"
  },
  {
    "user": "xiaomafankitty",
    "rating": 5.0,
    "message": "It was quit comfy to wear on an 8 hour shift. Constantly on my feet. Still experienced pain but not so much compared to the other brands."
  },
  {
    "user": "Maureen C. McHale",
    "rating": 5.0,
    "message": "I wear a 9 1/2 and sized up to a 10 since they don’t sell half sizes.  So glad I did. Size 10 fit perfect.  I love crocs as they seem to be the only brand that help minimize pain felt in feet, knees and overall legs caused by fibromyalgia and arthritis.  However, I refuse to wear the clogs out of vanity. Lol. But these fit the bill. Also ordered a pair of their flip flops, which are also very forgiving.  Highly recommend. Especially if you suffer from chronic pain like I do."
  },
  {
    "user": "Alexandra Flotto",
    "rating": 5.0,
    "message": "I am an Animal Care Technician at a shelter and we everyday work with water on the ground, dogs with no leash manners and large highly reactive dogs. All of these factors create a very dangerous situation that is avoidable with the right, non slip, breathable shoe. These have definitely hit the mark! They’re light weight, incredibly breathable, have non-slip soles, are well made and designed and not to mention that they’re cute af to top it off."
  },
  {
    "user": "Bonnee F.",
    "rating": 4.0,
    "message": "I ordered these in the same size as my Crocs mules, a size 10 women. But they were much too long and the size 9 would have been too short. Sadly, they do not come in 1/2 sizes. A 9 1/2 would have been perfect. Otherwise, they looked like they would be comfortable."
  },
  {
    "user": "Sarah",
    "rating": 5.0,
    "message": "I’m typically between a 9 and 10 in shoes and ordered a 10. They fit great and are so comfortable. I wear these when I’m on my feet and walking up to 5 miles at a time and they keep me from having some of the foot/hip/knee pain I get from walking in vans or other sneakers all day. They look great too. I’m not a fan of the classic croc look, but you can’t really even tell these are crocs unless you really check them out. I haven’t really worn any of my other shoes since getting these because they’re just so dang comfy"
  },
  {
    "user": "Wanda",
    "rating": 5.0,
    "message": "These are the best sneakers I’ve owned because of their functionality. They’re very comfortable, extremely breathable and my favorite part is they look just like normal sneakers but are very easy to wash and get clean! I work on my feet on hard concrete and was having a lot of leg and foot pain when I got off work but this has pretty much eliminated that. I’m sure buying arch support inserts would make them even better. Worth every penny."
  },
  {
    "user": "NDT0294",
    "rating": 3.0,
    "message": "Wow. They really need to tamp down the description of this shoe. The description makes mention of sinking into the shoe and speaks of the cushioned comfort. There is absolutely nothing plush about this shoe. Having developed posterior tibial tendinitis standing for 10 hours on my job I have been on a search for something that would support my arches but also give me cushion and comfort at the heel. This is not it. There is NO arch support and that little bumpy, rubber insole really doesn’t have much give or thickness. I mean, the shoe is basically flat. I was expecting a nice , plush, springy, cushiony insole based on what they describe. The shoe is not uncomfortable it’s just if you have any foot issues and need something with a good support and comfort factor these aren’t it. If they could make a closed in work shoe with the EXACT SAME foot bed as either their original clog or their water sandal I’d be set. But this shoe is just ok."
  },
  {
    "user": "Heather G uillen",
    "rating": 4.0,
    "message": "I have to wear nonslip shoes at work, these are comfortable. I didn't give 5 stars because these require tight thin sock so it doesn't bunch up"
  },
  {
    "user": "Tocahontas",
    "rating": 5.0,
    "message": "I bought these shoes after seeing a coworker in them & hearing that they were comfortable. I am a true size 7, which is what I ordered. The shoes run a little big but they’re not too big. It would be nice if Crocs made these in half sizes. My only other complaint is the material type tries to remove my sock when I take my shoe off. I bought them to wear at work. I work in vetmed. The shoes are comfortable, my feet still feel good after a 12hr work day consisting mostly of standing. I like that they’re easy to clean too."
  },
  {
    "user": "Kelly",
    "rating": 5.0,
    "message": "I work in healthcare and stand for 9-10 hours a day.  I am also getting over a bout with plantar fasciitis and these sneakers are amazing.  They are comfortable and can be easily cleaned, important in a procedural suite.  Love them!"
  },
  {
    "user": "Will",
    "rating": 5.0,
    "message": "Purchases in Sept.; Awesome shoes sadly they dont come in all white for men. Our job requires all white shoes. Wife and I bought them (yeah I bought the women's size equivalent for myself). I have Plantar pain and it has relieved a lot of the pain. I use them 40 hours a week. They are so flexible enough that I feel it allows my arch muscle to strengthen and hence reduced my pain. Sadly they are already wearing a bit after a months use but I walk 7000 to 10000 steps a day. If they wear out I will buy another set. They dirty quickly in the white but they wash super easily. Best feature is they get wet you wipe them out and put on a new sock and now you have dry feet again. Great for those who work in the  Florida parks. I get lots of compliments and love my shoes great buy. Update 1/29/21: shoes finally wore a holes in them after 149 days and about 894 miles in them. Still love the shoes because of comfort and the fact it help build the strength in my feet and my plantar fasciitis has not hurt as bad since I got the shoes. Just wish the sole would have lasted longer. But I just got a new set and still love them. My wives shoes are still in good condition because she does not wear them as much as I did mine."
  },
  {
    "user": "Alyse Fitzpatrick",
    "rating": 5.0,
    "message": "I’m very happy with these shoes. They are very comfortable when worn with socks. I have worn them to festivals, working out and for 12 hr shifts for work. My only complaint would be the rub my pinky toes just a little. Not to the point of blisters just notice it when I take them off. I would definitely buy another pair though."
  },
  {
    "user": "Gin Gonzalez",
    "rating": 5.0,
    "message": "I work at a vet clinic, I was researching for the best shoes to buy. Most of my co-workers love the basic crocs but to me they don’t have enough support. I have chronic pain issues that & working long shifts I really wanted the best. I saw the basic shoes New balance, Adidas & so forth but then I stumbled upon these. The easy cleaning was what sold me, but the COMFORT is what I will rave about! LOVE LOVE LOVE IT."
  },
  {
    "user": "silas dobad",
    "rating": 5.0,
    "message": "I bought these to wear to work. I work 12 hour shifts in a very large retail store. I usually get about 10-12 miles in a day on those concrete floors. These have helped tremendously. I’d buy them in every color if I could!"
  },
  {
    "user": "Amberly Rose",
    "rating": 4.0,
    "message": "I only wore my shoes for about 6 hours (with good socks) and the texture on the insides of the shoes started to hurt and imprint onto the bottoms of my feet. I was hoping they would help my lower back down to not hurt but they still hurt."
  },
  {
    "user": "Sam L.",
    "rating": 5.0,
    "message": "I work outside on my feet all day and use water alot. I hated how my feet would be soaked and I hated wearing waterproof boots. These are so perfect. I have wide feet and they do not hurt first day on. They dry fast too! I will be getting another pair. I'm usually a 8.5 or 9. Bought a 9 and had to wear socks. If no socks then I'd buy a half size down"
  },
  {
    "user": "Gloria E.",
    "rating": 5.0,
    "message": "I'm a cashier and on my feet all day love these shoes because they are so comfortable and at the end of my shift my feet aren't hurting as much as they did with regular work shoes highly recommend these.. I had the grey with camo before that's why I went and ordered the black with camo."
  },
  {
    "user": "Maria",
    "rating": 4.0,
    "message": "Would love these if they made a wide."
  },
  {
    "user": "Sydney R. Colyott",
    "rating": 4.0,
    "message": "I really love Crocs in general for their comfort and their nice roomy width. I figured these would fit much the same but in sneaker form. While these shoes are well cushioned just like traditional Crocs, they are *significantly* narrower. I changed out the laces to some elastics which has helped, but I do wish the shoes were wider overall."
  },
  {
    "user": "darrell walters",
    "rating": 5.0,
    "message": "My husband and I work outside in these and our feet stay happy. We are hooked and only buy this brand. They wash up super easy. Can be tossed in the washer or cleaned in the utility sink."
  },
  {
    "user": "anon",
    "rating": 5.0,
    "message": "I have never been a crocs person, but I was 8 months pregnant and my Dr. Recommended wearing crocs in the house to ease my hip and feet pain. I bought the regular slides and noticed a huge difference in my pain. I bought these shoes to wear to work and get comfort in, sneakily. Unfortunately, my baby showed up early and I never got to wear these around the office, but I wear them constantly and recommend them to everyone I know. They are seriously so comfortable  and they don’t look like crocs! I am normally a 7.5w and got an 8. They aren’t as wide as the slides. I haven’t ran in them, but they are great walking shoes. 10/10 highly recommend. I just wish they were in wide."
  },
  {
    "user": "faustino cruz",
    "rating": 5.0,
    "message": "I really love these shoes; I wear them to work almost every day and they are extremely comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "So i was looking for the perfect water shoe and came across these because they were so stylish and i bought them for me and my husband. Literally the best shoe for the purpose of my vacation. I went to quintanoo on a tour of 4 cenotes and knew i was going to be swimming in these and walking in the jungle and needed a good, stylish and comfortable water shoe. i would not recommend wearing with socks but they are nice and breathable. i also wore them while kayaking, snorkeling just in case i stepped on anything rough. never thought id buy crocs but happy to have joined the family lol"
  },
  {
    "user": "Nicole Dunn",
    "rating": 4.0,
    "message": "I wore these to work cause I work a 8 to 9 hour shift standing all day and my feet was constantly hurting me."
  },
  {
    "user": "James mullins",
    "rating": 5.0,
    "message": "I love my crocs! But I cannot wear them to work... now I can! These are supportive but a bit snug around the middle of my foot. But at the end of my work day my feet are not screaming to get my shoes off."
  },
  {
    "user": "Sarah TC",
    "rating": 5.0,
    "message": "Purchased in desperation when unable to find a traditional sneaker with a croc-like foam footbed (eases knee impact). Was needlessly concerned about the feel of the rubber side and top panels and potential for rubbing... these are Fantastic!  Gave these a full workout during a very touristy spring break and didn't have any problems with rubbing, chafing or foot sliding, even when loosely tied for easy slip-on."
  },
  {
    "user": "Brenda D",
    "rating": 5.0,
    "message": "This are seriously comfortable shoes. Work great in the rain also.  I have 3 pairs and this one I bought for my 18 Yr old granddaughter who is hard to fit.  She tried them on and this huge smile cross her face.  What more can I say!"
  },
  {
    "user": "Cindy Hall",
    "rating": 5.0,
    "message": "My daughter seen these shoes on vacation and loved them as she spoke to me about comfort, sturdy material etc.. the only reason she wasn’t able to buy when on Vacation, one shoe was unable to locate. When looking on Crocs website, she didn’t find exact shoe she seen on vacation. Fortunately Amazon had exactly the pair she raved about! Besides the estimated delivery date of 2-3 months, she was still willing to wait. I ordered and she received in 3 weeks :) Happy young lady!! Super happy all around!! Will buy again!!"
  },
  {
    "user": "Katie",
    "rating": 5.0,
    "message": "I love these shoes! They were just delivered today so I will update this review once I wear them out. My first impression of these are amazing. I tried them on and wow, they’re soooo comfortable and fit the shape of my foot well! I was afraid that the texture of the shoes would make it fit looser but it is tight and very well fitting. I ran around my house and they stay comfortably. The bottom of the shoe has small bumps that are actually very cushiony! They attached a small piece of the bottom to show a sampling of the bottom of the shoe which was nice as I did not know what to expect. I’ve worn them for about 1 hour now and they get more comfortable the longer you wear it. I bought them for my new job as an art teacher and wanted something comfortable and easy to clean. I poured water on it and it will go through the holes but it wipes right off the shoe. I will be an art on a cart teacher so I’ll be on my feet all day and am so looking forward to wearing these!! These would also make great hiking or walking shoes as they are breathable and easy to clean. I would highly recommend them at the moment!"
  },
  {
    "user": "Ava D.",
    "rating": 5.0,
    "message": "These shoes are cute and comfortable.  Fun to wear with my other camo gear. I’m getting loads of compliments and questions as to wear to buy them."
  },
  {
    "user": "Taylor",
    "rating": 4.0,
    "message": "I love the look of these shoes and they are comfortable and cute but they didn't have quite enough arch support for my liking."
  },
  {
    "user": "Shania grummel",
    "rating": 4.0,
    "message": "Giving a 4 for right now because I have mixed feelings. I work 12 hour shifts in a hospital so the ability to clean them easily is a huge plus. They are super light and comfortable on the feet. But, if you are funny about how your socks sit on your feet like I am, you may not like them. They are difficult to put on if you have socks. The material of the inside pulls my socks up when I put them on, making them tight on my toes. Because of the flexibility of the shoe, it is a tiny bit harder to get the back of the shoe on than it is other shoes. The sides of the shoes have rubbed my baby toes raw. I thought these shoes would keep my feet more cool because of the holes. With my shoe covers on at the hospital, my feet are actually more hot than they are in my normal shoes. They may be better to use on other floors instead of covid"
  },
  {
    "user": "amber",
    "rating": 5.0,
    "message": "Breathable shoes if you do a lot of walking at work or in general. Very comfortable. I would recommend not to wear black socks, after some time it stains the shoe with black spots."
  },
  {
    "user": "W Thompson",
    "rating": 5.0,
    "message": "Looks good, feels good on feet."
  },
  {
    "user": "Miranda Lee Perog",
    "rating": 5.0,
    "message": "These are… probably my favorite and most comfortable shoe I own. Everyone is so shocked when I say they are CROCS! I would not be caught dead wearing the original crocs. But these… are so cute! They don’t make my feet look big. I had to size down. I’m usually a 6 1/2 - 7. I got a 6 and still have a little room to wiggle. I think a 5 would be too small. I’m just waiting for the gray camo ones to restock!"
  },
  {
    "user": "Mardy",
    "rating": 5.0,
    "message": "These were a gift for my mom, and she absolutely loves them! Bought these for the long Disney days ahead, and also for support in her workplace. I’ve heard great things about the support of the overall shoe, and am very hopeful these shoes will not disappoint!"
  },
  {
    "user": "Cathy C",
    "rating": 5.0,
    "message": "These shoes are extremely comfortable. They are roomy in the front - don't squeeze my toes or forefoot, but narrow enough in the heal so they don't slip. I think they will be fine for arches, but haven't worn them enough to know yet. The only down side I see is they're harder to wear in winter due to all the holes, but they are great for indoors or on nice days. I wish I could find other shoes with this exact shape but in a different material. These are like silicone - but they are Crocs so I guess that's their thing."
  },
  {
    "user": "Sialofi",
    "rating": 4.0,
    "message": "Love it. Great for walking."
  },
  {
    "user": "Sam Crowley",
    "rating": 5.0,
    "message": "So freaking cute, comfy and keep your feet cool"
  },
  {
    "user": "Elaine C.",
    "rating": 5.0,
    "message": "I absolutely love these crocs!!  They are my new walking shoes… so comfortable & light weight!!"
  },
  {
    "user": "Alyssa Garza",
    "rating": 5.0,
    "message": "I wear these shoes to work all the time! they’re comfortable, light and easy to clean if they get dirty! Fits true to size. Great shoes, definitely buying more in different colors!"
  }
]