[
  {
    "user": "Fay W",
    "rating": 5.0,
    "message": "I have gone through quite a few sneakers over the years with my boys. However, this is by far the best sneakers!!!! They are comfortable and I was actually able to wash it in the machine.. It does take a while for it to dry. (1 day in the sun ). Will def. purchase these again next year!"
  },
  {
    "user": "Taylor",
    "rating": 5.0,
    "message": "These shoes are perfect for my daughter because they hold up well! Easily washable and look great after doing so. I have bought a pair of these in each of the last three sizes she's worn."
  },
  {
    "user": "CWest",
    "rating": 5.0,
    "message": "I have been getting these for my son for fall and winter these last three years. He’s a toddler, so he’s been growing through his shoes fast. LOL! They keep his feet warm and dry, are easy to clean, and matches very well with his clothes. He always gets compliments on his shoes when we go out. Love these!😁"
  },
  {
    "user": "T Shorter",
    "rating": 4.0,
    "message": "These are so adorable and can be worn with a variety of outfits. For toddlers learning to put on their own shoes, get the velcro. They will love some independence then rock the shoes with pride."
  },
  {
    "user": "Momma T",
    "rating": 5.0,
    "message": "Pretty expensive but I love them"
  },
  {
    "user": "stephanie rubago",
    "rating": 5.0,
    "message": "These are seriously the cutest adidas shoes ever!! I want a pair in my size! I got these for my almost 5 year old and they fit perfect! She’s so excited to wear them to school and look like a “cool girl” as she says! This mama is happy!"
  },
  {
    "user": "Pablo",
    "rating": 5.0,
    "message": "Producto de calidad y duradero"
  },
  {
    "user": "Angelina Mikles",
    "rating": 4.0,
    "message": "At first I was very excited to find Adidas with a different style my son definitely liked it when he arrived he wanted to wear them everywhere just from being a boy and being outside after school I noticed that they were creased and that I could not remove the dirt to me it seems like this she was just poorly made so I have ordered a new pair of a different brand and those will just become his place used now. If you're buying these with the intention of it being school clothesdon't waste your money"
  },
  {
    "user": "Raising Rutledge’s",
    "rating": 5.0,
    "message": "Purchased for my son for first day of 2nd grade. He loves them, and picked them out by himself. The laces are long enough for a child who is new to tying shoes. They are easy to clean as well. He got some scuffs and dirt on them the first week of wearing and they came clean with soap and water. The sizing was perfect and they fit great. The price was much better than on the brands website, and shipping was as always fast since this was a prime eligible item."
  },
  {
    "user": "Morgan Marshall",
    "rating": 5.0,
    "message": "Great gift for a unisex design before finding out the gender."
  },
  {
    "user": "Caleb Finley",
    "rating": 5.0,
    "message": "I was needing new shoes and these are perfect!!!!"
  },
  {
    "user": "Rob and Megan Carlon",
    "rating": 5.0,
    "message": "Too soon to say how durable they are, but my 8 year old loves to wear them.  They run a little big, probably a half to full size larger than his other shoes, but he loves them so much he wears them anyway."
  },
  {
    "user": "Joxxx69",
    "rating": 5.0,
    "message": "La guía de tallas es correcta. El producto es de buena calidad."
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "I wanted these for my daughter and they only had her size in the “used” section on amazon. It was listed as, “Used - good”, so I took the chance and paid the $19. They arrived and were brand new!! Only thing missing was the box and who cares about that! I got these for a steal and I’m so happy with my purchase."
  },
  {
    "user": "Lenny",
    "rating": 5.0,
    "message": "Great for kids with wide feet. I like the velcro scraps even in a kids size 3, my son is a kindergarten with larger feet so these sneakers worked out very well for us."
  },
  {
    "user": "Catherine Car",
    "rating": 5.0,
    "message": "Very comfy, easy to use and clean. True to size."
  },
  {
    "user": "Joey",
    "rating": 5.0,
    "message": "These super cute shoes are our 2nd pair from Amazon! My girls love them, they're easy to clean, and we always get compliments on the color. The holographic color goes with literally ANY outfit, and we are always super pleased with the way these hold up. Perfect for small kiddos! 10/10 recommend."
  },
  {
    "user": "Beca Reece",
    "rating": 5.0,
    "message": "My son loves these. They are cute and attractive while obviously offering the reliability and quality of Adidas. Will buy them again in a larger size so that he can have them when he sizes up."
  },
  {
    "user": "Carla Ciulla",
    "rating": 5.0,
    "message": "We had a different pair of these and my toddler loved them, when asked to get his shoes he would grab this particular pair out of them all. They seem comfy, gave 4 stars for comfort only because I’m not wearing them but he seems to love them. The Velcro makes things so easy, (he barley sits still to put them on, Nevermind laces lol) They wipe clean, look sharp, and can’t beat the price!"
  },
  {
    "user": "Athelie Rutherford",
    "rating": 5.0,
    "message": "I loved how comfortable they fit and how accurate the size is"
  },
  {
    "user": "Michelle Pastorick",
    "rating": 5.0,
    "message": "Look really cute and the baby loves them! WINNER!!"
  },
  {
    "user": "Morgan",
    "rating": 5.0,
    "message": "Like the fact that it is white and can be worn with  half of my sons clothing"
  },
  {
    "user": "Landa",
    "rating": 5.0,
    "message": "So cute came fast and fits my kid great"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great quality, and so happy they had 13 1/2. Fits perfect."
  },
  {
    "user": "Laura",
    "rating": 4.0,
    "message": "Size up they run small"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My son loves these shoes."
  },
  {
    "user": "Amanda Ward Temple",
    "rating": 5.0,
    "message": "She wears them every day! I need them in every size so she’ll never grow out of  them!"
  },
  {
    "user": "Ashley Mason",
    "rating": 5.0,
    "message": "My son loves his new shoes and was great to try on before buying"
  },
  {
    "user": "Kelly Jean Packham",
    "rating": 5.0,
    "message": "Her shoes are wonderful. Crisp white with black stripes. Good quality. Just what we expected and she couldn't be happier!"
  },
  {
    "user": "Katherin Torrento H.",
    "rating": 4.0,
    "message": "the shoes are beautiful, but the design shown on amazon is not the same as what they really send"
  },
  {
    "user": "Christine M. Caylor",
    "rating": 5.0,
    "message": "My daughter in law loves them for my grandson, we will be ordering a larger pair for when he is older."
  },
  {
    "user": "Ali",
    "rating": 4.0,
    "message": "Love these shoes! 4 stars only because the stripes on the side are not red & black or rainbowish like the picture shows. They’re black & tan tiger stripes on both sides & in the back with “Adida” in light pink. Didn’t bother us though since they’re still super cute & daughter loves them."
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "message": "Would buy for my friends"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect for our little 18 month old baby girl."
  },
  {
    "user": "Jelane",
    "rating": 5.0,
    "message": "These white Adidas sneakers are super cute, and my daughter says they're very comfortable. The light gold stripes are subtle, so they coordinate with pretty much any color outfit. The laces are the perfect length, and I like how the outer material is easy to wipe clean."
  },
  {
    "user": "Tina LaBorde",
    "rating": 5.0,
    "message": "The shoes are exactly as advertised and they fit perfectly."
  },
  {
    "user": "Charise",
    "rating": 5.0,
    "message": "My 4 year old loves these shoes!! She wears them with casual outfits to school and even wears them with dresses to church. They match everything."
  },
  {
    "user": "Natalie",
    "rating": 5.0,
    "message": "Recommend to buy."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are great quality and perfect for my 1 year old. He is 15 months and I ordered size 5. They are a little big, so they will fit him for awhile hopefully."
  },
  {
    "user": "Anna Gustafson",
    "rating": 5.0,
    "message": "They look great camr in the size I ordered and he will slowly grow into them!"
  },
  {
    "user": "Ashley",
    "rating": 5.0,
    "message": "My son loves his new shoes. He usually wears a size 3 and they were way too big on him. Had to order a size 2."
  },
  {
    "user": "Susan Wilson",
    "rating": 5.0,
    "message": "So happy with these super cool sneakers! They fit well and granddaughter says there comfortable. She looks so cute in them with her shorts and  sporty dress! Good value for good shoes!"
  },
  {
    "user": "Christina_trini",
    "rating": 5.0,
    "message": "Second pair I bought for my kid. True to size and comfortable. Will continue to buy as he grows!"
  },
  {
    "user": "Philly Reyes",
    "rating": 5.0,
    "message": "I love that my grand daughter loves these shoes !"
  },
  {
    "user": "PhxHomeGallery",
    "rating": 5.0,
    "message": "We planned to go to Disneyland we didn't find these at brick stores and ordered on Amazon arrived on-time and it fits perfectly."
  },
  {
    "user": "Dion",
    "rating": 5.0,
    "message": "I was a little skeptic at first, based on some reviews however I purchased with a leap of faith. I bought size 7 for a 1 year old it’s not a exact fit because her toes are not all the way to the front which I doubt mind. The shoe is exactly as pictured and it is very neat. Very good quality."
  },
  {
    "user": "Milena R.",
    "rating": 4.0,
    "message": "Son buenos"
  },
  {
    "user": "Kristen M. Lehner",
    "rating": 5.0,
    "message": "My child has issues getting shoes on, these have been no problem. Wide enough, and go on just as they should. As far as easy to clean, they are white. They have minimal stains, but my child is hard on shoes during play time."
  },
  {
    "user": "Kasi Touchet",
    "rating": 5.0,
    "message": "Stains easy and impossible to clean"
  },
  {
    "user": "Hien V.",
    "rating": 4.0,
    "message": "We are big fans of Addidas. Especially these because they're the \"hard shell\" material so they're easy to clean! Velcro is great for this age group. Plus they're iridescent, so my fashionable toddler loves them!"
  },
  {
    "user": "Dolo",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "Shatera Admore",
    "rating": 5.0,
    "message": "Fit very cute on my 2 year old."
  },
  {
    "user": "Samantha",
    "rating": 4.0,
    "message": "The shoes are all good as it's in the image but the quality at the tip of the shoes feel like they won't last long"
  },
  {
    "user": "Betty",
    "rating": 5.0,
    "message": "My sneakers arrived yesterday and they didn't come in the original box. The box they came in stated that the original packaging had been destroyed in transit and was replaced. It seemed a bit sketchy and I was afraid that I had purchased fake Adidas. However, after doing some intense research and comparisons to the real ones I confirmed that mine were indeed genuine Adidas sneakers. They are super comfortable and good quality and feel exactly like my previously purchased Adidas so I know that these are real.  Would definitely recommend these because of the cheap price. I wear a size 5-5.5 in women's sneakers and ordered these in a big kids size 3, they fit perfect!"
  },
  {
    "user": "Brittney",
    "rating": 5.0,
    "message": "My son picked these out for his school shoes they are very durable and fit perfect he loves them"
  },
  {
    "user": "Nina",
    "rating": 5.0,
    "message": "I loved them!!! My baby girl was too cute in them for the big 2nd birthday 🥳 🎉🎊"
  },
  {
    "user": "Kevon Baronville",
    "rating": 5.0,
    "message": "Great quality for the price. I would recommend to anyone in the market"
  },
  {
    "user": "Artyom",
    "rating": 5.0,
    "message": "Great quality and beautiful shoes"
  },
  {
    "user": "Tracie",
    "rating": 4.0,
    "message": "Holds up very well to a 7 year old boy. They clean very easy and still look good after a year. Only reason I have to buy a new pair this year is because he's outgrown the first pair. Definitely worth the money"
  },
  {
    "user": "Heather",
    "rating": 4.0,
    "message": "My 12 year old daughter wears a 7 in women and I ordered a 7.  They are soo big!  I wear and 8 in women’s and they are big on me as well.  I would consider them more a 9!!! So I exchanged them and got a 6 and they are still very large. The size chart isn’t accurate for my daughter."
  },
  {
    "user": "S. Towns",
    "rating": 5.0,
    "message": "Purchased for my 5 year old son. He loves them.. easy to put on, looks great and fits perfect. No complaints!"
  },
  {
    "user": "MomofThree",
    "rating": 5.0,
    "message": "My daughter is very picky about comfort and loves the grand court shoes. They have a nice wide toe area and do not pinch her pinky toe. The bronze is a cute color, almost gives a pink tone in some light. Big kid size 6 fits like a womens 7.5, so works for big kids and adults as well!"
  },
  {
    "user": "Brandi B.",
    "rating": 5.0,
    "message": "I'm just thankful the toe of the shoes is the same material as the shoes themselves, and not the junky rubber/ plastic toe that some of these shoes now have. These shoes have held up great and I'm very happy with them. I'm on my feet a lot and need shoes that can keep up with my fast paced life, and these shoes do it. I'm not a fan of all the crazy colors and designs that are popular now, so I'm glad I can still find a basic pair of Adidas shoes that make me happy. I will never buy Nike, I'll go barefoot first. Skechers memory foam doesn't hold up long, so I try to steer clear of them. Used to like k-swiss, but their shoes hurt my feet. Doesn't leave me with many options! Thank you Adidas, for keeping this shoe alive! As long as they are available, I will keep buying them!"
  },
  {
    "user": "Milka Feliz",
    "rating": 5.0,
    "message": "Le quedó un poquito grande a mi bebé, pero después me gustó mucho."
  },
  {
    "user": "Alejandro",
    "rating": 4.0,
    "message": "Amè mis tennis, son cómodos, lindos y se pueden convinar muy bien con todos los estilos, soy 6.5 en talla de adulto y pedí un talla 4 en niños y me quedaron un poco grandes pero los tennis son muy confortables"
  },
  {
    "user": "RT",
    "rating": 5.0,
    "message": "All around great shoes. Comfortable and reasonably priced."
  },
  {
    "user": "Brandi Harris",
    "rating": 5.0,
    "message": "My son loves putting on the shoes for school! They fit great and must be very comfortable for him to always want to wear"
  },
  {
    "user": "Christian",
    "rating": 5.0,
    "message": "We bought these on sale and they were a great price!"
  },
  {
    "user": "Terrence  Jacobs",
    "rating": 4.0,
    "message": "A gift for my niece, its big but I  will keep them."
  },
  {
    "user": "Nikki",
    "rating": 5.0,
    "message": "My daughter loves them. Looks like good quality. Fit as expected."
  },
  {
    "user": "K. Wilson",
    "rating": 5.0,
    "message": "These shoes are so cute! I ordered them from a different seller listed as “like new” and they were 100% in new condition. Very pleased so far."
  },
  {
    "user": "Sweetsmiley00",
    "rating": 5.0,
    "message": "I bought these for grandson. His size 7 Nike was too small. So we got these size 8 Adidas. These are his daycare/ play shoes. They have held up well. Seem well made. They were I little bigger than I expected. But he'll grow into them. He was very excited to get these when they arrived. And runs everywhere in them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Best money Ive spent and as pictured too!"
  },
  {
    "user": "Diana Paladines",
    "rating": 5.0,
    "message": "Esos zapatos los compre para mi hija y le quedaron muy bien son cómodos y lindos"
  },
  {
    "user": "Iliana Customer",
    "rating": 5.0,
    "message": "Me encantan los zapatos, cómodos y se le ven hermoso 😍🤩"
  },
  {
    "user": "Yolanda",
    "rating": 5.0,
    "message": "I love she shoes it’s giving unicorn 🦄"
  },
  {
    "user": "Teri Polzin",
    "rating": 5.0,
    "message": "Cute as can be and a great price!"
  },
  {
    "user": "Charlie",
    "rating": 5.0,
    "message": "They look good and with good materials. Old school hip hop tennis shoes, will have your kid breakdancing in no time!"
  },
  {
    "user": "Samantha Ehrlick",
    "rating": 5.0,
    "message": "Very nice"
  },
  {
    "user": "stone",
    "rating": 4.0,
    "message": "so far shoes holding up well"
  },
  {
    "user": "Lindarose",
    "rating": 5.0,
    "message": "The media could not be loaded. My son loves these. They arrived on time and are the perfect size, I ordered them a little big so he can grow with them. I will definitely be ordering more"
  },
  {
    "user": "Kris",
    "rating": 5.0,
    "message": "Extremely comfortable and great everyday shoes!"
  },
  {
    "user": "Paola",
    "rating": 5.0,
    "message": "Perfectos para mí Niño de 8 años"
  },
  {
    "user": "Michael Mavrakis",
    "rating": 5.0,
    "message": "Great shoe… Daughter absolutely loves!"
  },
  {
    "user": "Vincenza Villani",
    "rating": 5.0,
    "message": "great pair of sneakers"
  },
  {
    "user": "Ashleigh Rothhammer",
    "rating": 5.0,
    "message": "The soles come out easily but great shoes overall."
  },
  {
    "user": "Kristen Laird",
    "rating": 5.0,
    "message": "The shoes fit her perfectly and she loves that she has a matching pair as I have the same ones for women and we both love them!"
  },
  {
    "user": "Just_a_Mom_x3",
    "rating": 5.0,
    "message": "Love these and my daughter loves them."
  },
  {
    "user": "tessa",
    "rating": 5.0,
    "message": "Nice shoe for back to school"
  },
  {
    "user": "Monica",
    "rating": 5.0,
    "message": "These shoes are so cute and with an extended strap added they work great for SMO’s."
  },
  {
    "user": "Eliette",
    "rating": 5.0,
    "message": "Stylish shoes. my son feels comfortable. He love it."
  },
  {
    "user": "kim smith",
    "rating": 5.0,
    "message": "Easy to clean"
  },
  {
    "user": "AC",
    "rating": 5.0,
    "message": "Super cute sneaker. Good quality."
  },
  {
    "user": "Jose M. Velez Jr",
    "rating": 5.0,
    "message": "These are my daughters first walking shoes and I am obsessed! They're so adorable She loves them!"
  },
  {
    "user": "Dane Miluski",
    "rating": 5.0,
    "message": "Good: These shoes came quickly and in great condition Size Confusion: My son had recently outgrown his size 10T shoes. Visiting this page, I noticed the next size up offered was size 1 kids. Although the sizing chart linked on the page specifically showed additional toddler sizes 11, 12, 13 prior to Size 1 K, I assumed that after size 10T was size 1K. Suggestion to seller: To help your buyers, you might include size 11-13 as out of stock, so that other parents don't make the same assumption/mistake I made. I'll keep these anyway as my son will grow into them eventually."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I brought these for my 2yo old son and they fit perfectly"
  },
  {
    "user": "AshChen17",
    "rating": 5.0,
    "message": "Cute shoes for back to school. Like the fact that they are easy to wipe off. My 6 year old loves them. Hoping they can make it thru til Christmas time these will be her school shoes so from August to December."
  },
  {
    "user": "Oswaldo Villa",
    "rating": 4.0,
    "message": "I like these shoes i bought for my son , i bough a similar pair for me, but and the end of the travel we did on NY we ended up with pain in our feet,  these shoes are good looking and easy to clean but not good for long walks."
  },
  {
    "user": "Luis Rocha",
    "rating": 5.0,
    "message": "Right off the bat…1st day wearing and he drew on them with black marker 💀 Thankfully this shoe isn’t made of cheap material so I was able to scrub it off with Ajax and a tooth brush. They look brand new again. Would def recommend"
  },
  {
    "user": "misha",
    "rating": 4.0,
    "message": "I am a botas collector and I feel comfortable in this botas"
  }
]