[
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "One of the best shoes i ever tried in my life. Very comfortable, i can walk in this shoes all day without even feeling that i am wearing anything. Very good material . Color amazing. I got the black in 7.5 and it fits well. Quality looks high end . Highly recommend"
  },
  {
    "user": "Jessica McGruther",
    "rating": 5.0,
    "message": "I am absolutely obsessed with these shoes! They are super cute, very trendy but most importantly SO freaking comfortable! I wore these all around New Orleans without so must as a pinch or blister."
  },
  {
    "user": "crystal l wade",
    "rating": 5.0,
    "message": "So cute and comfortable!"
  },
  {
    "user": "Tracy L",
    "rating": 3.0,
    "message": "The shoes are very cute but are super narrow. Unfortunately I returned them."
  },
  {
    "user": "Maria",
    "rating": 5.0,
    "message": "El tamaño es coincide con mi talla"
  },
  {
    "user": "Christin Johnson",
    "rating": 3.0,
    "message": "They were sized right and comfortable but I didn’t realize the light Beige part at the toe was a satiny/shiny material. It gave the shoes a totally different look than I was expecting. If you’re OK with a dressy tennis shoe, you’ll probably love them but I wanted more of a true retro look."
  },
  {
    "user": "Jenn",
    "rating": 5.0,
    "message": "These are my 3rd pair of Tretorns, so clearly I like this brand. This shoe did not disappoint. I will say they were not amazing comfortable right out of the box. It did take a couple of days wear to “break them in”."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are very classy and make your feet feel great."
  },
  {
    "user": "Rebecca Leyco Ramos",
    "rating": 5.0,
    "message": "Great pair! Glad i got them and at a good price too!"
  },
  {
    "user": "AliciaCG",
    "rating": 5.0,
    "message": "Love the silver and black with the animal print pattern. True 7."
  },
  {
    "user": "K. Bunting",
    "rating": 5.0,
    "message": "These shoes are super cute and very comfortable!  They dress up a casual outfit in just the right way!"
  },
  {
    "user": "JB",
    "rating": 2.0,
    "message": "The shoes look correct, but feel like cheap shoes. The black part on the rubber looks as if it was spray painted on. There are weird marks on the shoe as well. I would go to the actual website to order them."
  },
  {
    "user": "AHA",
    "rating": 3.0,
    "message": "Quality not good color fading and stitching started to fraying"
  },
  {
    "user": "Shelby",
    "rating": 4.0,
    "message": "I love these but confusing about fit. I looked at reviews on this style everywhere with most people saying they run small or too narrow.  I’ve been a 7 for years, but lately 7.5 seems to fit better, probably because I have wide feet.  I ordered these in size 7.5. Not only were they too long, they were a loose width wise as well. I have to return them. Ordering in a 7. I hope they fit!  Also, the cream color on top is satin. That could be a deterrent for some. I wasn’t expecting it, but I still like them. Overall, I’m mostly drawn to the color as they will go with a lot of different outfits."
  },
  {
    "user": "sillife",
    "rating": 2.0,
    "message": "Shoes run .5 size too big & the pair I received had some loose stitching. nbd, until I clicked to return then repurchase.  The price increased from $50 to $100 :/ Returned for a refund."
  },
  {
    "user": "JOSHILL",
    "rating": 4.0,
    "message": "These run small and very narrow! They are stiff so I’m wearing them around the house to break in. But super cute and seem to be made well so far."
  },
  {
    "user": "Nicole",
    "rating": 5.0,
    "message": "They fit perfect. Comfy and feels like a real sneaker. I had only seen them on 2 sites and they didn’t have my size. Checked Amazon and they had them at a good price."
  },
  {
    "user": "michelle",
    "rating": 4.0,
    "message": "Super cute and stylish, They are more or a casual sneaker than anything I would go running in. I give them 4 stars for comfort, could be a little more comfortable."
  },
  {
    "user": "Raquelpdx",
    "rating": 4.0,
    "message": "Recommend a size up. Narrow"
  },
  {
    "user": "B-h-B",
    "rating": 1.0,
    "message": "This is a great looking shoe but beware of size!  I have the exact pair but in a different color in a 10.5.  When I ordered this pair I could only get an 11 which I knew would be fine.  The size 11 shoes wouldn’t even go in my foot!! Luckily my 18 year old daughter lined the shoes and they actually fit her.  She normally wears a 9.  So I was disappointed with the sizing of this shoe that’s why I gave only one star!!"
  },
  {
    "user": "jason a ehrat",
    "rating": 2.0,
    "message": "Bought full size up for pickleball, fits as expected. Comfortable shoe but the black lining rubbed off on my skin and white socks :/ (still ruining socks months later) Very cute shoes"
  },
  {
    "user": "Girl up north",
    "rating": 5.0,
    "message": "Love this sneaker!  Well made and cute.  Runs TTS.  Very comfortable.  Can dress up or down."
  },
  {
    "user": "Lauren Foster Ayers",
    "rating": 1.0,
    "message": "Sizing is way off, I am a standard women’s 9 and I could barely get my foot in. Also noticed a few small stains on the cream satin. Very disappointed."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "Attempted to wear these shoes twice but they are very stiff and uncomfortable. The tongue of the shoe digs into the front part of my leg. Would not recommend."
  },
  {
    "user": null,
    "rating": null,
    "message": "Love these shoes - so comfortable and pretty.  They are shinier than I expected (the cloth part is more like satin) and fit on the larger side.  I would go down a half size, if you aren't planning on wearing them with thick socks."
  },
  {
    "user": null,
    "rating": null,
    "message": "Very nice!"
  }
]