[
  {
    "user": "Amy",
    "rating": 4.0,
    "message": "These are a cute and fashionable shoe that are a good competitor for other more expensive and less supportive shoe. But if your day requires any real walking, these are not your shoe.  I loved initially that they seemed to have arch support, but there is no cushion to that support.  I wore to the airport and within a few minutes of walking I regretted not wearing a more sturdy shoe and by the time I got through the airport and at my hotel, I was searching out a place to get some true support.  Cute and fashionable, but not overly practical and missing what we really need from shoes, support."
  },
  {
    "user": "JanJan",
    "rating": 5.0,
    "message": "I wore this brand for several years during the summer months, but after recovering from a broken leg, I found myself wearing this brand/type of shoe most months out of the year!  I noticed not all colors and patterns were available all the time so if I loved a color, I shopped for it, and in the case of these white ones, I wanted a spare.  I live in a wet climate and white doesn’t stay white for long.  Even if they are washable, they never end up the same.  I love these comfy little slip on shoes, and I even get compliments on them all time... but they aren’t cheap (relatively speaking) so I watch for sales.  I just grabbed these white ones for a song through the Amazon Warehouse Deals!  I have had mixed results from the warehouse offerings, so your mileage may vary, but my white ones were in perfect condition (as far as I can tell) and even came in the original box with the tissue paper etc still in the shoes.  I am thrilled with this purchase!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Always wear a 7.5 I ordered an 8 based on the reviews. I am returning the 8 for an 8.5. My toe is at the tip of the 8."
  },
  {
    "user": "TheDailyConsumer",
    "rating": 4.0,
    "message": "I have had a few pairs of Roxy  sneakers over the years and we love them. When I saw these in blue, I ordered immediately. My daughter needed another pair of casual sneakers, but she already has a ton with neon colors, so I wanted something neutral. The shimmery gold and silver is adorable. And the little hints of rose gold on the metal eyelets and labels adds a cute touch. I always size up a half or whole size with these, for a perfect fit. With the first few wears, they can be tougher to get on, but once they're broken in, they're very easy to slip on and off. The memory foam foot bed keeps your feet cozy, and the lightweight, (yet quality) construction makes it feel like you're walking on air. Can't recommend enough to everyone! Buy these!"
  },
  {
    "user": "Sherry",
    "rating": 5.0,
    "message": "These are slip on & comfortable. My 2nd pair. I think they are true to size. I wear them a lot!"
  },
  {
    "user": "bucks",
    "rating": 5.0,
    "message": "not for a lot of walking or exercise"
  },
  {
    "user": "Pamela M. Barger",
    "rating": 5.0,
    "message": "I had to order a full size larger than my usual size, but I did, because I like these shoes. They’re as  comfortable as athletic shoes but not as bulky. And cuter."
  },
  {
    "user": "Angela",
    "rating": 5.0,
    "message": "I’ve had a pair of these before, and decided I needed a black pair. They are surely my go to shoes for the summer. Supper comfy and cute with shorts or a tunic dress"
  },
  {
    "user": "Mary E",
    "rating": 5.0,
    "message": "Love this Roxy shoe. So very comfortable and light. You hardly notice you have shoes on . Have one is many colors. Would recommend without hesitation."
  },
  {
    "user": "Kristene H",
    "rating": 3.0,
    "message": "I really want to leave a good review!  I love these shoes.  They are comfortable and fit perfect.  The durability though is just something i just cannot give a 5 or 4 star review for. I am already working on my 4th pair over two years (two pairs i bought elsewhere).  I do not wear everyday, maybe one to two times a week.  I also do not wear when I'm out in the grass or doing anything that may cause them to get overly dirty.  They get holes very easy in the toes and are coming apart at the sole.  Its extremely frustrating because i do really like the Roxy brand and especially the style and comfort of the shoe. Unfortunately this will most likely be my last pair....i know, it took me a bit to learn."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have been a converse wearer for years, even though they hurt my wide feet. I am so happy I found these comfy alternatives and I wish I had found them sooner. I did read the other reviews that said to size up and I'm glad I did... I probably could have gone up another half for some extra wiggle. They are cute, comfy, and I wore them all day straight out of the box with no complaints. I even bought a pair in another color."
  },
  {
    "user": "LK",
    "rating": 5.0,
    "message": "I love these sneakers. You can wear with so many different solid colors. Comfortable. I take a 7.5 and they fit perfectly."
  },
  {
    "user": "Maria D. Lizardi",
    "rating": 5.0,
    "message": "Love them! Thinking about getting another pair"
  },
  {
    "user": "Camille C",
    "rating": 5.0,
    "message": "Great fit. Not great for long walks but comfy and adorable. Usually a size 9-9.5. Bought a 10. So cute with jeans and sweats!  Will be buying again and again!"
  },
  {
    "user": "S. Dawson",
    "rating": 5.0,
    "message": "I bought the Roxy for a cute style when going around town on errands, shopping, out for lunch, or a casual dinner. I like the Bayshore III the best out of any style. There are so many great colors, and I bought four different ones. My husband likes them, and that's important to me. They are so comfortable, and the slip-on shoe is so easy take on and off. I would not wear them for serious exercise, but that is not what these are for anyway. They are true to size for me in the Bayshore III."
  },
  {
    "user": "Deb Barringer",
    "rating": 4.0,
    "message": "Nice, comfortable, looks good. Insole doesn't provide quite as much support as I was expecting and it is somewhat rough feeling. Still, nice looking shoe that is fun to wear. Would recommend."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I wear 6.5 in American size so the size 8 fits me perfectly. I had one before for a thrift store that's how I knew my size. And I loved them so much that I had to find a second pair 😂"
  },
  {
    "user": "Barbara Edmonson",
    "rating": 5.0,
    "message": "Soft comfortable shoes have several pairs in different colors  would buy again"
  },
  {
    "user": "Samantha kellie",
    "rating": 5.0,
    "message": "Pleased with my purchase and wear often. They are very comfortable."
  },
  {
    "user": "Jackie Z",
    "rating": 4.0,
    "message": "These are easy to slip on for quick errand or if going out & you’ll be sitting a lot. Not a supportive walking shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Most comfortable cute sneakers"
  },
  {
    "user": "nlb",
    "rating": 4.0,
    "message": "I read reviews and ordered up a half size from my usual 8 to 8 1/2. WOW! They were still small and went back asap. I suggest you consider ordering a full size over your usual. They are very comfortable, and a true slip on/off shoe. They are also nice looking and look as though they would wash well. The sizing is the only negative or I would give 5 stars."
  },
  {
    "user": "MomOfTwo",
    "rating": 5.0,
    "message": "Cute and fits true to size!"
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "Size 10 is a little tight, without socks. Limited toe room."
  },
  {
    "user": "Lanie",
    "rating": 4.0,
    "message": "I normally wear a size 8 and based on reviews I ordered an 8.  They are a little small, should have gone 1/2 size up."
  },
  {
    "user": "Kathy Payne",
    "rating": 4.0,
    "message": "Cute shoes. A little overpriced, that’s OK kept product and paid for it thank you Kathy Payne"
  },
  {
    "user": "Anne",
    "rating": 4.0,
    "message": "I bought two pairs, anthracite black and white. I really wanted minimalist shoes and these really fit that look. They're very soft and pliable. The soles get dirty easily but I don't care since they're shoes. The insoles slip out all the time and it's a bit annoying. I have very narrow, slim, tiny size 5 feet. I'm like 5 feet and 95 lbs and I'm an adult so I thought I'd go for my normal size 5 but I wanted to wear socks with these so I bought a size 5.5 based off of the reviews. Good lord am I glad I did. As small as my feet are, these shoes are still tight. I can wear them with ballet socks but any other socks won't fit. My toes hit the edge of the toe box, with and without socks, and I had my nails trimmed down. Generally I wear a lot of heels and sandals so I normally have longer toenails but I would never be able to wear these shoes unless I trim them. So there's that. Anyhow I have yet to smell anything weird from them after several wears without socks (which doesn't make them any more comfortable or fit any better). The issues I have with them would be that the elastic inside them leave deep indents in my skin and itch uncomfortably and the edges of the mouth also leave imprints on my skin after I take them off. I kinda wish I bought a size 6 because the white ones cut into the back of my ankle, but the black ones don't. As far as how they look though, the fabric looks very clean and new. Even though the anthracite design is distressed the laces are very white and my white pair is very clean overall. I like them since they serve their purpose. Mostly gonna wear my heels and sandals though. These are a little flat and will make my feet hurt a bit after hours of wear (from the tightness not the flatness)."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Ran a little small so I had to order a half size bigger. Extremely comfortable!!!"
  },
  {
    "user": "CarolinaFoodie",
    "rating": 4.0,
    "message": "Sizing is not consistent. I purchased the beige ones and blush ones both in my size. The blush ones fit perfectly - if maybe a teeny bit tight at first. But these beige ones were too small and I had to return. I think it would be safe to go up by 1/2 size. These casual sneakers are great looking and have a little padding inside. The sole is fairly thin so keep that in mind as I wouldn’t want to wear them on a trail or anything of the sort. But they are cute. The neutral color is perfect with lots of outfits"
  },
  {
    "user": "iowa shopper",
    "rating": 5.0,
    "message": "Shoes are very comfortable- very cute. Have several pairs of Roxy sneakers."
  },
  {
    "user": "Diana Gibbs",
    "rating": 5.0,
    "message": "I love all my roxy shoes and how you can toss them in the washer and dryer"
  },
  {
    "user": "Migdalia Haros Encinas",
    "rating": 4.0,
    "message": "El modelo me gusto, solo la medida es justa y se canda el traerlos unas horas"
  },
  {
    "user": "Beth Tucker",
    "rating": 3.0,
    "message": "I have these same exact Roxy Bayshores (different color) in a size 8. They fit perfect...both of them. I bought a size 8 in white from Amazon. They were too big and the left shoe was way too wide. I then ordered a size 7.5 and I received them today and just like the other pair, the left shoe was way too big and wide and I'm positive my left foot hasn't shrunk..... I now have to return both pair. Something is definitely defective with these Roxy's, so be careful!"
  },
  {
    "user": "LL",
    "rating": 4.0,
    "message": "They are comfy… but not for all day, if your going to be shopping! Looks good with capris, pants, and skirt!"
  },
  {
    "user": "J. T. in PA",
    "rating": 4.0,
    "message": "I usually wear a 9, but my toes were right at the front w/o socks, will definitely order 1/2 size bigger. Cute and comfy otherwise."
  },
  {
    "user": "Patricia S.",
    "rating": 5.0,
    "message": "I bought white, it instantly shows the dirt, but guess what, it washes very nicely.  The shoe doesn't have any support so I only wear them for short outings or get togethers. They are very stylish right now, I might consider getting another pair in a different color."
  },
  {
    "user": "Patricia Mailhiot",
    "rating": 5.0,
    "message": "Very comfortable fit.  This is my 3rd pair.  I purchase them every 18 months or so.  I wear them all year round.  Just a great shoe"
  },
  {
    "user": "Rhoda Baade",
    "rating": 5.0,
    "message": "I try to buy local but these were unavailable in my size or this color locally so I ordered them. They arrived fast and are exactly what I wanted. Super happy with them so far!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Like them. Very comfortble and so beautiful"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I am a true 8 med and had to return and get a 9…then it was a perfect fit! Love to slip them on and go!"
  },
  {
    "user": "Joshua East",
    "rating": 5.0,
    "message": "these are super cute and super comfy! I did order 1/2 size bigger and they stay on all day! do not slip off in back! will buy again"
  },
  {
    "user": "Ashe",
    "rating": 5.0,
    "message": "I am a barefoot flip flop kind of girl. Scooped these up so I could make it through tsa without being barefoot at the airport. These are hands down the most comfy shoes I've ever owned. I ordered a 5.5, im usually a 5-5.5 with 6s being giant in everything except for Toms. The 5.5 does fit and im keeping them,, but a bit more snug than preferred and def. no room for socks (though these are catered to not wearing with socks, the lining is so soft and dreamy.) Already ordered another color in a half size up and will be ordering a pair for my toddler (found them in little sizes too!) If you want to wear socks with them on the reg I would recommend ordering a full size up, no socks a half size should do perfectly. Foam cushioning and flexible sole. More comfortable than being barefoot... UPDATE: I managed to drip rust water on one of these shoes (off white) it took some abrasive cleaners and rough scrubbers to get out. I was concerned over damage to the threading and thin fabric but after air drying for a few days they still look great! For those of you wondering how easy they are to keep clean or how they hold up, photos are taken after rust drippage scrubbing. The sage is a size 6, yes they are near grey with a hint of green. The size 5.5 felt very tight at first but wore in quickly. The size 6 is comfortable initially but without socks slips off the back. I hold onto the idea that your normal size is great for no socks and half size up with socks. Future purchases (there will be more because I love them) I will stick with the 5.5."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "A little flat no arch support, but no pain or discomfort."
  },
  {
    "user": "Nanooo48",
    "rating": 4.0,
    "message": "I had these same sneakers, same size and fit perfectly. These ones for some reason are very snug."
  },
  {
    "user": "AH",
    "rating": 4.0,
    "message": "I wear a size 7 in almost every shoe I have ever tried on but this one was more like a six. Definitely size up. The shoe itself was very cute and had good support. Too bad they were out of the next size or I would have bought them."
  },
  {
    "user": "J",
    "rating": 4.0,
    "message": "I wear an 8.5 to 9, but these 9’s for like an 8!  They are absolutely adorable, and the arch support seems great. I am exchanging for a 9.5 for my toes sake!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "1/2 size too small if wearing lite socks with"
  },
  {
    "user": "Jenn S",
    "rating": 3.0,
    "message": "I love the look of these shoes, but the fit is terrible and there is no support. I dozed up nearly 1.5 sizes just to get my toes comfortable, like they won’t break through the canvas. But that means they fit very loose width-wise. I love them for a quick trip, but they cannot be used as walking shoes. The cushioned bottom is soft, but offers no support so heels hit hard on sidewalk/pavement. Great for looks but that’s about it."
  },
  {
    "user": "Laura S. Hoskins",
    "rating": 5.0,
    "message": "I wore these for a 5 day music festival and they exceeded all expectations. I did add arch support but the soles are padded and wonderful! Going to buy a second pair I love them so much!"
  },
  {
    "user": "Joyce Ryals",
    "rating": 5.0,
    "message": "Very nice"
  },
  {
    "user": "Captain2015",
    "rating": 5.0,
    "message": "These shoes are zero-drop barefoot shoes. This means your heel is at the same level as your toes. Roxy doesn’t market them as minimalist but if you want to strengthen your ankles, have a toe box that allow your toes to expand naturally and want to feel the ground, buy them. Those that are claiming the ground is hard are right. It’s been hard for a long time!  Once your ankles become stronger and your balance returns to how millions of years of nature intended it to be it won’t feel hard anymore. Your old padded shoes will start to feel uncomfortable. Other shoes surround the foot with unnecessary padding and the backs are higher than the fronts. That puts strain on your legs, toes and feet.  You can’t feel the ground and can easily twist snd strain your ankles. My other barefoot shoes have cost way into the hundreds of dollars each. These are nowhere near that and will last with some card. The Roxy Shoe can be washed. I use individual delicate laundry bags. A little Clorox wipe on the rubber makes it look like new again. They aren’t advertised as zero drop barefoot but they are. I have no more hip, knee, shin  or foot pain. No more neck pain from walking and standing in an unnatural position. My calf muscles aren’t strained. I have high arches, no longer need padding and it’s no longer a problem.  It didn’t happen overnight, it will take a few weeks to acclimate. These aren’t official barefoot shoes, but a great place to start if you want to move towards a healthier lifestyle."
  },
  {
    "user": "Magda",
    "rating": 5.0,
    "message": "They are gorgeous! I love them! I am usually size 7.5 and I ordered 7.5. They fit like a glove, but without socks. If you plan to use socks maybe you should consider to order half a size up."
  },
  {
    "user": "Erin",
    "rating": 5.0,
    "message": "I wanted a low profile and simple tennis shoe for an upcoming trip with some walking around town and these are perfect. Everything else I saw was either too bulky, too “brand/logo”-styled, or too expensive for my taste. This is nice and light but comfortable and while it may not have the best arch support, it’s still WAY more comfortable than a Chuck Taylor shoe. The toe box has a decent amount of room and there’s at least a bit of cushion. I will definitely get my money’s worth out of these shoes and then not feel like I wasted money if I have to toss them after 6 months to a year."
  },
  {
    "user": "piadrum",
    "rating": 5.0,
    "message": "I have been wearing these shoes everywhere, and was excited when my college age daughter complimented them. They're easy to slip and comfortable too. There not a ton of support, and I ended up adding inserts, but that may be just because I have fairly flat arches. I really like the shoes, and purchased another pair in black."
  },
  {
    "user": "AZ Grandma",
    "rating": 5.0,
    "message": "I love these shoes. The stripe is more a blue gray which is fine. Size 8, fits perfectly."
  },
  {
    "user": "Carolyn C. Ricks",
    "rating": 5.0,
    "message": "Roxy tennis shoes always look very nice, are comfortable and fit well."
  },
  {
    "user": "Tastycakes",
    "rating": 5.0,
    "message": "I’ve been buying these shoes for years now. They are soooo comfy for work, and they can be worn with a lot of different outfits. I noticed this last purchase feels tighter (shorter in length) than usual, but maybe I just need to break them in."
  },
  {
    "user": "Kristen Taylor",
    "rating": 3.0,
    "message": "I bought these in an 8.5 and I normally wear a 7.5 to 8 shoe. They do fit perfectly and are super cute BUT...they have ZERO support. I have 5 pairs of Hey Dude shoes and I can wear them all day at my job and I'm on my feet, on concrete, all day. I had to change out of these shoes after a couple hours because they were killing my feet, knees, hips, and back. It felt like I had nothing on and that my feet were literally just slapping the floor when I walked. I will wear these around the house and outside for gardening, because they are very comfortable and lightweight. If you are looking for a similar style that gives support, I would purchase Hey Dudes or another brand that has support."
  },
  {
    "user": "MHollaBack",
    "rating": 3.0,
    "message": "ADDENDUM: I changed my rating from 5 to 3 stars. I've had these now for about 2 months. I loved them at the start, and I still WANT to love them (overall they are quite comfy), but there is one feature that is driving me crazy. They have nice foam-y feeling inserts lined with cloth, but for some strange reason the inserts aren't actually attached in any way to the shoe. This means that if your feet sweat AT ALL, when you go to take the shoes off the inserts stick to your foot and come part way out with your foot. Every. Single. Time. I find myself having to shove the inserts back in with each use. And over time they start to get bunched up even when I try to flatten them back down. Maybe mine were defective? Were the inserts supposed to be attached in some way? Most inserts I have used in the past are harder material and heavier, so they don't slide around as easily in the shoe. For those, not attaching them works. But since these are light, foam/cloth inserts, they have no weight to them and get pulled out VERY easily. Sadly, because of this, I don't think I'll be buying these again... ORIGINAL REVIEW: I was looking for something I could slip on to walk the dog, run errands, etc. Easy on, easy off, comfortable. I wasn't expecting to get anything that would hold up to running or exercising. This definitely fits the bill. I will say, the first pair I got had a hardened glob of glue near the opening that rubbed against my ankle and was very uncomfortable, but it looks like just a manufacturing defect. I didn't take a star off for that, as those kinds of things just happen. I went ahead and returned those and got another pair. Glad I did - the new set is perfect and SUPER comfortable. I love that they have a little foam insert, makes them that much nicer to wear. I read other reviews stating that they run a little small, so I ordered up a half size (from 8.5 to 9) and am glad I did. Great buy. Will see how these hold up, but assuming they last a decent amount of time, I'll probably be ordering more!"
  },
  {
    "user": "Val",
    "rating": 5.0,
    "message": "These shoes are my favorite! They are so cute and comfortable. No socks needed. I’m a 9 or 9.5. Ordered the 9.5 and they fit perfectly. They do get dirty easily, but that is a given with white shoes."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I like the comfort and style"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I ordered a 9, the size I’ve worn for the last 35 years and it was too small but just slightly, so I ordered a 9.5 and it’s the same fit as the 9. Order a whole size up!"
  },
  {
    "user": "Sharmutti",
    "rating": 5.0,
    "message": "These are my fourth pair of Roxy shoes. They are light weight and have great cushioning. And they are stylish. I have them in 4 colors and LOVE them to wear with pants or crops. And they wash well and maintain their shape."
  },
  {
    "user": "Wendy Munoz",
    "rating": 5.0,
    "message": "Great casual shoe to go anywhere. Very comfortable! If you are going to be walking a lot you may want to consider a shoe with a higher arch."
  },
  {
    "user": "Jennifer Davidson",
    "rating": 5.0,
    "message": "I bought these for summer and couldn’t love them more. They fit perfectly, are insanely comfortable, easy to move in and make my feet look small (definitely an added benefit). I recommend them highly along with all of Roxy’s memory foam sneakers. I’ve yet to be disappointed."
  },
  {
    "user": "shoelover in Illinois",
    "rating": 4.0,
    "message": "So comfortable! I added another insole that I can take out and wash if I wear them barefoot. The only flaw is that the permanent insole is a bit too short (drops off) at the toe of the shoe. Since I ordered 1/2 size larger than my usual size 7, though, the drop off isn't that noticeable."
  },
  {
    "user": "Denise",
    "rating": 4.0,
    "message": "I love Roxys. Im 22 with Rheumatoid Arthritis so I have a hard time finding shoes that are cute and stylish but that support my feet (and fragile joints). I was really excited for these, but I did find that the pair I received (sz7) felt smaller than the other sz7s i have of Roxy brand. I didn’t return them because I was going on vacation the following day and desperately needed them. They are still comfortable and I love them just the size concerns me as when my feet swell up I know I wont have room."
  },
  {
    "user": "T Rose",
    "rating": 3.0,
    "message": "I’ve been wearing different style Roxy slip ins for years. These are the first that let me down. They feel like cheap knock offs. No eyelet breathing holes so they get sweaty and hot, fabric is already wearing on seams on the side, they feel a half size smaller than all my other Roxys.  They look like they have arch support from the picture but the inside is totally flat."
  },
  {
    "user": "Sara maynard",
    "rating": 5.0,
    "message": "light weight. super comfortable. great price. i have issues with feet and knee pain and i could wear these all day!!"
  },
  {
    "user": "radio gaga",
    "rating": 5.0,
    "message": "I have purchased multiple pairs of these shoes over the years and I am hooked! I typically wear a 9.5 but I buy these in a 10 and they fit perfect. Super comfy and cute and no socks needed."
  },
  {
    "user": "Christinexm",
    "rating": 4.0,
    "message": "I bought these knowing that they would have no arch support, which is fine bc I walk around the house barefoot and wear flip flops out (I live in San Diego). I love these shoes.  I have big feet and I have a bunion on my left foot, plus after having 3 kids, my foot became wider.  Even with that, they are still comfy, in my opinion. The only thing that bothered me is that they are a SMIDGE smaller than the white ones.  I bought rhe black and white ones at the same time.  I dont know if it happens to just be this pair, or maybe my white ones are a SMIDGE bigger?? Anyhow, it's not uncomfortable, so it doesnt bother me.  After reading reviews, it looks like they'll stretch out anyway. Also, I'd size up 1/2 size if you dont wear socks and are ok with a snug fit.  Or, 1 whole size if you wear socks and need a little bit more room. I normally wear 8.5 (but 9 in Nike's bc they run small), but ordered 9.5 with the bayshores."
  },
  {
    "user": "Elizabeth M",
    "rating": 5.0,
    "message": "So comfortable, I usually wear a 6 1/2 but I bought a 7, fit perfect.  These were my 4th pair and I know I’ll be buying more."
  },
  {
    "user": "West One",
    "rating": 5.0,
    "message": "I had a pair and wanted the same shoes again found them on Amazon . Yeah!"
  },
  {
    "user": "pinkkitty",
    "rating": 5.0,
    "message": "A couple years ago I got similar shoes from JCPenney. They wore out, so I decided to pay a little more for these shoes and I am in love! These Roxys are true quality. The memory adds a wonderful layer of cushiness and the sole is adequately thick-- the shoes are extremely comfortable without being flimsy. I got the heathered gray because it reminds me of cozy sweats, and the color goes with everything. I'm so glad I listened to all the other reviewers who said to size up, because they definitely run small. I am a solid 6 1/2-- I very rarely wear a 7, and I ordered these in 7 based on the review. They fit perfectly, but only without socks (which aren't necessary for these shoes since the lining is terrycloth). I think I would able to wear super thin socks with them, but definitely not normal or thick socks. So they definitely run at least 1/2 size small."
  },
  {
    "user": "carlee",
    "rating": 4.0,
    "message": "Really nice material.. Ordered the light gray sneakers/size 7 for my daughter..(11 yrs old).. But they were too small.  She has a wide foot.. However..by the looks of them.. I think they have a stretchability..and some give. I believe that because shoe is made of a cotton thick sweathirty looking material.  But she said \"too small\".  That is my review. Oh..She also said the shoe made her \"foot look weird\".. I didn't think so.  Anyhow..I don't like sneaker reviews. They are sooo mixed. I begin to wonder if the stitching on any given pair of shoe varies? I understand a brand of shoe will run larger and another brand smaller. However, when you have your specific foot measurement..and  you go by the fitting chart for the particular brand..and you get the sneaker..yet still not fitting?  That leads me to think with soo many mixed reviews...The shoes may not be accurately sewn at manufacturing place? I have purchased 7 different brands/pairs of sneakers from Amazon.  I have had luck a few times. The cheaper slip on sneakers(under 25.00)..have been good for both my daughter and myself..  It is really hard to find a wide \"specification\".  Even when I type in \"women's wide sized sneakers\". I don't see specially categorized sneakers for \"wide foot\".  What shows up, (Amazon prime filter).. A few ugly choices.. Or they'll say \"plus sized\"."
  },
  {
    "user": "Teneal Jones",
    "rating": 5.0,
    "message": "So comfy, cleans easily and the back elastic never rubs the back of your foot"
  },
  {
    "user": "M. Phillips",
    "rating": 4.0,
    "message": "I love Roxy's Bayshore shoes because they are soft and conform to my feet better than other brands. I can't stand those \"platform\" sneakers that feel like walking on boxed pillows, as I always twist my ankles and can't feel anything I walk on (no, that's not a good thing, might as well get yourself a hoverboard and use that to get around everywhere). Anyways, so the Bayshoeres are softest and most comfortable shoes to wear without paying crazy money for the pricey minimalist shoes. Of course these aren't perfect, the width is still narrow and shape doesn't exactly match a natural foot shape, however, it's the best of \"cheaper popular brands\" out there. I usually wear 6.5, in Bayshores I am 7.5. They do get more comfortable as you break them in. These dark gray ones in particular seem thicker and so a bit more snug than I am used to. I still like them and prefer them over so many other brands."
  },
  {
    "user": "kc",
    "rating": 5.0,
    "message": "These are some of the most comfortable sneakers.  I've purchased 4 pairs over the last 2 years in different colors from DSW and Amazon.  They work well with casual summer dresses, pants, shorts etc.  The only thing I've found is you definitely need to size up.  my normal size is an 8 or 8 1/2, with Roxy brand sneakers, I wear a 9."
  },
  {
    "user": "Lisa",
    "rating": 5.0,
    "message": "These shoes fit like a glove! No socks!"
  },
  {
    "user": "Cara",
    "rating": 5.0,
    "message": "Fit perfect"
  },
  {
    "user": "Karie L",
    "rating": 5.0,
    "message": "These shoes are the best easy slip on, cute, everyday comfort shoe I’ve been wanting for years! Size up!!!!!!!!!!! These run small!!!!!! I wore my sisters pair when walking all day in Boston in the rain and my feet never hurt. The best part was when we got back to the abnb I was able to throw them in the washer and dryer without them changing their shape or shrinking the fabric. I originally ordered a pair through Roxy and had a horrible experience. Their customer service was not helpful and he couldn’t change my order even though I called to change size the same day. It took weeks to process to ship. It then took weeks to receive from California to Maine and weeks to send back. And I still haven’t received my phone call back or my refund and it’s been over a month now. I paid the regular price here but I received them fast and amazon is always awesome about cancelling if you accidentally order the wrong size and they’re great about returns. All that being said I absolutely LOVE these shoes but I would beware before buying  directly from Roxy."
  },
  {
    "user": "Mercedes",
    "rating": 5.0,
    "message": "First off, I love these shoes! They are so cute, flexible and soft. FYI - They do not have any arch support and the sole is pretty thin, which I expected. Second off, despite my comments regarding the sizing, I'm still giving 5 stars because I love them! Anyway, I wear a size 8.5 in just about every shoe brand (Skechers, Asics, New Balance, Keds, Saucony to name a few). For Nike I wear a ladies size 9 since they run small and for Converse I wear a ladies size 8 since they run big. After reading the reviews, I ordered a size 9. I tried them on with my no-show socks and they were too small. My toes were hitting the end of them. I wore them around the house and the tips of my toes actually hurt from touching the end! I think they would've been too small without socks too, but I didn't try them without socks. I returned them for a size 9.5 and they fit perfect, just like a regular 8.5 would! I would've never guessed I needed a size 9.5! I will be ordering more of these now that I'm positive what size I need. I uploaded some photos of the shoes alone and in comparison to a ladies Skechers Go Walk size 8.5, ladies Keds size 8.5 and ladies Converse size 8. They were the same exact size!"
  },
  {
    "user": "Tp D.",
    "rating": 5.0,
    "message": "I love ROXY's!  I have the white in a size 8 and I wear them all the time.  So, I wanted the black (meaning the heather looking black).  I ask my daughter to get them for me for Christmas.  So she ordered an 8 on EBAY and they were beyond SMALL.  They do not fit anything like the white ones.  The EBAY seller wanted 13 dollars to ship them back, so  no way, so I sold them on FB Marketplace and put the money to buying these on Amazon.  I made sure to order a half size up and they fit beautifully and I love them.  So the moral of the story is that, I have NO IDEA WHY THERE IS A DIFFERENCE IN SIZING WITH THE DIFFERENT COLORS, BUT THERE IS!  Do NOT ORDER YOUR USUAL SIZE IF YOU ARE GETTING THE BLACK.  Be sure to order a half size larger and you'll be so HAPPY!  Oh.....yes, I love the way that the back of the shoe is stretchy so that it fits your ankle so well, and the logo on the back of every Roxy shoe is so cute."
  },
  {
    "user": "Bookworm",
    "rating": 5.0,
    "message": "This is my second pair of these shoes.  The best thing I like about them besides their comfort is they are washable!  I like anything I can wash, and its very infrequent you can find comfortable every day type of shoes that are washable."
  },
  {
    "user": "Kat",
    "rating": 5.0,
    "message": "Okay. I am obsessed with these shoes. I love these type of slip on sneakers, they are super casual and cute and just fun. These are a bit pricier than what I normally spend for these type of sneakers, BUT I wear my other ones so often, so I thought I'd splurge a bit. I got these in the pink color, i love love love them. Exactly what I ordered and came in great condition.. however... THEY RUN SOOOO SMALL . LIKE WHAT? I am normally a 8.5 in sneakers. Once in a while I'm a 8, but I usually go with 8.5 with the majority of my sneakers and they're perfect with socks.. I read the reviews and went with a half size up and got a 9. These bad boys arrived and I slipped them on and low and behold... my feet barely fit in them. My toes were squished up against the front and they were almost painfully tight. So... I returned these and ordered a 9.5 and crossing my fingers they will fit well. So, ladies.... GO A WHOLE SIZE UP. SERIOUSLY. A WHOLEEEEE DANG SIZE."
  },
  {
    "user": "BethinVail",
    "rating": 4.0,
    "message": "These shoes are super comfy, easy to slip on and very cute.  I own 2 pair and they're my go to for casual sneakers. Great with shorts or capris or leggings.  They’re perfect for running around town and you’re average day to day.  I love em, but don’t plan on wearing them if you’re going to be doing any serious walking as they have little to no support."
  },
  {
    "user": "Brittany",
    "rating": 5.0,
    "message": "I usually wear a size 5.5/6 in women's so I ordered a 6. When I got it in it was like a child's 6 so I sent those back and ordered a size 8 and they fit perfectly so I don't know how these other women are saying it fits true to size because it didn't. I love them though! They have become my everyday shoe. They are easy to put on and take off. The insert is loose at the top of the shoe but is firmly in place everywhere else. There not a whole lot of padding but there is some. Overall I'd suggest buying a size bigger than you normally wear. Also don't wear regular socks otherwise the insert will come out when you take your foot out. Instead get some socks for flats. Thin and breathable that way your feet won't slide the inserts out."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I really like the shoe but they do run a size small. I usually wear a size 8 and I had to order a size 9. I think it’s because they’re a little more narrow and the toebox is a little tight. They’re cute and comfortable. Not great support but what you would expect from a shoot like this.  Overall a good purchase."
  },
  {
    "user": "Adriana M",
    "rating": 5.0,
    "message": "My first pair was the heather grey and my second was the dark denim. Both I wore for a year or longer quite a bit. I am a US 8 or 8.5 depending on the style of shoe but with these I order a 9 because they run small. I love the arch support and memory foam. I've seen some other brands with similar styles but for some reason I like Roxy's more. They're easy on my feet that lack arch. Pros: comfy, effortless, goes with everything, cute, memory foam is like walking on soft pillows Cons: wear and tear faster than most types of shoes because they're made of softer materials, memory foam does not last me longer than a few weeks."
  },
  {
    "user": "Heather",
    "rating": 5.0,
    "message": "I already had one pair of these that were old.  I love this brand and how it fits"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love love love ! This is my second pair and there will be a third ! Throw them right in the washer, air dry, and just like new ! The first pair, from last summer, still gets compliments !"
  },
  {
    "user": "Carolyn D.",
    "rating": 5.0,
    "message": "Just that you need to make sure you go one size up so if you wear a 7 get a 8.🥰"
  },
  {
    "user": "Missy",
    "rating": 5.0,
    "message": "Super cute shoes! I did exchange for a half size bigger. These are my 5th Roxy pair, so definite variation. Nonetheless, same expected softness inside! ♥️ Cool, casual look. Same great quality."
  },
  {
    "user": "Emalou Sampson",
    "rating": 3.0,
    "message": "I couldn’t have them on too long, especially if I was walking around.  They do look cute - I got lots of complements!"
  },
  {
    "user": "Susan Tuttle",
    "rating": 5.0,
    "message": "Taking the sneakers on an upcoming trip where we will be doing daily sightseeing."
  },
  {
    "user": "Jennifer Kimbrell",
    "rating": 3.0,
    "message": "Love the color and style of the shoe but disappointed in the quality for the price. Hardly know cushion or support in this shoe and not good quality that I was expecting. They do run small so I did order a 1/2 size bigger but have narrow fit. If you have wide fewer I would recommend going up. A size. Sending these back for a better quality shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Cute, comfortable, and great for all day wear! I normally wear a size 8, but needed an 8.5 in these. I have purchased in a variety of colors… LOVE THESE!!"
  },
  {
    "user": "Andrea",
    "rating": 5.0,
    "message": "Fits perfect! comfy for casual wear, wouldn't recommend if your constantly on your feet working on concrete"
  },
  {
    "user": "Emily Davis",
    "rating": 4.0,
    "message": "These shoes run small. I ordered an 8. that is the size I wear across the board they were too small. They didn’t feel like they would be uncomfortable. But they’re just shoes to do small things in.  I wouldn’t wear them all day."
  },
  {
    "user": "arejmer",
    "rating": 4.0,
    "message": "I LOVE Roxy’s. BUT even though I bought the same size I have purchased before, these seem narrower than the most of the others and are a bit more snug. I mean, they are okay, but as a teacher I am on my feet all day and these simply are not as comfy as my other Roxy’s. BTW - I usually wear a 7 1/2 so I size up to the 8 in Roxy’s and Jelly-Pops. My last TWO Roxy’s purchases have been much narrower and with a much more snug fit than my first ones."
  }
]