[
  {
    "user": "Roberta",
    "rating": 4.0,
    "message": "Great shoe.I work 8hrs days standing up an no complaints. I removed the insoles that it came with added put in my own memory foam insoles. Also ordered a whole size up to ensure comfort and correct sizing. My feet barely hurt..  I sometimes wear on my off days when quick run to the store. Only downside some of the black coloring becoming brownish near the logo but it's hardly noticeable."
  },
  {
    "user": "Frugal shopper",
    "rating": 4.0,
    "message": "I bought these for better support when walking a lot of hilly streets. I had started developing shin splints but switching to these seemed to relieve them."
  },
  {
    "user": "Diana Orozco",
    "rating": 4.0,
    "message": "Comfortable shoe. Those with wide feet it’s body for you as it fits true to size. Perhaps a little narrow. Feels great for being on your feet all day like as a waitress or nurse. Not slick resistant. I do not recommend for restaurant kitchen work. Overall I am pleased with them."
  },
  {
    "user": "Trend",
    "rating": 5.0,
    "message": "Let me tell you about these shoes.  These run about 1/2 size too small. The width is accurate; however it is necessary to get the proper width because they don't give and relax like leather shoes .  The synthetic leather is sewn over a non giving Inner  \"shoe\".  That firm inner liner gives these gym shoes a lot of support and structure.  These will hold their shape for the life of the shoes.  They are very sturdy.  There is a band around the front of the shoe.  That gives additional structure.  They have a cushioned insole.  They have good arch support.  It supports exactly where it should on the arches. The tongue is padded and the heel area is padded.  The laces aren't overly long.  The gym shoes are lightweight.  On the feet, they look like good leather gym shoes.  They don't get those ugly creases in them. The insole is comfortable.  The synthetic leather is soft, but that is not felt because it is sewn over that inner shoe. The inner liner is soft, but firm.  The top of the shoe, before the laces have some \"play\".  That one area is softer. The rest of the  shoe is firm, non giving and will stay that way by design.  That's why getting the proper width is important.  The feet feel very supported.  These are nothing like those popular mesh gym shoes. Now, there are  two sole attached to these shoes. The first is flexible.  The second is not. It does not give.  It feels hard while walking.  The second sole is the one that is treaded.  It is deeply treaded These shoes are not for running.  For anyone that has lost a lot of knee cartilage just know the last sole is  hard and inflexible.  If it wasn't,  these would be an absolute dream come true for anyone with knee issues.  Since it is so firm, initially they don't maneuver  easily in all directions while walking.  That's important for anyone with knee problems. They do absorb shock  and have lots of cushioning. The entire sole is almost 2\".  They are well worth trying, because they absorb so much shock and pressure off the knees  while walking. Note the photos;  the heel is designed so that  wearer has to heel strike first.  It's not an option. That is the proper way to begin walking.  That takes further pressure off the knee joint......I'm a Massage Therapist. I really don't think you will find a better shock absorbing shoe.  The more you walk in them the more thick cushioned sole is felt; the less the hard sole is felt,  and the feet are able to adjust to movement in all directions.  When first trying them on they just feel so hard.  That leaves after about a day of wearing.  After first trying them on my initial reactions was to send them right back.  Don't get discouraged when first trying them on.  Give them a chance. The knees will thank you. This is a good pair of shoes for people without knee problems for sure.  These make good works shoes  and they really look attractive, too.  I love the way they look, especially the all white.  It's a bright true white.  They look so fresh.  They make a nice  dress up gym shoe for me.  I know I'm glad I found them and I hope this review helps someone else. I purchased the white and black. For whatever reason the black runs a little smaller than the white.  I noticed that is true of Reebok's Princess Lite shoe as well."
  },
  {
    "user": "Phyllislewis",
    "rating": 5.0,
    "message": "I just tried them on. I didn’t wear them yet."
  },
  {
    "user": "Heath",
    "rating": 5.0,
    "message": "Perfect for being on your feet for long hours. As a wedding photographer I needed a nice comfortable pair of sneakers to walk around all day in. And help support my back. I also love the simple all black look."
  },
  {
    "user": "Elizabeth Genther",
    "rating": 5.0,
    "message": "Comfortable walking shoe"
  },
  {
    "user": "Dwayne halls",
    "rating": 5.0,
    "message": "It is a good shoes to wear to work fit nice felt so good"
  },
  {
    "user": "Maryam",
    "rating": 4.0,
    "message": "It’s comfortable but not very much, it can’t be your daily work or walking shoes. You can buy comfortable and more useful shoes with this money"
  },
  {
    "user": "Juan Pablo Crofort",
    "rating": 5.0,
    "message": "Muy bonitos y cómodos."
  },
  {
    "user": "Suzette Brooks",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "christis mcalary",
    "rating": 5.0,
    "message": "Supper comfortable"
  },
  {
    "user": "A. Colacito",
    "rating": 5.0,
    "message": "These are the perfect workout shoe.  I follow an online fitness instructor at home (shout out to #CDornerFitness) who does a variety of classes ranging from step aerobics to weight training to HIIT and Tabata style classes.  These shoes are perfect for everything.  Super cushioned and supportive, for step, but strong enough, thanks to the faux leather material, that they can hold up to moves like wall sits and planks that push your toes forward; I never feel like I'm going to rip a hole through the front or hurt myself if I accidentally drop a weight.  I have a narrow foot, and so many sneakers are too wide for me.  I'm pretty much a size 7 in every shoe for every occasion, and this shoe is no different.  7 was just right, and I don't have to tighten the laces to the max to be comfortable on my narrow-ish foot.  I love the retro style (I got black), and I super love that they are cruelty-free.  They DID have a strong chemically smell for the first few days, but that has long gone.  I've basically worn them every day for a year and they are holding up great.  The only sport I would not wear them for is running, although, admittedly, I haven't tried them running....."
  },
  {
    "user": "Ll",
    "rating": 4.0,
    "message": "Like these shoes"
  },
  {
    "user": "Avril Gordon",
    "rating": 4.0,
    "message": "I use this product for work and it is very comfortable"
  },
  {
    "user": "Keisha HInds",
    "rating": 5.0,
    "message": "Fits perfectly and feels comfortable"
  },
  {
    "user": "southern NH",
    "rating": 4.0,
    "message": "I’ve  only worn these a couple of times, just for walking. So far they fit well and seem of good quality. Time will tell later, on that aspect. I ordered wide, and they seem true to size. No pinching. I replaced the insole with a Spenco orthotic, since I need the support."
  },
  {
    "user": "Andrea Williams",
    "rating": 4.0,
    "message": "Nothing"
  },
  {
    "user": "Carla Sanabia",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "Maria Gestwicki",
    "rating": 5.0,
    "message": "This purchase was for school uniform. She loves them, the shoes quality is good, the price is affordable. I like them too, they will last her a good time. I do like Reebok ♥️ (80’s style)"
  },
  {
    "user": "Donna P.",
    "rating": 5.0,
    "message": "I brought this shoe for my daughter for school which she loved,the only problem is that it runs small,so I recommend that you go a size up"
  },
  {
    "user": "Mary Dent",
    "rating": 5.0,
    "message": "I've been wearing these for year's I love them."
  },
  {
    "user": "Anna",
    "rating": 5.0,
    "message": "Bought a size 10 and it fits perfectly fine I love it."
  },
  {
    "user": "Sandra Azubuike",
    "rating": 4.0,
    "message": "Very nice for working out"
  },
  {
    "user": "Olga Martinez",
    "rating": 5.0,
    "message": "Cómodos y bonitos"
  },
  {
    "user": "Keke",
    "rating": 3.0,
    "message": "Uncomfortable but they’ll have to work I guess"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I like a lot how this shoes pair with my outfits however they are bigger than expected."
  },
  {
    "user": "Chris",
    "rating": 4.0,
    "message": "In the late 80s and early 90s I lived in high-top Reeboks that I found super comfortable. For some reason these Reeboks seem to lack the cushion I was expecting and my soles ache when I wear them because the insoles feel hard and ungiving. I still gave them 4 stars because they are well made and it might be that they need to be broken in, and might also be because I haven't worn shoes with a lot of support lately. I have an old pair of New Balance tennies that are very broken in and comfortable, and I've been wearing comfortable canvas slip ons as a shoe of choice that are more like wearing slippers in how comfortable they are, but they're probably comfortable due to little support (?). I'm guessing these are the reasons the Reeboks feel hard and ungiving, because I also got a pair of Sketcher slip ons (via Amazon) a few months back, and those were also not as comfortable as I expected, so I put gel insoles in them and that felt much better. So maybe I've just gotten used to shoes that don't have a lot of support and that's why I'm giving these Reeboks the benefit of the doubt, and hope once I get used to the support and they also break in some, they'll feel more like my old high tops of days past."
  },
  {
    "user": "LizB",
    "rating": 3.0,
    "message": "The shoes have absolutely no cushion.  It felt like I was walking on the floor.  The soles have a unusual design, much unlike the Reebok Ultra 7 DMX Max that I have purchased the past 10 years.  This design doesn't work for me.  Returning them."
  },
  {
    "user": "Cheri P.",
    "rating": 3.0,
    "message": "I think these shoes have the potential to be great. I ordered a wide in my size, twice and neither of them are wide. I wonder if they even offer wide. On the tongue of the shoe it should have a w next to whatever the size is and on both pairs it does not. They definitely are just the regular shoe size."
  },
  {
    "user": "Nikya Kuan",
    "rating": 5.0,
    "message": "These have that classic look, and they're comfy and good for walking or standing all day. Very supportive. They have that angled heel and toe which make walking easier and more fluid, which I imagine is great for the knees and hips. I don't think I would recommend them for working out though. The platform of the sneaker sole is a little high (think, Skechers Shape Ups) and I would be afraid of landing wrong and twisting an ankle. It if you're doing lots of running, crossfit, jumping, plyometrics, etc. Anyway, they're super cute, I think they're genuine, and they fit great. I usually wear a size 7.5 in all major sneaker brands with my left foot being ever so slightly smaller than the right. These fit just as expected. I received two other models of similar Reeboks as A Try Before You Buy order and neither of them seemed like genuine Reeboks by comparison to this one. Sizing was off, and quality was not as good."
  },
  {
    "user": "Latoya",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "RoxAnne White",
    "rating": 3.0,
    "message": "The shoebox said wide but sneakers were regular width."
  },
  {
    "user": "Lex",
    "rating": 5.0,
    "message": "I bought these shoes for work. Ordered my normal size, and they fit true to size, so order your normal size. Comfortable."
  },
  {
    "user": "eli",
    "rating": 3.0,
    "message": "these shoes are not that comfortable. I hadn't felt stable at all, I was about to fall down. The material of the inner fabric was plastic and my feet sweated after half an hour walking"
  },
  {
    "user": "Tabitha Hudson",
    "rating": 5.0,
    "message": "The product was in excellent shape in time for school"
  },
  {
    "user": "Ruth rivera",
    "rating": 4.0,
    "message": "These shoes are actually very comfortable. They fit great. I saw many bad reviews after I had purchased them( New to online shopping… 🤷🏻‍♀️) I guess I was one of the lucky ones. I love the shoes and will be purchasing them in black next time."
  },
  {
    "user": "Rhonda Anthony",
    "rating": 5.0,
    "message": "Great fit and price point!  Reebok are not shoes typically recommended for people who have plantar fascists and achilles tendinitis.  I also have narrow feet.  However, I recalled wearing Reeboks as a cheerleader MANY years ago and had no issues.  So, I gave them a try and believe it or not I have had no less pain with these shoes.  I am loving my Reeboks !"
  },
  {
    "user": "Momazon Reviews",
    "rating": 3.0,
    "message": "Wore this for 1 night (8+ hours) and regretted it. I went back to simple walking shoes after, and returned these Reebok sneakers. I got the Wide size, which did turn out to be as expected, a bit loose-fitting (well, cos Wide). However - you'd think with the loose fit, the shoes would be comfortable. Wrong. Some part of the shoes made my ankles hurt, and after that one night, I experienced discomfort in my right knee. I haven't experienced that with the other shoes that I wear to work. Which are simple black walking shoes. Not sure what's wrong with these Reebok sneakers, but they were not for me."
  },
  {
    "user": "Kathy Garza",
    "rating": 4.0,
    "message": "These are really cute shoes to wear for work, but they don’t have enough support for me, I have high arches. Also if you have wide feet, you might want to look for something else, these shoes are smaller than most."
  },
  {
    "user": "Ramon!",
    "rating": 5.0,
    "message": "I like the quality and it was bought for school so it should last a reasonable amount of time as durability is very important to me."
  },
  {
    "user": "Alyssa",
    "rating": 4.0,
    "message": "Got a 7, they were tight so I returned to get a 7 wide and they ate still small width wise."
  },
  {
    "user": "Vernoca Gray",
    "rating": 4.0,
    "message": "All purchases where up to standard"
  },
  {
    "user": "shea  morrison",
    "rating": 5.0,
    "message": "My daughter likes heavy shoes, like Dr. Martens so I got her these for P.E. they're light and durable. Also, afordable and cute"
  },
  {
    "user": "Ms. Steph",
    "rating": 5.0,
    "message": "These reebok are cute and served the purpose. They looked very nice and are comfortable."
  },
  {
    "user": "STORM",
    "rating": 5.0,
    "message": "My shoes came two days early. I was so happy I could try them on before actually wearing them to work. They fit perfectly and felt great with padding."
  },
  {
    "user": "Sandra",
    "rating": 5.0,
    "message": "I didn’t dislike anything, I have 5 pairs of Reebok sneakers and they are all very comfortable and stylish"
  },
  {
    "user": "Pamela Lopez",
    "rating": 5.0,
    "message": "These are perfect for Nursing. I will be using them for Nursing School. Comfy, & fit true to size."
  },
  {
    "user": "Kai-Zen",
    "rating": 5.0,
    "message": "Meets and even slightly surpassed my expectations. Especially when buying shoes online you can expect to be disappointed. It's new so I don't know how it will go... With use. It isn't as flexible as one would expect with \"leather\" feels more like a steering wheel cover than a shoe but... My feet fit! So 5 stars."
  },
  {
    "user": "Inez Brown",
    "rating": 4.0,
    "message": "I love them fits perfectly"
  },
  {
    "user": "Lacey",
    "rating": 5.0,
    "message": "It's perfect for school"
  },
  {
    "user": "ana Maria Gonzalez Sotolongo",
    "rating": 5.0,
    "message": "Muy bonitos"
  },
  {
    "user": "Dorothea Pieters",
    "rating": 3.0,
    "message": "Return"
  },
  {
    "user": "Obbileita",
    "rating": 4.0,
    "message": "Look a little cheap"
  },
  {
    "user": "Cez6526",
    "rating": 5.0,
    "message": "Just a little to tight on my toes but they just need to be walk on."
  },
  {
    "user": "Stephanie Colton",
    "rating": 5.0,
    "message": "I have had a favorite pair of Adidas that I've had for years, and have probably tried to replace them with something as comfortable 7 or 8 times. At last, a winner! From the first second I put them on they felt just right. That's because ... They don't rub against my pinky toe. The back doesn't stick up too high and rub against the achilles! Cushioning around the ankle is nice. They don't rub or poke anywhere. These shoes are comfortable enough to wear all day, cute enough that I don't have to change my shoes to go to the store, and comfortable so I can get up anytime and go for a walk. FYI - the arch support is moderate, not really high on the inside. SIZING - I normally wear a 7.5 but like my tennis shoes a little bigger. I got an 8. It's just right because I like a thicker sock - I would say these run true to size, which is I have found to be extremely unusual for tennis shoes! A 7.5 would have likely worked, too. Only possible negative is that the white sidewalls might get dirty easily, but that's minor and easily handled. Love them!"
  },
  {
    "user": "Donna",
    "rating": 3.0,
    "message": "I like the shoe overall.  Just need to  break it in to fit my toe area better"
  },
  {
    "user": "Vita",
    "rating": 5.0,
    "message": "Used them for a 90s photoshoot and they were perfect."
  },
  {
    "user": "Margaret Morrison",
    "rating": 3.0,
    "message": "Was just too tight"
  },
  {
    "user": "Carlos francis",
    "rating": 5.0,
    "message": "The shoe is comfortable to work in and a good price I really like them"
  },
  {
    "user": "Cheryl",
    "rating": 5.0,
    "message": "Needed new sneakers, they fit perfectly and are very comfortable."
  },
  {
    "user": "Joy Richerson",
    "rating": 3.0,
    "message": "Size says 9, fit like 5."
  },
  {
    "user": "Sophie",
    "rating": 3.0,
    "message": "Not really comfortable"
  },
  {
    "user": "Shar",
    "rating": 5.0,
    "message": "If you're looking for a true white sneaker that is simple,  yet chic, look no further!  Very comfortable,  although there is no arch support.  I am a teacher and wore them comfortably after a day on my feet. I appreciate the extra height too!"
  },
  {
    "user": "Glowygon",
    "rating": 5.0,
    "message": "Me agrado todo lo de mis tenis!"
  },
  {
    "user": "lori audi",
    "rating": 5.0,
    "message": "A good walking shoe. Also good traction on the bottom stay with Reebok shoes you won't go wrong."
  },
  {
    "user": "Justine Childs",
    "rating": 5.0,
    "message": "Okay seriously, if you want to feel \"like so totally rad\"...order these shoes! I was actually looking for some Nike Air Force one in only white and being the cheapskate I am, didn't want to pay full price so I found these as an alternative. I don't know that I could be any happier if I had the disposable income of Mr. Facebook and HAD gotten the Nikes. I put these on and was like \"ooooo, these feel like I'm walking on clouds of happiness.\" The boyfriend glanced at my feet and goes \"Those are weird looking. You look like you have space shoes on.\" That made me love them even MORE! (this review comes from a man who wears Crocs, so how much do you think I care what he thinks of what's on my feet?) They fit spot on, they have lots of cushion for walking and they look retro KOOL and take you back to the day of shoulder pads and ratted high hair. I felt 80's KOOL wearing them, comfortable in them like I was in my 80's (and care about comfort more than KOOL) and I swear I could hear Whitesnake singing \"Still of the Night\" with every step I took. Recommend these? YES!"
  },
  {
    "user": "Hannah Y.",
    "rating": 5.0,
    "message": "This is our shoe! I work 12H shifts on my feet, standing, “running,” on concrete floor. This hurts more than it sounds; at the end of my day, I would need my husband to carry me to bed because my legs hurt so much. My toes swell at the end of the day and necessitates the wider toe box of the wide version. The widest part of my feet are such that medial side is more distal than the lateral side, which makes finding a sole that aligns difficult, but in these, it matches or is more forgiving. The surprise for me, though, is the memory foam: I used to be skeptical about the praises of memory foam from my friends, but I am now converted! The match of these shoes have saved my feet. The material is easy to dirty, but easy to clean. It holds in 20-degree walks between public transit and home, with or without snow. I have been complimented for its height and classic look, and it raises me to 5’ tall, to boot. So many perks for such a great price!"
  },
  {
    "user": "Daphne Taylor",
    "rating": 5.0,
    "message": "No issues"
  },
  {
    "user": "Mariale",
    "rating": 5.0,
    "message": "Super lindos, mucho mas que en la foto!!! excelente calidad!!"
  },
  {
    "user": "Visa",
    "rating": 5.0,
    "message": "This is the second pair for my 91 years young Auntie.  She loves them..  She has decided to do some extra walk.  And thought this shoe was a good fit because she loves her black ones so much."
  },
  {
    "user": "H",
    "rating": 5.0,
    "message": "Let me just first address the reviews complaining they are tight. Unless you actually have a very wide foot these are NOT going to be too tight. I am always a size 8 and bought a size 8. My foot is average to slightly wide. When I first put my feet in the shoes, they were slightly snug, yes. *But I knew they just needed to be broke in. After two days of wear they have literally melded to my foot perfectly and I'm so happy I didn't half size up.* I was excited to write this review for active workers like teachers and nurses. I'm an active worker all day and a heavy walker. I am basically on my feet most of the day. I've had heel pain, foot pain and calf pain for years, not being able to find the right shoe. This is literally the best shoe I've ever worn. I can be on my feet all day at work and then walk to do errands after a long day and not feel a thing. This shoe has actually made me more active because I don't have the dreaded pain anymore. They are SO comfortable. I am very thankful to have found them. Added bonus: much more stylish and cute in person. I thought they might be a little bulky and matronly in person but they are adorable. I couldn't be happier."
  },
  {
    "user": "Andy1",
    "rating": 5.0,
    "message": "Love these shoes. I wear them to go out or for walks. The only thing I advice is to be careful with the foamy part of the shoes. I washed them by hand on a cold day & made the mistake to place them in the dryer not knowing they would get stuck. The shoe was wedged between the door & caused the foamy part of the outside of the shoe to look like it was cut off. It is ruined. Other than that I love my shoes"
  },
  {
    "user": "evelyns Custom Creations",
    "rating": 5.0,
    "message": "Will buy again"
  },
  {
    "user": "Charisma Mclain",
    "rating": 5.0,
    "message": "Great  for work. No disappointment almost didn't get them because of some of the reviews. I have wide feet. You mat need some inserts if wearing for all day satisfaction"
  },
  {
    "user": "SharonMarie",
    "rating": 2.0,
    "message": "super narrow shoes..not pointed just narrow . the material isnt giving, which i understand is a good thing, but when a shoe fits too narrow and your bone of your toes rub the pain is horrible. i don't normally wear wide shoes so this is abnormally narrow shoes. ive tried stretching the shoe. and really wish this shoe didnt hurt so bad. i really needed new support shoes for standing al day"
  },
  {
    "user": "barbara",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "J. Speicher",
    "rating": 3.0,
    "message": "For the price and name brand, I expected a much better look of the material used. Once worn outside, the daylight makes the 'leather' look yellow. They look cheap"
  },
  {
    "user": "MEC",
    "rating": 4.0,
    "message": "Sooo comfortable! They fit great, not too tight. My feet are a little on the wider side, I struggle with shoes that aren’t wide enough often, so I was pleased to see this fit great. They are very comfortable as well, my feel feel very supported! The only thing I didn’t like is that when I walk my heels slide up. It’s not the wrong size, it’s just my heel somehow slides up when I walk… it’s the only thing that makes them uncomfortable."
  },
  {
    "user": "Lyndsy",
    "rating": 3.0,
    "message": "I needed all white/no mesh shoes for nursing school and these were recommended to me by an upperclassman, but I did not like these at all. I normally wear a size 7, so I ordered that size, but they were bulky and too loose causing my heels to slip. So I ordered a 6.5 and they were still slipping. I ended up ordering from Reebok's website directly and purchased an entirely different shoe style. I am much happier with the quality and fit."
  },
  {
    "user": "janice",
    "rating": 5.0,
    "message": "comfortability"
  },
  {
    "user": "Barb",
    "rating": 3.0,
    "message": "im a size 9. I can get away with a 9.5 if I love the shoe and a 9 isn't available. I ordered the 9.5 wide. I have less than a 1/4 inch from the big toe to the end of the shoe. The wide isn't really wide either and are quite tight. If you have a naturally wide foot then these are not the shoe for you. They are not 100 percent leather either as stated in the description of the shoe. Only the part where the Reebox logo is actual leather. the rest is man made. The memory foam is nice but poorly attached inside the shoe and not properly lined up inside the shoe. I,m a waitress and spend more than 8 hours on my feet. I just received the shoes yesterday and have only worn them around the house so I cannot say how my feet will feel after my first few shifts. As of now my feet feel ok in them but a little restricted in the width and they do slip a bit in the back when I walk. I recommend if buying this shoe go at least a half size up for a little more room. If u go a whole size up they will surely slip when you walk. Id also recommend ordering the wide width regardless because the normal width would be quite tight on any foot since the wide width is currently tight on me. Perhaps after I break them in that will change. Ill update my review after a week or so of trying them at work. Hope this helps."
  },
  {
    "user": "JoJo",
    "rating": 5.0,
    "message": "I thought I should order a half size bigger but my instincts said no.  So glad I didn’t.  They are true to size.  Very very comfortable.  Looks great with jeans, even palazzo pants"
  },
  {
    "user": "LaTisha Seward",
    "rating": 5.0,
    "message": "These shoes were definitely a great buy last minute at that!  Met all my expectations especially for walking through airports. I bought these specifically for traveling did me justice."
  },
  {
    "user": "Tee",
    "rating": 5.0,
    "message": "Classic reeboks"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these shoes!"
  },
  {
    "user": "Enguarl Harris",
    "rating": 4.0,
    "message": "Shoe had a different fit to right shoe"
  },
  {
    "user": "N_0518",
    "rating": 4.0,
    "message": "I ordered these shoes for nursing school because they meet all requirements (white, leather, no mesh or holes). However, I definitely should have paid attention to the majority of reviews and ordered a bigger size. I not only had to order an entire size up than I normally wear, but I also had to order them in wide which I have NEVER had to do. That being said, once you get the size that fits you perfectly, they are great! They look really nice and they're very sturdy feeling and comfortable. You can tell they're made well and will last me a long time. Shout out to Amazon for the quick exchange before they even received my original pair back! That's awesome customer service."
  },
  {
    "user": "Elizabeth B.",
    "rating": 5.0,
    "message": "I have bought these before, so of course I came back to buy another pair! Amazon has great payment options such as monthly plans to pay for these! I will say though that the back by the heel is weirdly flatter than before so it took a few days wear to get used to stepping different, but all in all I still give 5 stars! 10/10 Definitely recommend!"
  },
  {
    "user": "sherry",
    "rating": 3.0,
    "message": "Had s spot on them I shouldn't had to clean new shoes out the box."
  },
  {
    "user": "Ashley Tejada",
    "rating": 3.0,
    "message": "I thought these would help my feet. I have plantar fasciitis and I was trying to find shoes that would not rip apart so easily because I go through shoes so fast! My feet were NOT having it. I'm on concrete all day. These are not it. Sad day."
  },
  {
    "user": "Caren G.",
    "rating": 3.0,
    "message": "Nice looking, but the leather feels strange. It feels hard. They feel different  from an older pair I bought  at a shoe store. They are ok just not as comfortable as I would  like but I have flat feet. Not bad for the price."
  },
  {
    "user": "Mallory Morgan",
    "rating": 4.0,
    "message": "Sadly, after reading reviews, I got a wide 9 because they were stated to be \"true to size\". I have a wide foot and am a solid 9. These were MASSIVE on me and so long. The width was actually great but it didn't help the length. My foot was coming out of them when I walked and uncomfortable. I would suggest if you need a wide, size down half a size or if you teeter on the line, get the half size smaller."
  },
  {
    "user": "Cyndy Roberts",
    "rating": 3.0,
    "message": "I've been looking for an all white pair of sneakers.  I really like the way these look, but after getting them and tried them on I was disappointed to find the arch support is nearly void. If you have flat feet or a low arch they would be fine, but for someone with a normal or high arch support they won't feel good."
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "For some reason, these rub my instep and on the side by my little toe in the left shoe only."
  },
  {
    "user": "TM272",
    "rating": 3.0,
    "message": "The sole and the upper show are 2 different shades of white...the sole is actually a bone-colored.  The combination clashes and is not eye-appealing.  Also I always wear a size 7 medium...these are too narrow, and has little to none arch support.  I use to wear Reebok all the time, but this is not the same quality I remember.  Won't buy any more Reebok."
  },
  {
    "user": "Claudia",
    "rating": 4.0,
    "message": "The media could not be loaded. Los uso para mi travajo están cómodos no se cansan los pies"
  },
  {
    "user": "kim l burke",
    "rating": 3.0,
    "message": "Very much liked the design of the shoe. Tried several different sizes, never fit right and looked like oversized blocks on my feet. Wear an 8 normally. Those were too tight and narrow, 8 and 8.5 wide and large."
  },
  {
    "user": "LAF",
    "rating": 5.0,
    "message": "I do love this shoe. Seems a little off white but excellent. I normally wear a wide width 10.5. But width is ok."
  },
  {
    "user": "User",
    "rating": 4.0,
    "message": "Wow I am so surprised how well they fit! I've been having a problem finding wide enough shoes for my feet and when I ordered the wide in these I don't feel like my feet are hanging off too bad! The cushion is great like everyone said they were. Also the item came in about 3 days after I placed my order. Overall, I am very satisfied with the product and I am so happy I decided to give these a try! The last shoe I ordered were women's Espirit sneakers and they were not wide enough for my feet. Also, I am normally a size 7 but I decided to order a size larger like everyone has suggested and it is the perfect fit! :) Really happy to finally have a black sneaker to wear while I am in Europe that is comfortable and nice looking! Edit*** Although these are nice looking shoes they arent leather so they never fully broke in like I had hoped. I have extremely flat feet and I should have left my insoles in but because the padding on the inside could not be removed, I found it hard to wear them with my insoles. Really a true bummer."
  }
]