[
  {
    "user": "amazona",
    "rating": 5.0,
    "message": "I love New Balance shoes and these don’t disappoint, The fit is true to size and super comfortable right out of the box, specially around the toes. Love the style and more arch support than I expected which is GREAT for me. I wear them everyday for a long walks with my dog; insoles are super soft I have no complaints of discomfort and I get a lot of compliments from it. Would definitely purchase NB again."
  },
  {
    "user": "Donna Scheer",
    "rating": 4.0,
    "message": "For this price, don't expect the solid NB construction or the support. The sole is comfortable enough if you're using it for city walking or short trips. The sides aren't super solid for extra strength or support there. I was hoping for a little more stability and support as a shoe for walking, but I walk fast and for long-ish distances. This won't hold up for that. Today's 2 mile walk resulted in minor discomfort (gone in an hour so not a big deal), just evidence that these aren't super workout shoes. The look is great and they'll be fine for daily run-around-town use."
  },
  {
    "user": "sarysa",
    "rating": 5.0,
    "message": "This is the third New Balance sneaker I've gotten over the years and like the others, no problems with fit despite my high instep. (which means your foot has thicker bone than most people, especially near the leg, has nothing to do with arches) Took a few days to break in and conform to my feet, but never once hurt. So long as there keep making their sneakers this way, they have me for life."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wear these for work and they are super comfortable. I average 10-15,000 steps just at work and not to mention I'm 6 months pregnant and these shoes are the best!! AND they're stylish! I wear them all the time! Definitely recommend!"
  },
  {
    "user": "Cynthia Hargus",
    "rating": 4.0,
    "message": "Daughter ordered these.  They are great for kicking around and wanting a little fashion on your feet!"
  },
  {
    "user": "Ashley Sanchez",
    "rating": 5.0,
    "message": "Love these shoes! Fits true to size and so comfortable, definitely would buy again. And a very good price."
  },
  {
    "user": "bsybee",
    "rating": 4.0,
    "message": "These shoes are comfy for all day walking. They offer good support for the feet. Will buy again."
  },
  {
    "user": "Carrie",
    "rating": 5.0,
    "message": "My granddaughter usually wears an 8 or 8.5 wide but in these a 9 wide fit perfectly She loves them"
  },
  {
    "user": "JAG2000",
    "rating": 4.0,
    "message": "Had surgery on my foot and after it healed I was told I needed to buy this brand. I was reluctant but happy they came in different colors. Looked narrow and small out of the box. Once I put them on I was surprised by how much room the tow box was in comparison to other name brand more expensive sneakers. I would buy them again. But would prefer to wear them without the orthotics I’m suppose to Put inside of them. I wear an 8 in women but Initially thought I would need a half size bigger. Try them on and walk around. They are true to size for me at an 8."
  },
  {
    "user": "Chill Hill",
    "rating": 4.0,
    "message": "I purchased my regular size shoe, 8w, with this shoe & the sole is not as supportive as I thought it would be. The shoe is good looking. I need a more supportive sole for walking long distances. Thicker socks help fill the space cause the shoe was a little loose. Will have to find a better fit shoe w/ more supportive sole for long walks"
  },
  {
    "user": "Sylvia",
    "rating": 5.0,
    "message": "Nice color and comfortable"
  },
  {
    "user": "Raul Buri",
    "rating": 5.0,
    "message": "Comodidad y estilo"
  },
  {
    "user": "Seana Boyd",
    "rating": 5.0,
    "message": "I bought them for work. I’m on my feet all day.  Worth it.  I was wearing flats…. 😳 My feet love me again.  Plus no swollen feet or leg aches once I’m home!!"
  },
  {
    "user": "sharon",
    "rating": 5.0,
    "message": "GREAT FIT!"
  },
  {
    "user": "Teresa's Love Of Books",
    "rating": 4.0,
    "message": "It wasn’t as wide as I thought it would be so of course now I have to buy a shoe stretcher Everything else about this you I loved but I actually bought them again these are bought for a child of mine that has a very wide foot and a high-end step"
  },
  {
    "user": "Sharon Whitehead",
    "rating": 5.0,
    "message": "I like the shoes and I bought them for me"
  },
  {
    "user": "Carol",
    "rating": 4.0,
    "message": "They were too small, my toes were right to the end, and I ordered the size I always wear in any brand."
  },
  {
    "user": "Josephine Rivera",
    "rating": 4.0,
    "message": "These are very comfortable. A little bulky."
  },
  {
    "user": "G",
    "rating": 5.0,
    "message": "Very cute shoes and comfortable to walk in. Great price! Love them! Order usual size."
  },
  {
    "user": "shanee",
    "rating": 5.0,
    "message": "They very good and comfortable  and thue are cute"
  },
  {
    "user": "Bianca Ware",
    "rating": 5.0,
    "message": "Love these shoes!"
  },
  {
    "user": "OL",
    "rating": 5.0,
    "message": "Very comfy sneaker Fit very well"
  },
  {
    "user": "Angela Lopez",
    "rating": 5.0,
    "message": "I love these shoes! Their color and shape, they are super confortable. 100% recommended!"
  },
  {
    "user": "MsG",
    "rating": 4.0,
    "message": "Very cute shoes but not enough support for working out or wearing for longer periods of time."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love everything about these sneakers!"
  },
  {
    "user": "Kathryn Babin",
    "rating": 5.0,
    "message": "I recommend"
  },
  {
    "user": "China Doll",
    "rating": 4.0,
    "message": "Work shoe"
  },
  {
    "user": "mns",
    "rating": 5.0,
    "message": "I walk everyday. These New Balance 515 V3 sneakers fit great and feel great during my exercise sessions."
  },
  {
    "user": "IN ETN",
    "rating": 4.0,
    "message": "Got on prime lightning deal for about half price. I had recently tried the same shoe on at a shoe store so knew it fit true to size. I wear 9 and purchased a 9. I’m pleased with the purchase."
  },
  {
    "user": "eadlergirl1",
    "rating": 5.0,
    "message": "You're simply the best, better than ALL the rest! Thank you New Balance for bring balance into my life!"
  },
  {
    "user": "Kevin",
    "rating": 5.0,
    "message": "Love New Balance. Can never go wrong."
  },
  {
    "user": "Mags",
    "rating": 5.0,
    "message": "I always buy nb they are comfortable and stylish."
  },
  {
    "user": "Mercedes sanchez",
    "rating": 5.0,
    "message": "Love this shoes 👟"
  },
  {
    "user": "Karen Krahn",
    "rating": 5.0,
    "message": "I’m never disappointed with this brand"
  },
  {
    "user": "Mar",
    "rating": 5.0,
    "message": "They are comfortable and fit very well."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are very comfortable. Love them although they were too big. I almost want to order another pair a size smaller and gift these to my sister."
  },
  {
    "user": "Isa",
    "rating": 5.0,
    "message": "Absolutely loved them. Finally found one that I loved and they weren’t expensive either."
  },
  {
    "user": "Melissa Arteaga",
    "rating": 5.0,
    "message": "True to size very comfortable."
  },
  {
    "user": "Xiomara  Fernandez",
    "rating": 5.0,
    "message": "Hace mucho tiempo uso new balance y para mi son los mejores"
  },
  {
    "user": "50 State Traveler",
    "rating": 5.0,
    "message": "I have far too many pairs of sneakers, but they were all purchased based on looks. I really needed a pair of non-trendy comfortable ones to wear on my daily dog walks. These NB shoes are supportive and comfy, and I can walk for miles easily. I wouldn't wear them out for an evening, but I do wear, and love them, every day."
  },
  {
    "user": "Maggie",
    "rating": 5.0,
    "message": "These are a totally classic New Balance fit. Comfy, true to size but Not the most breathable footwear out there. Your feet might sweat in the summer heat but the outside observer will love these shoes. I have seriously had more strangers stop to ask me about these New Balances than any basic sneaker warrants. Get that pop of goldenrod on your feet and be prepared to discuss where you bought these sneakers with all of your neighbors."
  },
  {
    "user": "Kate Fox",
    "rating": 5.0,
    "message": "I've tried many other shoes for walking and working out, but none ever last as long or provide the support I need for my feet as a supinator with really high arches. Almost everything else gets returned because they start to cause knee and hip pain, but not these. They're also way cheaper than most brands but still high quality and durable."
  },
  {
    "user": "Ebhart",
    "rating": 5.0,
    "message": "Ordered these in W and it's a comfortable fit. Have had no complaints since."
  },
  {
    "user": "Stephanie Waller",
    "rating": 5.0,
    "message": "These shoes fit perfectly and the colors and floral design is adorable. I love them!!"
  },
  {
    "user": "Reyna",
    "rating": 5.0,
    "message": "I was going to wear these for work with my scrubs but they're way too cute to get hospital cooties on them. I wear them with my everyday casual clothes. They're comfy too so I can wear them all day."
  },
  {
    "user": "Latina",
    "rating": 5.0,
    "message": "I wear a 7 women's and ordered a 7 wide because of my flat feet and they fit perfect."
  },
  {
    "user": "Evelyn",
    "rating": 5.0,
    "message": "I have not found these style of sneaker in a New Balance store or their website. New Balance was recommended by my podiatrist after having surgery on my foot. This did not disappoint in the healing process of my foot"
  },
  {
    "user": "Cecilia M.",
    "rating": 5.0,
    "message": "Fits well and is comfortable.I liked that it is adjustable for tightness around your ankle with the extra holes for the shoelaces."
  },
  {
    "user": "Hailey",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "emily p",
    "rating": 3.0,
    "message": "These were nice looking but run large."
  },
  {
    "user": "Cassidy S",
    "rating": 3.0,
    "message": "I am a woman that has extra wide feet (I usually buy a men's extra wide) someone suggested new balance but I found them very narrow. In fact, I have a knock off pair from Walmart that fit better! But they suck after even just a 8 hour shift. Ended up buying Hoka because I have plantar fasciitis. HIGHLY RECCOMEND I got the Bondi 7s mens extra wide"
  },
  {
    "user": "Emily",
    "rating": 5.0,
    "message": "The colors are beautiful!! Love the shoes and they are so comfortable!!"
  },
  {
    "user": "boyeon han",
    "rating": 3.0,
    "message": "I ordered size 6.5 W that is small for me. If you usually wear new balance sneakers size 6.5W, please order size 7 W for this 515v3 sneakers."
  },
  {
    "user": "LillyLo",
    "rating": 5.0,
    "message": "Very comfortable! Good quality and the colors are true to the picture."
  },
  {
    "user": "Lorit",
    "rating": 5.0,
    "message": "Having flat feet I have usually taken the easy route and avoided shoes with an arch.  I wasn’t doing myself any favors and it only causes further problems with age.  I thought I would give this shoe a try.  They are working out well and I don’t have any foot pain.  That along with being cute is a win, win!"
  },
  {
    "user": "Mary K",
    "rating": 4.0,
    "message": "I liked these shoes but were to narrow for me, but a nice shoe, and light weight"
  },
  {
    "user": "Carrie Lemasters",
    "rating": 5.0,
    "message": "VERY comfortable, walked for miles right out of the box, and super cute!  I've gotten many compliments as well!"
  },
  {
    "user": "Rina",
    "rating": 5.0,
    "message": "They are great shoes. I use them to work at the hospital for 12 hours and they are great."
  },
  {
    "user": "Ashley hall",
    "rating": 5.0,
    "message": "Fits perfectly cute !"
  },
  {
    "user": "Bobbie Walters",
    "rating": 5.0,
    "message": "Colors are wonderful"
  },
  {
    "user": "Desi Barrett",
    "rating": 5.0,
    "message": "These shoes WOW! I work at a bakery during the summer so I’m on my feet all day! These shoes are so comfy, and aren’t an outrageous price like On Clouds etc. I highly recommend!"
  },
  {
    "user": "Julie",
    "rating": 5.0,
    "message": "Great color and quality. Got them in wide width and they really are wide. My feet are very wide and even some shoes labeled wide usually aren’t wide enough, but there’s actually fit well. Definitely considering other colors for future purchase."
  },
  {
    "user": "Cincy Girl",
    "rating": 5.0,
    "message": "Love the 515’s so much that I have in two colors.  Great casual sneakers and my go to’s when running errands.  Bought in navy (indigo) as well as cream (sea salt/moonbeam).  True to size and wear my usual 9’s.  Enough support to wear all day (on my feet teaching) and cute too!"
  },
  {
    "user": "Carol Pape",
    "rating": 5.0,
    "message": "Comfortable sneaker, Love new balance. Bought these in the past and so there my go to shoe again!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Seem to be as comfortable as the NB 574 Classic Evergreen V2 which they did not have in my size in blue.  NB are the best sneakers I have found for walking.  Good support."
  },
  {
    "user": "Amy",
    "rating": 4.0,
    "message": "Great shoes, love the way they look, but did have to add arch support insole"
  },
  {
    "user": "Linda Taylor",
    "rating": 5.0,
    "message": "I like the color of the shoe, and I like the way the shoes fit. Thank you."
  },
  {
    "user": "Asa O",
    "rating": 5.0,
    "message": "These are super cute! Very comfortable. They came quick and well packaged in the shoebox. Definitely recommend them"
  },
  {
    "user": "K. Smith",
    "rating": 5.0,
    "message": "Great shoes. Definitely not for working out but they look great with jeans or shorts."
  },
  {
    "user": "Tereza",
    "rating": 4.0,
    "message": "A fun sneaker, pretty comfortable!"
  },
  {
    "user": "Your Mom",
    "rating": 3.0,
    "message": "I like the style and fit. But, for almost 100 bucks I would have hoped for a better made shoe. The 'N's are not glued very well and are already lifting. Seams of glue are sloppy and had strings of glue hanging off them. Edging is not cut to perfection. Let's just see how long they hold up."
  },
  {
    "user": "TK",
    "rating": 3.0,
    "message": "Love the look of these shoes but halfway through my 8hr shift my feet were achey. Not comfortable shoes when you’re standing most of the day"
  },
  {
    "user": "anonymous",
    "rating": 3.0,
    "message": "1. The shoe is not attractive, the toe of the shoe has a suede wave-like thing on top I didn't notice when I ordered. It almost looks like it was put on wrong and the wave part should be where the big toe sits. The material of the shoe feels like what they use on the inside of the shoe. 2. There isn't any arch support so I have had to add one. 3. I wear a 6.5 wide and it is wide enough. I haven't decided if I am going to keep."
  },
  {
    "user": "Sandy",
    "rating": 5.0,
    "message": "These are very comfortable for long walks.."
  },
  {
    "user": "V Yoco",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "christina mcduffie",
    "rating": 5.0,
    "message": "Great support. Beautiful color."
  },
  {
    "user": "Eulalia",
    "rating": 5.0,
    "message": "Para trabajar lo utilizo..perfect.."
  },
  {
    "user": "Steven M Proffitt",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "Jennifer Maietta",
    "rating": 5.0,
    "message": "A little stiff to begin with but broke them in quickly and they feel and look great."
  },
  {
    "user": "Terry C.",
    "rating": 5.0,
    "message": "This is my second pair of this style and I Love these shoes and they are so cute ! They fit well and re very comfortable ❤️"
  },
  {
    "user": "Libby Silvia",
    "rating": 5.0,
    "message": "Absolutely love these! Super comfy and perfect for a nurse on her feet all day"
  },
  {
    "user": "Nicole W",
    "rating": 4.0,
    "message": "I love the 311 hot pink style...the color and the shape is long and not to broad. Reminds me of old school skater shoes or old Nikes. I saw these and they looked the same but the now have more of that awesome color in cool flowers. It is same color and flowers are nice, like in photo .. But the shape is fugly. Idk what it is but the short and crooked toe seam or wide toe box. Im get thicker laces maybe"
  },
  {
    "user": "Rosalee Fernandez",
    "rating": 5.0,
    "message": "Shoes fit well and are very comfortable"
  },
  {
    "user": "Maggie S.",
    "rating": 5.0,
    "message": "Fit easily from day 1. Very comfortable. Good ankle support."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Really nice-looking, comfortable, well-made shoe that fits me true to size."
  },
  {
    "user": "Jay",
    "rating": 5.0,
    "message": "The fit is perfect for a daily shoe"
  },
  {
    "user": "mabely santana",
    "rating": 5.0,
    "message": "Son hermosos y comodos"
  },
  {
    "user": "Zaida Hernandez",
    "rating": 5.0,
    "message": "Comfortable, like the colors, always wear NB"
  },
  {
    "user": "Annette",
    "rating": 5.0,
    "message": "I stand all day at work most the time on cement and I needed a shoe that would help my feet in that situation.....these are shoes are light weight and so comfortable!!"
  },
  {
    "user": "Bibiana Ramirez",
    "rating": 5.0,
    "message": "They are simple amazing super cute and comfy"
  },
  {
    "user": "Dirtnapper",
    "rating": 5.0,
    "message": "Love them!"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Poor quality for the price. Looks like a knock off. Ran small. I returned and the refund was immediate, which was really nice."
  },
  {
    "user": "Lindsay Wood",
    "rating": 5.0,
    "message": "I really like the pretty floral design on these sneakers. They fit TTS and are comfy. Excited to wear them this summer."
  },
  {
    "user": "Ronisha Waters",
    "rating": 5.0,
    "message": "I love the color, the fabric and the fit."
  },
  {
    "user": "tabs",
    "rating": 5.0,
    "message": "These shoes are very light weight and comfortable not to mention adorable!"
  },
  {
    "user": "Sharon Ruiz",
    "rating": 2.0,
    "message": "Received my package in a second hand box not a new balance box. When I went to try on the shoe I took out the paper there was like 4-6 dog hairs entwined into the insoles of the shoe… didn’t want to try on anymore.."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Thank you"
  },
  {
    "user": "Leticia",
    "rating": 1.0,
    "message": "I am A respiratory therapist working 12hrs.  I read Reviews from nurses but after 15,000 steps in my first 12hrs LORD my feet burned & throbbed!  I am not just on my feet 90% of the time like nurses but as an RT we are all over the hospital walking around and i can easily put 25-39,000 of steps in one shift.  These shoes are cute but lack the stability to hold up.  I have a normal arch and pretty normal foot and not over weight.  I normally wear brooks or ASICS. Now they are cute plenty of toe room not narrowed in.  They would be Ideal for working out or casual wear i do Believe they will hold up."
  },
  {
    "user": "grandee",
    "rating": 4.0,
    "message": "the animal print looks a bit faded, but over all I like them"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect athletic shoe to wear with jeans but style be stylish! Very comfortable! I ordered a size Ladies 8 & they fit with a very thin sock. They felt a little snug with thicker running socks"
  }
]