[
  {
    "user": "linda",
    "rating": 5.0,
    "message": "When I first put the sneaker on, I thought it was too tight because my toe was at the very tip.(7.5M) However on my next wearing, I realized it was very comfortable and today I wore socks and still very comfortable. I love the black rubber with black canvass. Nice sneaker. Enough padding in sole to be very comfortable."
  },
  {
    "user": "Ty",
    "rating": 4.0,
    "message": "The shoes are very lightweight and simple . The inserts are already sliding out of it if you need something quick easy and simple this is the shoe but do not expect durability *update* I brought these shoes for work and I love feeling like there is nothing on my feet. They are comfortable to stand in and walk in. Not completely durable but they are comfy"
  },
  {
    "user": "Mariah P",
    "rating": 4.0,
    "message": "They are super light weight however aren't meant to walk in long periods, these are more meant to wear for simple things like sitting or relaxing at the park. These shoes remind me of those old school vans with the hard sharp ankle part so might I suggest bending that back point outwards before using them?"
  },
  {
    "user": "Kirby Schneider",
    "rating": 4.0,
    "message": "These shoes are so cute and give the appearance of Keds. I will say though, standing in them for hours and walking long distances are definitely not what these shoes were made for. The support isn’t great and they somehow give me blisters every time I walk in them too much. They’re great for school or somewhere where you don’t have to walk as much though"
  },
  {
    "user": "Megan Bramble",
    "rating": 5.0,
    "message": "These are very cute and comfortable! Can't beat the price! Insoles are soft and cushiony and I like the added padding on the heel."
  },
  {
    "user": "Conesia",
    "rating": 4.0,
    "message": "Bought it for walking and it was an excellent choice"
  },
  {
    "user": "Dorcas W.",
    "rating": 5.0,
    "message": "These sneakers are incredibly comfortable and fit great. They were surprisingly light and has the right amount of support."
  },
  {
    "user": "Lynn Collier",
    "rating": 4.0,
    "message": "I can't tell you about the quality of the shoe because the size ran so small that I couldn't even get my foot in it. My advice is to order a size or 1/2 larger than you usually order."
  },
  {
    "user": "Sierra",
    "rating": 5.0,
    "message": "I honestly really like these shoes!"
  },
  {
    "user": "Kat S.",
    "rating": 4.0,
    "message": "It’s a white sneaker and it looks great. Made well. But no support for arches. Atleast it runs a bit wide so I was able to wear arch sole inside and fixed it. I would def buy again. Best price ever for white shoes since white tends to get dirty.  It’s a bright white and lov it."
  },
  {
    "user": "Grateful owner",
    "rating": 4.0,
    "message": "The price is right and are perfect for walking, working, and will launder (and dry) nicely."
  },
  {
    "user": "Janette",
    "rating": 4.0,
    "message": "I love these shoes because they are so cute. My feet aren’t as narrow as they used to be so my pinky toes rub a good bit when walking. The backs gave me blisters so now I just make sure to put bandaids on before socks. I really do like these shoes so far. I wear them often."
  },
  {
    "user": "Kathy",
    "rating": 5.0,
    "message": "Fit well with great price for work"
  },
  {
    "user": "teresa",
    "rating": 4.0,
    "message": "They are comfortable. Just not a great arche support.  But i am not using them for hiking so mo problem."
  },
  {
    "user": "Grace Klein",
    "rating": 4.0,
    "message": "Comfy if you’re only wearing it for a few hours, but if you’re out and about walking a lot they tend to be uncomfortable"
  },
  {
    "user": "Tanisha",
    "rating": 4.0,
    "message": "The shoes are comfortable. It just takes a bit long to break them in so it’s not rubbing so harshly on the back of your ankle"
  },
  {
    "user": "joceline",
    "rating": 3.0,
    "message": "They fit me well, I like the fit and they look nice; I wanted them for dressy casual work attire. However, even though the fit was great, they gave me blisters on both my ankles. I work in an office, I've been wearing them for about 5 hours, the majority of the time I've been sitting and now I have two painful blisters. I wanted to love them because I hate wearing flats to work and this was a good alternative but I can't wear them anymore."
  },
  {
    "user": "Laura K.",
    "rating": 4.0,
    "message": "If you buy 1/2 size larger than your regular, these are good! They have no arch support whatsoever, but if you like old fashioned tennis shoes (with REAL rubber soles that LAST) these canvas sneakers are a good value.  My new ones are size 8 1/2, and they fit perfectly, though all my other closed toe shoes are size 8. Last year, I bought a pair in size 8 and had to repeatedly wet and stretch the toe area with a large marble just to be able to wear them with thin socks. But they DO hold up well with wearing.  Now, if Amazon had them in other colors, I'd buy more in the 8 1/2 size!"
  },
  {
    "user": "Kenya",
    "rating": 5.0,
    "message": "Perfect fit and cute"
  },
  {
    "user": "ELIZABETH HERNANDEZ",
    "rating": 4.0,
    "message": "They are nice but to hard I've all ready used them 3 times and they still heart my toes when to much walking"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I always look for traction. This shoe is non-slip with good traction, comfortable (with an insert), and cut low enough on the ankle to wear with a dress."
  },
  {
    "user": "MISS LINDA",
    "rating": 4.0,
    "message": "I really like them, they fit and look nice on my feet. Been a long time finding them. Long ago I wore white tennis shoe like these. I spray with scotch guard immediately and following each wash! Enjoy Yours."
  },
  {
    "user": "herman18",
    "rating": 5.0,
    "message": "Ordered them 1/2 size bigger like suggested and I like em' Nice :D"
  },
  {
    "user": "Fanna",
    "rating": 4.0,
    "message": "Okay shoes."
  },
  {
    "user": "Israa Dayekh",
    "rating": 4.0,
    "message": "I ordered 8.5  and my feet are 8, so it’s larger, however it still hurts my feet from the back"
  },
  {
    "user": "Mariah",
    "rating": 5.0,
    "message": "Okay fair warning I’ve had mine for at least 2 years now so they look crazy. This is after using them for gardening, babysitting, double Dutch, toddler soccer, teaching, walking long walks, beach trips, just everything really😅. I wear these almost every day. I don’t like shoes that provide arch support because I’m not a huge fan of shoes but these feel like I’m wearing nothing (or at least a flip flop) when I first got them they had padding in them but 2 years will allow them to stretch out and get even more comfortable than they already are (didn’t think they could get anymore comfortable but they surprised me). These shoes are amazing. I’ve washed them so many times I couldn’t give you a number if I tried 😂 they appear to be made of just canvas and rubber which is the perfect combo. If you love converse but wish the rubber toe wasn’t there sometimes just get this shoe. You won’t regret it!"
  },
  {
    "user": "SilkyPoco",
    "rating": 3.0,
    "message": "I’m really hard on shoes. These didn’t last long for me. Other then that they were great. I think for the average wearer they’d be great."
  },
  {
    "user": "MamaDoots",
    "rating": 4.0,
    "message": "Wore this to the zoo with my grandchildren and were so comfortable after 3 hours of walking.  Did not have to break them in, they fit perfectly and were more comfortable than some of my brand shoes and sneakers!"
  },
  {
    "user": "JP",
    "rating": 3.0,
    "message": "This is a unisex shoe which means it's made to fit men but anyone can buy it. It will fit women but it is wide and clumsy looking. There is no arch support but there is a nice springy insert. I found it comfortable. Similar in feeling to a simple flip flop or slipper. The bottom tread was not slippery even on a wet surface. It's definately over priced at $20 should be more like $12-$15. I would not recommend this for women unless you have a wider foot and have trouble wearing regular women's sneakers."
  },
  {
    "user": "JANET B",
    "rating": 4.0,
    "message": "THE PRICE WAS GREAT!!! IT'S LIGHTWEIGHT ALSO"
  },
  {
    "user": "mery",
    "rating": 3.0,
    "message": "They look good. They fit fine. They have no arch support, so after wearing after a couple of hours, they hurt."
  },
  {
    "user": "Jess",
    "rating": 5.0,
    "message": "I hated these when I first put them on, but after a day of use they are much better. For a basic pair of white tennis I would get these over $60+ Keds anyday. Will probably get another pair."
  },
  {
    "user": "Kimberly O.",
    "rating": 5.0,
    "message": "Cheaper than the name brand and wear the same, as well as comfortable.  I’ll have to stretch one shoe but because of a bunionecty scar."
  },
  {
    "user": "Destiny Miles",
    "rating": 3.0,
    "message": "I'm a server and also do quite a bit of walking- was getting sick of breaking nice shoes once every two months, just wanted something cheap that I could get dirty and would get me through 11 hour shifts. These are probably nice if you aren't on your feet much but I have foot and back problems from wearing these after a double and walking 4 miles the next day. They are soooo painful, please don't wear for long trips, shifts, hiking etc."
  },
  {
    "user": "J & J Benes",
    "rating": 5.0,
    "message": "I wanted a cute white tennis shoe to wear with a few outfits This shoe did not disappoint. Fits as usual not  a lot of \"squish\" in the bottom but comfy."
  },
  {
    "user": "AbigailC",
    "rating": 3.0,
    "message": "These shoes looks nice enough and are comfortable for the first hour or so but after that they start hurting your feet. I'll give it some slack because I work at a fast food place and I am constantly on my feet but just a little warning, these are not very good work shoes."
  },
  {
    "user": "Brittney Lee",
    "rating": 5.0,
    "message": "Perfect white shoes at a great price. I wear these to work in an office on days I need white shoes. In order to keep from rubbing on the back you have to ensure your laces are nice and tight. Love this purchase!"
  },
  {
    "user": "talcarey",
    "rating": 3.0,
    "message": "Nothing is wrong with the shoes..but I think it runs small...should of taken a size up"
  },
  {
    "user": "Clark Customer",
    "rating": 4.0,
    "message": "n/a"
  },
  {
    "user": "nanard",
    "rating": 5.0,
    "message": "These sneakers were a life saver!  My baton twirlers needed simple black sneakers for a competition.  They had to be exactly the same. All the girls love them!!  They fit true to size and are comfortable. No blisters!!!  I need to buy a pair for myself now😊"
  },
  {
    "user": "Zak",
    "rating": 5.0,
    "message": "Needed some all black color school uniform shoes and found them nice looking and very comfortable as well. It’s a great choice as school uniform shoes."
  },
  {
    "user": "Wanda Snyder",
    "rating": 5.0,
    "message": "To walk in a balanced way when getting in or out of my wheelchair. These shoes are perfect!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great value and price! I gave it as a gift. Fits as expected 7.5 roomy for socks. No support but she will put one in. She loved the sneakers!"
  },
  {
    "user": "Annie",
    "rating": 5.0,
    "message": "I had to untie the laces for my foot to go inside. I order size 7,5.If you feet are wide order one size bigger.Normally my size of shoes is 7. For sure price is good .Shoes go with everything"
  },
  {
    "user": "Stephani  Schuller",
    "rating": 5.0,
    "message": "I been looking for a pair and couldn't find them any where I was really surprised to find them on Amazon there great"
  },
  {
    "user": "Terra",
    "rating": 5.0,
    "message": "I would highly recommend. I bought for my trip to Paris and they were the perfect walking shoes. I ordered a size 6 and they were true to size."
  },
  {
    "user": "Angela Goldsmith",
    "rating": 3.0,
    "message": "Shoe is too narrow for my feet"
  },
  {
    "user": "Lora C.",
    "rating": 5.0,
    "message": "This shoes is so comfortable and fits my size 12 foot perfectly. I've had a few foot surgeries so I appreciate how comfortable they are. I love the all black look even on the sole. Very happy customer."
  },
  {
    "user": "Alyssa Johnson",
    "rating": 3.0,
    "message": "I can’t have white shoes last longer than a month and these ones came scuffed up already."
  },
  {
    "user": "Andorra C Shek",
    "rating": 3.0,
    "message": "This shoe is cute enough to like, and comfy enough to keep. The heels are a little sharp on the skin, but hopefully that softens up. Not bad enough to stop me from strolling nor make me return them."
  },
  {
    "user": "Katy",
    "rating": 5.0,
    "message": "I love this better than keds. I feel like you don’t have to “wear them in” like you do keds. Will buy again when mine need replacing."
  },
  {
    "user": "Shannon Lukas",
    "rating": 4.0,
    "message": "The shoes fit as expected and are true to size. I would not suggest wearing these for an extended period of time if you plan on actually being on your feet and walking around. These shoes are so flat that if you’re walking around for over 2 hours, your feet are going to kill you. There’s no support what so ever in these. I know that’s just the type of shoe but I had to order these specific ones for work and I wanted to cry every time I had to wear them for an entire shift up on my feet."
  },
  {
    "user": "Christina",
    "rating": 5.0,
    "message": "A little snugg for my normal size but they fit well for a day of walking!"
  },
  {
    "user": "imswennish",
    "rating": 5.0,
    "message": "These are my go to shoes for spring and summer. I get a new pair every spring, and they wear well all year long. Easy care, just pop them in the washer and air dry, no insoles falling out, or any of that. Love these shoes!"
  },
  {
    "user": "Alex",
    "rating": 5.0,
    "message": "Un buen producto"
  },
  {
    "user": "Priscilla Shannon",
    "rating": 5.0,
    "message": "I bought these as a keds dupe because I didn’t want to spend any more than $20. They were surprisingly comfy and fit as expected. I thought after several hours my feet would hurt but I was able to walk all day in them on my first wear. I will be using these regularly."
  },
  {
    "user": "LISHA I",
    "rating": 5.0,
    "message": "I ordered a size 10 but needed a 10 wide. A little tight but it's fine."
  },
  {
    "user": "Toni Quinones",
    "rating": 3.0,
    "message": "They are exactly what I wanted...however the white came in with noticable dirt all over them!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Good price, decent fit, comfortable. I bought multiple pairs because I custom paint them for variety. They look great without the laces also!"
  },
  {
    "user": "Sarah Bull",
    "rating": 5.0,
    "message": "i like both the white pair and black pair sneakers"
  },
  {
    "user": "Cin",
    "rating": 5.0,
    "message": "Very basic white sneaker, really love how light it is and looks good in any outfit, perfect to run errands in."
  },
  {
    "user": "ruth",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Danette Farrell",
    "rating": 3.0,
    "message": "Need to return"
  },
  {
    "user": "Linda H.",
    "rating": 5.0,
    "message": "These canvas sneakers are extremely well made!  They are so comfortable, I wear them most everyday!"
  },
  {
    "user": "Angela Kelly",
    "rating": 3.0,
    "message": "I don’t like that they rub the back of my heel and I’m not happy."
  },
  {
    "user": "Lisa Robinson",
    "rating": 5.0,
    "message": "I wanted a simple but comfortable shoe and these were all I desired."
  },
  {
    "user": "bbop",
    "rating": 2.0,
    "message": "i knew the minute i took them out of their packaging that they were waaaaaay too small. They looked more like a size 5-6.  I ordered an 8 so that they would NOT be \"binding\" to my sensitive feet. Sooooooooo, i tried them on, right? i just wanted to be sure that they were not my \"friends\"....after all, if i can \"live with them\" i'd much rather do so. Here's the verdict.....they are really rigid and stiff, narrow, and too small. They're a waste of money. They would fit a size 5 foot maybe. Even then, they're just too rigid and stiff. NOT comfortable at ALL.  i'm disappointed."
  },
  {
    "user": "Ambur",
    "rating": 5.0,
    "message": "They look great with shorts, capris or jeans."
  },
  {
    "user": "Theresa Joe",
    "rating": 5.0,
    "message": "I purchased this product to wear indoors to a 60s birthday party. I would not wear outside  everyday because I need good supporting gym shoes. I wear skeckers."
  },
  {
    "user": "Trend",
    "rating": 5.0,
    "message": "These have a little arch support and the heel area is padded. There is a cushioned insole about 1/2\" thick from the arch to heel and 1/4\" thick  from toe to arch. It is not removable. The canvas is sturdy and firm.  The toe area of the canvas is reinforced in the inside of the shoes. That gives structure and shape.  These shoes have all around good structure and shape  The stitching is pristine.  The laces are not overly long. The soles are attached to the canvas securely. There is no gaping areas.  The canvas is actually tucked down into the sole.  Note the photos.. There is a thin rubber boarder securing the canvas into the sole. I find they run true to size..medium width.  I bought the white. I like them a lot. Better quality than I expected.  I like them better than my leather shoes that have the same style. These are actually better made....love the price."
  },
  {
    "user": "Alesha",
    "rating": 5.0,
    "message": "I was searching for an all white pair of shoes and I found a great pair."
  },
  {
    "user": "Madeline B.",
    "rating": 3.0,
    "message": "A little too tight around the toes."
  },
  {
    "user": "Chandler C.",
    "rating": 5.0,
    "message": "On my boyfriend's amazon account: I got all Black!! I'm normally a size 9.5 in womans Vans and Airwalks! Everyone said go slightly bigger! Im glad I did I went with a 10 and they are just right with a little wiggle room in the toes but I put them on without socks real quick to try on! They'll be perfect with normal (not thick-thick socks). The shoe is all black and looks more like Keds (little bit more slim than Vans/Airwalks!) Makes my feet look small and dainty!! For the price I'm HIGHLY SATISFIED! These are pretty top notch! Stitching and glue is fabulous (nothing messy or showing- I know the all black pic looks dingy but the shoe is actually really clean and black) is even more perfext than when I get name brand shoes that have messy glue all over and frayed stitching!! I'll be ordering all white next!! These are PERFECT!!! (For some reason there is no option for me to add photos or I would because I ALWAYS look at photo reviews before I make my purchase!)"
  },
  {
    "user": "Gmama",
    "rating": 5.0,
    "message": "I couldn’t find this type of sneaker in my area. Was excited to find on Amazon. They are exactly what I wanted and they fit perfectly and are of good quality."
  },
  {
    "user": "Lois",
    "rating": 2.0,
    "message": "I have to return this pair of shoes, not because they are not lovely or not made well, but because they are not wide enough for my feet."
  },
  {
    "user": "Wanda",
    "rating": 5.0,
    "message": "Runs little big"
  },
  {
    "user": "Lindsey Konchar",
    "rating": 5.0,
    "message": "Perfect for a cute, everyday white sneaker! Fits as expected!"
  },
  {
    "user": "Cindy B.",
    "rating": 5.0,
    "message": "Fit as expected, washed up great!"
  },
  {
    "user": "A.R.M.",
    "rating": 5.0,
    "message": "Everything you would expect for a $20 canvas shoe. Wouldn't compare them to keds but they are great for errands and such."
  },
  {
    "user": "Anne Davis",
    "rating": 5.0,
    "message": "Very comfortable and a great price"
  },
  {
    "user": "lisa giesecke",
    "rating": 4.0,
    "message": "Okay little shoe.  They run small so I gave the original 8.5 that I purchased  to my daughter and ordered a 9 for myself. They seem to be well made and sturdy enough but I will put a insert in the bottom to give a little more support.  They are just what I wanted to slip on for outside and running to the store but I won't be doing any sight seeing or long walks in them. I am kind of a shoe snob and usually spend way more on my shoes and expect them to be comfortable, well made AND stylish. These are worth what I spent on them and fit my intended use."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very good and comestibles so far so great"
  },
  {
    "user": "Tricia Mansourian",
    "rating": 5.0,
    "message": "I like that it fits well"
  },
  {
    "user": "Jared",
    "rating": 5.0,
    "message": "Ot fits well and is light waight."
  },
  {
    "user": "Sammey",
    "rating": 4.0,
    "message": "I would definitely size up at least half a size, possibly 1 whole size if your feet are on the wider side. I generally wear a 9 but sized up to a 9.5 and my toes are almost to the tip (its comfortable though and I'm not crammed in) My feet are done growing so this is no problem for me, but if you're buying these for a child I'd suggest a size bigger as they run a teeny bit small and are a bit narrow. They are canvas so they will stretch, so don't fret too much if you have wide feet."
  },
  {
    "user": "Fred Keller",
    "rating": 2.0,
    "message": "Stiff and uncomfortable"
  },
  {
    "user": "happy shopper",
    "rating": 5.0,
    "message": "she loves how cute they are with her summer attire"
  },
  {
    "user": "Chrissy",
    "rating": 5.0,
    "message": "these were the perfect answer to my daughter needing black sneakers for her dance performance"
  },
  {
    "user": "AnnMay",
    "rating": 4.0,
    "message": "These shoes look like they would be decent quality for the price. They look nice and they arrived quickly and clean. This shoe is just a bit smaller than I can comfortably wear. I ordered a 6.5 which is what I've always been, and my toes are juuusstt barely too jammed into the toe of the shoes. If I were to purchase again, I'd size up a half size. Other than that, no complaints! Not a bad shoe for the price."
  },
  {
    "user": "Ching Ng",
    "rating": 2.0,
    "message": "I wear 7.5 and this shoe fits tight. There is no wiggle room toe area and the  side of the shoe I could feel it rub against my foot.  Is not a true 7.5.  The shoe is made well and I love how it looks on my foot.  I will return it and try size 8 and see if that works."
  },
  {
    "user": "Amanda",
    "rating": 4.0,
    "message": "These are really cute and a much cheaper version of my favorite Van's shoes. Just like the Van's brand, they are cut pretty small. I wear between a 7 1/2 and an 8. I ordered an 8 and my toes are pretty close to the front. These aren't work out shoes or long walk shoes but they're super cute and really well put together for the price."
  },
  {
    "user": "M.Parker",
    "rating": 5.0,
    "message": "Granted these shoes have barely any arch support and I’m a hairdresser and stand all day, but since my feet are already used to that kinda stuff, these shoes are extra comfy and I love wearing them. They fit nicely, despite me having one foot slightly larger than the other so in any shoe I buy I have to make sure they’re a half size bigger so my right foot fits comfortably. They’re cute, and go with most outfits. But again, no arch support, very flat shoe so beware."
  },
  {
    "user": "Jennifer",
    "rating": 2.0,
    "message": "My Keds were more comfortable than this and a pair of Walmart versions were a little better as well. This felt like walking on concrete barefoot."
  },
  {
    "user": "JulieGiorgio",
    "rating": 5.0,
    "message": "Just a nice, comfortable shoe."
  },
  {
    "user": "Molly",
    "rating": 5.0,
    "message": "Be aware that these are old school canvas shoes. They have a *very* thin layer of foam (unlike Converse), but in general they have very little to no support. That said, if you need a flat shoe to deadlift, have high arches and don’t like padding, or both— this is a great choice for the price! It was exactly what I expected it to be: a reasonably well-made, no-frills canvas shoe. Since I use them to lift, I’m sure this will not be my last pair."
  },
  {
    "user": "Flaka25",
    "rating": 5.0,
    "message": "Happy with my purchase"
  },
  {
    "user": "Genie",
    "rating": 4.0,
    "message": "But size bigger than what you wear!! The shoes are made well and look as pictured. I saw many reviews saying that the shoes run small. I usually wear a 7.5 so I got a size 8. Although they do fit, it’s just a tad snug."
  },
  {
    "user": "Adrian",
    "rating": 1.0,
    "message": "I got these shoes for work; I am standing and walking constantly. These shoes immediately gave me blisters because they rubbed against my feet and after weeks, I still have a scab from the blister. These shoes are very uncomfortable. They are also cheaply made and not good quality. It was suggested that I get a half size up, so I did, but I would’ve been totally fine with my normal size. I do not recommend buying these."
  },
  {
    "user": "Alysha Neese",
    "rating": 4.0,
    "message": "The shoe itself it made pretty well but the sole seams to be a bit flat.... It kind of feels like I'm not wearing shoes sometimes.... The sole is pretty thin but they aren't bad shoes."
  }
]