[
  {
    "user": "Roberto Juárez",
    "rating": 5.0,
    "message": "Sumamente encantado porque son los zapatos que yo esperaba original y de muy buena calidad"
  },
  {
    "user": "julio",
    "rating": 5.0,
    "message": "Like the suede black carbon classic style"
  },
  {
    "user": "Vinnie D",
    "rating": 5.0,
    "message": "Been wearing this style sneaker for 25 years. I live them"
  },
  {
    "user": "Lewis ngate",
    "rating": 5.0,
    "message": "A hidden gem when it comes to timeless style"
  },
  {
    "user": "EL GORDITO",
    "rating": 5.0,
    "message": "muy recomendable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "Gregory Fite",
    "rating": 4.0,
    "message": "What I wanted"
  },
  {
    "user": "Randolfo Neira",
    "rating": 5.0,
    "message": "Cómodo"
  },
  {
    "user": "Rams",
    "rating": 4.0,
    "message": "Feels tide, get size bigger"
  },
  {
    "user": "Scott",
    "rating": 4.0,
    "message": "Picked out what I wanted and got exactly that."
  },
  {
    "user": "cindy",
    "rating": 5.0,
    "message": "I bought this shoes for my husband .He loves them comfortable shoe light weight"
  },
  {
    "user": "YISSEL SURIEL",
    "rating": 5.0,
    "message": "A mí esposa le encantaron demasiado cómodo buen precio buena calidad lo recomiendo 100% desde hoy soy fanático a los tennis Reebok"
  },
  {
    "user": "Nthdegree63",
    "rating": 5.0,
    "message": "My husband wears these shoes 12+ hours a day, seven days a week. I think this is his 4th pair in 15 years. They wear well, fit exact to size, and are very comfortable."
  },
  {
    "user": "ashleigh voight",
    "rating": 4.0,
    "message": "Fits as described. Good quality"
  },
  {
    "user": "Stavro",
    "rating": 5.0,
    "message": "These shoes were good for my daily activities like running, walking, or going to the gym, and they are very comfortable."
  },
  {
    "user": "Mark Olson",
    "rating": 5.0,
    "message": "Needs a little break in time but than Fits great"
  },
  {
    "user": "GARY",
    "rating": 5.0,
    "message": "Nike prices are so high now so I decided to get these to save money"
  },
  {
    "user": "Jennifer Mejia",
    "rating": 5.0,
    "message": "Love this sneakers so much I may buy three more pairs....with different matching colors... Reebok classics are truly one of a kind"
  },
  {
    "user": "Juan Lopez",
    "rating": 5.0,
    "message": "I love this product , just like the ones from back in the day in the 1996 just love them thank you."
  },
  {
    "user": "Cody Patino",
    "rating": 5.0,
    "message": "I like them. Comfortable and easy to slip on."
  },
  {
    "user": "Diana L Collins",
    "rating": 5.0,
    "message": "My husband really likes these shoes.  He has been purchasing these for a very long time."
  },
  {
    "user": "VH",
    "rating": 5.0,
    "message": "I usually wear a 11.5 in a men's shoe but this one was really tight on my foot so I am returning the shoe. But other than that the shoe was as described and arrived on time."
  },
  {
    "user": "JM Haces",
    "rating": 5.0,
    "message": "About a decade ago, fed up with modern sneaker styles that were not only horrible to my aesthetic sensibilities, but also absurdly expensive, I was at a loss about what to do. I kept buying Sketchers or New Balance sneakers but every trip to the shoe store was like a scavenger hunt, trying to find a model that didn't look horrible to me. Then, on a visit to sports retailer Academy, I ran into these. Since I'd had them when I was a kid and they were about $25 I decided to buy a pair. It was love at first walk. They are comfortable, breathe pretty well and you can even stick them on the washing machine when they get too grungy. Since they're mostly made out of nylon, they dry pretty quick. I've owned the black/white, black/black and grey/white models and all are great. When they wore out I bought a new pair and kept doing it through the years. Eventually the price went up to $29 and then, to my dismay, I could no longer find them at Academy. I asked the dude working there and he said they were discontinued. Don't know if that's true, but I found them on Amazon and I've been buying them ever since. Often several pairs at a time to have a couple of pairs on stand-by in case they do stop making them. The price has slowly climbed from $29 to $35 and now to around $40, so it's no longer a steal, though compared with most $100+ shoes, still a bargain."
  },
  {
    "user": "Joel",
    "rating": 5.0,
    "message": "Comfort"
  },
  {
    "user": "Lisa Thomas",
    "rating": 5.0,
    "message": "Great shoe"
  },
  {
    "user": "Evelyn bLush",
    "rating": 5.0,
    "message": "I love my shoes i'm a size 6-6.5 or 7 in mens. I ordered 6.5, I did feel they were a little just a tiny bit tight but im gonna break them in for sure! The only thing I saw was that little defect on the ridges running along the outer side of the shoe. but other than that id say they're pretty legit. People you need to know that the exposed foam is a part of the design even nike has done this lol stop saying its not well done. at the end of the day you're purchasing from amazon if you wanted you could have ordered from all these websites; (flightclub.com. stadiumgoods.com. rif.la. solesupremacy.com. projectblitz.com. indexpdx.com. stockx.com. goat.com. reebok ) collectors main sites and pay double the price. I would recommend except unless youre an Avid sneakerhead collector."
  },
  {
    "user": "Richard Torres Jr",
    "rating": 5.0,
    "message": "I'm so happy I found them. I'm going to order more to make sure I have them"
  },
  {
    "user": "Jason Grimm",
    "rating": 5.0,
    "message": "Everything was great I buy this type of shoe and get the same size every time,.. I received an 11.5 not my usual 6.5 . The return was easy but y’all busted my Xmas thanks,.."
  },
  {
    "user": "Chris Edwards",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Me and my bf loved them we went to a NFL game and knew we would be doing alot of walking they were comfortable and gave much support for the all the standing and walking we did"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Casual"
  },
  {
    "user": "Camila Calvin",
    "rating": 5.0,
    "message": "Very happy with this purchase. Can’t find these specific shoes anywhere else and I’m glad I found them here!"
  },
  {
    "user": "Scott K. Speece",
    "rating": 5.0,
    "message": "Bought this pair to wear around the house and take the dogs for a walk.  Previously had these sneakers and loved them.  Wore them so much that they finally went to the Great Sneaker Heaven."
  },
  {
    "user": "Lendl",
    "rating": 5.0,
    "message": "Got it at sale price and couldn’t be happier. Quality was what I expected. Fit was perfect and true to size. Would buy again with another color (looking at you black and white). P.S Tongue’s designed this way and not a flaw as what others say."
  },
  {
    "user": "Ric",
    "rating": 5.0,
    "message": "Great shoes really happy with them, as advertised. Will be ordering more! Thank you!"
  },
  {
    "user": "Kurt",
    "rating": 3.0,
    "message": "My rating is only based on the shoe overall, not that the shoes looked like they had been worn when I received them. I still tried on the shoe, however to see if I wanted to replace it. The toe box of this shoe is very narrow. In comparing with some other retro sneakers, the overall fit is similar to my NB 515s (which are rarely, if ever worn due to comfort for my foot). The only other knock I have on this shoe is the heel and height of the Achilles portion. It feels like my foot would frequently slip out if I wore these."
  },
  {
    "user": "jackie perry",
    "rating": 4.0,
    "message": "Says they don’t feel like they even on his feet"
  },
  {
    "user": "framthisheart",
    "rating": 4.0,
    "message": "These are real. Idk what the other reviewers are speaking of saying that these could’ve fakes because you can see with your bare eyes that these shoes are authentic!  I absolutely love; only they run really tight. I’m assuming because it has sort of a platform style shoe that takes away some of the space inside. Unless u have super narrow and smaller feet or have already worn Reebok shoes, order at least one size bigger."
  },
  {
    "user": "L. Simkhovich",
    "rating": 5.0,
    "message": "I bought them for the second time. Good shoes"
  },
  {
    "user": "Eugene Campbell",
    "rating": 4.0,
    "message": "Too small"
  },
  {
    "user": "Javier Zavala",
    "rating": 5.0,
    "message": "I love Reebok company."
  },
  {
    "user": "Jimmy M.",
    "rating": 5.0,
    "message": "I use this product everyday use I recommend it to a friend"
  },
  {
    "user": "G",
    "rating": 4.0,
    "message": "I've been wearing Reebok Classic sneakers for ~10 years now.  When one pair wears out, I replace with another of the same.  They fit me well for casual use.  I wouldn't go hiking or play sports in them, but I can walk in them for several miles and feel fine.  They have a classic look, and their price continues to hold steady at ~$40.  I am very pleased with Reebok for continuing to make this classic sneaker with little to no changes.  My last pair wore out surprisingly quickly in the heel interior, but that's been my only real complaint I've had with any pair of these shoes. If you're particular, be aware that there are multiple slightly different \"Reebok Classic\" sneakers.  For my purposes, they're all about the same."
  },
  {
    "user": "LryD.Kitcns",
    "rating": 5.0,
    "message": "I like all qualities of the shoes."
  },
  {
    "user": "samrdbr",
    "rating": 4.0,
    "message": "As everyone else said, the shoe is a bit tight, but the good thing about it is you don't have to tie your laces. It's looks quite nice and I've had it for a while now. The cloth part of the tip's color gets a bit faded after a while since it's in the sun (which I love, it gets a really nice look, almost three different colors). The white part of the sole of the shoe is difficult to clean but stays clean for a long time, too. It's a very stiff shoe and it'll take a while to break it in. The only bad thing for me is that sometimes it looks too chunky, but that's just personal, there is nothing wrong with the shoe itself. Would recommend it."
  },
  {
    "user": "merc",
    "rating": 5.0,
    "message": "The Reebok Classic is...well, Classic.  I've been wearing them for years, both for everyday use and occasional running, and they have never let me down.  In my experience their durability is as good as can be expected in a sneaker-- they are not, after all, USGI army boots-- and the fit is predictably comfortable.  As for the style, this is of course a matter of taste.  As a Baby Boomer I love the fact that these look like the running shoes of my youth, as opposed to the sculpted swoopy techno dayglo bizarro shoes one sees today.  Okay, that was judgmental, but this is an opinion piece, right?  Hipsters may love the Converse All-Stars that we also wore back in The Day, but let them try these on.  One day in these retro runners and they'll quickly know why, back in the 70s, we all ditched our Chucks for running shoes!"
  },
  {
    "user": "Joann",
    "rating": 3.0,
    "message": "Nice, just to small. I do not like the 30 day return. I order on line because of my limitations. I try to take it back friday, February 7. I was told that they could not take it back because time has expired. I feel that more time should be allowed. Now I have a pair of snickers that my brother can't fit. This is so unfair because I bought another pair that he fits. So now I'm out nearly Thirty dollars. I take care of my brother who is on disability as well as myself. When I finally got to the store the clerk told me that I could have had it picked up. I didn't know that. Please consider my request for an extended return date so I'm able to get my refund. Thank you. Joann Tomlin."
  },
  {
    "user": "A Reader",
    "rating": 4.0,
    "message": "I've been wearing these Reebok nylon classics for quite a while ( this is probably my third pair ) and they are a good every day kick around shoe. They fit as expected and have a generous toe box. I've never had a pair tear or wear out, I usually replace them only because they've gotten old and I've trashed them in the dirt. I would normally give this shoe a five star rating but this new pair has a white smudge, probably a manufacturing defect, so I have to consider that. Overall a good every day shoe that looks great with jeans."
  },
  {
    "user": "elhigh",
    "rating": 5.0,
    "message": "I have been wearing this model of Reebok since the 1980s.  The model number has changed a couple of times but I've always been able to track it across the model range and find the right shoe again.  A couple of times there were even notations pointing out that this one used to be called that one, etc. Some people are complaining that the quality has gone down since the manufacturing base for the shoe has changed; I haven't detected any change in quality and since I have literally been wearing this model of shoe for DECADES - not exagerrating at all, I first bought these in 1985 - I think those complainants are railing against foreign manufacturing rather than the shoe's actual quality.  Get over yourselves, people.  If you want domestically made shoes, they're out there.  Go buy those instead."
  },
  {
    "user": "Reynaldo Tijerina",
    "rating": 5.0,
    "message": "Absolutely love Reebok. These are the most comfortable shoes ever"
  },
  {
    "user": "Wes",
    "rating": 3.0,
    "message": "I bought these after having a difficult time finding Reeboks at any brick-and-mortar retailer. I understand the company has been going through some changes recently, but I didn't think their shoes would be so hard to find. I used to wear Reeboks when I was younger and wanted a changeup from Adidas and Nike, the latter of which has dropped significantly in quality. My last two pairs of Nikes have fallen apart after just a few months of normal non-athletic use. I like these classic nylons for the most part. They're comfortable and fit true to size. Fabric and sole quality seem to be up to par. The only thing I dislike is a cosmetic feature. The nylon part on the top of the toe area is much shinier than it appears in the listing photos. It's more like a glossy metallic gray, which gives the shoes a somewhat tacky appearance, but it's not intolerable. I'm not sure if different colors of the same style have the same problem, but I would hope not."
  },
  {
    "user": "Tiffany",
    "rating": 5.0,
    "message": "I'm a 5 in ladies and ordered this mens 3.....perfect fit......vibrant color......and were only 20bucks.......5stars on every aspect!!!!!!"
  },
  {
    "user": "Greyestfox",
    "rating": 4.0,
    "message": "I work in a warehouse and am on my feet walking on concrete for 10 hours a day. Needless to say, at the end of the day my legs and feet are worn out. I started the job in November 2011 wearing a pair of these that I had bought in 2005. After ten months and approximately 2000 miles of wear, the soles finally started peeling off the old shoes. After going through painful days trying other sneakers, I decided to search for another pair of these. They were at a great price, they fit just the same and I'm very happy with them. I have wider feet (due to having an extra metatarsus bone in each foot) and find these fit well. Overall, these shoes have endured torture testing at work and I'm very satisfied with them."
  },
  {
    "user": "Elijah",
    "rating": 5.0,
    "message": "The nylon upper on these Reeboks means the shoe stretches where I need it to. Always a perfect fit."
  },
  {
    "user": "Bob S.",
    "rating": 5.0,
    "message": "I have always liked Reebok shoes.  They fit me better than other athletic shoe brands and are very durable.  These shoes are no exception.  Very comfortable right out of the box, light weight and attractive too.  I find their nylon and leather shoes to be their best value."
  },
  {
    "user": "Brittney Nash",
    "rating": 5.0,
    "message": "My husband absolutely loved them! They’re perfect!"
  },
  {
    "user": "Jeremy A. Logan",
    "rating": 3.0,
    "message": "I've worn Reeboks on and off for 20+ years. I got these cause they looked to be nearly identical to some I had ~ 15 years ago that I loved. They were tight in the toe box (but fine everywhere else) when they came in, but I figured they'd break in some... over a year later, they haven't.  They're fine for a trip to the store, or similar, but if I wear them around town for a day I'm guaranteed to get blisters. Otherwise, I like the look of them and the quality seems to be about what you'd expect (a year later and they're still fine)."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "fits great there amazing workout shoes the only problem I had was the box they came in was destroyed like sopping wet all ripped up  but somehow the shoes were safe so I'm satisfied"
  },
  {
    "user": "Andrew Jepsen",
    "rating": 3.0,
    "message": "I have another pair i love!! I work at an animal hospital and need comfy shoes and these are great so i bought this pair...when i put them on o noticed they seem unfinished and I’m not sure how to contact seller to discuss this!!!"
  },
  {
    "user": "Enrique A.",
    "rating": 5.0,
    "message": "recommend for flat foot people. Good shoe for cost."
  },
  {
    "user": "DerkaDerk",
    "rating": 5.0,
    "message": "These kicks are exceptional. As soon as they hit my feet, I realized how top-notch they truly are. The aesthetics, style and color design are absolutely on point. It is said that after the face, the majority of humans will look at someone's feet/shoes, second. So look fresh, clean, and drip a little sWAg too with this sauce on your feet."
  },
  {
    "user": "Lizzy Lou",
    "rating": 5.0,
    "message": "I’m a lady who buys dude tennis kicks because sometimes (a lot of times) size 11 in Women’s runs small. They’re pretty unisex and also, who cares what shoes anyone wears - amiright! I wear these running around town, short trail walks, and traveling and have found them to be so squish and nice to my feet. Do yourself a fave and get you a pair!"
  },
  {
    "user": "Bernardo Reyes",
    "rating": 4.0,
    "message": "A mi hijo le gustaron, lo único que me gustaría,es que al momento de fabricarlo le cubran la corcha de la suela."
  },
  {
    "user": "Pickle jUCE",
    "rating": 5.0,
    "message": "The most comfortable shoe ever. I'm glad I found them for cheap on amazon. I still wear them to this day and I've had them for over 3 years now. They're definitely one of those shoes that you'd wear until they're falling apart. Sometimes it's hard for me to shoe shop because (1) I sometimes fit in a size 12 and other times in a size 13 and (2) I have wide flat feet, so these shoes fit both of those criterias and felt great once broken in. If I could, I'd wear a new pair everyday. If you don't have a pair and you're reading this review, then you need to order you a pair."
  },
  {
    "user": "Billy",
    "rating": 5.0,
    "message": "I read some reviews saying I should get a half size bigger, some that said order my size. In my case, ordering the correct size was the way to go. These shoes look and feel great! They feel exactly as I remembered from back in the day. I used to buy these regularly in a local store until they stopped selling them. I was forced to experiment with others. And was never really satisfied. I was so glad to find these available again, online! They are just so light and comfortable. Will order another pair soon!"
  },
  {
    "user": "Ryan K.",
    "rating": 5.0,
    "message": "Really dig the orange color and the comfort is great. Only complaint is the toe box is prone to creasing so be aware if you buy these. Overall I love reebok shoes (I have 2 pairs of Iversons as well) and these are a great addition to my rotation."
  },
  {
    "user": "Msuhr12",
    "rating": 5.0,
    "message": "Great shoes. It came with white and black shoe laces so you can decide which one you want to use. Very comfy as well."
  },
  {
    "user": "Elton T.",
    "rating": 5.0,
    "message": "I've seriously owned at least five or six of the same pair of shoes. They are very comfortable, they look slick, and they serve their purpose as running shoes. I'd recommend these shoes to anyone that likes the way they look and enjoy a smug fit (not tight). Also, the seller here was awesome. I got my shoes in two days. Amazon Prime free two day shipping RULES! I'd highly recommend buying from this site, especially when you know what you're looking for and want a good price. I bought this same pair of shoes about 2 - 4 years ago for $10 more, and, while I don't mind paying a bit more for the quality and comfort I am so familiar with, I'm still kicking myself for not finding these shoes on amazon."
  },
  {
    "user": "Ra1nM@N",
    "rating": 5.0,
    "message": "These Reebok classics lived up to my very lofty expectations of them all facets. The fit, style, durability, & comfort have always been top-notch, making them my favorite shoe of all time, & this pair ordered from Amazon is no exception. At ~$45 USD they were reasonably priced, especially for a shoe that lasts at least 2 years (w/ near exeruday wear) & retains that \"new shoe\" look for MUCH longer than any of my other shoes, including those that are much more expensive. Also LOVE that they include both Black & white laces in the box, & as always shipping was very prompt."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Product came on time and mostly as expected, they came with both navy and white laces, the white laces came with a couple dirt spots already on them. Not the biggest deal considering I will inevitably get them dirty on my own but still would have been nice to have them pure white for a bit. The shoes fit well and I like the look. The overall quality is what you would typically expect from Reebok, however the clothe topping of the insole has already separated from the insole, and bunches up under my foot. It’s not a huge deal cause I can always just pull it out but it’s somewhat annoying considering I’ve only been wearing them 2 weeks. If I bought a classic sneaker again, I’d still consider these."
  },
  {
    "user": "Michael Consuegra",
    "rating": 5.0,
    "message": "The fit is perfect. Exactly as I expected it. I would purchase these sneakers again."
  },
  {
    "user": "David Torres",
    "rating": 5.0,
    "message": "Good shoes ."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Talla perfecta, quedaron bien al pie."
  },
  {
    "user": "AprilDee",
    "rating": 5.0,
    "message": "90's me would totally be jealous of these bad boys. They are stylish as hay-ell, and even more comfortable. True to size and are of standard reebok quality. I'm gonna buy a few different colors before they go out of style again."
  },
  {
    "user": "Kelly T",
    "rating": 5.0,
    "message": "I've bought these for my husband 3 times now.  He loves these shoes.  He works in a plant, on his feet all day every day, so having a comfortable shoe that can withstand high level wear is essential. He always has a pair that he wears to work, and a pair that he wears out and about. My husband is in his early 30s so for him, this shoe is a nice \"throw-back\" classic shoe that he often gets complements on. Since wearing these shoes to work, he experiences less foot pain.  Working on a concrete floor all day is still very rough on the feet and back so we will eventually get him some orthopedic inserts. But until then, these shoes are great for him."
  },
  {
    "user": "Steve B.",
    "rating": 5.0,
    "message": "This is the classic, which fits like the classic and feels pretty good.  The fit is true, and the quality is Reebok - worthy of the title, \"Classic\" in every way.  So glad to have these!  Several miles of concentrated walking most days, and I'm a moderately heavy heel striker - and it works and works and works . . .  (FWIW, I'm a 9.5 in Clarks and Nunn Bush, and I get a 10 here.  Covers a light insert and the crew socks.)"
  },
  {
    "user": "Maris M.",
    "rating": 5.0,
    "message": "Don't pay attention to all the reviews that these are fake because of the unfinished tongue. Ypu can go directly to the Reebok site and it clearly states this style has an unfinished tongue \"for a distressed look\". They are real, cheap, come super fast, and fit great. Got my son a pair for 20 bucks. Can't beat that."
  },
  {
    "user": "Matthew Johann",
    "rating": 5.0,
    "message": "These were a perfect addition for going out but keeping it casual"
  },
  {
    "user": "David Thornton",
    "rating": 5.0,
    "message": "Good shoe for the money very comfortable"
  },
  {
    "user": "Paul Stacker",
    "rating": 2.0,
    "message": "These shoes were so narrow that even a size larger didn’t fit. I wear a 9 1/2 W. I purchased a 10 1/2 just like my 4 yr old pair ( not wide). Look at the difference in my photo. Both pairs viewed are the same style and size. Look how narrow! Returned. Maybe new balance?"
  },
  {
    "user": "Noel Moore",
    "rating": 4.0,
    "message": "Every day wear"
  },
  {
    "user": "Angel Term",
    "rating": 5.0,
    "message": "Fit comfortable"
  },
  {
    "user": "Riley",
    "rating": 5.0,
    "message": "Ordered them Friday got them Monday. They look good and feel good. I'm not a shoe expert so if they are knockoffs like the other comments say, they are really good ones. Fit as expected, I ordered 12.5 and normally get a 12.5 to 13."
  },
  {
    "user": "Wilfer",
    "rating": 5.0,
    "message": "ohh I love this Shoes,  very comfort, soft..  and the price  is perfect....  This  brand  it's my favorite...  Thanks..."
  },
  {
    "user": "Robert Daryl Miller",
    "rating": 5.0,
    "message": "I wear a shoe size 15, which can be a problem if you like cool, comfy shoes. Reebock and New Balance seem to have the best choices for me as I prefer the old school / classic / retro styling. Highly recommended; will definitely purchase again."
  },
  {
    "user": "Mooseville",
    "rating": 4.0,
    "message": "I have been wearing this style of Reeboks forever.  They are light but supportive and very comfortable.  That's all that matters to me, yet it's not always easy to find that functionality in shoes when style rules the day.  I went into a Reebok outlet store recently and its obvious that the company has no tolerance for honoring this classic any more.  So Amazon was my last hope.  It worked out well.  They were a bit tight but they have been loosening up and are satisfactory.  I'm thinking that maybe I should have bought extras in case these really are impossible to obtain in the near future.  It's a consideration."
  },
  {
    "user": "William Suchecki",
    "rating": 5.0,
    "message": "I found this sneaker years ago where I live. I need a larger size (14) which is very hard to find. I usually had to end up wearing a size 13. I could not find them in my area anymore, but was able to find them on Amazon. I have since bought several pairs  of these over the years. As long as Amazon keeps stocking them, I'll keep buying them. I'm on my feet all day, so I need a shoe that's comfortable. A lot of the shoe is made out of nylon which I feel keeps my feet from sweating. The only disadvantage is rain or puddles, the nylon makes it easy for the water to soak through, but I still think it's a great sneaker. I think it's a great quality sneaker, they wear very well."
  },
  {
    "user": "Ralph P",
    "rating": 3.0,
    "message": "I already had a pair these shoes and wanted a newer pair. Sole is a single piece of foam rubber. Top fairly nice and comfortable. 60  plus bucks for 15 dollar sneaks is a bit much but they are comfortable. I wouldn’t run in them."
  },
  {
    "user": "LoRye",
    "rating": 5.0,
    "message": "Came as a set, which I appreciated. I didn’t have to purchase the left shoe separately, and run the risk of getting mix-matched size and or color. Also,  I can now run faster and jump higher, totally exceeded my expectations."
  },
  {
    "user": "Bruce Crenshaw",
    "rating": 5.0,
    "message": "The sneakers are very comfortable, and stylish."
  },
  {
    "user": "Trudy Ma",
    "rating": 5.0,
    "message": "The running shoe is at a great price and of high quality. Definitely worth the money. We would highly recommended it. We probably will buy another pair for replacement very soon."
  },
  {
    "user": "William Hendricks",
    "rating": 5.0,
    "message": "fast service and hey they are reebok's"
  },
  {
    "user": "The Machine",
    "rating": 1.0,
    "message": "Didn't last as expected, a hole got made on the front part of left sneaker with less than a year of use, not worth the price."
  },
  {
    "user": "M. Hadley",
    "rating": 5.0,
    "message": "I basically wore nothing but these shoes, when they were made by Adidas, back in the 1970's/early 80's. The fit and quality was great and you could really move in them. Of course, after they stopped making them and my last pair wore out I was out of luck.  I've had many other types of running/athletic shoes since, but always wished I could find some forgotten stash of that old Adidas model again.  When I saw these shoes I was pretty surprised and hopeful, but when I found out Adidas owned Reebok I got excited!  I have 3 pair now and I'm completely satisfied with them.  Same fit and feel, with the added bonus of remembering good times from the past each time I wear them.  If you remember these and liked them back then, do yourself a favor and get a pair.  You won't be disappointed."
  },
  {
    "user": "Javier",
    "rating": 5.0,
    "message": "These shoes are comfy all around, already bought myself another pair."
  },
  {
    "user": "Osvaldo Vargas",
    "rating": 5.0,
    "message": "Great shoes! fit perfectly and last forever."
  },
  {
    "user": "ainley schofield",
    "rating": 5.0,
    "message": "I've literally bought the same shoe eight times and as each pair start to fail i just rotate them to the next chapter like mowing the lawn and they fit my size 13 foot perfectly and will continue to buy these until they don't make them no more."
  },
  {
    "user": "J Lar",
    "rating": 5.0,
    "message": "These are such a pretty color and surprisingly stay very clean! Street dirt just doesn't seem to stick to them. They still look new even though I wear them almost daily. Very good quality shoe."
  },
  {
    "user": "Ya boii larry",
    "rating": 5.0,
    "message": "I've worn these around for 2 weeks now and can definitely tell theyre not falling apart soon. Considering that I payed like $40 for mine i think these are a hella good deal."
  },
  {
    "user": "JoJo",
    "rating": 5.0,
    "message": "My son loves them. Talks about how comfortable they are."
  }
]