[
  {
    "user": "Tracy L",
    "rating": 5.0,
    "message": "These are the most comfortable tennis shoes I have owned. They go with every outfit! Bought another pair I love them so much!!"
  },
  {
    "user": "Allison",
    "rating": 5.0,
    "message": "Just as pictured"
  },
  {
    "user": "Margaret",
    "rating": 4.0,
    "message": "I always get a 7 in tennis shoes but these run small I needed a 7.5 to have any toe room. They do not stretch at all. Bottoms are slippery on wet surfaces and certain flooring."
  },
  {
    "user": "Baylee Phillips",
    "rating": 5.0,
    "message": "The colors are perfect and fit great!"
  },
  {
    "user": "Kristina",
    "rating": 4.0,
    "message": "Super cute. The color is def not the blush color shown in pics. It’s more beige or gray but they are still really cute and match everything. Also definitely a knock off Steve Madden as other reviewers have said that’s why I took 1 star away.. But I’m not a label snob so I’ll happily wear them!"
  },
  {
    "user": "Zaley G",
    "rating": 5.0,
    "message": "Very cute sneaker, size up! If you have a wide foot."
  },
  {
    "user": "Beth R.",
    "rating": 5.0,
    "message": "Love them"
  },
  {
    "user": "Jasmine",
    "rating": 4.0,
    "message": "So I ordered the “white multi” and I am just now realizing they sent me a completely different shoe. I thought they looked a little different but figured I was being dramatic but nope they gave me the wrong shoe BUT they’re so cute and comfy def ordering another pair!"
  },
  {
    "user": "Amber B.",
    "rating": 5.0,
    "message": "Super cute and very comfy!"
  },
  {
    "user": "Natalee",
    "rating": 4.0,
    "message": "Loved everything but they were way too small"
  },
  {
    "user": "Jaden",
    "rating": 5.0,
    "message": "These shoes are super cute and for a good value of money. Much better than spending over $100 for a similar pair. I love these shoes and going to be wearing them a lot to school this fall!!"
  },
  {
    "user": "Susan",
    "rating": 3.0,
    "message": "These run very small so size up. So darn cute!"
  },
  {
    "user": "Amy Trimble",
    "rating": 4.0,
    "message": "Comfy shoe. Just as pictured. Shoe is a bit clunkier than I had thought but still cute."
  },
  {
    "user": "Michelle D'Olimpio",
    "rating": 4.0,
    "message": "Shoes were cute but they run small."
  },
  {
    "user": "adfritts",
    "rating": 4.0,
    "message": "About 1/2 size too small. But love them. Super cute."
  },
  {
    "user": "kd",
    "rating": 3.0,
    "message": "The shoe is tan, not pink hue at all. I believe it’s supposed to be rose colored. Still cute tho."
  },
  {
    "user": "Jon Panish",
    "rating": 3.0,
    "message": "Good value"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These are absolutely adorable. I ordered my usual size (7.5) and they are a bit tight across the toes. I have found that if I wear socks with no toe seams, they are much more comfortable. I figure the more I wear them, they will stretch out. Love them otherwise."
  },
  {
    "user": "Ranaeda",
    "rating": 4.0,
    "message": "These are cute, but they take a while to break in. The tab on the top of the toe put so much pressure on my ankles I had bruises the first time I wore them. After a couple wears though they are comfortable enough to wear all day. I wouldn't shop in them or walk in them all day though. The inside of the tow is also a black material that transfers to white socks, FYI."
  },
  {
    "user": "Alexa Stone",
    "rating": 5.0,
    "message": "These shoes are so cute!! Love wearing them with summer dresses! So cute and comfy!"
  },
  {
    "user": "K. R.",
    "rating": 3.0,
    "message": "I was so excited to get these shoes only until I opened the box and seen blue ink marks all around the shoes.. not happy.. would have loved to try to reorder but in addition to just being ruined they run small so I tried to size up but no longer available.. so very disappointed..... a few days later was able to find another seller.. the new pair are perfect and look absolutely great with everything.. would be  5 stars I'd not for the first inked up pair"
  },
  {
    "user": "Jesica",
    "rating": 4.0,
    "message": "Super comfy and cute but it did take awhile to break them in Bc of the leather black piece on the front it would rub"
  },
  {
    "user": "Rosita L.",
    "rating": 3.0,
    "message": "They are really pretty sneakers but very uncomfortable for me. Sorry."
  },
  {
    "user": "S Thompson",
    "rating": 3.0,
    "message": "They are a little tight on my foot due to the leather but I’m trying to stretch it out by wearing. Noticed some paint or something peeling off part of the rubber lining around the bottom, haven’t worn them but twice."
  },
  {
    "user": "Lisette Ponce",
    "rating": 4.0,
    "message": "The shoes are cute, but they run a bit small."
  },
  {
    "user": "Ali",
    "rating": 5.0,
    "message": "Love these,comfy and go with everything!"
  },
  {
    "user": "Randi Schram",
    "rating": 5.0,
    "message": "Love the shoes!! Fits well enough to keep but if i were to order another pair I’d size up to 7 i ordered 6.5. I’m usually 6-6.5"
  },
  {
    "user": "Logan Woodyard",
    "rating": 4.0,
    "message": "Love these sneakers and fits as expected (size 8). The sneaker is pretty stiff and heavy. I can dress them up or down which I love. The only thing is that the tab of the sneaker tends to fall to the outer side of my foot and can rub a blister so I have to tie it really tight."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Fit very true to size, love them.  Great Quality."
  },
  {
    "user": "Savannah H.",
    "rating": 4.0,
    "message": "Super cute shoes but very uncomfortable!"
  },
  {
    "user": "Amy",
    "rating": 5.0,
    "message": "Such cute shoes and people mistaken them for golden goose. Wish I could have got them in black too"
  },
  {
    "user": "Connie Wilson",
    "rating": 4.0,
    "message": "Run small I’m an 8 needed a 9"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "I like the shoes a lot but they arrived with black marks all over them :("
  },
  {
    "user": "Rachel",
    "rating": 5.0,
    "message": "Love these shoes! I needed a new sneaker to go with anything! The white and neutral brown is perfect."
  },
  {
    "user": "Amy M",
    "rating": 4.0,
    "message": "I would have given a 5 stars if not for the sizing. These shoes look killer in person, LOVE them. I usually wear a 7.5-8 depending on the shoe. I went with a 7.5 with these after reading reviews. They are definitely snug, even tight. I'm not going to return them though in hopes they will just stretch out a little bit, which I think they will."
  },
  {
    "user": "chelsey",
    "rating": 5.0,
    "message": "These fit very well. They are a lightly uncomfortable but once you break them in like any shoe they fit well. Super cute!"
  },
  {
    "user": "Jennifer Liles",
    "rating": 5.0,
    "message": "Cute, stylish and comfortable. I have 2 pair!"
  },
  {
    "user": "Kristin Bean",
    "rating": 5.0,
    "message": "I love the style and fit of these!!"
  },
  {
    "user": "Tracy",
    "rating": 3.0,
    "message": "Very uncomfortable for ppl with high instep feet"
  },
  {
    "user": "tatum aigner",
    "rating": 4.0,
    "message": "They are super cute! But, I usually wear a 7.5 or 8 and I ordered a size 8 in these. It was a little bit small, but after I removed the sole it worked. I would recommend going a size up, though."
  },
  {
    "user": "madi duran",
    "rating": 3.0,
    "message": "Shoe doesn’t have much give, so can be a little difficult to get on. Blisters on pinky toes after an hour or so. Came in already damaged/yellowed. Cute though."
  },
  {
    "user": "Erin Heilman",
    "rating": 3.0,
    "message": "Break these in before wearing for an extended period. They arrived brand spanking new and super stiff but exactly as pictured! Once broken in, they’re perfect for extended use!"
  },
  {
    "user": "LRK",
    "rating": 5.0,
    "message": "Comfortable and cute!"
  },
  {
    "user": "ReAnna",
    "rating": 3.0,
    "message": "Super cute great quality. Size up!"
  },
  {
    "user": "K. Orr",
    "rating": 1.0,
    "message": "These shoes run SUPER small- no one else mentions this in their reviews but I wear a 7.5 in ever brand of shoe I have bought in the last 15 years and I can barely get these on my feet with a thin sock on. Super sad now :-("
  },
  {
    "user": "Christine",
    "rating": 5.0,
    "message": "True to size and very comfy"
  },
  {
    "user": "Adreiana Longnecker",
    "rating": 4.0,
    "message": "Love them, but wish I would have went up at least a half size!"
  },
  {
    "user": "Ha",
    "rating": 5.0,
    "message": "LOVE LOVE LOVE these shoes!!! Constantly get compliments on them. Such a great closet staple shoe."
  },
  {
    "user": "Luigi Montevecchi",
    "rating": 5.0,
    "message": "Love it so conftable"
  },
  {
    "user": "Taylor",
    "rating": 5.0,
    "message": "True to size and cute! They are a little tough at first until you wear a few times"
  },
  {
    "user": "Kimmil",
    "rating": 1.0,
    "message": "Maybe the worst wearing shoes ever. They’re hard, the tongue of the shoe digs into your ankle.  I truly never leave a bad review but wore these once, put them on shelf in closet, forgot about them do a few months and tried on again last night and by now my return window is over so I figured I might as well be honest, leave a review and maybe save someone else from wasting $$$."
  },
  {
    "user": "Strom S Mull",
    "rating": 3.0,
    "message": "Size up at least a size... maybe even a size and a 1/2"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Comfortable."
  },
  {
    "user": "Michelle Murray",
    "rating": 3.0,
    "message": "No"
  },
  {
    "user": "Tina Walker",
    "rating": 5.0,
    "message": "Comfortable fit and nice for long days on my feet. Very attractive, especially with a sundress or wide leg pants. Well made, sturdy and durable. Very easy to wipe clean."
  },
  {
    "user": "Michele M. Causey",
    "rating": 5.0,
    "message": "Bought these for my 13 year old daughter because she said that all of the girls had sneakers with a star on them.  SHE LOVED THEM!!  These go with leggings and jeans and even skirts and are so cute!  Definitely a must have!"
  },
  {
    "user": "Brenda lee Santiago",
    "rating": 1.0,
    "message": "They are very cute but very uncomfortable"
  },
  {
    "user": "Lindsay Higgins",
    "rating": 3.0,
    "message": "Very snug!"
  },
  {
    "user": "Clarke",
    "rating": 3.0,
    "message": "I love the look of these, but they are quite stiff and the shoelace holes rip when tightening. Disappointing quality from Steve Madden"
  },
  {
    "user": "Julie DaSilva",
    "rating": 3.0,
    "message": "Very stiff heals, they are my size, but not comfortable to wear :("
  },
  {
    "user": "Lexi Tosh",
    "rating": 1.0,
    "message": "Great shoes, other than they’ve hardly been worn and the sole on the right one is already coming off the bottom."
  },
  {
    "user": "Kristy",
    "rating": 3.0,
    "message": "Very narrow"
  },
  {
    "user": "Renee Lonero",
    "rating": 5.0,
    "message": "Love the shoes!  They are a little stuff but very cute on."
  },
  {
    "user": "Katelyn",
    "rating": 3.0,
    "message": "Returned. Did not like on me"
  },
  {
    "user": "Lindsey Ruiz",
    "rating": 2.0,
    "message": "These are cute but the tongue is so stiff that they are super uncomfortable. I would have returned them if I hadn’t missed the return window."
  },
  {
    "user": "Meghan Bush",
    "rating": 5.0,
    "message": "These are not only fashionable but super comfortable!! They go with everything!"
  },
  {
    "user": "Alicia A Green",
    "rating": 5.0,
    "message": "Very cute shoe. My 12 year old daughter says they are comfortable, and she gets several compliments-even her brothers approve!"
  },
  {
    "user": "Haleigh Turner",
    "rating": 5.0,
    "message": "Love these, they fit perfect! Just what I was looking for."
  },
  {
    "user": "AR",
    "rating": 5.0,
    "message": "Really like it!"
  },
  {
    "user": "Heather",
    "rating": 3.0,
    "message": "Shoes ran small"
  },
  {
    "user": "Lauryn K",
    "rating": 1.0,
    "message": "I am normally an 8.5 and when the shoe arrived, they not only were way too small but we’re not genuine Steve Madden sneakers. Returned and refunded."
  },
  {
    "user": "Amazon Customer",
    "rating": 1.0,
    "message": "I wanted so badly to like these, but they were so uncomfortable. Very stiff. I tried several times just to wear these around the house to give them a chance, but they were a no for me. They hurt my feet too bad."
  },
  {
    "user": "Jennifer Naumann",
    "rating": 2.0,
    "message": "I expected a lot more from this shoe, but it runs very short.  There isn't very much cushioning inside and I really don't reach for them very often. I probably should have returned them."
  },
  {
    "user": "Rhea",
    "rating": 2.0,
    "message": "This is not a pink/blush color.  It is gray.  Also there are bright pink ink lines visible where it was marked to sew.  I’m hoping magic eraser will remove them so that I can wear them.  I’ll have to change the laces as they are bright white on an off white and gray shoe."
  },
  {
    "user": "Gina DaGrosa",
    "rating": 2.0,
    "message": "Bulky shoe. Plus there is a terry cloth like fabric inside that makes your feet so hot! Not a good summer shoe."
  },
  {
    "user": "AC",
    "rating": 5.0,
    "message": "LOVE THESE!!"
  },
  {
    "user": "Morgan",
    "rating": 2.0,
    "message": "Looks pretty realistic in picture but not the same quality as the REAL Steve maddens"
  },
  {
    "user": "Taylor",
    "rating": 2.0,
    "message": "I was so excited for these shoes, and loved them the first couple of wears. They are easy to clean. Unfortunately they are cheaply made and are already starting to break down."
  },
  {
    "user": "Brandy Barrington",
    "rating": 1.0,
    "message": "I only got one shoe….I have two feet and need two shoes"
  },
  {
    "user": "TaylerDiPesa",
    "rating": 5.0,
    "message": "So comfy and classic"
  },
  {
    "user": "Megan Carpenter",
    "rating": 1.0,
    "message": "These only feel fake. They are very small, the material is really hard and the bottom of the shoes started to peel up. Not impressed at all for the price."
  },
  {
    "user": "Rosa",
    "rating": 5.0,
    "message": "Nice"
  },
  {
    "user": "Marian",
    "rating": 1.0,
    "message": "Fake, not genuine Steve Madden shoes!  I just ordered these same sneakers in half size larger directly from Steve Madden and they are different. The NY90 stamp on one of these seems off (0 has no circle in the middle) and the sole on the authentic ones is fuzzy velvet whereas in these it is rubber. They seem fake to me so I am returning them but wanted to warn others."
  },
  {
    "user": "Connie",
    "rating": 5.0,
    "message": "Gift for my granddaughter. She loves them"
  },
  {
    "user": "Trisha",
    "rating": 2.0,
    "message": "Really cute but runs small"
  },
  {
    "user": "Carla M.",
    "rating": 1.0,
    "message": "Cute shoes but they are not comfortable at all.  Worn once and will never wear again.  I bought a half size up and they don’t give at all.  Feels like a plastic mold.  Next time I’ll get the real deal."
  },
  {
    "user": "Aura Marina Hernandez Zuloaga",
    "rating": 1.0,
    "message": "Me parece que mis zapatos vinieron defectuosos, en la parte de adelante la plantilla de adentro es un poco más pequeña que el tamaño del zapato y hace que el zapato sea insoportable. Realmente supongo que es un defecto de fábrica."
  },
  {
    "user": "Scott G.",
    "rating": 5.0,
    "message": "Nice hip shoes for a great price!"
  },
  {
    "user": "JenJen_pr",
    "rating": 2.0,
    "message": "They run short and are hard"
  },
  {
    "user": "Jennifer",
    "rating": 4.0,
    "message": "They look really nice with shorts or jeans. I wore with a sundress and liked them a lot! They run more narrow then other fashion sneakers. The leather will stretch and eventually will be more comfortable."
  },
  {
    "user": "Jenna",
    "rating": 1.0,
    "message": "Product didn’t come in SM box. Shoe itself had a smushed heel like it had been worn already and rubbed against the back of foot. Terribly uncomfortable"
  },
  {
    "user": "Gary Davis",
    "rating": 2.0,
    "message": "The  sole of my wifes shoe is coming unglued. Only wore then a dozen times and they are falling apart. Too bad because her Nikes last two years."
  },
  {
    "user": "Egle",
    "rating": 1.0,
    "message": "El zapato en la imagen no es el mismo al que mandan. En la imagen tiene cierta plataforma y el que envían es uno normal tipo converse"
  },
  {
    "user": "emily",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Julie",
    "rating": 1.0,
    "message": "ordered my usual size (6.5) they were comparable to a size 5.5. also came with stains on the shoe laces. returned them..."
  },
  {
    "user": "EUGENIO VILLASECA",
    "rating": 1.0,
    "message": "It look fake"
  },
  {
    "user": "Gretchen Elmer",
    "rating": 1.0,
    "message": "I love Steve Madden shoes, and this could have been an off shoe for my foot. In all honesty the shoes are extremely stiff and very uncomfortable."
  },
  {
    "user": "Catherine Melody Steib",
    "rating": 1.0,
    "message": "Didn’t fit and were very uncomfortable."
  },
  {
    "user": "JoAnna B. Hurley",
    "rating": 1.0,
    "message": "These are fake! They are hard and short in size. They are nothing like my other Steve Madden sneakers."
  },
  {
    "user": "Anon",
    "rating": 1.0,
    "message": "Not real Steve Madden! not comfortable at all"
  }
]