[
  {
    "user": "AP, RRT",
    "rating": 5.0,
    "message": "I'm a Respiratory Therapist who manages a hospital department and does patient care several times a month. I have 3 pairs of Sketchers from this line that I rotate for work. I highly recommend them, especially because of the arch support!"
  },
  {
    "user": "C. Harwood",
    "rating": 5.0,
    "message": "Bought them for the support, and so far they've delivered!  Been wearing them around the house all week."
  },
  {
    "user": "Pamela J Bennett",
    "rating": 4.0,
    "message": "I would have kept this pair if they hadn't rubbed my ankles."
  },
  {
    "user": "gina smith",
    "rating": 5.0,
    "message": "Love the arch fit, light weight"
  },
  {
    "user": "Minerva Nunez",
    "rating": 5.0,
    "message": "Tal y como los esperaba  muy comodos"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "comfortable and  supportive, true to size - all my skechers are the same size"
  },
  {
    "user": "Michelle Borel",
    "rating": 5.0,
    "message": "Great arch support and it literally feels like you are walking on clouds!"
  },
  {
    "user": "HW",
    "rating": 5.0,
    "message": "These are perfect for walking. They are light weight, comfortable and the fit perfect."
  },
  {
    "user": "Jfaker",
    "rating": 5.0,
    "message": "I am almost 69, retired and began part-time work at a local garden nursery.  13K-15K steps per day.  Have expensive Brooks but these are better!  Not once have my feet ached!  And they wash and dry easily and quickly.  I have wide feet and bunion and not one problem!"
  },
  {
    "user": "Melinda Ondrus",
    "rating": 4.0,
    "message": "I've worn a size 10 for years but they are getting a little tight.  I ordered a 10 1/2 but it's that old problem, as a 10 1/4 is not available.  In other words they are true to size but for me are a little to big."
  },
  {
    "user": "tawatchai puntmek",
    "rating": 5.0,
    "message": "Will buy it again"
  },
  {
    "user": "Maryanne",
    "rating": 5.0,
    "message": "They are somewhat comfortable, they support the arch but fall short on the heel area."
  },
  {
    "user": "H. Dry",
    "rating": 3.0,
    "message": "I have had these sneakers less than three months and the shoes have holes in the top where my toes peel through. They lasted less than half the time my previous pair of the same sneakers did, and I've actually been working less hours!! Seems that the quality has gone down. Not worth the nearly $90 price tag."
  },
  {
    "user": "M. Joan Shanafelt",
    "rating": 5.0,
    "message": "Liked everything about Sneaker.  Looks great and great fit!"
  },
  {
    "user": "Jazzmaster",
    "rating": 5.0,
    "message": "I love the fit and comfort these shoes provide. I had a huge amount of foot pain and these shoes have made walking easy again. I now have two pair of these shoes. Will certainly buy again and again."
  },
  {
    "user": "Victoria Renovitch",
    "rating": 5.0,
    "message": "I've had my shoes for about 4 months now and they're still very comfy. I wear them 1-3 days per week and normally my shoes show some wear to them by this point but not these! They fit and feel as well as the day I got them. Very light and durable. Fits exactly as expected"
  },
  {
    "user": "James",
    "rating": 4.0,
    "message": "No"
  },
  {
    "user": "jotitdown",
    "rating": 3.0,
    "message": "Great color, nice soft fabric and cushioning, fit great - except there is no real arch support here. Does it fit my arch? Yes. Does it actually support the arch?  No. If you already have a beautiful, picture ready arch in your foot you'll probably love these shoes.  If you have flat feet or fallen arches this will not help you out.  If you like the shoe otherwise then you should consider an arch support you can put into the shoe.  Unfortunately I will be returning my pair."
  },
  {
    "user": "Teresa Peters",
    "rating": 3.0,
    "message": "Within 6 months these sneakers were demolished. All from walking. My Walmart sneakers lasted longer than this. They were very comfortable though."
  },
  {
    "user": "Katrina S.",
    "rating": 5.0,
    "message": "Bought these for my Mom who has arthritis and foot issues.  She loves them - the style, the fit, the comfort - all of it."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "In the last year my right foot has become unbearable with plantar fasciitis pain. I have tried so many different brands of shoe to help with the pain. I got an injection but it only lasted a little more than a month. I have inserts for my shoes but nothing was helping until I put these shoes on my feet. Wow. What a difference. I wear a size 7 so I don’t know if it just fits my foot better than New Balance, Brooks, Nike or orthofeet but I am ordering another pair."
  },
  {
    "user": "KB",
    "rating": 5.0,
    "message": "Great shoes for walking"
  },
  {
    "user": "Ms Chrystal",
    "rating": 5.0,
    "message": "I have flat feet and struggle finding a shoe that I can wear all day and gives the support I need. These are a perfect fit and are great for whatever running or walking that you do. Especially recommend for people who need the extra arch support."
  },
  {
    "user": "Annette Lee",
    "rating": 5.0,
    "message": "The shoes fit great give good arch support and look great."
  },
  {
    "user": "Katie",
    "rating": 5.0,
    "message": "I really like these shoes. They aren't heavy but at the same time are supportive and I can go several miles in them and still feel the support."
  },
  {
    "user": "Casey",
    "rating": 5.0,
    "message": "These shoes are amazing. Lightweight but sturdy. Very comfortable. Worth the money. I have extremly flat feet and this is my second pair of the arch fit. I wanted a breathable shoe and wow this is it."
  },
  {
    "user": "Marilyn",
    "rating": 5.0,
    "message": "Love the color and how comfortable my feet feel."
  },
  {
    "user": "Donna Lee",
    "rating": 5.0,
    "message": "Light  weight  and comfort."
  },
  {
    "user": "J H Ashburn VA.",
    "rating": 4.0,
    "message": "Love the shoe ,will look for an insert to help support the arch in the right shoe."
  },
  {
    "user": "LN1022",
    "rating": 4.0,
    "message": "This is my second pair and I will keep purchasing as long as they don't change them. I have plantar facitis and these shoes are great, don't have to buy insoles that don't last long anymore! They fit great and are very lightweight."
  },
  {
    "user": "Kates GG",
    "rating": 5.0,
    "message": "Initially worn on a trip to Disney and Universal. Surprised at the amazing comfort wearing these for full days of walking and standing in long lines—no sore feet or blisters. Also appreciate the light weight —no heaviness added to my travel bag."
  },
  {
    "user": "Suzanne",
    "rating": 5.0,
    "message": "This is the second pair of these sneakers that I have ordered.  And I will reorder them again once I wear this pair out!  I truly believe these sneakers, with their incredible arch support has played a very large part in curing my plantar fasciitis.  My foot pain is gone!  I will only wear the Arch Fit from here on out!"
  },
  {
    "user": "EileenMB",
    "rating": 4.0,
    "message": "These are very comfortable and good for workouts at the gym. I prefer high-top Ryka shoes for walking or running. They have even better support for my feet and ankles."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Heat for the price"
  },
  {
    "user": "Linda S",
    "rating": 5.0,
    "message": "These were actually purchased for a woman and I really like them. I walked all over Israel in them and they were incredibly comfortable and supportive. I liked them so much that I bought the navy paid as well!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My only complaint is that I thought I was ordering a slip on shoe but it ties."
  },
  {
    "user": "Sandy",
    "rating": 4.0,
    "message": "Bought these to wear to work, on my feet almost all day. They give good support and feel good on my arches but my feet still hurt. I was hoping for a bit less pain. I may try a insole in them."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The shoes fit well with room in the toe box of the shoe and length is just right.  However, hate to have to add additional support in the insole of the shoe. 1)  Had to add \"Amazing Gel Insoles\" to the shoes to get the proper support.  Foam insoles have a history of breaking down after just a few weeks or months.  With the Amazing Gel Insoles, the support is much better.  2) The arch support is weak and could be done better. We will see how the overall performance of he shoes are in 6 months."
  },
  {
    "user": "Barbara Kelley",
    "rating": 5.0,
    "message": "I'm very happy with my new Skechers.  I have worn different running and walking shoes and always have a pair of Skechers in my closet.  This pair is more sturdy than my others, but still comfortable.  I've found stronger support in some other shoes, but these do have good support.  I'd buy them again."
  },
  {
    "user": "msdsm",
    "rating": 5.0,
    "message": "Support is awesome and the shoe is comfortable!!!"
  },
  {
    "user": "Sherry Shriver",
    "rating": 5.0,
    "message": "This is the 4th pair of shoes I've purchased from Amazon. Never disappointed"
  },
  {
    "user": "Sandy Mims",
    "rating": 5.0,
    "message": "I got these shoes as I’m on my feet all day at work with very little time to rest my feet and ankles had been bothering me after one day my feet and ankles didn’t hurt going to order some more"
  },
  {
    "user": "H",
    "rating": 5.0,
    "message": "I ordered these for my daughter who has severe Rheumatoid Arthritis and has issues with walking and foot pain.  She asked me to write this so someone else with her condition might benefit from the input.  She says they are comfortable for walking and don’t put pressure on her toes.  This is her second pair and she was glad to be able to reorder a product that works for her personally."
  },
  {
    "user": "Elaine",
    "rating": 5.0,
    "message": "Love my sneakers!!!  So comfortable but most important, great support!!!"
  },
  {
    "user": "Xena",
    "rating": 5.0,
    "message": "Perfect fit and very comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Love these arch support and comfortable is hard to find."
  },
  {
    "user": "Dixie Blue Moon",
    "rating": 5.0,
    "message": "I was expecting shoes wide enough for Big Foot but surprisingly they are the perfect size. An 8 Wide that forms to my feet, doesn’t hurt or pinch anywhere and still looks feminine. Arrived on time, packaged well, and I will order another pair."
  },
  {
    "user": "Hazel Poulter",
    "rating": 5.0,
    "message": "the shoes are very comtortable"
  },
  {
    "user": "Sherilyn Peterson",
    "rating": 5.0,
    "message": "These shoes fits great!  Am getting used to the fit after not having a good arch support for a long time."
  },
  {
    "user": "Carrie",
    "rating": 2.0,
    "message": "They hurt my feet soooooo bad, I even added hel insoles! Bought a par of Asics and my feet are great! Had to be the shoes!"
  },
  {
    "user": "c.a.",
    "rating": 4.0,
    "message": "Regular width does not stretch far enough. If you wear wide order wide."
  },
  {
    "user": "Ill shod",
    "rating": 2.0,
    "message": "These looked nice but returning because there is not enough cushioning where your toes are for me."
  },
  {
    "user": "P.H.",
    "rating": 5.0,
    "message": "I hesitated to buy another pair of Sketchers because there was little or no arch support in the last pair I purchased. I was pleasantly surprised how comfortable they are. I don't have flat feet but do need some arch support, these seem to fit the bill! Thank you"
  },
  {
    "user": "Mgray",
    "rating": 5.0,
    "message": "Love these sneakers."
  },
  {
    "user": "B. Eberhard",
    "rating": 5.0,
    "message": "Actually my 90 year old mother swears by this model of sketcher shoes.  She has been wearing the same ones for over a year and worn them out with her daily walks.  We replaced them this month and she loves the new pair, the old ones had definitely started to show signs of wear."
  },
  {
    "user": "LouLou218",
    "rating": 5.0,
    "message": "I like everything about these shoes, they are so comfortable and support my feet so I can shop and walk longer."
  },
  {
    "user": "Elise M. Sattler",
    "rating": 4.0,
    "message": "I’m very happy with my first Sketchers. I wear an 8 but I bought an 8.5👍 So go up a half or 1 full size  for a walking shoe❤️"
  },
  {
    "user": "KatzMeow",
    "rating": 5.0,
    "message": "These shoes fit great and feel good, sizing is exact. I love the look and feel and they are not losse, so my shoe is not wobbly when walking or wearing.... great shoe for the price"
  },
  {
    "user": "H Mack",
    "rating": 4.0,
    "message": "Being on my feet 12 hrs at work, I need a comfortable and support in a shoe. This shoe met these needs at a great price."
  },
  {
    "user": "Joan LeMunyon",
    "rating": 3.0,
    "message": "I have other skechers sneakers and shoes that I love.  These have great arch support but run narrow.  Not comfortable for standing for a long time."
  },
  {
    "user": "Cristina Vargas",
    "rating": 5.0,
    "message": "The media could not be loaded. Lo cómodo que son☺️☺️"
  },
  {
    "user": "Barbara Jameson",
    "rating": 5.0,
    "message": "Love these shoes, so lightweight and supportive."
  },
  {
    "user": "Jack",
    "rating": 5.0,
    "message": "They are light but still supportive-perfect for walking!! I love them!!"
  },
  {
    "user": "cheryl silvers",
    "rating": 5.0,
    "message": "Awesome comfort!!!!!!"
  },
  {
    "user": "David",
    "rating": 5.0,
    "message": "Great support! Keeps my foot in place when walking.  This shoe provides comfort all around my foot."
  },
  {
    "user": "Jeannette Hawkes",
    "rating": 3.0,
    "message": "For a side shoe it was very tight. Would not purchase again"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I finally found a great fit.  My ball of the foot does not burn in these shoes.  Very comfortable!! Knees feel aligned love walking in them."
  },
  {
    "user": "coleen carlson",
    "rating": 5.0,
    "message": "The look and fit are wonderful.  I receive compliments and my husband noted I am more comfortable"
  },
  {
    "user": "Catherine Garrett",
    "rating": 5.0,
    "message": "I have finally found a pair of sneakers that are comfortable.  I love the color and style. Thank you!"
  },
  {
    "user": "Rhoda M Chamberlin",
    "rating": 5.0,
    "message": "I love love love these arch support shoes so very comfortable and really help support the arch. I love skechers  shoes.."
  },
  {
    "user": "Linda B.",
    "rating": 4.0,
    "message": "I put arches in the size ten and they are very comfortable, I wear a 10 but a 91/2 would have been perfect"
  },
  {
    "user": "Pamela Bale",
    "rating": 5.0,
    "message": "We’re NOT WIDE. Hurt my feet."
  },
  {
    "user": "Valerius Poplicola",
    "rating": 2.0,
    "message": "When I first put these on I was impressed with the arch support. They were very cushy, which was nice at first. I have plantar fasciitis so I was looking forward to a sneaker with arch support.  After wearing them all day, my plantar fasciitis felt a little worse, but my foot also hurt in other places and my ankles hurt.  The next morning my feet and ankles were sore. These are so cushy they are unstable which is why my ankle hurts, and my foot sunk into them deep enough it hurt other joints in my feet.  Additionally there is no rubber treads so they are slippery.  I have never seen a sneaker where you are just stepping on the foam.  Also they don't have the lock loop at the top like other sneakers so the pressure is tight on the top of my foot which restricts blood flow to my toes. These have the potential to be great, but need several improvements. As is, these are not worth they are charging for them."
  },
  {
    "user": "Renee B",
    "rating": 5.0,
    "message": "Comfortable and lightweight. Able to wear for hours without issue"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Doesn't hold up my fallen arches as expected them to. Wear them to work daily."
  },
  {
    "user": "Calene Muehlenkamp",
    "rating": 5.0,
    "message": "I really like these shoes. Have bought several pairs of the last couple of years. Very Comfortable."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "I wear a ten and these were to large in the heel."
  },
  {
    "user": "R Miller",
    "rating": 5.0,
    "message": "I love these shoes!  Comfort & fit is perfect!"
  },
  {
    "user": "kris broadwell",
    "rating": 4.0,
    "message": "I had to buy AR h support insole to really get the support I needed"
  },
  {
    "user": "Ken fabas",
    "rating": 5.0,
    "message": "Treadmill"
  },
  {
    "user": "susan h.",
    "rating": 4.0,
    "message": "I disliked that they ate used shoes.  It was obvious someone had worn them outside.  The white Sikes were dirty."
  },
  {
    "user": "Jo Ann Gibbs",
    "rating": 3.0,
    "message": "This is the second pair of arch fit shoes I’ve purchased.  This pair is a different style and is not as comfortable.  The toe is bigger so it is a little floppy.  It also sets my foot at a different angle, which is less comfortable.  It is more flat.  I like the quality and look,  but will not buy this style again.  I will purchase a 2nd pair of the first style.  Those arch flex shoes were perfect."
  },
  {
    "user": "Paintbox",
    "rating": 5.0,
    "message": "The arch in these shoes is the equivalent of some of the ones you can buy over the counter, which cost as much as $50., so it makes the Arch shoe a good deal. If it's not as high as I need, I still use my professional orthotics as well as the arch, but I'm pretty happy with these shoes."
  },
  {
    "user": "ET",
    "rating": 4.0,
    "message": "The arch support is good but not great.  I don't think the shoe will hold up very well - time will tell"
  },
  {
    "user": "Cherie Baggot",
    "rating": 5.0,
    "message": "I’ve been dealing with plantar fasciitis and the arch fit Skechers have been a life savor for me. It’s all I wear now."
  },
  {
    "user": "Ruth",
    "rating": 5.0,
    "message": "I like my new sneakers"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are comfortable and great for walking. I have a fallen arch and after an hour I'm limping. With these shoes, I was comfortable and had the support I needed. These shoes are true to size and the best comfort."
  },
  {
    "user": "Ferol J  Dickson",
    "rating": 5.0,
    "message": "Great for arch support"
  },
  {
    "user": "Nancy",
    "rating": 5.0,
    "message": "Very Very comfortable shoe.  I was really surprised.  I have severe back pain and this shoe really helps."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The sketcher arch fit  fits  perfectly very comfortable I wear them for work helps my back a lot"
  },
  {
    "user": "Grandma Susie",
    "rating": 5.0,
    "message": "These tennis shoes are so comfortable with good arch support. I have a bunion on one foot, so the soft fabric has been a quality I love when wearing these daily."
  },
  {
    "user": "Dani N",
    "rating": 5.0,
    "message": "Love these sneaks. Definitely ease my body aches from being on my feet for hours.  Still get sore but that's cuz I'm old and fat.  A shoe can't fix that bit Is highly recommend giving arch fits a try."
  },
  {
    "user": "S B.",
    "rating": 3.0,
    "message": "Not any better than other sketcher shoe, but twice the price.  Minimal cushion. A lot of hype over nothing"
  },
  {
    "user": "Jane M. Birdwell",
    "rating": 5.0,
    "message": "I liked everything  about the shoe, the fit and comfort. I use them for work"
  },
  {
    "user": "Denise Valencia",
    "rating": 3.0,
    "message": "I want mt foot to stay fitted in place when I walk in the shoe, not slide to the front of the shoe!"
  },
  {
    "user": "BCarter",
    "rating": 5.0,
    "message": "Love, love!!!  The added padding for the arch and pad of foot built into sole makes a huge difference.  If you’re on your feet a lot, highly recommend."
  },
  {
    "user": "Martha Coffey",
    "rating": 5.0,
    "message": "Love these shoes! The arch support is great and the fit was perfect. I can walk farther with those shoes. I'm an older person and these shoes feel so good on my feet."
  },
  {
    "user": "Irene Brookes",
    "rating": 5.0,
    "message": "I love the Sketchers Arch fit sneakers. They are the most comfortable shoe ever. Even after having them on all day, my feet feel great. I highly recommend them."
  },
  {
    "user": "Alena",
    "rating": 5.0,
    "message": "Good walking shoes!"
  },
  {
    "user": "Nancy Copeland",
    "rating": 5.0,
    "message": "Looks and feels good. Great price"
  }
]