[
  {
    "user": "Dustin",
    "rating": 5.0,
    "message": "I was looking for something comfortable for my son and I to do our daily walks in for Pokemon Go.  They were on sale for 29.99 and I figured why not.  The memory foam mentioned in the product description is way under rated.  It really wonderful and absorbs so much impact compared to my last pair which were thick soled New Balance.  I'm in the high 200s, so that's significant when talked about cushioning the bottom of the foot.  Saw a few people talked about tight in the toe.  If you just slip them on and lace them up that will definitely be a thing.  I relaced them a bit more to my comfort level and they're just fine.  I think the pre-lacing on these is for the maximum snug fit.  All in all, super impressed with these and thinking of buying another pair or 2 for backup while they're cheap."
  },
  {
    "user": "Jim Tzaras",
    "rating": 5.0,
    "message": "Bought for casual office use, mild walking. 8+ hours at a time when in office casual mode. These exceed expectations by far where fit and comfort are concerned for long wearing. No idea about longevity yet, been only a couple weeks, but if they even last like inexpensive shoes do, I will rebuy."
  },
  {
    "user": "Catherine Farrell",
    "rating": 5.0,
    "message": "My son loves these shoes! They are true to size and on sale for a good price. He still has a little room to grow still and they are wide enough for him without having to go to a wide width size."
  },
  {
    "user": "Waqas Raja",
    "rating": 4.0,
    "message": "This is my 2nd pair, both I was able to pick up on sale. The first one lasted for couple of years with heavy use so I totally recommend this shoe if you are looking for an economical running shoe. Not super comfortable but its not bad. It a jack of all traits type of shoe."
  },
  {
    "user": "Darron",
    "rating": 5.0,
    "message": "I bought this pair of Puma shoes a few years ago and really liked the feel and fit of them and I have ordered at least five pairs since. The only issue I have with these is the fact that like al modern shoes they have a tendency to dry rot after 18 to 24 months but other than that they perform excellently."
  },
  {
    "user": "Albert Sturch",
    "rating": 4.0,
    "message": "well I really liked the look and the great price I got them for which was my biggest reason for this purchase feel a little loose in certain areas but nothing that I cant make do with overall great product awesome value for my money"
  },
  {
    "user": "Ken Burkepile",
    "rating": 4.0,
    "message": "It's a nice looking shoe other than I need for a bigger or better cleat and the sides around the ankle are a little too tall I think those will just wear in but good product otherwise only use them once so far"
  },
  {
    "user": "Theo",
    "rating": 5.0,
    "message": "Bought these cuz I thought they looked cute and they were cheap. They fit like a glove and the insole feels AMAZING on my feet while walking, definitely a great purchase."
  },
  {
    "user": "Moses Rabeinu",
    "rating": 5.0,
    "message": "very comfortable & has some arch support as well, feels like walking on air one thing beware these run small, I'm a 7 in Ecco, and over here I took an 8 & it fits me we'll have to see over time how durable these are but even if they won't last as long as nikes their definitely worth for the comfort"
  },
  {
    "user": "Kelsey Herndon",
    "rating": 5.0,
    "message": "I bought these for my fiancé for his birthday, very well made shoe and a year later they still are holding up well!  Good quality"
  },
  {
    "user": "NE Major Dude",
    "rating": 5.0,
    "message": "The shoes look great!  Very stylish sneakers, IMHO.  The soles are a little on the thin side, but that's what they're designed to be.  They're very light and nice to wear."
  },
  {
    "user": "Roy",
    "rating": 5.0,
    "message": "Has expected from puma the toolbox area was a little narrow. This has been a failing of puma shoes for a long time. Aside from that they have a very comfortable cushion insole. I think they are a cool looking shoe. Going to buy a second pair."
  },
  {
    "user": "Tony Westerman",
    "rating": 4.0,
    "message": "Insoles are comfortable. The top of the shoes where your toes go are tight"
  },
  {
    "user": "AlleyCat",
    "rating": 5.0,
    "message": "Everything about this shoe is perfect..for me..we are all different, but these are comfortable right out the box. better for support and comfort than my loafers so I only wear them in the house they're so comfortable. I don't wear outdoor shoes in the home, so I'll need another pair for outside walking. Fit is just right."
  },
  {
    "user": "mario malpica",
    "rating": 5.0,
    "message": "Comfortable and stylish.  Will be purchasing more. Sneaker size varies for me depending on type and brand. Nike, I'm usually size 11 to 12.  I originally bought size 11.5, returned no issue for a size 12."
  },
  {
    "user": "Nidhi",
    "rating": 4.0,
    "message": "I never had a pair of Puma's like this before. I wasn't expecting them to be as nice and comfortable as they are."
  },
  {
    "user": "Jeff H",
    "rating": 4.0,
    "message": "My boys wear it to school every other days. Like the design and functions well. My boys have wider feet. They feels these shoes are little narrow. Wish they offer wide size."
  },
  {
    "user": "Kaushik Pattanaik",
    "rating": 5.0,
    "message": "I had been using Puma from the past 10 years and it has never failed. Product is very good, provides perfect arch support."
  },
  {
    "user": "Gus Cruz, Sr.",
    "rating": 5.0,
    "message": "My hubby loved them.  They are comfy and support his feet the way he likes it."
  },
  {
    "user": "Lilian",
    "rating": 5.0,
    "message": "I bought it for my son. He really likes it."
  },
  {
    "user": "Sumedh Habbu",
    "rating": 4.0,
    "message": "I read the reviews and purchased a 10 instead of a 9.5. However, for me even the 10 is running a size small. Have put it up for returns. Let's see what happens."
  },
  {
    "user": "Ryan T.",
    "rating": 4.0,
    "message": "These fit great and wearing well. Downside is there is no place for the laces to keep the tongue straight."
  },
  {
    "user": "Katie Hendrickson",
    "rating": 5.0,
    "message": "My 12 year old loves them! He says they are super comfortable and the best shoes he’s had in a while!"
  },
  {
    "user": "Sherry Lockhart",
    "rating": 5.0,
    "message": "I purchase these shoes for my husband and he loved them.He said they was very comfortable on his feet.Highly recommended because they are very stylish and comfortable 🙂☺️"
  },
  {
    "user": "Carlos & Angela Ayala",
    "rating": 5.0,
    "message": "Second pair! Worth it! I like to have 2 pair of the same when I like it. Highly recommend it."
  },
  {
    "user": "DSurge",
    "rating": 4.0,
    "message": "Great price, definitely worth it.  Will have to see how long they last before they start to tear, etc."
  },
  {
    "user": "Andy",
    "rating": 5.0,
    "message": "It is perfect fits on my foot just ordered it 12 but 11 size works also The shoes which I ordered are very good in quality and comfortable."
  },
  {
    "user": "Jorge",
    "rating": 5.0,
    "message": "Great quality, very good looking and most important very comfortable. Great buy"
  },
  {
    "user": "Anibal O.",
    "rating": 5.0,
    "message": "Comfortable, bonitos, buen material. Estoy encantado con mis shoes!!!!"
  },
  {
    "user": "S. OLEARY",
    "rating": 5.0,
    "message": "I ordered these mostly because I thought they looked cool. Didn’t read any reviews and honestly, my previous experience with Puma goes back to the 1980s. I ordered a 9 1/2 because that is my normal size. 43 in European sizes. The Euro size on the box is a 42 1/2. Looks like I’ll have to send these back and exchange them for a pair of 10s. Other than how tight the toe box is on my big toe, these shoes seem quite well put together and the insole is super soft & comfy. Still really like how they look too. Will update later if I’m able to exchange them for the bigger size."
  },
  {
    "user": "Pete",
    "rating": 5.0,
    "message": "Great service and product"
  },
  {
    "user": "Rob",
    "rating": 4.0,
    "message": "I like the shoes. I bought a size 12 but I should have gone with a 11 or 11.5"
  },
  {
    "user": "Glenn Archibald",
    "rating": 5.0,
    "message": "Look and feel"
  },
  {
    "user": "jose m",
    "rating": 5.0,
    "message": "Prácticos y ligero"
  },
  {
    "user": "Bryan Moore",
    "rating": 4.0,
    "message": "Great shoes for the value. Wouldn’t hesitate to buy again"
  },
  {
    "user": "Megan F",
    "rating": 5.0,
    "message": "My husband will not buy any other brand of shoe for work and loves these. Fit well, good quality and comfortable."
  },
  {
    "user": "Kelvin Greene",
    "rating": 5.0,
    "message": "december 1994 - time traveler"
  },
  {
    "user": "Yadira",
    "rating": 5.0,
    "message": "Exelente, y mas por el precio ❤️"
  },
  {
    "user": "Joseph s milito sr",
    "rating": 4.0,
    "message": "Good price when I bought them"
  },
  {
    "user": "Diego D.",
    "rating": 5.0,
    "message": "True size, very comfortable!"
  },
  {
    "user": "amber",
    "rating": 5.0,
    "message": "I order Puma Men's Tazon shoes every winter for my hubby as a gift. He loves these shoes! We always order the Tazon line (different colors and styles of Tazon). After months of searching and trying over 25+ pairs of shoes, he finally found a style that works. We've been buying the Tazon line for 3 years now! The quality of this line is great. He wears them almost daily and they hold up well. The last pair after 9 months of wearing them (daily) the only wear we saw was inside the shoe where the back of his ankle hits. The support of the shoe after about a year of wearing them almost daily obviously isn't as good as before, but he always says they're still comfortable. Shoes for him are hard to find since most are uncomfortable for his feet and don't fit correctly. At one point a few years ago we'd tried over 25+ pairs of sneakers (various stores, brands, styles in the same brands, etc) and he couldn't wear any of them! We'd even tried other Pumas with no luck. It was so frustrating and extremely frustrating for him. You see, we'd been through this with dressier shoes as well, tried on a lot. He wanted to give up. Well I'd seen an add for the Puma Tazons and after about an hour of convincing him I got him to try them on. Typically he can tell if a shoe won't work for him the moment he tries them on or walks in them for less than ten seconds. I'd ordered his size and also half a size up. He put them on, walked around and from the look on his face I could tell they worked for him. I will say that he is always a 9, but for this shoe the 9 1/2 fit better for him, so you might want to try the half size up if your regular size doesn't feel right when you try them on. I love how the Tazon line has a bunch of styles and colors too! I've recommended this shoe to a lot of people and will continue to do. If I had my way I'd order a vast amount of colors and styles, but he isn't someone who likes to wear a bunch of different shoes. I did get two pairs this holiday season and told him he's going to alternate to change it up. Thank you Puma for making a good quality shoe that works well for my hubby."
  },
  {
    "user": "kevin e wooten",
    "rating": 4.0,
    "message": "Comfortable well made shoe"
  },
  {
    "user": "Alexander Rosa",
    "rating": 5.0,
    "message": "Zapatos muy bonitos igual a la descripción, se sienten de buena calidad y muy cómodos. Esperemos que duren. Por ahora todo bien"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "These shoes are soo comfortable. They literally on great, even better was the price."
  },
  {
    "user": "K. Bap",
    "rating": 5.0,
    "message": "Good Quality item, fit as expected"
  },
  {
    "user": "Michael Egan",
    "rating": 5.0,
    "message": "Great for all my Dad weekend chores like mowing the lawn, cleaning the garage and taking the trash to the dump.  Way cooler than the standard New Balance sneakers and no jorts required for these either!"
  },
  {
    "user": "PDove",
    "rating": 5.0,
    "message": "Great shoes! A little narrow for my foot but, I'm ok."
  },
  {
    "user": "Elisha Bell",
    "rating": 5.0,
    "message": "Nice and comfy!"
  },
  {
    "user": "Toni",
    "rating": 5.0,
    "message": "I have to say I was weary of buying this show since there's not a lot of sole, but it has been heaven so far. The innersoles feel thin but amazing and enough. I love how they look. I usually wear a size 12 boot so I went with a size 13 sneaker and the difference has been amazing for walking on concrete."
  },
  {
    "user": "LINDY",
    "rating": 5.0,
    "message": "Happy to find these for the price we did! Husband is hard on shoes and it’s hard spending a lot when he’ll tear them up in a couple months. These are also rather water resistant which is one of the main reasons we like this style! So much is mesh now and that’s not good for the weather around here. 10 out of 10, will absolutely buy again."
  },
  {
    "user": "junior",
    "rating": 4.0,
    "message": "The shoe is Great needed a basketball shoe very"
  },
  {
    "user": "Donald A Castle",
    "rating": 4.0,
    "message": "Puma has the best looking shoes on the market and some of the best prices as well.  Now let's get the comfort for the Tazon 6  right !"
  },
  {
    "user": "GR",
    "rating": 5.0,
    "message": "Everything was perfect."
  },
  {
    "user": "Pranay Narne",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "KWB",
    "rating": 5.0,
    "message": "Very comfortable, supportive, and sturdy shoes!  I have a very difficult time finding shoes that fit me well and that are comfortable for me, and I have had no problems with these shoes whatsoever!  They fit my feet perfectly, as expected and I love the comfort and stability these provide for my feet!  No complaints and very pleased with this purchase!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Tight fitting"
  },
  {
    "user": "Ada Mendonca",
    "rating": 5.0,
    "message": "wonderful very good and excellent quality"
  },
  {
    "user": "Kristina Ivory",
    "rating": 4.0,
    "message": "My bf uses these sneakers for work. Basically walking."
  },
  {
    "user": "Luis Lopez",
    "rating": 5.0,
    "message": "Me párese perfecto 👌"
  },
  {
    "user": "Jose",
    "rating": 4.0,
    "message": "me queda muy bien este fue el segundo que compro de estos modelos, y estoy esperando otro que pedi ahora me gustan mucho ya pronto tendre 3 de estos pero diferentes colores...."
  },
  {
    "user": "gary jones",
    "rating": 4.0,
    "message": "Great with ankle support"
  },
  {
    "user": "John Jensen",
    "rating": 5.0,
    "message": "See headline"
  },
  {
    "user": "steve",
    "rating": 5.0,
    "message": "Thank you"
  },
  {
    "user": "Manuel Soriano",
    "rating": 5.0,
    "message": "En un principio los compre para Trabajar solamente y hasta el momento me han funcionado de maravilla! Ya llevo un año con ellos y volveré  a comprarme otros cuando ya no aguanten mas! Quiero resaltar Su comodidadal caminar, Comfortables, Muy buena Presentación, Buenos para hacer todo tipo de actividad al Aire libre"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My 15 year old son picked these out from the pic for the 1st day of school because of how they looked. I bought them for the great price. We both were surprised at quality and comfort. He said \"mom these feel great after being in them all day\" that's all I needed to hear! Buying 2nd pair NOW!!!"
  },
  {
    "user": "JOE M",
    "rating": 5.0,
    "message": "Have had these before. All as expected and arrived quickly."
  },
  {
    "user": "jkk",
    "rating": 5.0,
    "message": "I like the comfort"
  },
  {
    "user": "Shana Williams",
    "rating": 5.0,
    "message": "I love these shoes...they are solid, true to size and cute."
  },
  {
    "user": "Duluth greyhound",
    "rating": 4.0,
    "message": "The shoes are put together correctly. Great style. Inexpensive way to get great trainers!"
  },
  {
    "user": "william graden",
    "rating": 5.0,
    "message": "Already had a compliment on the shoes."
  },
  {
    "user": "jaqueline",
    "rating": 5.0,
    "message": "I will buy this shoes 👟 again"
  },
  {
    "user": "Jeffrey Alister",
    "rating": 4.0,
    "message": "Very comfortable and light weight, I really like them."
  },
  {
    "user": "Richie",
    "rating": 5.0,
    "message": "Perfect fit straight out of the box. This Puma shoe is the most comfortable Puma shoe that I've owned. Purchase 1 1/2 size up (originally I wear size 9)."
  },
  {
    "user": "Pedro",
    "rating": 5.0,
    "message": "Era lo que esperaba"
  },
  {
    "user": "Edwart",
    "rating": 5.0,
    "message": "los recomiendo, los compre para ir a mi trabajo, soy profesor de educacion física y creo que lo voy a coger para salir jajajjajja. le recomiendo que se midan el pies y los pidan por los Cm asi les llegan exacto a sus pies."
  },
  {
    "user": "George",
    "rating": 5.0,
    "message": "Not much too say: I’m happy with the product! The shoes arrived NEW in the manufacturer’s box. I went to a few local shoe shops before shopping on Amazon. I purchased this product for about 15% less than what I would've paid locally. They fit great & cost less! Win/Win!"
  },
  {
    "user": "Joseph Panio",
    "rating": 5.0,
    "message": "Bought a pair for myself. Liked them so much, I bought a pair for my son!"
  },
  {
    "user": "duncan",
    "rating": 5.0,
    "message": "Went thru changes but I got them really like these!"
  },
  {
    "user": "Nerlaine",
    "rating": 5.0,
    "message": "The shoe fits perfectly and is very comfortable"
  },
  {
    "user": "Mark",
    "rating": 5.0,
    "message": "Great quality!"
  },
  {
    "user": "Ronin",
    "rating": 4.0,
    "message": "These are not as light as running shoes, but much lighter than any cross trainer I have ever used so able to jog?walk in them too. These are a great bargain, they look great, they are comfortable, and seem to be well built. I usually buy Asics, or Nike, these are my first Pumas and not my last, matter of fact ordering the black ones just to wear around"
  },
  {
    "user": "Johnathan Stroud",
    "rating": 5.0,
    "message": "A super super comfortable shoe!"
  },
  {
    "user": "kay",
    "rating": 4.0,
    "message": "Item looked better than I thought it would."
  },
  {
    "user": "Katherine Gil",
    "rating": 5.0,
    "message": "Es cómodo, y se adapta perfecto al pie"
  },
  {
    "user": "Alan E Singleton",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "Dawn Dunfee",
    "rating": 5.0,
    "message": "Great shoes"
  },
  {
    "user": "musicmanohyeah",
    "rating": 5.0,
    "message": "Perfect for my style and Puma never disappoints"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "Sonnia Lizbeth Manrique Cando",
    "rating": 5.0,
    "message": "Perfecto"
  },
  {
    "user": "Sonja Motley",
    "rating": 5.0,
    "message": "See above for  description of issue"
  },
  {
    "user": "Rickey Gause",
    "rating": 5.0,
    "message": "Na"
  },
  {
    "user": "Ramon de la Cal",
    "rating": 5.0,
    "message": "Buen zapato me gusto"
  },
  {
    "user": "Thomas",
    "rating": 5.0,
    "message": "Super comodos"
  },
  {
    "user": "Tom Perkins",
    "rating": 5.0,
    "message": "I think they fit great. I ware them all day and they are comfortable. I would probably buy them again."
  },
  {
    "user": "tony hensley",
    "rating": 5.0,
    "message": "no issues with shoea"
  },
  {
    "user": "Eliecer Gonzalez",
    "rating": 5.0,
    "message": "Me agradó mucho"
  },
  {
    "user": "Merisi39",
    "rating": 4.0,
    "message": "This is the third pair of Puma shoes that I have purchased within the last 3 years.  I find them great for training (I powerlift/bodybuild), for the most part. My only criticism is that the toe box is a bit narrow (however, most shoes have a narrow toe box).  As such, I do not squat in them (have  minimalist shoe dedicated to squats)."
  },
  {
    "user": "Sibongile",
    "rating": 5.0,
    "message": "Strongly made shoe. Comfortable.  My son wears his too school and it takes the pressure of his activities."
  },
  {
    "user": "Randy Edwards",
    "rating": 5.0,
    "message": "Just what I was looking for."
  },
  {
    "user": "marvin kiger",
    "rating": 5.0,
    "message": "I will be purchasing these again, quality product and we'll priced"
  }
]