[
  {
    "user": "Mike",
    "rating": 4.0,
    "message": "I just got these from Amazon today. They are just what I thought they'd be... They are a entry level white retro sneaker... They are NOT 4EEEE I would say they are a 11.5 W/E. In a EE or EEE shoe my feet have \"room\" like a athletic fit jean vs a slim/ straight fit.  Given that they are so inexpensive I am going to keep them as an outfit shoe for events with limited walking. PS: I also bought a New Fall '22 Cole Hann white sneaker for 4x the price of these that are already getting returned they look different but they fell and support the same."
  },
  {
    "user": "Zavier Simpson",
    "rating": 4.0,
    "message": "neat, cute, comfy"
  },
  {
    "user": "javier",
    "rating": 4.0,
    "message": "Siempre quite unos tennis asi me gustan ,"
  },
  {
    "user": "Tyler Hurst",
    "rating": 5.0,
    "message": "Just what I wanted"
  },
  {
    "user": "Ron Torres",
    "rating": 5.0,
    "message": "Liked everything about it."
  },
  {
    "user": "Terry J. Rupnow",
    "rating": 5.0,
    "message": "Very comfortable, good value for the money."
  },
  {
    "user": "Adrian Gomez",
    "rating": 4.0,
    "message": "Sorry. I was expecting my reebook shoes in leather,  and they were not.  So I did send them back.."
  },
  {
    "user": "Daniel Griffin",
    "rating": 5.0,
    "message": "Very comfortable and was delivered fast."
  },
  {
    "user": "Randall Pilotte",
    "rating": 5.0,
    "message": "Been using Reebok for years then box stores quit selling them but if you did find them they were way over priced.  Everything I expected and at a lower cost"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Bought these for my son and he loves them. Can't go wrong for the price."
  },
  {
    "user": "susan dittrich",
    "rating": 5.0,
    "message": "Looks like a great product, fits well."
  },
  {
    "user": "Tom Laguens",
    "rating": 5.0,
    "message": "Great value, nice style."
  },
  {
    "user": "Maria B",
    "rating": 5.0,
    "message": "That’s my husband’s third pair of these shoes! He has been wearing them maybe for 5 years! The most comfortable and suit everything!"
  },
  {
    "user": "Lou Smith",
    "rating": 4.0,
    "message": "Fits well, lightweight,  good sneaker for the price"
  },
  {
    "user": "Luis Jose",
    "rating": 4.0,
    "message": "Buen zapato"
  },
  {
    "user": "Ismael Romero",
    "rating": 5.0,
    "message": "Excelente 👌"
  },
  {
    "user": "Randy Burgess",
    "rating": 4.0,
    "message": "Nice sneaker, fit as expected and is comfortable to walk around in."
  },
  {
    "user": "ALFONSO ALBUJA",
    "rating": 5.0,
    "message": "Clásico"
  },
  {
    "user": "Lifetime",
    "rating": 5.0,
    "message": "Good support"
  },
  {
    "user": "Catherine",
    "rating": 5.0,
    "message": "These are the classic sneaker from years ago. They look clean and look good with any outfit. My husband loves them because they are comfortable. It’s a win win. 🙂"
  },
  {
    "user": "A. Vazquez",
    "rating": 5.0,
    "message": "When Amazon asked me to review this sneaker I wasn’t sure if I wanted to have my name associated with this brand… after wearing these sneakers it has completely change my life.. the comfort and versatility they provide are next to none.. do yourself a favor and take a selfi when you put these one.. send them selfi to friends and family and allow them to bask in your glory of such amazing sneakers.."
  },
  {
    "user": "Richard Acosta",
    "rating": 4.0,
    "message": "Got here  quickly And fit correctly"
  },
  {
    "user": "john w.",
    "rating": 5.0,
    "message": "Most comfortable sneaker I've ever had. Size fit like a glove. 1st time for Velcro straps and keep sneaker tight."
  },
  {
    "user": "Todd R. Warner",
    "rating": 4.0,
    "message": "I usually buy K-Swiss, but I saw these while browsing for shoes and always wanted a pair of Reebok's ever since I was a young kid. So I went ahead and purchased a pair on-line without ever having tried them on. In trying them on the first time, they where slightly tight in the length and width. I have warn them for a few days and they have loosened a bit, but they are still a bet uncomfortable. My foot width is regular to wide (it sort of a tweener between a regular and wide foot). I will be keeping these and overall am happy with them, but just want to warn those of you who have a slightly wider foot that apparently Reebok's run a bit smaller and narrower than a true to size fit so try them on before you buy your first pair. For reference, I seem to have a similar issue with Nike shoes. Also, I cannot wear Saucony as they are too narrow for my foot."
  },
  {
    "user": "Julio nin Henriquez",
    "rating": 5.0,
    "message": "Muy bueno"
  },
  {
    "user": "Friedmar Bendrat",
    "rating": 5.0,
    "message": "I like the fact that it has leather uppers"
  },
  {
    "user": "PrayGod Nnko",
    "rating": 4.0,
    "message": "I received it, the way I expected and im comfortable with them"
  },
  {
    "user": "rocky",
    "rating": 5.0,
    "message": "cushion not to great after a few months"
  },
  {
    "user": "ryan t rock",
    "rating": 5.0,
    "message": "Exactly as advertised and delivered early.  Great deal"
  },
  {
    "user": "Aldemar sanchez",
    "rating": 4.0,
    "message": "Un poco grande respecto a la talla."
  },
  {
    "user": "Juan Agustín",
    "rating": 5.0,
    "message": "Wuau me encanto 😍 llegaron nuevos en su caja y fue 💯 rápido 🥰"
  },
  {
    "user": "bigcountry",
    "rating": 3.0,
    "message": "Not a bad shoe. But only lasted 3 months before insoles have torn apart and stiching on exterior of shoe have began to separate. But was only 40 dollars for them so get what ya pay for"
  },
  {
    "user": "Mel Mamula",
    "rating": 4.0,
    "message": "After regular wear, in six months the front rubber separates from the top leather.  This is my fifth pair of Reeboks and they separate in the same place.  See photo."
  },
  {
    "user": "Joe B.",
    "rating": 5.0,
    "message": "I have purchased this item several times and always the same as I expected."
  },
  {
    "user": "Barry B.",
    "rating": 5.0,
    "message": "High quality shoe with proper support for my racket sports.  Good value for the cost!"
  },
  {
    "user": "Joe P.",
    "rating": 5.0,
    "message": "Everything wasfine!"
  },
  {
    "user": "Tina.Simp",
    "rating": 5.0,
    "message": "I was surprised the size is true to fit."
  },
  {
    "user": "SaLLY V",
    "rating": 4.0,
    "message": "Read not wide enough."
  },
  {
    "user": "Robert S. Cox",
    "rating": 5.0,
    "message": "Nice 80's style just like I had in high school. Awesome and well built as always."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The most comfortable sneaker i ever owned"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Son comodos para caminar."
  },
  {
    "user": "Shirl0045",
    "rating": 5.0,
    "message": "Fit as expected. Comfortable and look as shown."
  },
  {
    "user": "Sherenleo",
    "rating": 5.0,
    "message": "It's my son school shoes"
  },
  {
    "user": "Christy Stephens",
    "rating": 4.0,
    "message": "Not the most stylish of shoes, but they worked great for what we needed them for the Rose Bowl Parade and everything else they did out there, he didn't have them broke in either, because there was no time, we got them 2 days before he left for his trip and he didn't have any issues at all with his feet hurting them and he actually stated he likes them and would buy another pair.  He is hard on shoes and they've held up for a few months now so yes these are good walking shoes."
  },
  {
    "user": "John Kuvetakis",
    "rating": 4.0,
    "message": "Ordered these in a size 12 and I could barely get my foot in. I'd suggest going bigger."
  },
  {
    "user": "Carlos Castillo",
    "rating": 5.0,
    "message": "Amazing shoes very confy"
  },
  {
    "user": "Nawa",
    "rating": 5.0,
    "message": "Was worried the sneakers wouldn't fit properly being the first time I ordered footwear online, but was pleasantly surprised they fit true to size. They are the right fit and are very comfortable sneakers"
  },
  {
    "user": "kim milano",
    "rating": 3.0,
    "message": "One split open near toe area not real happy, only lasted about 3 months"
  },
  {
    "user": "Yoselin Sánchez",
    "rating": 4.0,
    "message": ""
  },
  {
    "user": "Orfis",
    "rating": 5.0,
    "message": "I really recommend this"
  },
  {
    "user": "George Unger",
    "rating": 3.0,
    "message": "My bad , ordered Wrong size."
  },
  {
    "user": "George Maceli",
    "rating": 5.0,
    "message": "Great quality, fast delivery good pricing"
  },
  {
    "user": "Scrubs",
    "rating": 5.0,
    "message": "I didn't read the reviews before buying so it might be a hit or miss. Mine were a hit. For me the shoe fit exactly as my pair from eons ago. I know they're not made for great support but are good for me. The width was my major concern and they are neither too snug or too loose. They look good and I have no complaints. Had I known that they were an A+ I would have ordered 2 pair and save some duty money."
  },
  {
    "user": "Robert Honiss",
    "rating": 3.0,
    "message": "I will never get shoes by reebock that are made this way. I am not saying they are bad but for my weight at this time these do not make good walking shoes. I weigh over 400lbs if I use these shoes for walking it wont give the right suppurt for my size. The shoes are good just not for me."
  },
  {
    "user": "joel",
    "rating": 5.0,
    "message": "very comfortable"
  },
  {
    "user": "jazcam",
    "rating": 4.0,
    "message": "Not bad.  I was hoping for a more form fitting inner sole but for my diabetic condition it does provide a nice cushion for my feet."
  },
  {
    "user": "Winston Mitchell",
    "rating": 3.0,
    "message": "I like the brand the narrowness of the front i don't like it fits but too narrow at the front."
  },
  {
    "user": "Ron R.",
    "rating": 4.0,
    "message": "I disliked this small size!!!! I have been having to OVERSIZE!!!! I'm  now going to NEW BALANCE!!!! A Perfect Fit!!!! Ron R"
  },
  {
    "user": "jose miguel ortiz florentino",
    "rating": 4.0,
    "message": "The media could not be loaded. Me agrado"
  },
  {
    "user": "Shayler Y",
    "rating": 3.0,
    "message": "poor quality"
  },
  {
    "user": "bud sutton",
    "rating": 5.0,
    "message": "fits perfect and looks great,,well worth the price very satisfied"
  },
  {
    "user": "Stoliman",
    "rating": 4.0,
    "message": "Only problem is the lack of arch support. I got around this with an off the shelf support made by Dr. Scholl's. The only reason I could use these was the shoe being extra wide."
  },
  {
    "user": "Jack L Williams",
    "rating": 5.0,
    "message": "My feet"
  },
  {
    "user": "Sergio Hernandez",
    "rating": 4.0,
    "message": "Good sneakers"
  },
  {
    "user": "Tomás",
    "rating": 5.0,
    "message": "Excelente compra, a la medida."
  },
  {
    "user": "Hillary w",
    "rating": 4.0,
    "message": "They look good and are decently comfortable, but run small"
  },
  {
    "user": "Carmen",
    "rating": 5.0,
    "message": "Nothing"
  },
  {
    "user": "Kindle Customer",
    "rating": 3.0,
    "message": "First let me say that I like the shoes. I bought a pair about 187 months ago and wore them a lot.  They fit good and were comfortable.  So as they were getting worn, I reordered the exact same thing.  Same size 11 1/2.  When the shoes arrived they were much too small.  I sent them back and got a size 12 which is OK but stilll smaller than my original 11 1/2.  I am writing this because it does not seem that hard for a manufacturer to make sure that the sizing of shoes remains constant.  I assume that the plant that made the shoes changed and they made them shorter to save a dime on materials.  Why can't Rebok just make a cast of a foot that is a certain size and then check production samples to insure that the shoe fits.  This is a quality issue for Rebok that costs them more in returns that they save in shorting the materials. I have included pictures of the size difference between the old shoes and the new ones"
  },
  {
    "user": "Scott",
    "rating": 5.0,
    "message": "Initially a little sloppy but they tightened up as they became more flexible."
  },
  {
    "user": "Mostafa",
    "rating": 2.0,
    "message": "Honestly I have been buying from Amazon for more than ten years and I have never got a product like this. After 4 months one pair of sneakers is open, the other one starts getting opened from the front. I don’t know what to do, I just lost my money for nothing. I need to buy  new ones. I am very disappointed. I will never buy this again and I will advice my friends and people I know not to buy this from Amazon"
  },
  {
    "user": "Norman von Hollen",
    "rating": 4.0,
    "message": "must be labeled wrong not even close to a 12 wide"
  },
  {
    "user": "Angel",
    "rating": 5.0,
    "message": "5 estrellas"
  },
  {
    "user": "Craig canty",
    "rating": 5.0,
    "message": "Glad I got it"
  },
  {
    "user": "Jersey Girl",
    "rating": 5.0,
    "message": "The sneakers are very nice. I purchased them as a gift."
  },
  {
    "user": "PT",
    "rating": 4.0,
    "message": "Bottom line is this RBK Club Memt show white w/blue trim is sporty and comfy for casual walking and has a slightly snug feel in width that might cause those with wide feet to order one shoe-width wider. The uppers are leather and the soles are flat rubber  with ridges for a non-skid surface.  Haven't tested the non-skid surface under wet conditions but the shoes are stable on waxed floors.  The shoes feel a little smaller than the true size but this might be due to the memory foam insert.  I am a 4E size and when I first put my foot in the shoe, it felt like a 2E fit.  I thought they would be uncomfortable but the more steps I took the more comfortable they felt as the foam relaxed in the shoe.  Oddly, they never feel tight after I start walking.  They only feel snug when I first put them on.  It seems that the shoe was constructed to give some arch support via arch indentation/reinforcement but the indentation provides more arch pressure than arch support.  I read reviews that stated the sole felt like you were walking barefoot on the ground.  It appears that RBK added the memory foam to address this problem.  The foam gives reasonable cushion but it's not anywhere near the cushion of your high-end walking and cross-training shoes.  If you view these shoes like you would the popular boat shoes (think cruise ship walking shoes) then these are as good as or better than any of those shoes.  I think the shoe is a solid 4 star shoe."
  },
  {
    "user": "Bobby Decibus",
    "rating": 4.0,
    "message": "Need to order a 1/2 size bigger than typical to get the best fit."
  },
  {
    "user": "doc",
    "rating": 5.0,
    "message": "Fast shipping! Great price and very comfortable. Thanks Amazon"
  },
  {
    "user": "M",
    "rating": 5.0,
    "message": "Literally love these shoes! Needed a pair of plain white sneakers and these have the best shape. They’re a similar feel to the Air Force ones but slimmer which is what i like. Definitely gonna get these shoes in multiple colors"
  },
  {
    "user": "Douglas Bowers",
    "rating": 5.0,
    "message": "So soft and comfortable."
  },
  {
    "user": "Cally",
    "rating": 5.0,
    "message": "Shoes"
  },
  {
    "user": "Phil VanFosson",
    "rating": 5.0,
    "message": "This is just ther shoe i wanted"
  },
  {
    "user": "JN",
    "rating": 4.0,
    "message": "The shoe itself looks really nice. However, the bottom lacks padding which makes your foot feel like there is a layer of thick cardboard between it and the ground, but that can easily be remedied by purchasing cushy inserts for the shoes but if you have large feet, that might reduce the amount of space available for your foot to rest in. Overall, 3/5. Looks fresh and fancy, has lots of shine on a sunny day. ...Just make sure not to wear them on a rainy day."
  },
  {
    "user": "Liron",
    "rating": 5.0,
    "message": "Didn't know what to expect in terms of quality but I was pleasantly surprised. Shoe fits good just get half size bigger.  The quality of the materials is very good and its comfortable to stand on for long periods of time."
  },
  {
    "user": "Cristalina Martínez",
    "rating": 5.0,
    "message": "This is the second time buying these sneakers for my father, but this time they came with what it seems to be some animal hair and other things. 👎🏻"
  },
  {
    "user": "Ronald Badeaux",
    "rating": 5.0,
    "message": "A o k"
  },
  {
    "user": "Antonio G.",
    "rating": 5.0,
    "message": "Cumplieron lo prometido. Gracias"
  },
  {
    "user": "Skillman",
    "rating": 4.0,
    "message": "Been buying this model for many tears now and they seem to be getting lighter and weaker...sent one pair back because sides started ungluing after a few days and this last pair the sole is not very rigid. You can push you thumb into it and the sold gives rather too easily for my liking..."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I wear size 13 shoes and these are the ONLY ones that fit comfortably.  Every other tennis shoe I've tried,  the toe area is too tight, especially Nikes, which I wore up until discovering these about twenty years ago.  The only flaw (which has occurred with every pair of these) is the seam on top near the front comes apart after about a year."
  },
  {
    "user": "dave",
    "rating": 5.0,
    "message": "These are my favorite sneakers. Comfortable, nice looking, and fit as expected. Nice to be back in Reebok."
  },
  {
    "user": "Katalin Kepley",
    "rating": 5.0,
    "message": "Work"
  },
  {
    "user": "PHendricks",
    "rating": 3.0,
    "message": "My last pair of Reeboks fit like a glove after a year. They molded themselves to my feet.  I wore them in public until they started looking ratty, then I wore them for walks and yard work until they started falling apart.  Great sneakers ... loved them.  When they finally had to go in the trash, I bought these MEMTs hoping to have a similar experience. Nope. Come on, Reebok, WHY did you make the soles so thin?  Another 1/8 inch of foam would add what, 50 cents to the price?  The fit is good, and they have started to mold themselves to my feet, but after a year I still feel every little pebble through the soles.  Will not buy again for this reason.  Of all the places to cut manufacturing cost ... the sole is a pretty fundamental aspect of a shoe."
  },
  {
    "user": "Natanael Ramos",
    "rating": 5.0,
    "message": "All was as expected!"
  },
  {
    "user": "Jennifer Sykes",
    "rating": 4.0,
    "message": "Ordered for hubby to wear to work. They wear too snug which is possibly a preference thing but also there was a piece inside that pushed into his foot. At first glance I thought it was just the seem towards the front but after looking closer the seem was actually half an inch further Into the toe. Maybe a manufacturer error but not cool for $50 shoes."
  },
  {
    "user": "Robert Sinko",
    "rating": 5.0,
    "message": "Today is the first day wearing and I am extremely pleased. I have nerve damage with my feet and these sneakers were very comfortable"
  },
  {
    "user": "YULAY22",
    "rating": 4.0,
    "message": "Confortable but need more ventilation on some point after a few hours I feel my feet warm and start sweating making a weird  cheese smell ."
  },
  {
    "user": "JerryB12",
    "rating": 5.0,
    "message": "I’ve worn a pair of these for 12 years. Bought identical pair number for number and couldn’t walk in them. Weird. So I ordered these. They look the same. They’re both size 13 4E. This pair fits perfectly. When I switched between the ones that fit and the ones that hurt, I found that one pair squeezed my left foot and prevented me from using them.  Those were purchased years ago but never used. Both the worn out pair and the ones purchased years ago were made in the same place, Taiwan. These new ones are made in Vietnam. Don’t know if that’s the difference but it could be."
  },
  {
    "user": "Susan",
    "rating": 5.0,
    "message": "These are very comfortable."
  },
  {
    "user": "Chris",
    "rating": 3.0,
    "message": "I am wearing these like dress shoes now. Comfortable and looks good. Tends to squeak on tile floors when I stop fast. The lining you step on is falling apart in the left shoe after only a few times wearing them, but I always change those myself with some Dr Shoules inserts. They have a very flat base and not meant for running or exercise. They seem to be non skid like deck shoes."
  },
  {
    "user": "Jack Akers",
    "rating": 3.0,
    "message": "Shoe looks good, smells vaguely like leather, but when I put it on and took a step I knew.  It feels like I'm walking barefoot on a gravel road.  Is this just a shoe that Reebok wanted to get rid of?  Or a Chinese knock-off that sneaked by Amazon's rigorous quality control program?  Yes, it was the lowest priced Reebok shoe I had found.  Yes, I had $33 to burn.  I'll probably wear them when I'm going somewhere that I can just put my feet up and let people admire my kicks.  But walk from here to there, I'd rather not."
  },
  {
    "user": "ARTURO",
    "rating": 2.0,
    "message": "pensé que por ser reebok serían cómodas, comore 2 pares de este modelo y ambas son de mala calidad, son super delgadas en la parte de la suela, cuando caminas se siente la calle como caminar  descalzo, recomiendo comprar plantillas para usarlas"
  }
]