[
  {
    "user": "Frisco Moses",
    "rating": 5.0,
    "message": "Bought these for treadmill and not disappointed at all.  They are snug when right out of the box but have loosened up after a few miles. They still require sitting down to put them on. They are not loose enough to slide into like a deck shoe, but I like the fit.  They are supportive of my feet and do not ride up and down on my heel. They also have a comfortable amount of toe room. Right out of the box I would recommend thinner socks for the best result. Overall for the money they are hard to beat imho!"
  },
  {
    "user": "G. Orwig",
    "rating": 4.0,
    "message": "These are not \"Slip on\" shoes, they are \"Pull on\" shoes. The first time I put them on I ended up sitting down on the floor and pulling hard on the back straps to get them on. I thought for sure they would be too tight. Once on, they were snug but I decided to walk a mile or two. They were snug, but not bad. Now, after a couple dozen miles they fit fine. The widest area across the ball of my foot is still just a bit snug, but I don't even think about it. My feet do not slip or slide around inside them while walking on pavement or sidewalk, but I don't think they would be very good for trail hiking or serious running since there is no way to adjust them. The size I wear is 8.5 medium width and I ordered the generic 8.5. This shoe would not work well for someone with wide feet.  I am pretty certain that after breaking them in a size 9 would have ended up too loose for me, though. So far there is no sign of wear on the sole or heel and I am surprised since I walk pavement and I tend to wear the outside of my heels very quickly."
  },
  {
    "user": "Richmond Kid",
    "rating": 4.0,
    "message": "I've been looking for a slip-on walking shoe and this seemed like it would fit the bill. I went with the size Amazon recommended and it is about a 1/2 size too small, although it may stretch to fit after wearing. Looks and material were good. It was too small to \"slip-on\" or even pull on without help. I used a boot pull hook on the heel loop and this worked well to pull back and then up. This isn't a running shoe, but should be OK as a walking shoe if you get the proper fit. My experience is get 1/2 size larger."
  },
  {
    "user": "Marc Anderkin",
    "rating": 4.0,
    "message": "I owned a pair of the version right before this one, and really loved them. I wore them pretty much daily. I have back issues so slip on shoes that are actually comfortable and act like shoes are very nice to me. I’ve only had these for about a week so far and I do like them but my feet still take a little bit wearing these, and it may just be because they’re so new. But as far as slip on shoes, just go, these are still some of my favorites."
  },
  {
    "user": "Gee Williams",
    "rating": 4.0,
    "message": "I have purchased three pairs of these Adidas for my 12 year old son. I love the style and he loves the comfort. Since he is very active (a lot of hard playing outside), these are not as durable as I would have liked. He has ended up with a hole in the toe of each pair. I'm giving these shoes 4 stars because they are stylish, comfortable, and were reasonably priced. I would recommend these for older children or those that are not hard on shoes."
  },
  {
    "user": "Wayde J. Prejean",
    "rating": 5.0,
    "message": "So far, I really like these shoes.  They are very comfortable, fit well as expected.  The only thing I don't like as much are the soles / bottom of the shoes.  A little concerned that they might become slippery over time."
  },
  {
    "user": "Shelby",
    "rating": 5.0,
    "message": "I have had a pair similar to these since roughly 2017! I absolutely love them. When my partner began asking for a new pair of shoes I insisted he try these! He absolutely loves them. They are durable and easy to clean."
  },
  {
    "user": "L P",
    "rating": 5.0,
    "message": "My son loves these sneakers. He said they are very roomy, provides a soft cushion and his feet never hurt when he has them on all day. They are too quality sneakers that will last him the whole school year."
  },
  {
    "user": "abc shopper",
    "rating": 4.0,
    "message": "My teenager loves the ones with strings that look just like these, but these are narrow in the toe box and he has narrow feet, but long toes. These soles don't last long playing Basketball on a tennis court. But, affordable. At first tried 1/2 size down bc they seem to get looser in the heel after taking them on/off frequently, then ordered normal size and still uncomfortable due to width. They do look good with shorts, and team sweatpants when not wearing slides. Giving a 3 star for quality since they lose tread on the bottom so quickly. (Box came broken, returns even on prime are slow on these)."
  },
  {
    "user": "Louisianagina",
    "rating": 4.0,
    "message": "My husband was looking for a light comfortable walking/casual athletic shoe. He certainly found it. This shoe is light, comfortable and easy on and off without shoe laces. It's mesh material allow feet to breathe and feet less likely to sweat.  This is a great buy for the features and price."
  },
  {
    "user": "Jake",
    "rating": 4.0,
    "message": "I bought these and my father liked them so a month later for his birthday I bought him a pair. I am almost positive the pair I bought are fakes. The QR code on the inside of the shoe does nothing unlike my fathers, and that takes you to the Adidas website. As well as the soles on mine are completely different, mine are all black that had Adidas text on it but wore off the first day. His are the cloud foam sole. Don’t get me wrong mine still feel great and I had no idea they could’ve been fake until I saw my fathers. As far as mine they fit mostly true to size maybe half a size down but don’t worry they do kinda stretch out so you can get a half a size to small and be fine. Comfort is great and I mostly bought them for work so my feet don’t sweat and they do a great job at that. Ive used them pretty much everyday for 2-3 months and there is a small tear in the side stitching on the inside of the shoe."
  },
  {
    "user": "Jay Dionisio",
    "rating": 5.0,
    "message": "I love that I can just skip this on, no shoe tying! So soft and comfortable. I use this for everything but mostly when I go the DisneyWorld and would be walking all day long."
  },
  {
    "user": "Jay_ATX",
    "rating": 5.0,
    "message": "Great shoe to have by the door so you can quickly slip them on to take the trash out or to run an errand. Also works great on treadmills and indoor/garage workouts. I normally wear Nike Air Max trainers and this is close to the fit/feel without the price tag or weight (yes, these are lighter). While this is a slip on shoe, it is a secure fit once it's on your feet. No fear of it slipping or falling off while running."
  },
  {
    "user": "Yunior Pacheco",
    "rating": 4.0,
    "message": "They are good. But not exactly what I was expecting. They are a little narrower than I thought."
  },
  {
    "user": "Leonid",
    "rating": 5.0,
    "message": "I couldn't believe how lightweight these are. Feels like nothing is on your feet, but, at the same time, very comfortable to walk or run."
  },
  {
    "user": "Zach Thompson",
    "rating": 5.0,
    "message": "These are one of the most comfortable pairs I have ever owned. I have bad back issues from the army and they make things a little easier."
  },
  {
    "user": "Jeff Rickett JD",
    "rating": 5.0,
    "message": "Snug, fit well, love the dark grey, hard color to find from adidas.  Just like all of the Racer Lite 4.0's."
  },
  {
    "user": "Tony Carretti",
    "rating": 5.0,
    "message": "I’m a personal trainer and I use these for work as well as working out. They’re so comfortable and I love the fact that I can simply slip them on and off so easily."
  },
  {
    "user": "AL",
    "rating": 4.0,
    "message": "I love adidas these are definitely the most comfortable and cheapest pair I own. Very good for walking . I own $300 Yeezys but they aren’t as comfortable as these lol"
  },
  {
    "user": "ruben casanova",
    "rating": 5.0,
    "message": "These are my favorite workout shoes. They never mess up my feet and are so light and comfortable"
  },
  {
    "user": "Peggy Lee",
    "rating": 5.0,
    "message": "I bought these for my 16 year old son. He absolutely loves them. The ease of slipping them on is a plus and he loves the look. He wore them on a trip to the ocean and even when they got wet, they dried quickly. Highly recommend these shoes!"
  },
  {
    "user": "michael royce",
    "rating": 4.0,
    "message": "Should have ordered a half size bigger and had to change out the insoles, other than that seems like a quality shoe."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Purchased for my 15 year old. Says they are the most comfortable shoes he's ever had"
  },
  {
    "user": "Jim Greenway",
    "rating": 5.0,
    "message": "Love the slip-on feature and they are very comfortable"
  },
  {
    "user": "Paul B",
    "rating": 4.0,
    "message": "Comfortable light weight running shoe."
  },
  {
    "user": "Michelle Fennell",
    "rating": 5.0,
    "message": "Perfect shoe, has comfort and a great look. Love that you just slip them on. Great for everyday comfort"
  },
  {
    "user": "Nirav",
    "rating": 5.0,
    "message": "Wanted a good pair of shoes for work. I’m a doctor on my feet most of the day so by the end of the day my feet hurt without proper support. I’ve tried all types of shoes, brands, price ranges you name it. I can’t say it enough, these are superior to all other brands I’ve tried- allbirds, rockport, Nike, etc. and at this price point it’s unbeatable."
  },
  {
    "user": "Cheto",
    "rating": 5.0,
    "message": "Cómodo y el color me gustó mucho"
  },
  {
    "user": "Debbie",
    "rating": 5.0,
    "message": "My grandson only wears addis shoes and he loves them."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Bought for my grandson  he loves them !!"
  },
  {
    "user": "tom",
    "rating": 4.0,
    "message": "If you are on the chunky side of life, you will not get these on your feet."
  },
  {
    "user": "David Sandstrom",
    "rating": 5.0,
    "message": "They are a great shoe for the office. I work in IT and run around the entire facility all day long helping everyone with their computers and needed a shoe to hold up to the task. Well done."
  },
  {
    "user": "Brandon",
    "rating": 4.0,
    "message": "The tread of these shoes don’t last only a few months if that. I am constantly having to buy more or else the shoes become very slick when walking. Great sneaker otherwise and super comfortable."
  },
  {
    "user": "Ruben Cordeiro",
    "rating": 5.0,
    "message": "Not bad"
  },
  {
    "user": "Joel",
    "rating": 5.0,
    "message": "These slip on sneakers fit perfect and are really comfortable.. I don’t believe they are intended for running, although I have run in them and they worked great"
  },
  {
    "user": "T. D.",
    "rating": 4.0,
    "message": "Comfortable and light weight but runs 1/2 size small.  So if you wear a 9 1/2 shoe, order a size 10."
  },
  {
    "user": "Peter Suppa",
    "rating": 5.0,
    "message": "Fits great, very comfortable. Just bought a 2nd pair"
  },
  {
    "user": "phillip sears",
    "rating": 5.0,
    "message": "These shoes are quite comfortable and light. They are a fraction of the cost of some other companies but are high quality"
  },
  {
    "user": "Christopher",
    "rating": 5.0,
    "message": "Best shoes for the price."
  },
  {
    "user": "GLavah",
    "rating": 5.0,
    "message": "I bought these shoes for my husband, and he has since requested another pair...they are that comfortable. The fit and the wear... EXCELLENT!"
  },
  {
    "user": "Jim S.",
    "rating": 5.0,
    "message": "These are great lite SLIP ON shoes with substantial soles and support. I ordered my usual size and find them a hair on the snug side."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "Great shoe. Fits great and looks great! True to size."
  },
  {
    "user": "Shawn",
    "rating": 5.0,
    "message": "These shoes are soft and great for running. They fit snuggly on my feet. The best thing is no laces saves a lot of time."
  },
  {
    "user": "Andres castaneda",
    "rating": 5.0,
    "message": "Para hacer ejercicio 💪"
  },
  {
    "user": "Corey T. Williams",
    "rating": 5.0,
    "message": "Easy enough to put on and stays on. It starts off a little tight but that goes away after use."
  },
  {
    "user": "Chet Cessford",
    "rating": 4.0,
    "message": "Great shoe, wore out to fast"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "We go through shoes every six months due to growing foot. So far these have held up and are comfortable"
  },
  {
    "user": "elvio barreto de melo filho",
    "rating": 5.0,
    "message": "the product is very good."
  },
  {
    "user": "D",
    "rating": 4.0,
    "message": "Decent set of Adidas. Nice comfortable shoes. The only thing I don't like is the big Adidas name at the top. Its just way too big. Price at Amazon is unmatchable. Awesome great price."
  },
  {
    "user": "Laura",
    "rating": 4.0,
    "message": "Go 1/2 size up.  Size 12 purchase 12-1/2"
  },
  {
    "user": "T-Man",
    "rating": 4.0,
    "message": "Cheapest pair of Adidas I was able to find. They're thin, and don't have the support one needs for everyday running. They're ok if you just want something to use around a gym, look alright, easy to put on and take off. Overall the quality of these match the price."
  },
  {
    "user": "Michael",
    "rating": 4.0,
    "message": "As a door knocker, I walk 10-15 miles a day 6 days a week. These shoes lasted me a good 3 months of this kind of use, but they are very worn down now. Not bad for the price but if you want them to last many miles of use buy a different pair. Pretty good quality though overall. 7.5/10 durability. 9/10 looks. 10/10 price to product ratio."
  },
  {
    "user": "Meli",
    "rating": 4.0,
    "message": "I've had to buy two of these in only a few months for my teen. Style and comfort are great but the front end of the soles wear down rather quickly."
  },
  {
    "user": "Rick b",
    "rating": 4.0,
    "message": "Yes had a pair wore them out started using them for yard work so wanted a new pair here u have it lol"
  },
  {
    "user": "Pattongb",
    "rating": 5.0,
    "message": "At a residential treatment center and unfortunetely arrived with just my sandals.  We do a lot of walking here so the sandals werent cutting it.  Ordered these off Amazon, ive always had good luck with Addida products and was suprised at the low price on these.  They came in 2 days and immedietely caught my eye how cool they look.  Very stylish.  They are slip in and off which was important to me.  I have had the shoes 3 days now and I can honestly say im amazed at how quickly they broke in, and how comfortable they are.  The stitching seems very strong and they look like they can stand up for a long time.  For the price im very satisfied."
  },
  {
    "user": "Erica A.",
    "rating": 5.0,
    "message": "Perfect"
  },
  {
    "user": "lilroc513",
    "rating": 5.0,
    "message": "Easy to put on. Constructed well and comfortable. My 18 year old son loves them."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Comfortable and fit as expected. Shoe was on sale at a good price."
  },
  {
    "user": "Darryl Teachey",
    "rating": 5.0,
    "message": "Awesome shoe, thought it was flimsy at first but realized that I was wrong about it and that it was actually the lightest shoe I've ever bought and they are great and super comfortable, love them !!! 😀"
  },
  {
    "user": "Ana Carril",
    "rating": 4.0,
    "message": "Es ligero"
  },
  {
    "user": "Payton",
    "rating": 5.0,
    "message": "I am very satisfied with these shoes as a versatile gym + walking shoe. I bought them with the intention that I could wear them out with casual clothing. There is very little tread on the bottom and you can see from the photo that the bottom wore out and got dirty from one or two walks on asphalt. I’ve had them for a while now and have begun wearing them to the gym because they are lightweight, comfortable, and flat. I am able to squat, leg press, and do any other lift without any discomfort or fear of losing balance. I’ve had no issues with these shoes except that I keep spilling my coffee on them. I do habitually drink a lot of coffee, but I make it my business not to spill coffee all over myself. Despite this, in the last couple weeks I have spilled coffee on myself three times and each time it has landed directly on these shoes. Last week my girlfriend split her coffee on her own Adidas (a different pair) and I think this is suspicious. If it happens again I will be looking for Adidas to address these concerns. Otherwise, great shoe."
  },
  {
    "user": "Jillianne V.",
    "rating": 5.0,
    "message": "My son loves these and has them in two colors. Easy to pull on and off and very light weight. He wears them all day through school and PE and says they are very comfortable."
  },
  {
    "user": "Jeremy McDaniel",
    "rating": 5.0,
    "message": "Love these, love almost everything Adidas. These are great for workouts or casual strolls. Don't wear in the rain, the inner layer is water resistant for a splash or two but in consistent rain your feet will get wet and smell like doodoo."
  },
  {
    "user": "Mom to 3 boys",
    "rating": 5.0,
    "message": "These are my kids and husband's favorite shoes.  They love that you can slip into them so easily.  I literally have bought at least 12 pairs between my 3 sons and hubby.  One kid needs wide which are a little harder to find, but they are their favorite shoes ever. True to size. Hold up well until they grow out of them or turn into mowing shoes lol."
  },
  {
    "user": "donesha allen",
    "rating": 5.0,
    "message": "Very durable for my 15 year old"
  },
  {
    "user": "Craig",
    "rating": 5.0,
    "message": "Comfy"
  },
  {
    "user": "Dean",
    "rating": 5.0,
    "message": "My son seems to enjoy these shoes. They fit well. I hope they will last awhile."
  },
  {
    "user": "Karla B.",
    "rating": 5.0,
    "message": "Ordered a few styles similar to this for my son. This is the only one that didn't feel too big for him. Runs true to size. He's also flat footed and they work well for him."
  },
  {
    "user": "Dylan",
    "rating": 5.0,
    "message": "Shoes to wide for my feet so standing for a long time gets uncomfortable but other than that they are great super light weight"
  },
  {
    "user": "iog002",
    "rating": 5.0,
    "message": "Lovely"
  },
  {
    "user": "Emad Uddin",
    "rating": 5.0,
    "message": "I love the overall design and quality."
  },
  {
    "user": "steph",
    "rating": 4.0,
    "message": "These lasted about two or three months for my teens. They are rough with their shoes, however and still like the way they feel."
  },
  {
    "user": "N",
    "rating": 5.0,
    "message": "What can I say? I really like mesh cloudfoam Adidas sneakers. I decided I wanted to try a pair of slip ons this time. The mesh lets one’s feet aerate, so they don’t get too soggy. Not something I’d want to wear while hiking, but running on pavement, this is what I want. If I step in a puddle, the moisture will wick and my socks will dry out over the day, unlike with non-pourous shoes. The cloudfoam soles are super comfortable, although I wish they could hold their spring longer. The shoes are difficult to slip on at first, but after a couple days of wearing, they’ll slip on easy, but not so easy that they slip off while running. Great shoes; I get lots of compliments."
  },
  {
    "user": "bryan fineberg",
    "rating": 4.0,
    "message": "quality product"
  },
  {
    "user": "Sam E.",
    "rating": 4.0,
    "message": "Great shoes for work"
  },
  {
    "user": "Jeremy",
    "rating": 4.0,
    "message": "I like them"
  },
  {
    "user": "Felicia",
    "rating": 5.0,
    "message": "Husband really loved these. Very comfortable and fashionable."
  },
  {
    "user": "vanessa",
    "rating": 5.0,
    "message": "I'm very happy with this purchase. They had the size my son needs and I didn't have to look all over town to find it. They arrived and fit him perfectly. Thank you"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "So my left ankle is stiff and hard (wish I could say the same for my wiener) from years of sprains and twists but walk ten miles a day for my geezer exercise routine.  Tried these Adidas slip ons and even though it’s low cut, I found very strong ankle support and no pain while I’m walking.  First fit may be tight if you have wide feet but stretches out for a great fit.  So I strongly recommend this Lite Racer!"
  },
  {
    "user": "Brian L.",
    "rating": 5.0,
    "message": "This shoes are good slip on.works well also if  you have norrow ankles dont slide up and down on ankles"
  },
  {
    "user": "The Dude",
    "rating": 5.0,
    "message": "I bought these because tying my shoes has become difficult due to health issues. They fit great and are very comfortable. They are true to size. Would recommend"
  },
  {
    "user": "G Vargas",
    "rating": 5.0,
    "message": "Comfortable"
  },
  {
    "user": "ElSamito",
    "rating": 5.0,
    "message": "I wear them almost daily for walking, feel comfortable, light, yet feel sturdy and feel secure when i walk( niot slippery). My feet dont tire quickly."
  },
  {
    "user": "Carlos uralde",
    "rating": 4.0,
    "message": "Me agrado  normal ,no para volver a comprar."
  },
  {
    "user": "Maggie",
    "rating": 5.0,
    "message": "Amazingly comfortable"
  },
  {
    "user": "Mona",
    "rating": 4.0,
    "message": "My son loves slip ons"
  },
  {
    "user": "Arch Stanton",
    "rating": 5.0,
    "message": "Order a half size larger than your usual shoe size."
  },
  {
    "user": "ZAMYORKER",
    "rating": 4.0,
    "message": "Love these kicks. I wear them for my commute for that extra pep in my step then would wear my dress shoes once at the office. They fit into my work and casual fashion. I am using my first pair 100% for work outs this is why I got a second pair. Hope the colors become available was looking to get the red pair or the gray pair but these colors where not available. Overall perfect fit, great price and comfortable padding perfect to make you feel like floating 🙈👍🏿"
  },
  {
    "user": "KK Franks",
    "rating": 5.0,
    "message": "Fit is comfortable but secure.  Good for walking or running.  Perfect weekend shoes for me!"
  },
  {
    "user": "Las Vegas Stevo",
    "rating": 4.0,
    "message": "I love the shoe I love the company I love the light weight but, the shoe is very loose fitting in the toe area it’s not made for a hard hard landing such as running. These are great for around the house and walking around when you’re in a hurry because they have no laces. If you’re not going anywhere where you need to extend a lot of exercise on the shoes it is perfect. I would stay away from the shoe if you are a runner but if you are relax retiree such as myself please these are the best around the house around the retiree village shoe you can buy and look fashionable."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great shoe for price. This are comfortable and really like that they are slip ons. You will need to buy a smaller than normal size. They will be tighter than the lite racer 3.0’s but I’m a good way for working out and not feeling like they will slip off. I am normally a 10.5 men’s shoe size in adidas and wear a 9.5 in these."
  },
  {
    "user": "Bobo",
    "rating": 5.0,
    "message": "Shoes are very lightweight and comfortable to walk around in. After having surgery I needed a shoe that went on easily and these shoes were perfect for walking/therapy.  Bought another pair to have one held back, will definitely buy more adidas shoes to try after purchasing these."
  },
  {
    "user": "Kenny",
    "rating": 3.0,
    "message": "I have had these long enough now where I feel I can give a honest opinion. First off in my opinion I think you should size up a half a size. I wear size 12 and they fit a little tight. They are not uncomfortable or anything but just a little tight. The shoe is incredibly light and they look very good. Got several compliments of how good they look. Definitely not for everyday usage. I like the shoe but I just dont love them. Wont be returning them or anything but this is not a shoe I would purchase again."
  },
  {
    "user": "Kitty",
    "rating": 5.0,
    "message": "86 year old hubby loves these shoes!"
  },
  {
    "user": "Bayron Molina",
    "rating": 5.0,
    "message": "Muy suaves y cómodos,ligeros,siento como les entra el aire ,son muy frecos"
  },
  {
    "user": "Jenny",
    "rating": 5.0,
    "message": "Kiddo wears these to school on warm days and loves that he can do physical activities in them as well as wear just an every day show."
  },
  {
    "user": "Luis Alberto Silva crisanto",
    "rating": 5.0,
    "message": "Los uso para trabajar y son muy cómodos no se cansa el pie la medida de la talla es justa esperemos a ver la durabilidad"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These are my favorite pair of shoes for workouts and runs. Fit great, comfortable, easy to put on/take off, and look good too. The one thing I'll say is that I had a pair of these previously, and decided to get a new pair since I wore the other ones out. These have a different material for the inside sole than the last one, which adds more friction to it when you try to slide them on. It smooths out after a while, but it just means that you'll have break in the shoes for a bit."
  },
  {
    "user": "honglanzou",
    "rating": 5.0,
    "message": "I bought for my son，it is comfortable"
  },
  {
    "user": "Jean Launay",
    "rating": 4.0,
    "message": "Muy bueno."
  },
  {
    "user": "Cathy Heminitz",
    "rating": 5.0,
    "message": "The price was great!"
  },
  {
    "user": "Alexander",
    "rating": 4.0,
    "message": "If you have a wider foot than average you should either get a bigger size than what you would of gotten or a dif shoe"
  },
  {
    "user": "sean wilson",
    "rating": 4.0,
    "message": "Love the looks and ease of putting them on. There is not a lot of cushion. After a few days it feels like I have 2x4's strapped on my feet and I have to break out the Nike Airs."
  },
  {
    "user": "Asbe25",
    "rating": 3.0,
    "message": "My son has worn this style of shoe for several years. We bought this pair to replace his old worn out pair and move up a half a size. These shoes had a new insole design with an exposed solid foam construction instead of the insoles in previous  shoes that were covered with fabric. The foam insoles tore about a week in and had to be replaced. In a A second pair of shoes the insoles tore the second day they were worn! The foam insoles also broke to pieces when I tried to remove them and left bits stuck to the adhesive that had to be scraped off. The old version of the insoles were worn over a year with no problems or replacements necessary. Still love the style and ease of the shoe, but they need to go back to the old insoles."
  },
  {
    "user": "Jaime Cruz",
    "rating": 4.0,
    "message": "Fit well"
  },
  {
    "user": "Demetryil Watts",
    "rating": 5.0,
    "message": "These shoes and super LIGHTWEIGHT and COMFORTABLE ! They were delivered in perfect timing as well. 5 stars indeed!"
  },
  {
    "user": "Eriq Lanigan",
    "rating": 4.0,
    "message": "Like that they are easy to put on and comfortable"
  },
  {
    "user": "Nisa E.",
    "rating": 5.0,
    "message": "Great product and savings! Almost paid double at retail store! This is the perfect shoe no lace"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "These on the outside look exactly like the adidas I bought last year besides the color. They had cloud foam. Currently the pair I bought in store, despite being worn out are more comfortable to wear than these that I ordered new. A little disappointed because they look awesome. They work fine and obviously it’s a shoe. Disappointed in the lack of cloud foam. A little tight for wider feet as well."
  },
  {
    "user": "Alec",
    "rating": 4.0,
    "message": "Fits uncomfortably tight, great for an 1-2 hours but after than my feet start to hurt from being sneezed by the top strap. I ordered my normal size and never had this issue before."
  },
  {
    "user": "Garret Ireland",
    "rating": 4.0,
    "message": "A bit narrow...I dont have wide feet either otherwise no other isses."
  },
  {
    "user": "Colin",
    "rating": 4.0,
    "message": "Very comfortable, only issue is foot slides forward and gets cramped in the toe. Even when first putting on is tight in the toe."
  },
  {
    "user": "Marianny García",
    "rating": 5.0,
    "message": "Súper cómodos! Los recomiendo 💯%"
  },
  {
    "user": "Manuela I. Fogarty V.",
    "rating": 5.0,
    "message": "Bought these as I cant get sneakers my size locally and so far adidas does not dissappoint. Soles have solid grip event on wet or oily sidewalks from daily commute, material is breathable and light."
  },
  {
    "user": "Steve",
    "rating": 4.0,
    "message": "Light, comfortable, and good for workouts, walking, or just casual wear.  I do find with all sneakers that I need to use inserts for arch support and these are no exception.  I bought the Currex arch supports which work great."
  },
  {
    "user": "Kim Hobart",
    "rating": 5.0,
    "message": "They are very comfortable without socks."
  },
  {
    "user": "Mike M.",
    "rating": 4.0,
    "message": "Great shoe, comfortable, durable.. however the white finish.. get dirty..instantly.  (before wearing I sprayed a protective coat).. but.. day 3.. looking pretty dirty..  but that's my fault.. will go with the black pair next time!"
  },
  {
    "user": "BABS",
    "rating": 5.0,
    "message": "My grandson loves these sneaks because they are quick and easy to put on and take off. They are really comfortable around the house. (He wears them more than slippers.)"
  },
  {
    "user": "Anthony Quinzio",
    "rating": 3.0,
    "message": "It was a nice product, but it's not made for older men"
  },
  {
    "user": "Orlando C.",
    "rating": 3.0,
    "message": "I ordered the right size but my feet are wide and these shoes are perfect for people with long narrow feet. So it's a little tight on me, and when i start running they heat up really faster than my old running shoes and pain my feet. Better for weight lifting in the gym than running."
  },
  {
    "user": "Reese Bryan",
    "rating": 5.0,
    "message": "I needed something simply and light for massage therapy school. Amazing!"
  },
  {
    "user": "akash gupta",
    "rating": 5.0,
    "message": "Comfort on point while running. I use them daily for workout and been months so far all good. Would recommend"
  },
  {
    "user": "Kasi TheUnPooperPickerUpper",
    "rating": 5.0,
    "message": "The shoes are great I’m on my feet a lot at work and I will definitely be buying me another pair"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Excellent for traveling"
  },
  {
    "user": "stephanie burgos",
    "rating": 5.0,
    "message": "He plays sports with them and he loves addidas period. He loves this shoe"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Comodidad"
  },
  {
    "user": "Ristom G",
    "rating": 4.0,
    "message": "For the price it is fair but not smooth as I expected. For walk it is fine not that good for running"
  },
  {
    "user": "Johanna Olson",
    "rating": 5.0,
    "message": "Easy to slip on, my middle schooler is happy."
  },
  {
    "user": "Sonni",
    "rating": 5.0,
    "message": "Good shoes"
  },
  {
    "user": "jdaileyjr",
    "rating": 5.0,
    "message": "These gym shoes are now my ONLY AIRPORT shoes.  They are extremely comfortable.  I wear them to workout and walk. My son in-law buys these all the time to run in. My daughter runs also and they both have a pair. This shoe has to be amazing if a man whose 6'2 and a size 17 buys them every 6 months.  He runs about 50 miles a month. Awesome shoes."
  },
  {
    "user": "Zander Borash",
    "rating": 5.0,
    "message": "I didn’t realize until I got them that they were laceless, But they fit really good and Im actually really happy with them, I got size 10.5 and they fit absolutely perfect, I am very happy with these shoes and they look really nice as well!"
  },
  {
    "user": "Cj Singh",
    "rating": 5.0,
    "message": "worth every penny my 3rd pair"
  },
  {
    "user": "Christy",
    "rating": 5.0,
    "message": "I bought for my husband and he loved"
  },
  {
    "user": "KBatch",
    "rating": 5.0,
    "message": "The price was great , I couldn’t pass them up even though my son didn’t need new sneakers. I don’t even bother buying any sneakers with laces anymore. They are nice looking shoes"
  },
  {
    "user": "Fabio M. Álvarez",
    "rating": 5.0,
    "message": "Me gustó el estilo, pero me quedaron más pequeños de lo que esperaba"
  },
  {
    "user": "Armani AKWA",
    "rating": 4.0,
    "message": "Adidas make a good product and I enjoy it"
  },
  {
    "user": "John Shelhart",
    "rating": 5.0,
    "message": "Nice"
  },
  {
    "user": "cody",
    "rating": 5.0,
    "message": "Good shoe, does what it needs to do. Insert that was included is terrible definitely recommend getting inserts that are better."
  },
  {
    "user": "Book worm",
    "rating": 5.0,
    "message": "Confort and stylish!"
  },
  {
    "user": "Claudia",
    "rating": 5.0,
    "message": "My husband wears them and he like how they feels"
  },
  {
    "user": "Paul Walker",
    "rating": 3.0,
    "message": "These shoes are narrow and extremely uncomfortable. Sorry. Not a keeper"
  },
  {
    "user": "Jhue Backus",
    "rating": 5.0,
    "message": "that I've tried. I have three pairs!!"
  },
  {
    "user": "SGM Grady",
    "rating": 3.0,
    "message": "This shoe has a different sizing than the ones that I purchased in a Adidas store"
  },
  {
    "user": "Pamela",
    "rating": 5.0,
    "message": "We have ordered these for several Years. They hold up well. Great sneaker"
  },
  {
    "user": "Jimmy Roberts",
    "rating": 3.0,
    "message": "Too tight. Other than that they are pretty cool"
  },
  {
    "user": "Mom to 2 boys",
    "rating": 3.0,
    "message": "Love this style of shoe. I was so happy to buy a second pair. I ordered an 8.5 to fit just right. Received my shoes in a couple of days. They looked big. I put them on and I knew something was wrong. The size on the inside says 8.5. They look more like a 10.5. I would order another pair but am not sure I want to go through the same issue.  Maybe I can give them away."
  },
  {
    "user": "C. Harbin",
    "rating": 5.0,
    "message": "Very lightweight and super comfortable!"
  },
  {
    "user": "Christopher Presley",
    "rating": 5.0,
    "message": "I purchased these to use at the gym. They're great for that but so comfortable that I've been wearing them everywhere.  I'll be ordering more."
  },
  {
    "user": "Brian K",
    "rating": 4.0,
    "message": "Should have order next size up"
  },
  {
    "user": "Kevin",
    "rating": 3.0,
    "message": "Harsh review but for a reason. These shoes for the past 2 months have caused me so much pain. The shoes weren’t made as the exact size for both shoes that I ordered and it started to make me have balance issues. I can’t ever recommend this"
  },
  {
    "user": "PaulM",
    "rating": 4.0,
    "message": "They are as desired. Lightweight and affordable. Personally I like the way they feel and look."
  },
  {
    "user": "Ryan Welch",
    "rating": 5.0,
    "message": "These shoes are like walking on a cloud the spring to the step and the comfort are the best feeling shoe I have ever worn."
  },
  {
    "user": "nixy87",
    "rating": 5.0,
    "message": "Just like buying them in the store. But way less peoplely."
  },
  {
    "user": "TheReader",
    "rating": 5.0,
    "message": "Comfortable, good looking shoes."
  },
  {
    "user": "John",
    "rating": 5.0,
    "message": "i saw thesese shoes locally at adidas outlet mall but colors were limited.  glad i searched amazon and found this color.  price was better than the outlet mall.  super happy with purchase. wear this shoe daily and its very comfortable."
  },
  {
    "user": "Billie Jo",
    "rating": 5.0,
    "message": "These are breathable and comfortable. My son loves these.."
  },
  {
    "user": "Stephanie Antunez",
    "rating": 5.0,
    "message": "Son loved them"
  },
  {
    "user": "Theron L",
    "rating": 4.0,
    "message": "I love these lite racers but my only knock as long as they should. These aren't made for long walks, running or to exercise in because the soles do eat up fast. They're made for casual purposes only"
  },
  {
    "user": "Kevin Reynolds",
    "rating": 4.0,
    "message": "Runs small"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "These are at least 2 sizes too small! Had to send them back"
  },
  {
    "user": "Dan",
    "rating": 4.0,
    "message": "I like that this is made from partially recycled materials. The fit is very comfortable and they look great. I got the grey ones with the blue Adidas logo strap. My one critique is that the tread wears out fast, even when just walking around on the sidewalk for a week. My experience hasn't been as bad as another reviewer, but I also haven't taken them out running yet. I expect they wouldn't last long if I did. Thankfully I found a good price - almost 50% off - here on Amazon."
  },
  {
    "user": "X Méndez",
    "rating": 4.0,
    "message": "Zapato cómodo"
  },
  {
    "user": "Ethan",
    "rating": 5.0,
    "message": "I bought these shoes because I just needed a new pair for work, I bought these because I liked how they looked and adidas is a good brand lol. and they were totally worth the money, I'm on my feet for 8 hours a day everyday and these shoes are my go to now, I didn't need to put in new insoles or anything and they are already more comfortable than any of my other shoes, and I haven't gotten a single blister from them which was a pretty big issue before. 10/10 get them they are worth it"
  },
  {
    "user": "BARRYfromBOSTON",
    "rating": 3.0,
    "message": "You hear “cloud comfort”, “Adidas” and “walking shoe”, and you might think (as I did) this would be the perfect shoe for my 5-8 mile walks, every day. They fit perfectly; they’re soft as a cloud. Unfortunately, after the dirst time I got home from a 5 mile walk, my feet absolutely ached. Not i. The way that a shoe that is too narrow or doesn’t have a wide enough toe box. Just general ache through the feet. Next day, same. Day after, same. Day after, processed the return."
  },
  {
    "user": "MADGUNS FOREVER",
    "rating": 3.0,
    "message": "I like this shoe, first time buyer. However, as has been said, it does run small, so I would suggest buying a half-size up.  I wear an 11, but will be returning this for an 11-1/2.  Looking forward to wearing this shoe."
  },
  {
    "user": "ben harrison",
    "rating": 4.0,
    "message": "I don’t run so I can’t review that part, but for walking/wearing all day I like these. I want to order more and will soon. Just need to add inserts for my flat feet"
  },
  {
    "user": "Jay L",
    "rating": 3.0,
    "message": "Had these for a few weeks and they are already wearing out on the bottom after using them 3-5 days over the last 3 weeks. Comfortable but not a sustainable sneaker."
  },
  {
    "user": "Eric Ramos",
    "rating": 5.0,
    "message": "Normally you go half size bigger for running shoes. These run a half size bigger so just get the same size you would for normal sneakers. They feel great for budget running shoes. I went for my first run in them today and they’re similar to my old brooks"
  },
  {
    "user": "D. Nuskey",
    "rating": 5.0,
    "message": "Super light weight, they look good and they last. This is my second pair."
  },
  {
    "user": "Jacob",
    "rating": 3.0,
    "message": "They are extremely light and pretty comfortable. Only problem is I have flat and wide weed. So after a few hours at work my feet started to hurt wearing these. But if you’re only wearing them for a couple hours at the gym or something they are pretty great"
  },
  {
    "user": "Anna",
    "rating": 4.0,
    "message": "These are definitely on the narrower side of shoes I’ve received from adidas. They’re comfortable enough once you get them on but they definitely need a lot of breaking in. These were rather long compared to other shoes I’ve bought from them so it’s a bit awkward to have all that extra tow room. I’ll wear them, but probably wouldn’t buy another pair."
  },
  {
    "user": "charlotte brown",
    "rating": 5.0,
    "message": "This our 4th pair and it’s amazing, my son lives these for school and for when we head to Disney parks, this brand and design recharges your feet all day"
  },
  {
    "user": "claudia",
    "rating": 5.0,
    "message": "Good Quality,  Good price"
  },
  {
    "user": "ProfAHK",
    "rating": 4.0,
    "message": "Kind if a fake soul - more like plastic than rubber. Not bad if only walking in them."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Narrow footprint and not much flex in the construction. Which is spot on IF you order the right size."
  },
  {
    "user": "Spence",
    "rating": 5.0,
    "message": "Was concerned about the lack of shoelaces but the shoe fit really well and there weren’t any issues there"
  },
  {
    "user": "Christy B.",
    "rating": 5.0,
    "message": "Super comfortable, lightweight and easy to slip on."
  },
  {
    "user": "JRW",
    "rating": 5.0,
    "message": "Wear them for work.... So far so good ***Update*** These have been really comfortable work shoes for the medical field. I think I'm going to order me another pair to start wearing for work and using these for house shoes. Perfect house shoes for someone that doesn't realize they are old like me, or doesn't want to look old... lol"
  },
  {
    "user": "Jeffrey Osborne",
    "rating": 5.0,
    "message": "They look awesome and no more fooling with pesky laces. The fit perfect my feet and knees are no longer sore from inferior footwear"
  },
  {
    "user": "Joshua",
    "rating": 5.0,
    "message": "My father loves these, they were a little tight at first, but after breaking them in they are his go-to shoes."
  },
  {
    "user": "Ashlyn rego",
    "rating": 4.0,
    "message": "I brought for my bf and it good Thank you recommend this"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Ordered the same shoe as I had before because I loved them.  This pair came and were very tight, seemed to be seconds or something.  Very disappointed in the quality, size and workmanship"
  },
  {
    "user": "Chip Larsen",
    "rating": 5.0,
    "message": "Little stiff with putting them on initially, but very comfortable all day"
  },
  {
    "user": "Tonja Mason",
    "rating": 5.0,
    "message": "These Adidas slip on sneakers are awesome! They are very comfortable and the material allows your feet to breathe. I got them today and took a walk. My feet felt great after the walk."
  },
  {
    "user": "Ramiro",
    "rating": 5.0,
    "message": "good design, fit perfectly"
  },
  {
    "user": "Travis Moore",
    "rating": 5.0,
    "message": "These are good shoes. If you like good shoes, get these good shoes."
  },
  {
    "user": "OON7",
    "rating": 3.0,
    "message": "I have a few different colors and they fit great, except for these black ones. They are very tight, hoping they stretch out a bit."
  },
  {
    "user": "Luz Porras",
    "rating": 5.0,
    "message": "Back to school"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Got for grandson good fit"
  },
  {
    "user": "Edward",
    "rating": 4.0,
    "message": "They are kinda bulky so they don’t fit all outfits."
  },
  {
    "user": "lucas aviles",
    "rating": 5.0,
    "message": "Todo ok"
  },
  {
    "user": "Ryan White",
    "rating": 4.0,
    "message": "The media could not be loaded. Excellent choice"
  },
  {
    "user": "d wedge",
    "rating": 4.0,
    "message": "Just was too small and too narrow for"
  },
  {
    "user": "Michael Carlile",
    "rating": 4.0,
    "message": "I bought one pair of these shoes and really liked them so I bought a second pair.  Both are the same size, but the newer pair is much tighter than the other pair. Part of the reason I bought these was because of the marketing around their \"ocean plastic\" and other green materials.  I can't speak to the truth of these claims, but being that my primary concern is to reduce my impact on the environment, instead of sending them back I will endeavor to use these shoes and hopefully they'll stretch out.  The other pair didn't seem to stretch to a new normal but they were the right size to begin with so, time will tell."
  },
  {
    "user": "Lillie B.H. Joplin",
    "rating": 5.0,
    "message": "Great shoes! Very comfortable and slip on nice and easy. I am buying a second pair...! Note, these are not waterproof but they dry fairly quickly."
  },
  {
    "user": "KelLo",
    "rating": 3.0,
    "message": "I ordered these for my 11-year old because they are his favorite shoes. He's had several pairs that we've purchased locally. He insisted that the ones I ordered him from azon were a different quality than the ones from the store. He said they fit different, as well. We sent them back."
  },
  {
    "user": "Ian Campbell",
    "rating": 5.0,
    "message": "I love these shoes. I wanted a slip on sneaker that was light and fast to put on. These fit the bill. I have running sneakers that I love and wanted just a relaxed fit sneaker that wasn’t too tight to the foot and still soft and cushioned. Perfect for leaving by the door to run out of the house or for everyday use."
  },
  {
    "user": "Patrick Routt",
    "rating": 5.0,
    "message": "Fantastic"
  },
  {
    "user": "Witchelle",
    "rating": 4.0,
    "message": "I love the shoes. It’s just very tight the first wear. Go 1/2 size up if you have to."
  },
  {
    "user": "Sierra Pace",
    "rating": 5.0,
    "message": "Adidas always produces an excellent quality shoe but this cloud form she was really great my husband is a runner and he often times has issues with traction and support for his arches with his shoe decisions but this one really shines through all the way"
  },
  {
    "user": "Jesus Alvarez",
    "rating": 5.0,
    "message": "Walking shoe"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love these things.  Light weight and comfortable. No support for the arch but I wear Spencos for my arches anyway. With that combination, these are the greatest shows. At $45 I can buy a new pair every 6 months and still save money. With the color selection, I can afford to have a pair for any day."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Mostly comfortable, very light weight, downside is without laces they hold to your foot loosely, and if youre on your feet for an extended amount of time theyre not the most comfortable. Good buy for certain circumstances"
  },
  {
    "user": "Adria Rainwater",
    "rating": 3.0,
    "message": "My teenager loves these slip on shoes as they are easy, but the tread started to wear down in about 3 months. The insoles deteriorated and the sole started to pull away in about the same time. The shoes were never washed or majorly wet. Do not recommend for active kids for every day wear."
  },
  {
    "user": "MonkeyRBD",
    "rating": 4.0,
    "message": "Not that great feeling as far as a light shoe. It feels cheap. This is used for small trips anyway but I wouldn’t get caught dead in these shoes for a long period of time. Cushion kind of sucks."
  },
  {
    "user": "Pen Name",
    "rating": 5.0,
    "message": "My son loves these shoes. Easy to slip on and very comfortable. The wear out quickly, but with my son's growing feet it doesn't matter to us. If you are hard on shoes and your feet have stopped growing these may not be for you."
  },
  {
    "user": "Matthew",
    "rating": 5.0,
    "message": "Sneakers are light and comfortable. Worth every penny. I would buy again in different colors. My buddy here likes them too!"
  },
  {
    "user": "Adrock",
    "rating": 3.0,
    "message": "Really nice shoe and comfortable. Feels more like a slipper than a running or tennis shoe. Great on flat ground. But on a gravel road or any uneven ground you feel it. To the point it’s painful. Not recommend for anything but leisure activities."
  },
  {
    "user": "James S.",
    "rating": 4.0,
    "message": "Tight at pinky toe but loosens up."
  },
  {
    "user": "Year062",
    "rating": 4.0,
    "message": "Fit as expected and comfortable for walking"
  },
  {
    "user": "Goldwing48",
    "rating": 4.0,
    "message": "I ordered the wrong shoe type. HOWEVER, the vendor was ABSOLUTELY the BEST EVER! They resolved my problem with speed and grace. Try them...You will love them!"
  },
  {
    "user": "Tat Haynes",
    "rating": 5.0,
    "message": "They fit good and I’m happy with my order"
  },
  {
    "user": "Roderick Collier",
    "rating": 5.0,
    "message": "They fit great and they are really comfortable"
  },
  {
    "user": "AHucks",
    "rating": 3.0,
    "message": "Narrow!  My son's foot wouldn't fit in at all."
  },
  {
    "user": "Draven Hill",
    "rating": 5.0,
    "message": "Well made fit great"
  },
  {
    "user": "Karsten",
    "rating": 5.0,
    "message": "Kind of tight but not bad, still comfortable"
  },
  {
    "user": "Simply Mad",
    "rating": 5.0,
    "message": "I have been searching for kicks that resembled my And One slip-ons since the 90s. The Adidas Adapt are perfect! They're super comfortable, extremely durable, and stylish. The shoes are true to fit. Have them in two colorways. Love them."
  },
  {
    "user": "kenyatta b.",
    "rating": 4.0,
    "message": "Nice light shoe + comfortable. Bottom wears rather quickly though."
  },
  {
    "user": "Sabrina",
    "rating": 5.0,
    "message": "At first, I was really disappointed in these shoes. The first time I ordered these shoes it was a size 8 (for women’s). They fit okay, but we’re a little too big. Amazon took them back with no problem, and I reordered the shoes in a 7 1/2. Still, they seemed too big. I kept them even though I probably could’ve gone down to a size 7, and honestly now that I’ve worn them for a couple of months I love them. I think the feeling of them being too “roomy” was throwing me off. And the inside of the shoe has a fabric that made it easy for my shoe to slide off the back of my heel when wearing socks very slightly when walking or running. However, my shoes never slipped off or fell off. Honestly, now I don’t even notice the “slip” feeling. I don’t know if that was a sensation I just had to get used to or what, but these shoes are so comfortable and I wear them for at least 10 hours everyday (I work in a factory). I hardly ever have foot pain anymore. I’d definitely buy these again."
  },
  {
    "user": "jennygold08",
    "rating": 5.0,
    "message": "Very nice shoes and very comfortable"
  },
  {
    "user": "B 💙",
    "rating": 5.0,
    "message": "He goes to work and he said they’re very comfortable"
  },
  {
    "user": "mike rangel",
    "rating": 5.0,
    "message": "👍🏼"
  },
  {
    "user": "myrl hersh",
    "rating": 5.0,
    "message": "School."
  },
  {
    "user": "Melinda Dunaway",
    "rating": 5.0,
    "message": "Good price for adidas!! Grandson love love loves them"
  },
  {
    "user": "Eric Homen",
    "rating": 5.0,
    "message": "I purchased these shoes for a vacation with 8~12 miles of walking per day. They seem to breath well and stay comfortable all day. The 7 days of walking on pavement/concrete in 90~95 degrees @ 70~90% humidity. Very happy with my purchase. Now when I get home I’ll put some running miles on them and will update."
  },
  {
    "user": "Ed P",
    "rating": 5.0,
    "message": "This is my 2nd pair,  they are comfortable and look good."
  },
  {
    "user": "Rocky T.",
    "rating": 3.0,
    "message": "I've had this line of shoes for years now, going back to one of the first iterations (I believe it was one of the first), with the luxurious feeling cloudfoam insoles, that had small lumps, but in a good way. I still have that pair, completely worn out, but still more comfy than this most recent 4.0. I've had 3 other pairs since, all of which no longer had the lumpy (but comfy) cloud foam, but still all more comfy than this current 4.0 iteration. The surface of the new insoles feels like cork, and has minimal to no padding... the shoe itself seems decent enough, keeping the standard alive there. But the insoles make it feel like I'm walking on rough sand."
  },
  {
    "user": "TK",
    "rating": 5.0,
    "message": "Comfortable!"
  },
  {
    "user": "supadjmq",
    "rating": 3.0,
    "message": "Hard to pull on very tight"
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "I liked everything about them. Use them for leisure."
  },
  {
    "user": "Ryan",
    "rating": 5.0,
    "message": "Pretty nice and comfy"
  },
  {
    "user": "Taka",
    "rating": 5.0,
    "message": "I love this item. I got this at the lowest price."
  },
  {
    "user": "Xfertime",
    "rating": 5.0,
    "message": "I purchased these primarily for walking on my treadmill. On average I walk or jog 30 minutes aday"
  },
  {
    "user": "Stephan M. Twiss",
    "rating": 5.0,
    "message": "Lightweight and cool style. Good non skid soles."
  },
  {
    "user": "Carlos Rodriguez",
    "rating": 5.0,
    "message": "Great walking shows"
  },
  {
    "user": "ChiBob",
    "rating": 5.0,
    "message": "Was able to wear these on a 3 mile walk, right out of the box, and they were incredibly comfortable.  Fit was perfect and comfort level was spot on.  Liked them so much I ordered another pair in gray.  Definitely a great product at a great price."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Purchased these for my husband and he loves them!"
  },
  {
    "user": "J. Croyle",
    "rating": 4.0,
    "message": "I wanted a quick slip-on shoe for short trips. What I got was a very comfortable walking shoe! They are a little more snug than I expected but it's well within tolerance. I dont particularly like the style with the large logo but it's okay."
  },
  {
    "user": "Stuff buyer",
    "rating": 3.0,
    "message": "Looks nice,  but runs very narrow."
  },
  {
    "user": "Akwasi Ohemeng",
    "rating": 5.0,
    "message": "Great for working out, running and being on your feet all day."
  },
  {
    "user": "Ed",
    "rating": 5.0,
    "message": "These shoes are great. Easy to put on. I usually don't wear socks with them and they're comfortable. I use them for running and every day footware. They're my favorite shoes ever. If they came in red with a white band that'd be perfect."
  },
  {
    "user": "Doodle mom",
    "rating": 4.0,
    "message": "Nice to see you but runs kind of small"
  },
  {
    "user": "Dominic M.",
    "rating": 3.0,
    "message": "I bought these prior to a 3 week trip to Germany. I averaged 13.5k steps over 20 days in these shoes with a combined load of about 260lbs(me and my pack). The soles are worn almost smooth under the balls of my feet. I had reservations about buying a walking shoe with 100% foam soles, and ultimately was proven correct. If these were half the price I’d give them 4 stars for outright fit and performance as a throwaway shoe. If they had a layer of rubber under the heel and ball of the sole they’d have 10x longevity, and they’d be 5 stars at any price under 100$. Your mileage may vary."
  },
  {
    "user": "Danielle Nichols-Taylor",
    "rating": 5.0,
    "message": "My 14 year old son who wears a size 12 loves these shoes. Says their super comfortable and light weight easy to put on too slips right on."
  },
  {
    "user": "R and A Family",
    "rating": 5.0,
    "message": "Wife got these for me and I love them. You can step into them pretty easily. I’m wearing them everywhere. They are just a little bulky, but overall a really nice shoe to walk around in all day long."
  },
  {
    "user": "Wilmer Torrealba",
    "rating": 5.0,
    "message": "Para el entrenamiento diario"
  },
  {
    "user": "STEPHEN R. MURPHY",
    "rating": 4.0,
    "message": "I was looking for a New Balance Recovery slip on that I wore all the time. The Adidas is not the same type of shoe."
  },
  {
    "user": "Benjamin Julen",
    "rating": 4.0,
    "message": "These shoes are great for the most part. They are incredibly comfortable and offer a lot of cushion. I wear them all day everyday at work and they have held up pretty well, the tread has worn down faster than expected but they do get a lot of use. They look like house slippers. Maybe I was foolish they think they wouldn’t. The first time I wore them with sweat pants instead of scrubs my friends thought I had on adidas house shoes the whole day. Even if they look like house shoes they aren’t house shoes and I guess that’s the important thing."
  },
  {
    "user": "James Cormack",
    "rating": 2.0,
    "message": "I have had these since February now. The only good thing I can say about them is they are super comfortable and very light. However, I do not recommend these for outdoor use, the sole wears down very quickly. They would make a great gym shoe or indoor track. Definitely do not wear them in wet weather or around wet ground, they are very hazardous on hard floors once dampened they become dangerously slick. I have actually fallen three times because of this, and I have very good balance. For the price and how quickly the sole wears I am very disappointed in them, I would never buy them again unless they improve the sole. I just wear them around the house or in office now."
  },
  {
    "user": "saraco b.",
    "rating": 4.0,
    "message": "My boyfriend love his shoes"
  },
  {
    "user": "Lee",
    "rating": 5.0,
    "message": "Was looking for a stylish, lightweight, no shoe lace, soft out-sole shoe for comfort and I finally found it in this pair of Adidas.  I've recently found that Adidas shoes fit my feet the best, giving me a great, comfortable fit.  What is really hard to find is the soft, cushiony bottom of the shoe that absorbs the shocks in every step.  Just absolutely love these shoes."
  },
  {
    "user": "GUY FONTENOT",
    "rating": 5.0,
    "message": "Nice snug fit, great for running and working out."
  },
  {
    "user": "Thebrevvv",
    "rating": 5.0,
    "message": "Lovely!"
  },
  {
    "user": "Ryan Austin",
    "rating": 4.0,
    "message": "Comfy and light"
  },
  {
    "user": "basileo",
    "rating": 3.0,
    "message": "I have an Adidas US size 8 feet - that is what I ordered.  The product I received was labeled US size 8, but when I put the sneakers on, in reality they are US size 9+.  I am returning them for a refund."
  },
  {
    "user": "LR Breitling",
    "rating": 5.0,
    "message": "Shoe is easy to slip on and off.  Very comfortable.  I recently wore on a trip to Mexico.  Lost of standing in lines at customs in airports. No regrets."
  },
  {
    "user": "Nelson DeJesus",
    "rating": 5.0,
    "message": "Satisfied"
  },
  {
    "user": "aaron lobbley",
    "rating": 5.0,
    "message": "My 1st ADIDAS! With no shoestrings to tie, might I add! These shoes, so far, are so comfortable, and breathable. And highly recommended, for the price of $45.00, you can't beat that!"
  },
  {
    "user": "Das Deutsche",
    "rating": 5.0,
    "message": "Great looking shoes and very comfortable."
  },
  {
    "user": "Cody",
    "rating": 5.0,
    "message": "I wear these all the time very comfy"
  },
  {
    "user": "Austin",
    "rating": 5.0,
    "message": "Bought a pair of these a couple months ago. I’m still wearing them today. I enjoy the sleek look to the shoes along w/ the fact that I don’t have to tie the shoe."
  },
  {
    "user": "Félix O. Rivera",
    "rating": 4.0,
    "message": "The media could not be loaded. They look great, fit good, lightweight, there are good for work-out."
  },
  {
    "user": "Stanley Hoskins",
    "rating": 5.0,
    "message": "Fits great, looks great."
  },
  {
    "user": "Clint Girdhari",
    "rating": 5.0,
    "message": "Just got it today and walked in them for a few hours. They fit perfect as a 11 1/2 wide. For being laceless they were always secure. Even though I'm not a white footwear type of guy, they look pretty good in white. Would recommend for walking and light jogging."
  },
  {
    "user": "mark",
    "rating": 5.0,
    "message": "Great style and Good price!"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "message": "Great shoes love them, get dirty fast but that's alright so damn comfortable."
  },
  {
    "user": "Joyce",
    "rating": 5.0,
    "message": "The shoe is nice and comfortable easy to put on I would definitely recommend this to anybody."
  },
  {
    "user": "Ed Eakin",
    "rating": 5.0,
    "message": "Shoes are a bit on the narrow side....I love the weight of the shoe....comfortable..."
  },
  {
    "user": "Mahendra Kandel",
    "rating": 3.0,
    "message": "It’s not that good compared to other adidas shoes I bought in the past."
  },
  {
    "user": "Salomon Alain Mpouma",
    "rating": 5.0,
    "message": "I like everything of it. I use them for work."
  },
  {
    "user": "RONALD BRIGHAM",
    "rating": 5.0,
    "message": "I've had these a few weeks and I just can't say enough good things about them.  They fit great.  They are super light.  They look good with either shorts or sweats.  I bought black ones and liked them so much, purchased the gray ones too.  I bought some no show socks and plan wearing them all summer."
  },
  {
    "user": "Jennifer English",
    "rating": 5.0,
    "message": "I love these shoes had a pair for over 2 years before they started breaking down real bad. I like how light weight they are on my feet and help with my feet not hurting from a long day of work because i can switch them out with my work shoes."
  },
  {
    "user": "Cornelius davis",
    "rating": 5.0,
    "message": "Shoes to small"
  },
  {
    "user": "clara p granados",
    "rating": 5.0,
    "message": "Deberían de regalar tarjetas a los que compran frecuente mente para tener a los clientes felices"
  },
  {
    "user": "Gman",
    "rating": 4.0,
    "message": "True to size, easy to slip on and off. Minor issue is how easily it traps stains, so good as a walker or light workout, but I wouldn’t use it for hiking or garden work unless you’re eager to clean them often"
  },
  {
    "user": "Angela Tomlin",
    "rating": 5.0,
    "message": "N/A"
  },
  {
    "user": "Crystal Math",
    "rating": 5.0,
    "message": "Shoe works exactly how I wanted it to."
  },
  {
    "user": "Jacob White",
    "rating": 5.0,
    "message": "Super comfortable. Super convenient slip ons. Highly recommend."
  },
  {
    "user": "Patricia Carr",
    "rating": 5.0,
    "message": "Easy to slide on but a nice snug fit."
  },
  {
    "user": "Doug G.",
    "rating": 5.0,
    "message": "These shoes are perfect for casual use."
  },
  {
    "user": "Betty jo",
    "rating": 5.0,
    "message": "I bought these for my dad because he’s always loved this brand and he says there very comfortable and durable."
  },
  {
    "user": "CinTN",
    "rating": 5.0,
    "message": "These shoes fit as expected and very comfortable.  Look great, too."
  },
  {
    "user": "Adrian S.",
    "rating": 5.0,
    "message": "Great shoe for the money.  Super comfortable & easy slip on."
  },
  {
    "user": "MNDLBRT",
    "rating": 5.0,
    "message": "Light, easy on & off & comfortable."
  },
  {
    "user": "JImmy CHAMPAGNE",
    "rating": 5.0,
    "message": "IT FIT  VERY NICE"
  },
  {
    "user": "AJ",
    "rating": 5.0,
    "message": "Grandson likes these shoes. This is his second pair. The first pair lasted from September through April, everyday use, including school outdoor and indoor gym stuff."
  },
  {
    "user": "Jerry",
    "rating": 5.0,
    "message": "Great slip on shoes for the gym at a good price"
  },
  {
    "user": "Karen",
    "rating": 5.0,
    "message": "My son gets a lot of compliments on these shoes. He’s 11& in 6th grade so he has become very particular about what he wears."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "REALLY COMFORTABLE just sized one half to big so go a little smaller!"
  },
  {
    "user": "Sara Scarrette",
    "rating": 5.0,
    "message": "Grandson very pleased, comfortable out of box, well made, quality, will buy again."
  },
  {
    "user": "Kim Kerr",
    "rating": 4.0,
    "message": "The black pair actually has a forest green tint to the mesh part. Black was what I ordered."
  },
  {
    "user": "siamak rahbar",
    "rating": 5.0,
    "message": "easy to wear and comfortable"
  },
  {
    "user": "Spock",
    "rating": 3.0,
    "message": "I wear a 10.5 and usually never have a problem with Adidas but I had to send this shoe back.  Maybe it was just that particular run so I may order again and see if it fits because I tried on a black pair in a store, same size, and it fit great but I didn't want black."
  },
  {
    "user": "RK",
    "rating": 5.0,
    "message": "These are low tech, super comfy slip on sneaks.  I love them and wear them for any casual activity when I'm on the go."
  },
  {
    "user": "S. Andersen",
    "rating": 5.0,
    "message": "Purchase for my 13yo, he says they are comfortable."
  },
  {
    "user": "Torrey Turner",
    "rating": 5.0,
    "message": "Shoes fit good"
  },
  {
    "user": "tk-421",
    "rating": 2.0,
    "message": "I wear wide 3E 9.5 and while uncomfortably tight out of the box, gritting it out for 1 day of walking around the house has stretched them out nicely. Seem to help reduce my pronation. I wish the sole were slightly more rigid and heel cup a tad deeper for more ankle support (deduct 1 star) like my Brooks Pure Cadence (discontinued) but really for the price, I'll buy another pair. I like the stretchband, its good design, not too narrow, not too strong. Updated: After a few weeks, the band area across bridge of my foot began to get very sore on extended walks. I tried stretching the band, different socks, nothing helped. Then I noticed that if you pull the band away from the shoe, there's a relatively thick, round, U shaped seam in the shoe material, hidden by the band. The band is compressing that seam into top of my foot in sensitive area, very uncomfortable. Going to donation pile. Other than that seam, loved the shoe. Mine was a tight fit anyway, YMMV"
  },
  {
    "user": "Shirley MB",
    "rating": 5.0,
    "message": "Comfy"
  },
  {
    "user": "WEGIGABYTE.Info",
    "rating": 5.0,
    "message": "Played racquetball in these shoes. Feels comfortable."
  },
  {
    "user": "Leopoldo O.",
    "rating": 5.0,
    "message": "Great"
  }
]