[
  {
    "user": "Revisor",
    "rating": 5.0,
    "message": "Never tried laceless shoes before and after playing around with these I've realized that I've been missing out my whole life. Just think about how many times do you actually lace your shoes out of millions times you put them on and take them off throughout the day, probably almost never, so whats the point? These ones look very stylish, very soft and comfortable, don't have an over-engineered outsole, therefore, easy to clean. Best thing about them is you can literally put them on without bending over and even touching the shoe with your hands, while at the same time still they are able to stay on firmly."
  },
  {
    "user": "Nate S.",
    "rating": 4.0,
    "message": "I ordered a pair of these in black last year in size 11 fit perfect and have absolutely loved them. This year I ordered a pair in 11 and they were way too tight. I returned and ordered a 12 and seems to be just as tight as the 11s were. The 12s which I still have seem to be loosening up a bit but are still alittle tight. Comfy but not sure if the sizing changed or my feet did (every other shoe I own is an 11)"
  },
  {
    "user": "JM",
    "rating": 4.0,
    "message": "Good fit, easy to get on. Great for walking or light running. Laces don’t tighten, just slip on shoes. For really hard running, get a pair of high quality runners. Other than that, pretty good shoe for $35"
  },
  {
    "user": "Lynn",
    "rating": 5.0,
    "message": "Bought the shoes for my daddy. He said the shoes are comfortable, a bit narrow, so you might not be able to put them on as fast as a usually slide on shoes. But once you put on, the shoes are comfy."
  },
  {
    "user": "Ottomac",
    "rating": 5.0,
    "message": "I have had mine for 6m now and I think there great. Soles are ultra quiet when walking. Good support but not great. That doesn't in any way take away from the comfort of these shoes. At the price there being sold for which is fair for a pair of sneakers, I think it's a no Brainer just buy them you'll be happy you did."
  },
  {
    "user": "Thomas G.",
    "rating": 5.0,
    "message": "Bought a pair of these in a brick and mortar a couple of years ago, loved them.  Purchased these here on Amazon recently, same size but not the same fit at all.  Material feels more stiff and the insole isn't the same quality either.  Would return but too late now, very disappointed."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "My husband had a pair of these shoes a couple years ago and was so happy to find them on here. Best slip on shoes he’s ever had. He walks a lot for work and he loves the comfort of these and for being slip on shoes they feel really secure and don’t slide around"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I bought these for my grandson, he loves them ! This is his third pair. He says they are the most comfortable shoe he has ever had. He is on his feet all day. Kudos!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "The most comfortable sneaks I have ever worn. Very cushioned. Like slippers. Sold as runners, but I would say that is a stretch. Bottom rubber is a very airy super soft compound and I have worn out the bottoms in a matter of two months. Like 10 times faster than standard sneakers. I would still get another pair."
  },
  {
    "user": "Steven",
    "rating": 4.0,
    "message": "Extremely comfortable and light weight. Really like the shoes and would buy again. I am a size 12 US and they were a tad large. If they had half sizes, I would probably get an 11.5."
  },
  {
    "user": "N&M",
    "rating": 5.0,
    "message": "Very lightweight and extremely comfortable. Just got back from vacation in Europe and did a lot of walking, up and down, and this shoe didn’t disappoint. Highly recommend it."
  },
  {
    "user": "Ashley Wells",
    "rating": 4.0,
    "message": "My son has slightly wide feet. He can fit into almost all tennis shoes but not these. I liked the look and the quality felt good too, they just did not work out for my son."
  },
  {
    "user": "Tone",
    "rating": 4.0,
    "message": "I've owned these for about a month now and I'm not terribly hard on shoes as I have an office job and am not very athletic. They are starting to rip on top where one of the seams are. Kind of disappointing"
  },
  {
    "user": "Sai Krishna Kandagatla",
    "rating": 4.0,
    "message": "It is very comfortable. Highly recommended for workouts"
  },
  {
    "user": "David James Savalza",
    "rating": 5.0,
    "message": "Most comfortable shoes I've ever had. Their light and and very cushioned. I absolutely love them and recommend them to everyone!"
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "The elastic is not durable. Popped within a week of wearing the sneakers. Had to hand sew it back together smh"
  },
  {
    "user": "Kevin Narinesingh",
    "rating": 5.0,
    "message": "Super comfortable, easy to move around in and fits almost perfect. Just need a slightly thicker socks and then it's fitting like a glove. Love it!"
  },
  {
    "user": "Eva",
    "rating": 5.0,
    "message": "These shoes are so comfy and lightweight. Great buy."
  },
  {
    "user": "BeepBeep",
    "rating": 5.0,
    "message": "I just ordered my sons 2nd pair. He had his 1st ones for over 2 years and that is amazing for him. My husband wanted to try them and he loves his also. He is more than happy with the shoes and I hope they keep making them!"
  },
  {
    "user": "Weaponsjunkie/Jody Baucom",
    "rating": 5.0,
    "message": "His foot is growing so fast. He likes the slip on and off feature."
  },
  {
    "user": "B. L. Ridenhour",
    "rating": 5.0,
    "message": "Light as flip-flops or Crocs, comfortable foot bed, breathable and solid black (so you can pass them off for semi-work attire). Love, love, love…seriously. They aren’t really serious shoes for playing any sports I can think of (changing directions, climbing, etc.), but would work great for walking and running where ankle stabilization or accelerating “out of your shoes” isn’t of concern. Adidas is a solid brand, and these are ridiculously comfortable and lightweight."
  },
  {
    "user": "Ron Ulshoffer",
    "rating": 5.0,
    "message": "Exactly what I was looking for, comfort and fit to size"
  },
  {
    "user": "CJ Boudreaux",
    "rating": 4.0,
    "message": "Soles of shoes don’t last for months so Inserts will be needed. The outside of the shoe lasts quite long, they are comfortable and these will be my 3rd pair."
  },
  {
    "user": "DANIEL ORLANDO JIMENEZ",
    "rating": 4.0,
    "message": "GOOD"
  },
  {
    "user": "Dominic",
    "rating": 4.0,
    "message": "Mainly worn in an casual office setting. Great shoe to simply slip on and off and the comfort while its newer is great.  The durability of this shoe is not great, but for the cost its very nice.  No tears in the shoe but the insole does start to wear through and the outer sole wears quickly and looses traction."
  },
  {
    "user": "Adam Holland",
    "rating": 4.0,
    "message": "Very comfy but not strong enough on the bottom of my heel."
  },
  {
    "user": "Baylee Hurdle",
    "rating": 5.0,
    "message": "My husband loves these, very comfortable"
  },
  {
    "user": "Michael Lee",
    "rating": 4.0,
    "message": "Good Shoes"
  },
  {
    "user": "jego",
    "rating": 5.0,
    "message": "It’s very comfortable , sleek, easy to wear, tested for work it gave me no pain for 12 hours of work. Highly recommended"
  },
  {
    "user": "James",
    "rating": 5.0,
    "message": "Very comfy shoes. Easy slip on and off. Purchased these for work, and are my second pair. Love them and definitely recommend."
  },
  {
    "user": "Ian",
    "rating": 5.0,
    "message": "I’ve been looking for a good slip on shoe and this one is perfect. No laces to tie and they’re comfortable and we’ll ventilated. The price is also very fair. I have no complaints at all after a couple weeks of using them every day."
  },
  {
    "user": "Greg Stone",
    "rating": 5.0,
    "message": "If the shoe fits... well it's true to size so that's a relief. I was a little concerned that a shoe that you don't lace up every time would fall off while running, but it doesn't. It feels very normal running in them and they're very comfortable for everyday activities as well."
  },
  {
    "user": "Joshua Reilly",
    "rating": 5.0,
    "message": "I love these shoes! I’m huge and they have good support and are comfortable! I got the white ones and man are they a dirt magnet! So comfortable I’m willing to wear them and look homeless tho! I highly recommend these shoes!"
  },
  {
    "user": "TheRealJoe",
    "rating": 4.0,
    "message": "They are definitely worth the $20 sale price but not much more."
  },
  {
    "user": "Derek T.",
    "rating": 5.0,
    "message": "2nd pair of these shoes super comfortable and thanks to not having laces they can't get caught on machines at my job"
  },
  {
    "user": "Cassie P.",
    "rating": 4.0,
    "message": "Love everything about these shoes: the way they look, how they feel on the foot, how incredibly LIGHTWEIGHT they are, and just comfortable. My only complaint is the durability of the shoe itself; it’s only about three months old, and the sole is completely flat and Without tread. I’ll still wear the s*# out of them though, and it’s pretty probably that I will buy another pair!!!"
  },
  {
    "user": "Ryanap93",
    "rating": 5.0,
    "message": "3.0 is my favorite shoe! I wear it for nursing and working out 10/10"
  },
  {
    "user": "sheila d.",
    "rating": 4.0,
    "message": "Basic black slip on shoes easy to get on and off for people with back issues. These look nice and are comfortable to walk in my husband said. The size 12 fit as expected."
  },
  {
    "user": "Lawrence",
    "rating": 5.0,
    "message": "Very comfortable"
  },
  {
    "user": "Steven Chell",
    "rating": 5.0,
    "message": "Adidas cloud foam are the best. Especially these shoes you don’t need to tie! I love them I’ll prob wear them completely out"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I like them even if they made in China."
  },
  {
    "user": "PM Customer",
    "rating": 5.0,
    "message": "This is my teen sons second pair of this style.  They are great."
  },
  {
    "user": "Nate",
    "rating": 4.0,
    "message": "Comfortable"
  },
  {
    "user": "yaakov greenfield",
    "rating": 5.0,
    "message": "These shoes fit on my feet really nicely Look classy but still have the sporty feel"
  },
  {
    "user": "Fadi Tapponi",
    "rating": 5.0,
    "message": "its good for work"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very light weight and moveable! Super comfortable to run in"
  },
  {
    "user": "s12ms",
    "rating": 5.0,
    "message": "These sneakers are easy to slip on quickly and are a loose fit. Very comfortable, will see how they hold up to the school year. These would leave you with wet feet in a heavy rain or snow slush so purchased a different brand for those days."
  },
  {
    "user": "ske",
    "rating": 5.0,
    "message": "My son got these in a store and wore them out. He had saved the box because he wanted same exact ones again"
  },
  {
    "user": "DuCoeur",
    "rating": 5.0,
    "message": "The laces are wonky. Fit is a little bigger than my last pair."
  },
  {
    "user": "Michael A Finley",
    "rating": 5.0,
    "message": "Very nice and comfortable I love them."
  },
  {
    "user": "Teresa Franco",
    "rating": 5.0,
    "message": "Love them! So glad I got them. Might get another color later when they do another price cut."
  },
  {
    "user": "Jesse",
    "rating": 4.0,
    "message": "Didn’t keep them, very nice, but too wide."
  },
  {
    "user": "tina k miller",
    "rating": 5.0,
    "message": "As expected. Price is great"
  },
  {
    "user": "brad clarke",
    "rating": 5.0,
    "message": "Snug fit, ideal for pickleball"
  },
  {
    "user": "I am a Penguin",
    "rating": 5.0,
    "message": "My partner was adamant I leave a review to say how comfortable these shoes are. I bought him a second pair."
  },
  {
    "user": "FamKay",
    "rating": 5.0,
    "message": "Great for all day wear"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is the 3rd pair of these shoes I have bought for my son. First 2 were the white ones. He is on his feet at work all day and says they are more comfortable than sketchers and dont hurt his feet"
  },
  {
    "user": "Larry T. Fasick",
    "rating": 5.0,
    "message": "Great shoe overall. Feels comfortable to me after a few weeks use, no complaints. Comfort is subjective, so I can't add that to the pros list though. Pros: the fake laces give it a nice look like a lace up shoe. I hate how most slip-ons look like aqua socks, but the faux laces make it look more natural. Cons: none Note for size: After experimenting with a few orders, i ordered 2 sizes up. The reason is: these slip ons have a tight opening around the foot and it's not very elastic. So my normal shoe size fit well, but it was a bit difficult and tight to put on, which kind of defeats the purpose of a slip on which is supposed to be easy. Therefore I ordered two sizes up, from a 10.5 to 11.5. The shoe is about 1/2 inch too big in length but the width feels fine. as for the opening, it makes it much easier to slide into. As for the larger size, it's fine for gym workouts, but honestly..... slip ons aren't really meant to be used for actual heavy duty running workouts, so I dont' care that they're not a perfect fit in length. For me it's a great quick slip on shoe that is great for workouts and casual walking out and about."
  },
  {
    "user": "Wayne Hollingsworth",
    "rating": 5.0,
    "message": "Bought for my son. This is his second pair. Offered to buy him more expensive pair, but he wanted these again."
  },
  {
    "user": "Debbie  Stohler",
    "rating": 4.0,
    "message": "Son likes them but they don’t hold up well. Not a lot of support. Good price"
  },
  {
    "user": "joshua",
    "rating": 5.0,
    "message": "Nice fit, awesome workout shoes"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These were purchased for my husband. He loves them. He said they are very comfortable, lite and fit great."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Very happy with these shoes. Great value for the price."
  },
  {
    "user": "D.Mo",
    "rating": 5.0,
    "message": "Wore them to the gym for the first time, very comfortable, nice form fitting, and they look great. I'm impressed, I hope they last. Only time will tell"
  },
  {
    "user": "Alfred Ranili",
    "rating": 5.0,
    "message": "It’s very comforting"
  },
  {
    "user": "camille torkelsen",
    "rating": 5.0,
    "message": "Needed for a color scheme"
  },
  {
    "user": "Handy-Man",
    "rating": 4.0,
    "message": "I got these shoes to replace a previous pair of Adidas CloudFoam shoes.  Overall they are ideal for walking due to their lightweight and breathable nature (very similar to the Nike Free). To achieve the lightness however there were some sacrifices that had to be made.  First is the lack of ANY support for your foot/ankle.  These shoes will twist and bend without much pressure being applied.  Like I said - this is OK for walking, but I'd be cautious of doing anything that requires secure footing (CrossFit, running, lifting, etc). Secondly, there is NO arch support on this shoe.  The sole is completely flat, which presents its own set of issues...but be warned if you have a high arch...these shoes might hurt to wear."
  },
  {
    "user": "Chelsea Schillinger",
    "rating": 5.0,
    "message": "This adidas shoe is true to size and extremely lightweight and comfortable to walk around in all day. Bought as a gift for my husband and they're his favorite pair of shoes."
  },
  {
    "user": "Bryan",
    "rating": 5.0,
    "message": "Easy fit. Comfortable sole. Nice look"
  },
  {
    "user": "Amanda",
    "rating": 5.0,
    "message": "Good shoe for the price.  Looks really good with neutral clothing color.  They were purchase for casual wear.  My husband wore them to a 3 hr shopping trip and he never complained about feet hurting or back hurting.  Which is a plus since he is flat footed and has had back and hip surgery.  I give them a 10"
  },
  {
    "user": "rose fetner",
    "rating": 4.0,
    "message": "These shoes run very large. I had to send them back and order and full size down. I think they run wide also. Comfortable shoe."
  },
  {
    "user": "Game Test",
    "rating": 4.0,
    "message": "Really like the look and have similar pair from few years back. However, these are not as comfortable as the old pair. I believe they change insert foam."
  },
  {
    "user": "Derek S Bradford",
    "rating": 5.0,
    "message": "Product came as described"
  },
  {
    "user": "Jonathan B Arthurs",
    "rating": 4.0,
    "message": "Great shoe,  nice looking.  Not intended for working out. Not a shoe for long walking or running on the treadmill at the gym. Not good for heavy workouts,  no support.  Great for casual walking around,  or if you want to look like a wanna be gym person.  Easy to slip on and go. Light weight.  I'll buy another pair! Different color.  For a easy slip on shoe after a long swim, workout, or a shopping strip ."
  },
  {
    "user": "paula",
    "rating": 5.0,
    "message": "Very pleased."
  },
  {
    "user": "Fred",
    "rating": 5.0,
    "message": "So light and comfortable and 100 percent washable."
  },
  {
    "user": "holly cameron",
    "rating": 5.0,
    "message": "Son loves them"
  },
  {
    "user": "Matt",
    "rating": 5.0,
    "message": "I wouldnt wear these to the gym but that's just me. As far as fitment they are snug at first, but good once broken in."
  },
  {
    "user": "Laura Adcock",
    "rating": 4.0,
    "message": "Good little pair of slip ons; and very comfortable."
  },
  {
    "user": "Meachell13",
    "rating": 5.0,
    "message": "We are on our 3rd paid of these as he has needed to up his size (very active kid and has separate running shoes) and even then they still have life in them in if his foot wouldn't have grown so much in the last 2.5 years!"
  },
  {
    "user": "hunter lockhart",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Lisa Soto",
    "rating": 5.0,
    "message": "Great quality and comfort"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Easy on and off. Lasted an entire school year with only wear on the treads."
  },
  {
    "user": "David M. Orbach",
    "rating": 4.0,
    "message": "I love these slip on tennis shoes.  Very easy in and out.  Comfortable walking around the house or walking the dog.  These are not work-out shoes.  They lack lateral support and the slip on fit is loose so expect your foot to shift inside the shoe.  I would never use them running or doing anything requiring traction such as lunges or squats.  That said, if you want a comfortable, easy in and out house shoe this is a great choice."
  },
  {
    "user": "True BookWorm",
    "rating": 4.0,
    "message": "I am a woman who spends her days in high heels.The only time I wear gym shoes is when I'm working out. I prefer to buy men gym sneakers since their fashions are more current. I'm a size 8.5 in women sizes, so I'm a size 7 in men sizes. These shoes appealed to me because of their olive hue and the fact that they were produced from recyclable materials. They are comfortable without being overly tight (if you have a wider foot then the fit may be tight).There were some concerns with the quality of the product. The seams were not well sewn (view picture). In addition, there were a couple of deep scratches evident. However, it was not a huge concern for me. The loose threads were gently removed with scissors. The sneakers were made in Myanmar, according to a tag located on the inside. The bottom of the shoes were not slick, and the comfort level was adequate. It was also an advantage that the pricing was so low. As of today, still happy with this purchase."
  },
  {
    "user": "Maverick",
    "rating": 4.0,
    "message": "I've seen some negative reviews on these shoes but there worth the price. I have had 4 pairs of them. I do a ton of walking at work and they help keep my feet comfortable. I usually get up to 6 months to 8 out of them."
  },
  {
    "user": "Boxxx Gazard",
    "rating": 5.0,
    "message": "Awesome shoe for summer fit perfect"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Looks cool feels great 👍"
  },
  {
    "user": "Hillary C",
    "rating": 5.0,
    "message": "Adidas has always been a reliable shoes of good quality and comfort, this is shoe is nothing short of that. Reasonably priced for this pair, it gives my husband good support being a musician, he stands on his feet for 2+ hrs at a time. He gives this a 10/10, it’s true to size. If you want more comfort and toe space you can go up half size. He wears 9.5 and I bought his the 10. It fits perfectly with thick enough socks."
  },
  {
    "user": "Raymond Thomas",
    "rating": 5.0,
    "message": "These shoes are both comfortable and attractive. They're easy to just slip on and go on about your day. They feel more like house shoes than sneakers. They're advertised as a \"running\" shoe, but I don't think they're well suited for that. The elastic bands and overall construction of the shoe is just not well suited for anything more than an occaisonal light run. They're more suited for walking. I use them for brisk walks on the treadmill at the gym and like the comfort and breathability they provide. When the pair I have wear out, I'll be purchasing them again."
  },
  {
    "user": "Roland Pugh Jr",
    "rating": 5.0,
    "message": "There feel very light and yet very durable to wear. Amazing feel and fit!"
  },
  {
    "user": "Mr. Jones",
    "rating": 5.0,
    "message": "Very nice shoes to slip on, the heel does not stick and pops up. At some point I was asked to rate these for fitness, they would work for stuff that’s upper body based but I couldn’t imagine running in these, they’re still slip on shoes. I use them as quick driving shoes and they work great"
  },
  {
    "user": "Azaghi",
    "rating": 5.0,
    "message": "I bought the shoes for my son who seems to love only white shade shoes. The shoe is more catchy while wearing them. My son loves the shoe, he is all ready for his school year."
  },
  {
    "user": "marvin",
    "rating": 4.0,
    "message": "I keep these by the door and slip them on quickly anytime I need to run out or walk the dog. Perfect for what I wanted. Super light, not heavy"
  },
  {
    "user": "Sea-cove-man",
    "rating": 5.0,
    "message": "So fa so good"
  },
  {
    "user": "Phil H.",
    "rating": 4.0,
    "message": "If u have wide feet these arent the shoes for you, really narrow"
  },
  {
    "user": "Olga Cabanillas Rivera",
    "rating": 5.0,
    "message": "Estos zapatos son los mejores que he comprado, son muy cómodos, realmente tus pies no se cansan , son muy suaves al usarlos. Recomendado 100% este modelo"
  },
  {
    "user": "KELLI",
    "rating": 5.0,
    "message": "Sneakers came just as portrayed in the pictures. Nice and light, 12 year old step-son says they fit really nice and are comfy"
  },
  {
    "user": "JR",
    "rating": 5.0,
    "message": "Fits well. Good for walking, bike rides, everyday wear."
  },
  {
    "user": "John",
    "rating": 4.0,
    "message": "The soles tear out too easily in these.  Other than that, good pair of shoes"
  }
]