[
  {
    "user": "Objective reviewer",
    "rating": 5.0,
    "message": "I am training for an Ironman, I use this shoes for easy runs and recovery training and they are very comfortable and stable. Wouldn't do anything longer than 15k on them, will never brake a personal record on them, but they cost at least half the price of all my other running shoes, which make this pair a pretty good option for daily trainers. Helps you balance out the wear of your other, more expensive, running shoes."
  },
  {
    "user": "Katrina Perry",
    "rating": 4.0,
    "message": "I got these for a nice looking pair of shoes on the weekends. I have size 14 4E feet. They are comfortable enough to wear around for a day. Over all I am happy with them. I will say though, my feet are wide and it is hard to find a 4E that is still wide enough and actually fits. I'm a Dunham, Brooks, Hoka 4E person. These brands, my little toe does not rub the outside. Asics, Saucony, New Balance, all of those 4E my little toe is still squished against the side. That is the case with these as well. So, if those brands fit you, these will be just fine. If those brands are slightly snug on you, these will be too. The length is spot on. The only other ding i'd give it is as soft and flexible as the sides are, really nice, the big logo on the side is fairly rigid and you can feel it on the side of your foot. Not rubbing to the point of blisters or anything, but you definitely know there's a big logo on the side of your shoe."
  },
  {
    "user": "Raaj",
    "rating": 5.0,
    "message": "I bought a pair before I took a trip to Seattle as my previous shoes were worn out, being so close to the trip I took a chance. I went with the wife simply because of the shape of my feet, narrow/normal shoes just don’t cut it anymore. When they arrived they looked great and when I went to try them on they were pretty snug but worked, was thinking they’d be bit wider but they fit nicely. It’s gonna take a a few walking sessions to get use to the fabric on the back of your heels or maybe wear some ankle high socks, otherwise it’s gonna cause some irritation. To sum it all up I am happy with my purchase, they feel great and comfortable with their cushioning, they looks good and glad I took the plunge in these. Highly recommend, like I said it may take the heels some getting use to or wear out that fabric on the back of your heels so you’re use to it."
  },
  {
    "user": "Al",
    "rating": 5.0,
    "message": "I've had my older Under Armour Trainers for years and loved the simplicity and rugged support it provides. After 10 years, I parted company with it and started searching for a replacement, only to be dismayed by what's on the market. It seems like the Trainers nowadays are competing for a beauty pageant -what with the colours and unnecessary accessories they attach to them.  I almost gave up till I came across these ones .... Black, Simple, Supportive and super comfortable - and it looks good with your workout gear. I have size 11 feet -long and narrow and got an 11, which fit perfectly - and it's half the price. What's not to like Buying a second pair pronto before they stop making them"
  },
  {
    "user": "Paul Coleman",
    "rating": 5.0,
    "message": "Without question this is one of the best walking shoes in the market.  These are my second pair.  Fit and finish are second to none.  I have wide feet so buying good, quality comfortable shoes is always a struggle.  These fit the bill in every way.  Hopefully they'll continue to make these because it's the brand and line I'll be buying again."
  },
  {
    "user": "Dubhlinn",
    "rating": 5.0,
    "message": "worked for fedex and found myself tearing through shoes quite fast. went from brand to brand. tried all the athletic, running, hiking, max support, comfort, etc. i settled on the underarmour as they have been the longest lasting, most comfortable, and most supportive. my feet felt better, immediately, after using these for one day on the job. highly recommend these for any active setting and i would buy again."
  },
  {
    "user": "Mousoom Sinha",
    "rating": 4.0,
    "message": "Happy with the purchase of my very first pair of road running shoes. They do justice to the purpose absolutely. Pros: 1. Sturdy 2. Relatively harder sole 3. Sole shows no sign of wearing out even after daily (almost) use for 3 months 4. Light-weight 5. Top quality fabric material cons: 1. These are outdoor running shoes. Hence not that comfortable for casual wear due to the sole being harder. 2. I would have personally liked for the forward foot widget to be a little more. It's not that narrow though, but a slightly more width would have made the shoes more comfortable. In summary, none of the cons are deal-breakers. I recommend this shoe 100%, especially to road runners."
  },
  {
    "user": "Richard Wayne Broome",
    "rating": 5.0,
    "message": "So I have a hard time finding women shoes that are wide.  I try these on and completely love the comfort and I like that that Even though it’s men’s shoes it still compliments me style wise.  Under Armour is a brand to be trusted!"
  },
  {
    "user": "Abhinav an Amazonian :)",
    "rating": 5.0,
    "message": "Absolutely Love these Shoes. Color - 5*, Comfort - 10*, Style - 4* I love them so much I have given up my sneakers and jordans for a while. Till the time these look new I will be wearing them. They are so comfortable to wear while walking / jogging / running. I have been using nike and Adidas for like 10 years now and this is my first time using under armour for myself. I am in awe of how comfortable they feel to the feet. Like you are not wearing any thing in your feet but you have no issues in running / jogging. Recommend it to everyone else."
  },
  {
    "user": "KingMDM",
    "rating": 5.0,
    "message": "Great value!  Very comfortable and light for walking around the office and the all-black doesn't stand out as much as gym shoes.  My 1st pair of 'real' gym shoes in almost 30 years and my feet couldn't be happier. I never have bought Wide shoes but after reading the reviews I decided to go 13 wide.  Very glad I did as the regular width size wouldn't have been as comfortable."
  },
  {
    "user": "Bylle J.",
    "rating": 5.0,
    "message": "These shoes have lasted longer than many shoes we have purchased for work in a tire shop.  No slipping, even on wet, oily surfaces. The e bottom tread started peeling after 3 months of daily wear."
  },
  {
    "user": "Shellei Kittrell",
    "rating": 5.0,
    "message": "The hubs says these are GREAT! Finally an actually wide “wide” shoe. Had no breaking in discomfort whatsoever - however, like others have mentioned some extra bit of fabric at the back was a little annoying at first. He will buy these shoes as long as they keep making them."
  },
  {
    "user": "Ashley Wells",
    "rating": 5.0,
    "message": "I bought these for my son. He has slightly wide feet and they fit him perfectly. They're super comfortable, made well, and look brand new even after being worn for 4 months by an active 12 year old. Usually his shoes would be showing wear by now, but thankfully not these. I will be purchasing them again when he grows out of these."
  },
  {
    "user": "Grant Serafy",
    "rating": 5.0,
    "message": "Been searching for a show that has mesh for flexibility but some protection for dragging my toe in pickleball and this shoe, while not perfect, does quite well - have two pairs already. I find the stiff tennis shoes very uncomfortable."
  },
  {
    "user": "Trevor Smith",
    "rating": 5.0,
    "message": "I got these as a daily work shoe. I am a Fiber tech, so I am outside and on my feet all day. These shoes breathe great and offer plenty of comfort. I've worn them every day since buying and I am completely happy with these shoes. Weather they last 6mo or less, I don't care. I will continue to buy these. Once my feet get hot, I am done, I will overheat. These shoes made out of a very nice mesh help me stay cool in 100 degree heat. Absolutely love these shoes."
  },
  {
    "user": "Robert Chicago Suburbs",
    "rating": 5.0,
    "message": "I normally do not order a \"wide\" shoe, but I tried it with this shoe and I loved it.  Actually I liked it so much that I ordered the exact same shoe one year later.  I mostly just walk (10,000 steps per day), no jogging or running ... but I love how comfortable these shoes are."
  },
  {
    "user": "Craig Brock",
    "rating": 5.0,
    "message": "People keep talking about counterfeit shoes being sold. If these shoes are counterfeit then my hat is off to the superb craftsmanship of the person who made these shoes."
  },
  {
    "user": "Todd A. Lewandoski",
    "rating": 5.0,
    "message": "This is a good looking shoe and is comfortable. I am glad I got them a 1/2 size larger. I don’t plan to use them as a workout show however, they will be used as an every day shoe and will get plenty of use. For the short time I have worn them, they seem to be good for support."
  },
  {
    "user": "Baby Gyrl",
    "rating": 5.0,
    "message": "This was for my step-dad so I can't really give it a detailed rating, but after wearing them once, he loves them!"
  },
  {
    "user": "selkiegal",
    "rating": 5.0,
    "message": "I usually wear 10.5 wide - 11 womens. 9 mens are easier to find. These fit great. I was a little worried that they were too snug the first time I wore them but I have not experienced any discomfort from long-term wear."
  },
  {
    "user": "DMcEvers",
    "rating": 5.0,
    "message": "After ankle fusion this shoe provides the fit, comfort and support my husband needs.  This is his  third pair- as he likes to have the different colors."
  },
  {
    "user": "Daniel",
    "rating": 4.0,
    "message": "You need a lot of time to get use to have it, it take so long to adjust right to the feet"
  },
  {
    "user": "Hope T.",
    "rating": 5.0,
    "message": "I purchased these for my husband who was very happy with the shoe.  They run true to size, are comfortable and hold up well.  Would recommend"
  },
  {
    "user": "Justin",
    "rating": 5.0,
    "message": "I use these to walk in everyday and I feel a lot more support and less impact on my soles than my old pair of walking shoes"
  },
  {
    "user": "Crester1",
    "rating": 5.0,
    "message": "Extremely comfortable and supportive.  Use this for weight lifting and works great.  Fits very well.  Would definitely recommend this sneaker."
  },
  {
    "user": "Keith N.",
    "rating": 5.0,
    "message": "Probably the 2nd most comfortable shoes I've ever worn in my 40+ years.  I'll definitely buy again.  I'm in my feet all day on concrete floors and it's difficult to find footwear that comfortable and lasts.  These have been great for a few months so far.  Very happy.."
  },
  {
    "user": "Dan McNeilly",
    "rating": 5.0,
    "message": "Under Armour anything, never disappoints.  These shoes are good quality, comfortable, great for workouts or running errands.  I'll probably just buy all Under Armour shoes form now on."
  },
  {
    "user": "Esteban Avila",
    "rating": 5.0,
    "message": "Using these shoes for only treadmill running only, these shoes will not see the outdoors. First run today and NO FOOT/ LEG soreness at all. I’m about 260lbs and have wide feet 👣. I’ve gotta say these are extremely comfortable and great fit for me. They recommend me neutral running shoes. Great price and bargain."
  },
  {
    "user": "MP Services",
    "rating": 5.0,
    "message": "comfortable and perfect fit - lightweight but tough enough for everyday or running or working out - No negative comments here"
  },
  {
    "user": "Jacob Gibson",
    "rating": 5.0,
    "message": "I've been using them to workout and they work perfectly, my only problem is that the back of my foot got a little scab because it digged into my skin a little."
  },
  {
    "user": "Carol",
    "rating": 5.0,
    "message": "My husband loves his new shoes.  He has to order extra wide due to problem with his feet.  That is hard to find in a shoe."
  },
  {
    "user": "Elias Francisco",
    "rating": 5.0,
    "message": "Fits well i like the color, I got the black wide one fit Perfect, I usually try to change the insoles but on this one I kept until it wore out it was comfortable"
  },
  {
    "user": "Cynthia W.",
    "rating": 5.0,
    "message": "Really good made sneaker for my son. Extremely comfortable, light, and good fit. Price was good too."
  },
  {
    "user": "Arthur C.",
    "rating": 4.0,
    "message": "I use these shoes for work where I stand and walk for  8 hours a day!"
  },
  {
    "user": "A. Gingery",
    "rating": 5.0,
    "message": "I own several pair of these sneakers. Like the fit, it’s nice looking, every time I wear a pair out, I just replace with another."
  },
  {
    "user": "April",
    "rating": 5.0,
    "message": "Hubby is a mechanic so he is on his feet sometimes 13 hours a day. Concrete floor. He has purchased these the last 2 summers and they hold up all year. For the price he loves them!"
  },
  {
    "user": "WMCE",
    "rating": 5.0,
    "message": "Third pair I have purchased - wore the other two out. Great product"
  },
  {
    "user": "MeMeMe",
    "rating": 4.0,
    "message": "These fit fine, but aren't the most comfortable- the heel is a little stiff/hard. Hoping they will loosen up over time."
  },
  {
    "user": "JustinandJenn Long",
    "rating": 5.0,
    "message": "I work all day in these shoes and don't get leg splints or tires legs they are very comfortable and I think the look pretty good I would highly recommend, where else can you find a great name brand shoe for such a good price! Only thing is they say actual size Soo I ordered an 11 and I probably should have went a half size up."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great color and good fit. Good arch support and over cushion."
  },
  {
    "user": "Radio Man",
    "rating": 5.0,
    "message": "Bought these for daily wear.  Comfortable for walking and standing."
  },
  {
    "user": "Harold C. Ackett",
    "rating": 5.0,
    "message": "I do a lot of Tabata style or crossfit type workouts. These have been both comfortable and functional. Great value and fit/function"
  },
  {
    "user": "José Luis Amador",
    "rating": 4.0,
    "message": "zapato muy lindo y bien construido, falta mucha comodidad, no es tan suave como aparenta"
  },
  {
    "user": "AnnieRae",
    "rating": 5.0,
    "message": "This is a reorder. We like these so much that we order another pair when they wear out."
  },
  {
    "user": "Brandon M",
    "rating": 5.0,
    "message": "Needed a new pair of shoes for work and these are exactly what I needed and wanted. They give me no discomfort unlike Nike shoes."
  },
  {
    "user": "Sean Somers",
    "rating": 4.0,
    "message": "Shoes are great quality. Light and durable. They are sized a bit smaller than expected, but fit nicely when I returnes for half a size bigger. The sole was a bit thin, but easily fixed with a 3rd-party sole."
  },
  {
    "user": "Chas",
    "rating": 5.0,
    "message": "I have been  2 pairs of the black assert 8’s which I have used for over a year. I can walk 4 miles or so about 4 days per week with no issues and can take them to the gym and do the stepper with them. They have always felt great until they just wore out. The 9’s bring back that support and comfort and feel even more comfortable than the 8’s when they were new. A good upgrade for me. Don’t regret this purchase"
  },
  {
    "user": "Dominic",
    "rating": 5.0,
    "message": "I walk about 40-45mi a week and was looking for a pair of shoes that was affordable and offered in 4E width. My previous pairs of shoes have always been Nikes - I came from the Monarch (robust, heavy, interior wore down really fast) and before that, the Downshifter 11 (very light, but slippery sole that wore out pretty fast). This was my first piece of UA apparel ever - I was really impressed with the build quality and how light/minimal these shoes were. The heel cup shape is really well pronounced, you feel like your heel is locked in place really well. This is often an overlooked part of any pair of sneakers or performance related shoes, especially at this price point. The upper is very lightweight, it feels like nothing and breathes really well. The sole itself is supportive and somewhat rigid, giving the shoe a pretty good road feel which I felt like my previous pairs of Nikes were missing (they felt more squishy/soft, lost their support quite fast). I was eyeing them on Zappos for a while, but saw they were on sale even further on Prime Day, so got these for $41 which I felt was an amazing price point. Really satisfied with my purchase, looking forward to potentially getting more UA shoes in the future once these wear out."
  },
  {
    "user": "Christopher C.",
    "rating": 5.0,
    "message": "Good sneakers but not water resistant at all"
  },
  {
    "user": "Gabriel Outeda",
    "rating": 4.0,
    "message": "Muy justo de talle, les recomiendo pedir un talle más..."
  },
  {
    "user": "big j",
    "rating": 5.0,
    "message": "Big guy with wide feet.... they fit great."
  },
  {
    "user": "Kevin Agler",
    "rating": 5.0,
    "message": "These shoes are great comfortable to wear all the time lol made a good purchase!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Used for every day walking . Shoes are very comfortable  and give good support."
  },
  {
    "user": "Alex",
    "rating": 5.0,
    "message": "Fit to size and feel great"
  },
  {
    "user": "victoria m  flores",
    "rating": 5.0,
    "message": "They are super comfortable ! I have. High arches and these where perfect!!! I use them at the gym or on the go !!! Totally recommend them these are my second pair !!!"
  },
  {
    "user": "Terry Lee Murphy",
    "rating": 4.0,
    "message": "Love color and the feel great"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I can’t talk about the longevity because I couldn’t wear these shoes for long before returning them. I wear a size 10 and these are clearly a 9 (although the tag does say 10). They seem well made and durable, so my 4-star is based on that."
  },
  {
    "user": "Jorge Caceres",
    "rating": 5.0,
    "message": "Buen material, la talla calza como indica.. hay que probarlos con el tiempo"
  },
  {
    "user": "James R Casey",
    "rating": 5.0,
    "message": "These shoes might be the best fitting shoes I’ve ever bought. I have wide feet and I usually have to buy a whole size bigger to have them feel ok. The extra wide size fits great."
  },
  {
    "user": "ariel",
    "rating": 5.0,
    "message": "Really happy with it."
  },
  {
    "user": "jorge bustamante",
    "rating": 5.0,
    "message": "They're comfortable and breathable."
  },
  {
    "user": "Paul",
    "rating": 5.0,
    "message": "This was my first pair of Under Armor sneakers and I was really pleased with how comfortable they were and how well made they were too. These sneakers are very light, with excellent support as well."
  },
  {
    "user": "Joshua Mwololo",
    "rating": 5.0,
    "message": "I use them for basketball and they are comfortable and have good grip"
  },
  {
    "user": "Tyewest78",
    "rating": 5.0,
    "message": "Fit Great! Feel Great! Look Great! What else need I say?"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have plantar fasciitis and usually need additional support from insoles. These are the only shoes I’ve ever owned that keep my feet comfortable throughout the day without insoles or added support. Hope this helps."
  },
  {
    "user": "NurseB",
    "rating": 5.0,
    "message": "My husband got these for a birthday gift and now only wants these shoes. Wears them every where. Probably about to buy his third pair sometime soon"
  },
  {
    "user": "Anti",
    "rating": 5.0,
    "message": "I like the price and the level of comfort they offer. I usually wear 11s but I like this ones a little looser so 11.5 it was."
  },
  {
    "user": "Kris Shaffer",
    "rating": 5.0,
    "message": "Comfortable well-fitting shoe."
  },
  {
    "user": "Nick",
    "rating": 5.0,
    "message": "I wanted an all black work shoe for working around the fire house as work boots are prohibited from the living quarters and I didn’t like working/walking in sandals all day so I took a chance on these shies. They are completely black which is hard to find an all black athletic shoe, they fit comfortably, and have held up great. A slip on version would be even better but these are doing fine so far. I did have to put an aftermarket sole in for comfort as my feet started to hurt pretty bad after a few hours standing but that was a small investment for comfort. Highly recommend."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "No puedo creer q estas tenis tengan tan buen precio y tan buena calidad a la misma ves"
  },
  {
    "user": "Rian Powell",
    "rating": 5.0,
    "message": "Good fit nice"
  },
  {
    "user": "Ashley Bosquez",
    "rating": 4.0,
    "message": "My husband had this version (Charge Assert 9) from a in store purchase and wanted to get them again. We ordered the same size and they were a little smaller than his original. He tried to stretch them out and wear them around to break them in, but it didn't help. Order a half size up."
  },
  {
    "user": "Mike H.",
    "rating": 5.0,
    "message": "These shoes fit perfectly. Very comfortable. I was pleasantly surprised."
  },
  {
    "user": "Dusty Cowick",
    "rating": 5.0,
    "message": "I like the shoes because I've got wide flat feet and wear a size 13 US and have plof room my toes don't feel like there being crushed together"
  },
  {
    "user": "K Loca",
    "rating": 5.0,
    "message": "I bought these needing a wider toe box , and these did the job . Comfy and looks good when wearing"
  },
  {
    "user": "Dee",
    "rating": 5.0,
    "message": "Very good fit and breathable to prevent feet from excessively sweating, could use a little more padding (just my opinion) but overall a very good shoe for a good price, would definitely buy again if they're still available when I wear these out"
  },
  {
    "user": "Dafud iza",
    "rating": 5.0,
    "message": "Buena calidad"
  },
  {
    "user": "David Rizzo",
    "rating": 4.0,
    "message": "Only negative is I had to replace with shorter laces.. that increased the investment a few  dollars. The laces that came with the shoes were crazy long."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are being used by my husband who works delivering packages. He goes through shoes like water, these he says the soles are lasting a lot longer than anticipated, he says they are the best his found out there. It’s like walking on pillows, and are really comfortable. 100% recommended by a delivery person"
  },
  {
    "user": "Michael Shedwell",
    "rating": 5.0,
    "message": "Nice.... Put them on my feet and walked around outside, sometimes I run depending on the day. I also get new socks everytime I get new sneakers... Amazing."
  },
  {
    "user": "Jeffrey James Foster",
    "rating": 5.0,
    "message": "For the cost it is an excellent shoe"
  },
  {
    "user": "Blake Galligan",
    "rating": 4.0,
    "message": "Good comfortable shoes that fit right and are very stylish.  Only complaint is Blue is harder to match with a variety of clothes than I thought it’s it’s be😂😂.  First pair of under armor shoes and most likely will not be the last:)"
  },
  {
    "user": "David B",
    "rating": 5.0,
    "message": "I have been using this brand for years.  I get a new pair every 6 months because I put a lot of miles on them each week. These are my running/power walk shoes for as long as they make them!!"
  },
  {
    "user": "Cristian Robles",
    "rating": 4.0,
    "message": "Very nice, just like the image, soft, a little heavy because its pads are made of hard rubber but they do not prevent exercise or walking. My son liked them for an 8.5 they look really great"
  },
  {
    "user": "Ulpiano García Cobos",
    "rating": 4.0,
    "message": "El producto es cómodo sin embargo la talla no es la indicada es un poco más pequeña, si vas a comprar estos zapatos te recomiendo comprar media talla más grande a la habitual."
  },
  {
    "user": "Andrew B.",
    "rating": 5.0,
    "message": "These are very comfortable, will be buying second pair for my work out shoes."
  },
  {
    "user": "Wayne Horikami",
    "rating": 4.0,
    "message": "Look great and wish it would be a little wider"
  },
  {
    "user": "E. W.",
    "rating": 5.0,
    "message": "My husband and son wear 4e shoes but they are hard to find these look great and last and aren’t too stretched out and bulging like most shoes.  They say they have quickly become their favorite over the new balance and ASICS they were wearing for everyday use."
  },
  {
    "user": "Samuel Taylor",
    "rating": 5.0,
    "message": "Great looking and fit"
  },
  {
    "user": "CLM",
    "rating": 5.0,
    "message": "Great shoe very comfortable."
  },
  {
    "user": "levaniko",
    "rating": 4.0,
    "message": "I was always buying New Balances, but I gave it a try. Overall not bad, but returning back to NB..."
  },
  {
    "user": "Jairo Albornoz",
    "rating": 5.0,
    "message": "I am a sound technician and during my work I have to walk for a long time or stand for a long time, and these shoes have been the best choice not to end my day with my feet destroyed. I buy them from version 2, and I still have a couple of these for more than 2 years that have been in very good condition."
  },
  {
    "user": "James McGinley",
    "rating": 4.0,
    "message": "Better than nikes"
  },
  {
    "user": "Kirk Henneberger",
    "rating": 5.0,
    "message": "Nice all purpose sneaker, my second pair. Sadly, despite what others say, you will need to replace these $56 sneakers eventually. They do not last for eternity"
  },
  {
    "user": "Jeremy J.",
    "rating": 5.0,
    "message": "Very comfortable, sturdy and supportive. Excellent for fitness training and running/walking. Size15 fits excellent. Color and design are attractive too."
  },
  {
    "user": "Amber Bradley",
    "rating": 5.0,
    "message": "These are nice shoes. They are lightweight on the feet but so comfortable. They have held up really good for all the walking and running my son does. Very durable."
  },
  {
    "user": "J.E.T",
    "rating": 5.0,
    "message": "Comfortable, great fit."
  },
  {
    "user": "Michael",
    "rating": 5.0,
    "message": "They are a very comfortable pair of shoes that fit perfectly."
  },
  {
    "user": "happy customer",
    "rating": 5.0,
    "message": "I bought these shoes for my husband and they were exactly what i ordered. I also purchased and under amour baseball cap and shirt that goes perfect with the shoes."
  },
  {
    "user": "Tyron Sandin",
    "rating": 5.0,
    "message": "Good workout shoe."
  }
]