[
  {
    "user": "Jaimie",
    "rating": 5.0,
    "message": "These had clearly been worn.  When I pay 90 dollars for a pair of shoes I would expect a new pair.  Gross.  Returning and repurchasing in hopes for a new clean pair.  They are gorgeous and super sparkly. But I couldn’t get past the fact that I finally splurged on something other than Walmart sneakers for my birthday and they came dirty. Update: it didn’t give me the option to exchange for the same thing, so I returned and rebought.  The next pair came brand new, in plastic bags and clean and I am very happy with them.  The sparkle is incredible."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Reviews that I read said the shoes were narrow and tight and that you should size up at least to have two full size I wear a 6 1/2 so I bought sevens they lose they run very true to size they’re extremely well-made there’s no sequins or gems falling off in the box the platform is solid and white but they are still lightweight not cumbersome and heavy I’m thinking about getting the rose gold ones because I love them so much extremely comfortable well-made but they don’t run small"
  },
  {
    "user": "kimberly",
    "rating": 5.0,
    "message": "I bought these to wear for a Vegas trip to see my son (after a few years of not seeing each other due to illness and COViD ) These shoes were not only absolutely beautiful but they were comfortable! I have received numerous compliments from people when I was in Vegas and I wore them on casual Friday at my law firm and people raved about them! You won’t be disappointed by buying them!"
  },
  {
    "user": "Alexsandria H.",
    "rating": 4.0,
    "message": "Beautiful sneakers but runs large. I suggest you order half a size smaller than your regular size.  Usually I wear 9.5 but in this style it was big I tried to order size 9 Unfortunately it was sold out. I had to return the shoes."
  },
  {
    "user": "sparklefaery",
    "rating": 4.0,
    "message": "These are very cute. Who doesn’t love sparkly red shoes. The don’t have any arch support so the make me feel flat footed. Overall. I love them. ❤️"
  },
  {
    "user": "Holly Schoolcraft",
    "rating": 4.0,
    "message": "Too cute for words. Fit comfy, jewels stay on. LOVE LOVE LOVE!"
  },
  {
    "user": "Alesia",
    "rating": 5.0,
    "message": "Gorgeous shoe! It adds a touch of class to any casual you want to dress up. I usually wear an 11 and ordered an 11. The 11 was a little lose, but the 10 was too tight. I suggest wearing thick shoes."
  },
  {
    "user": "Bridget M",
    "rating": 5.0,
    "message": "The fit is horrible.  I brought them for a wedding and wish I had not.  They are clunky.  They hurt.  I had them in less than an hour and wanted to throw them in the ocean."
  },
  {
    "user": "NICKY WRIGHT",
    "rating": 5.0,
    "message": "I was so happy to find these sneakers! I looked at so many other places to find the perfect one to match my wedding dress and I finally found these. They were so comfortable I was able to wear them all day and into the late night. Definitely happy with my purchase."
  },
  {
    "user": "Brenda Page",
    "rating": 5.0,
    "message": "I loved the look of the shoe however they are not wide enough and I am going to return them and inquire if they come in a wide fit. The shoe is firm and has no give which causes a tighter fit. The shoe was perfect for my need just need it wider in the fit"
  },
  {
    "user": "Military Mom",
    "rating": 5.0,
    "message": "They are very comfortable I wore them after the wedding when I took off my high heel shoes. I received lots of compliments."
  },
  {
    "user": "Stacy Daniels",
    "rating": 5.0,
    "message": "I ordered these for my wedding and I loved them. They were perfect and I received several compliments."
  },
  {
    "user": "Samantha Coy",
    "rating": 4.0,
    "message": "I ordered the white pearl for myself but had to order these for my mom since she loved them so much."
  },
  {
    "user": "Kim Pipkin",
    "rating": 4.0,
    "message": "Love them. I ordered my size 7.5 and are just a tad large, but if I ordered a 7 my toe would it the tip. They didnt come with the extra rhinstones like others have gotten but Amazon gave me a partial refund. I can't wait to wear them for my wedding!"
  },
  {
    "user": "Robin P.",
    "rating": 5.0,
    "message": "A perfect comfortable alternative to painful fancy high heels!"
  },
  {
    "user": "mary",
    "rating": 4.0,
    "message": "It's a cute shoe, but nothing to go shopping in. It has no arch supports and is a bit snug in the toebox."
  },
  {
    "user": "G. Pedroni",
    "rating": 5.0,
    "message": "My wife bought these shoes. She received  many compliments. She wants more in different colors."
  },
  {
    "user": "Demetria Anderson",
    "rating": 5.0,
    "message": "Only had a chance to wear once, but really comfortable"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are SO fun and cute!! My only dislike, and it’s not even that big of deal, is that the rubber sole smells really strong, almost chemically mixed with the “new shoe” smell. I’m not sure how long that’ll take to dissipate and haven’t experienced that with other Betsey Johnson sneakers. Otherwise, they’re great!"
  },
  {
    "user": "Linda K. Bonsell",
    "rating": 5.0,
    "message": "I have one bad foot and the shoe didn't fit well.  Love the shoes, however."
  },
  {
    "user": "Emmanuel Clark",
    "rating": 4.0,
    "message": "Beautiful, sparkly shoes for my wedding! However, the back of the shoe where the back of your ankle is--rubs against the skin and it is very uncomfortable and painful. You would need socks higher than ankle-socks to be comfortable."
  },
  {
    "user": "Lillie P Reid",
    "rating": 5.0,
    "message": "Ordered for a 1950 look for 70th birthday. They air beautifully with my dress😁"
  },
  {
    "user": "Callie Hart",
    "rating": 5.0,
    "message": "Wow these are the most gorgeous, sparkly sneakers that truly are amazing. The sparkle is so incredible. Fit very comfortably as I didn't break them in before wearing them out and was still able to wear them comfortably for hours. Fit pretty true to size. Most beautiful shoes I own."
  },
  {
    "user": "JuJuBeans",
    "rating": 5.0,
    "message": "I love these shoes! They're well-made and I get lots of compliments on them. They fit pretty much as expected and they're pretty comfortable, too (though I haven't walked miles upon miles in them). The laces are white, however, so be aware that they can get dirty pretty quickly!"
  },
  {
    "user": "SnowBunny80",
    "rating": 5.0,
    "message": "Love these, have four  pair now."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "2nd pair (Rhinestone) purchased uncertain about authentic, or not. Box did NOT contain the small bag of various rhinestones taped to the box lid for replacing stones if they fall off. Wore once so far."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I have had many compliments."
  },
  {
    "user": "UKR",
    "rating": 5.0,
    "message": "I can’t wait to wear these during my wedding!!"
  },
  {
    "user": "Buyer",
    "rating": 5.0,
    "message": "The media could not be loaded. These shoes are exactly as pictured. I got the iridescent sparkle ones. Now ALOT of people said to size up by half a size which I did buy I say order your usual size. Now I’m ok to wear the size I got but I might likely need a little insole but also I have not tried them on with socks yet, just my bare feet. So that could change the way they fit. So bite they are a heavy sneaker so if you are looking for lightweight then try another sparkle style sneaker. As for quality, they are perfect, not a single stone out of place and they look amazing on!!"
  },
  {
    "user": "Cody",
    "rating": 4.0,
    "message": "I had to order and return them a few times to get the right size but they are still a bit big on me.  I typically wear a 9 which were way too big.  The 8 were a bit too small and the 8.5 is a little bit too big too.  I ended up keeping the 8.5 and will just have to lace super tight and wear thick socks.  If I didn’t absolutely love them, I’d send them back and give up altogether."
  },
  {
    "user": "Iselia♡",
    "rating": 5.0,
    "message": "The media could not be loaded. So honestly bought these at the last minute last night and got them same day today! Reading through the reviews I saw it ran small... However I did not completely full size up-I am a 9, got 9.5. (As I didn't want to risk it with a 10.) So right out of the box I was like oh my goodness in all things fairy tale sparkle these shoes... Wow breathtaking. Didn't even have to put flash on these things to see they sparkle like mad! Beautiful crystals! Yet obviously on closer inspection there were pieces of lint embedded into the crystals, some threads popping out, and some glue lines and only one line of crystals missing on both shoes. Which isn't even all that bad? I got some tweezers and those minor flaws were fixed. Now for the sizing~ on immediate try on I was scared because after loosening all the laces my foot slid in easy and kind of felt, too big. I was like no! But after putting on socks and tightening them up it fits like a charm! I totally recommend getting your 1/2 size that way youll have enough space,-especially with thicker socks for this weather. The only disappointment I got from these is that everyone says they got an extra baggie for missing crystal repair and I didn't get one? I'm thinking I might have gotten a pair someone sent back. I really wanted some back up crystals to fix the missing ones. :/ However overall BUY THESE SHOES! if you live for sparkle go for it girl! Catch me at Disney on Christmas wearing them lol"
  },
  {
    "user": "Sandra kish",
    "rating": 5.0,
    "message": "I’m So happy with these sparkle shoes! And they are comfortable too."
  },
  {
    "user": "Jennifer Herpel",
    "rating": 4.0,
    "message": "I don’t have an issue with the shoes at all. They are absolutely beautiful! So sparkly and colorful. However the refund process was absolutely ridiculous. I did not received the full price of the purchase all at once. I received several different emails which eventually added up to the full amount. Some went on a gift card and some went back to my debit card. Buyers beware if you have to return these shoes. Double check your sizing folks!!"
  },
  {
    "user": "Miss Atlantic City",
    "rating": 5.0,
    "message": "I saw these on someone else at a baseball game and I had to have them! I wore mine to a concert. They are so comfortable. I got so many compliments on how pretty they are. They could be worn with jeans, shorts, dresses. I just love them. I got my regular size and they feel a little big to me. You don’t need to go up a size if you are in between sizes. My regular size fits with a little room."
  },
  {
    "user": "Alicia L.",
    "rating": 4.0,
    "message": "I got these to wear to an event since I can’t wear dress shoes right now and they are just as cute in person if not more.  I wear a 6 1/2 in sketchers and new balance so I ordered that with these, however they seem to run large .  A 6 would have probably been fine."
  },
  {
    "user": "anyavix",
    "rating": 4.0,
    "message": "So sparkly and pretty but stiff sole so not comfy for me. It was large in the heel for me and I wear an 11. Wanted to love but just didn't work for me."
  },
  {
    "user": "griss",
    "rating": 5.0,
    "message": "Bellos bellos bellos!!!!!!!"
  },
  {
    "user": "Marjorye Lopez",
    "rating": 5.0,
    "message": "Perfectas"
  },
  {
    "user": "Christian Smith",
    "rating": 5.0,
    "message": "I bought the boots version of these, and I LOVED them, but I didn't have a lot of opportunities to wear them. When I found these, I decided to get them too. Holy crap! First of all, they're stunning! When I go out, I get at least 1 compliment. I've had them for about 6 months now, and the gems are still perfect. I wear an 8.5/9, and the 9 fit perfectly. I know they're on the pricy side for non sneaker fanatics, but even a  basic pair of Vans is $65 today."
  },
  {
    "user": "LisaMarie B.",
    "rating": 5.0,
    "message": "The sneakers are not only stylish but they are comfortable. They run big so order your true size."
  },
  {
    "user": "Hannah",
    "rating": 5.0,
    "message": "Soooo cute!! I got the pearl size 7, I’m usually a 6.5/7 and I’m glad I went with the 7! The regular/thicker sock made them feel a little snug, so just going to wear them with a thinner / no-show sock they fit perfect! The pearl is still super shiny and perfect for my wedding :,) I’m obsessed!"
  },
  {
    "user": "Maria  Espinoza",
    "rating": 5.0,
    "message": "The shoes run a bit large. I would size down. They still look great and they saved my feet"
  },
  {
    "user": "jackson",
    "rating": 3.0,
    "message": "Looks good but not comfortable to wear for very long"
  },
  {
    "user": "Speechtree",
    "rating": 5.0,
    "message": "Something is off with my entire right side and I kept falling.  I can tell you that these shoes have stopped my falling because of the sturdy heels it allowing my balance reactions to work. No more falling!!! I can feel my losing balance but the shoes allow time for my balance reactions to the process.  These shoes have saved me from wearing those old lady brogans we watched our parents  (born in the 1920'a and 1930') wear. As a young child, I always thought my Mom's shoes were the ugliest things I had ever seen on someone's feet. My prayer was \"Please do not let me wear those shoes when I am old\",  Please do not change your design, Besty Johnson. People stop and comment on how cute my shoes are vs. how ugly my feet look :)"
  },
  {
    "user": "Lena",
    "rating": 4.0,
    "message": "The vendor was excellent. The shoe itself not too much. Slightly bigger then expected"
  },
  {
    "user": "AZ Reviews",
    "rating": 5.0,
    "message": "Beautiful shoe, very well made and comfortable. Great price."
  },
  {
    "user": "Smithec26",
    "rating": 5.0,
    "message": "These shoes are amazing. They look great and I get a million compliments on them when I wear them. This is your warning though they are very heavy! But not unwearable just heavy from all the bling."
  },
  {
    "user": "Doris Hall",
    "rating": 5.0,
    "message": "Amazing beautiful comfortable stylish.. im in love"
  },
  {
    "user": "Kindle Customer",
    "rating": 4.0,
    "message": "This was comfortable but a half size too big. I love the embellishments and the product was of a good quality. Good product."
  },
  {
    "user": "Kenny Crosby",
    "rating": 5.0,
    "message": "The media could not be loaded. These are my favorite shoes. I am a very bling person and love all things bling. My car has bling and my AirPod holder is bling and now I have bling shoes. I followed the advice of others and bought these a whole size up and then 1/2 size up but ended up returning both and getting my regular size. They were true to size for me. Gotten so many compliments and they look like disco balls on my feet. The sparkle explodes in the light and the pictures don’t do it justice. Absolutely love these and wore them to Disney World. Now I wear them everywhere. Will be buying Betsy Johnson’s blink ankle boots too soon. If you love bling these are a must have."
  },
  {
    "user": "MzLegz",
    "rating": 4.0,
    "message": "This is a nice sneaker, cute to dress up outfits; however it was definitely too heavy with the dole of it being as thick as it is/was.  If the doke of the sneak wasn’t so thick, wouldn’t have had any problems with it."
  },
  {
    "user": "TayRoe",
    "rating": 3.0,
    "message": "Super cute but you can feel the sticky from the jewels they also look like they will pop off after a short time"
  },
  {
    "user": "erin reagen",
    "rating": 3.0,
    "message": "These are adorable. I looked high and low for them before finding them on Amazon. Unfortunately, I had to return. I wear size 38. Size 7.5 was too big and size 7 uncomfortable. 😢"
  },
  {
    "user": "Paula Mason",
    "rating": 5.0,
    "message": "These shoes are awesome and are extremely eye catching. Received lots of compliments. You should buy them."
  },
  {
    "user": "Elizabeth P Anderson",
    "rating": 3.0,
    "message": "Love the sparkle. Flat bottom had to buy cushioned insert with arch support. Not flexible."
  },
  {
    "user": "Tammy C.",
    "rating": 5.0,
    "message": "I bought these for my wedding and added sheer laces in place of the ones that came with the shoes. So cute!!! And comfortable too. What’s not to love??? I will be wearing them often after the wedding!!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I've only tried them on but they are comfortable and fit well. I am between a 8.5 and 9 due to wide feet. The 8.5 fit perfectly and my feet don't feel cramped. Pearls are beautiful in person. Can't wait to wear them for my wedding."
  },
  {
    "user": "Claire turner",
    "rating": 3.0,
    "message": "Really cute ! But so heavy and stiff"
  },
  {
    "user": "TSC",
    "rating": 5.0,
    "message": "The shoe is a show stopper. The sparkle is fantastic. It feels pretty comfortable as I tried them on, but I was never able to wear it because it is too large. I ordered my usual size (which can sometimes be on the larger size since I hate tight shoes) and I can't keep the sneaker on my feet. I've got about an inch extra space in the heel, so these are being returned."
  },
  {
    "user": "Ashley",
    "rating": 2.0,
    "message": "For the price of these im beyond displeased. I ordered these for my wedding and it's too late to return and find and purchase other ones. The beading seems like it is a prefab stick sheet. It's not fitted the same on both shoes. When I first touched the shoe it was super sticky (still is) and there is excess glue in spots completely covering the beads. I really went back and forth on this purchase because of the price and on a budget for the wedding. I wish I did not purchase these. I did change the laces and there is glue all over the laces which I can easily remove but just to explain how much glue these are coated in. Crazy. I doubt they will hold up to more than 1 or 2 wears."
  },
  {
    "user": "Linda M. Owen",
    "rating": 5.0,
    "message": "I feel like I definitely got a great pair of shoes, both comfortable and totally worth the money! They feel good and are so much fun to wear; definitely dazzle when in the sunlight. I love them"
  },
  {
    "user": "Rob Harris",
    "rating": 3.0,
    "message": "I adore these shoes, I’m really sad I can’t give them five stars. They’re so beautiful but definitely not for daily wear. The sole has torn on one of mine. I’m heartbroken. But if you’re looking for the perfect special occasion sneaker, look no further! These are amazing!!"
  },
  {
    "user": "Lisa Lane",
    "rating": 5.0,
    "message": "They were great just a little big....I normally wear a size 8.5 do that's what I ordered, but I should have got a size 8."
  },
  {
    "user": "E. Ross",
    "rating": 5.0,
    "message": "I ordered the gold pair for my upcoming wedding and it was the perfect color and they are comfortable."
  },
  {
    "user": "Tina Simmons",
    "rating": 5.0,
    "message": "I like the color and the fit of these shoes. You can wear them with a cute dress or casual shorts. Can't fail with them."
  },
  {
    "user": "DEBORAH TURNER",
    "rating": 4.0,
    "message": "The shoe is beautiful, lots of sparkle.  It runs small so I went up a size. The larger size is too big and the shoe is too wide. If an insole is added it might be a better fit."
  },
  {
    "user": "s.Perriello",
    "rating": 5.0,
    "message": "My daughter is enjoying this product. She is going to wear it to prom. Not only will it be stylish under her dress, but she won't be towering over her date and be comfortable at the same time."
  },
  {
    "user": "Avid",
    "rating": 5.0,
    "message": "These shoes are great, and I can even wear them to work. The only issue is that they run a little small. I usually get a 7.5, and although I could get them on, my big toe was touching the side of the shoe, over time that would be an issue. So I exchanged them for an 8."
  },
  {
    "user": "Mildred",
    "rating": 5.0,
    "message": "I like this tennis. They are comfortable.  I use this tennis everyday."
  },
  {
    "user": "Christina",
    "rating": 5.0,
    "message": "The shoe looked like the picture cute"
  },
  {
    "user": "Kat Atwood",
    "rating": 3.0,
    "message": "I usually wear an 8.5 tennis sneaker. When I buy online, I often have to order a size 9 based on reviews.  I bought and reordered this shoe three times; that's how much I wanted this shoe! Here's how that went: the 9 was way too long.  Sent it back and ordered an 8.5. Also too long.  Sent it back and ordered an 8.... yep, too long.  Tried one more time with a 7.5.... the length fit but the shoe was too tight.  I gave up. I will say that each return was refunded within a day.  Great customer service!"
  },
  {
    "user": "Jennie Hewitt",
    "rating": 5.0,
    "message": "Loved them"
  },
  {
    "user": "Texascj5",
    "rating": 4.0,
    "message": "These are the cutest, but they run large and they are very heavy. I had to Size down half a size, but the exchange was easy and postage was paid. Not a daily wear sneaker, but cute for those special occasions."
  },
  {
    "user": "AnitaMarie",
    "rating": 3.0,
    "message": "Pictures don’t do them justice. Soo much prettier in person but as much as I wanted, I couldn’t make them fit. I normally wear a 8. I tried a 8.5 in the store and they were way too big, I ordered the 8, and they were tight and narrow, and since a few weeks had passed, I really could not believe the difference between the sizes to the point I thought I must’ve tried on a 9 in Macys. So, I returned them for an 8.5 and nope, it was the same, they were wide and when I took a step, my heel would come out. Kinda strange. I’m envious of those who can wear them!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Lo q me agrada q los quería para una fiesta para la noche y me fascinaron Porq brilla fue excelente"
  },
  {
    "user": "Sadie M",
    "rating": 5.0,
    "message": "The media could not be loaded. Okay, as I read the reviews it was recommended to size up a half size so I did. I actually returned the sized up pair and got my correct size. So in my opinion the shoe is true to size! I also did not have any problems with the sparkles falling off. Overall love the shoes and will be wearing them for my winter wedding!"
  },
  {
    "user": "Karen",
    "rating": 5.0,
    "message": "Got these for my daughters prom shoes. She had a long dress and these were perfect. Cute yet very comfortable. She said they were the most comfortable shoes she’s worn to a dance yet."
  },
  {
    "user": "joni roberts",
    "rating": 5.0,
    "message": "I have several colors of these beautiful and comfortable blingy sneakers. 6 pair yo be exact with the navy blue still in rout!! I have yet to be disappointed. I absolutely love love love them.  Now I just gotta figure out how to get my hands on a pair of the sold out fuchsia colored Betsy sneakers!!!  I usually wear 8.5 to 9. I ordered a size 9. Fit perfectly!"
  },
  {
    "user": "GLW",
    "rating": 3.0,
    "message": "The shoes are even more beautiful in person and they're comfortable, too. They run about half a size large and are wide. There are loose threads and what looks like hot glue coming out from the bottom of the rhinestones. The sewing was wobbly, like the machine or person who was creating the shoe was shaking. But I'm not sure if anyone would notice from a distance. Not sure if I'll keep it anyway or return."
  },
  {
    "user": "Haley G",
    "rating": 5.0,
    "message": "I hate heels they never feel good on my feet so forgoing wedding tradition in my family i went with sneakers. I saw these online and knew right away this is what i need. Bought them they fit great are very comfortable and make the perfect addition to my dress."
  },
  {
    "user": "brenda m. smith",
    "rating": 4.0,
    "message": "These shoes looked amazing but they were so narrow towards the toes. Difficult to wear with socks. Served my purpose as wedding shoes."
  },
  {
    "user": "Rose Kolodny",
    "rating": 4.0,
    "message": "If you have big feet, size up. I got a 10 and usually wear a 10 but holy cow they are tight. Cute, though."
  },
  {
    "user": "Michael Rodriguez",
    "rating": 3.0,
    "message": "The media could not be loaded. Larger pearls have the color already scratched off when I took them out of the box and random loose treads on both shoes. It's too late for me to return because these are for my flower girl and the wedding is in just 9 days. They are really cute and iv purchased the other style with the gemstones and I had absolutely no problems with those."
  },
  {
    "user": "Tamara Brown",
    "rating": 5.0,
    "message": "These shoes are an amazing quality! They are true to size. I wore them to a wedding because I cannot wear heels and received many compliments on them. beautiful and comfortable"
  },
  {
    "user": "Justin Lewis",
    "rating": 5.0,
    "message": "I read a lot of the reviews and most of them recommended a half size up, but I would have gone true to size and stuck with 8.5. I ordered a 9 and they fit great anyway. I LOVE these shoes, they are so sparkly and lovely!"
  },
  {
    "user": "Livi",
    "rating": 2.0,
    "message": "I ordered this in a 10 and an 11 I’m normally a 10.5 the 10 fit was a little tight but the 11 was huge when I compared the shoes the 11 was like a monster shoe not to mention the shoe was poorly made. I was disappointed because without really looking the shoe is super cute and sparkly but the craftsmanship is awful!"
  },
  {
    "user": "Amy Garnet",
    "rating": 5.0,
    "message": "Bought these for St. Patty's Day celebration!  They are great.  Perfect emerald green. None of the gems fell off, when I fell, so that's good. Comfy too"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "I usually wear a 9 and the 9 in this shoe was huge. Ordered the 8.5 to compare and it felt just as big, maybe even a little wider than the 9.  I held the 8.5 and the 9 up side by side and they were both the same length. Sizing is inconsistent. I will be returning both sizes and trying an 8. The shoe is so cute so hopefully this works.."
  },
  {
    "user": "Joy A Timlin",
    "rating": 5.0,
    "message": "I will most likely buy another pair!"
  },
  {
    "user": "Tula’s mom",
    "rating": 5.0,
    "message": "I love them! The pink sparkle makes me feel like I have magic in my feet!"
  },
  {
    "user": "Susan M Kribs",
    "rating": 5.0,
    "message": "Bought these so I could get down on the dance floor at a wedding and have something fun to wear. They were very comfortable and I loved how sparkly they are!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "These shoes are so comfortable and I get compliments everywhere I go. Definitely worth the money!"
  },
  {
    "user": "Tammy Duarte",
    "rating": 5.0,
    "message": "Beautiful shoes but too big. Not enough time to reorder."
  },
  {
    "user": "Tamara R. Murray",
    "rating": 5.0,
    "message": "OMG! THESE SHOES ARE ABSOLUTELY GORGEOUS! THE SPARKEL!!! The photo does not do any justice on how well these shoes shine! You will definitely catch a lot of attention in these beauties! Now, as for the size they run narrow and small. Luckily,  I have narrow feet. I ordered a size 8 1/2 and they fit.  It was a little snug across the in step of my foot. But after walking in them they fit with no problem.  So, if you have wide feet order a size up.  I'm happy I made this purchase and I'm definitely going to wear them on my bday! Ladies these shoes are definitely a must buy!😁👍🏽"
  },
  {
    "user": "Katherine E. Anding",
    "rating": 5.0,
    "message": "Love these! So much fun and do comfortable"
  },
  {
    "user": "Devika B.",
    "rating": 4.0,
    "message": "These are really pretty and comfortable. However they run very small. I would suggest a whole size up. I'm a six in almost every shoe and needed a 7. Trust the reviews! And then go enjoy your fun new sparkly sneakers"
  },
  {
    "user": "Allison J. Godden",
    "rating": 5.0,
    "message": "I used the shoes to go to a formal event. They were perfect with my black dress and I was comfortable all night long!!!!!"
  },
  {
    "user": "KitKatinBama",
    "rating": 1.0,
    "message": "Saw these at Belk. they only had a size 7, 8 and 10. I normally wear a size 9 so I tried on the 8.  they were just about perfect but I was not wearing socks so I figured I needed an 8 1/2  since I would always be wearing socks with them.  When 8 1/2 arrived they were tight.  So Ordered a size 9 from Betsy Johnson's website because Belk was out of 9's.  they fit exactly like the size 8. I then bumped it way up to size 10 from Amazon. they were huge, exchanged them for 9 1/2.  They feel like a Wide Version.  there's too much room in the toe area and I can't get the laces tight enough.  My heels feel like they could slip out as I walk. Because the laces are so tight the toe area has a part that bumps out/up.  there is too much shoe trying to squeeze together. OH, They all were laced up backward from the way I lace my shoes.  I had to take out laces and do them my way.  Which is probably how everyone laces their shoes. I just gave up 😢 Glad there were many who actually got a pair that fit. Wearing size 9.5 in pic."
  },
  {
    "user": "mallori",
    "rating": 3.0,
    "message": "I really wanted these shoes to work. Ordered a 10 and they were way too big. Ordered a 9.5 and could barely squeeze my foot in. Bummed because they’re really cute!"
  },
  {
    "user": "Victoria Molina",
    "rating": 5.0,
    "message": "Super comfy! I wore these as part of my Halloween costume to Walt a Disney World and I walked around the whole day with them! Very impressed! The picture shows them in the bottom but it was great because I didn’t have to wear heels and yet it still matched the outfit!"
  }
]