[
  {
    "user": "Jenn",
    "rating": 4.0,
    "message": "These shoes are exactly as pictured and very nice! Extremely lightweight great for walking and even wearing to the gym for workouts. The shoes fit nicely however my only complaint is that the opening for your foot is tight. My foot does not easily slide into the shoe and I have to wiggle my foot into them which could be a big issue if you have large ankles and/or wide ankles. The shoe laces are false and only for design. You actually cannot widen the opening by adjusting the laces."
  },
  {
    "user": "A. Roche",
    "rating": 5.0,
    "message": "This my second pair of the Addidas Cloudfoam athletic shoe.  They are very comfy and great for running around town.  I would not wear these for any serious exercise such as running because I'd need more support.  They can also be a bit harder to get on.  But over all, these are cute, comfy everyday shoes."
  },
  {
    "user": "Jaclyn",
    "rating": 5.0,
    "message": "Love these shoes. Bought my daughter a pair, then myself one. Not a supportive shoe, but great for everyday wear, only downside if you slide your foot in, so that can be a bit challenging. Nice finger hole on back to help though."
  },
  {
    "user": "Carolyn",
    "rating": 4.0,
    "message": "I am disappointed in the amount of cushioning in this shoe. Nevertheless, it is comfortable for me after I added an arch support. Looks nice on my feet."
  },
  {
    "user": "Laura",
    "rating": 4.0,
    "message": "The shoes are all one piece (no tongue) so they feel more like a slip-on than a true running shoes. They are very soft though oddly it does feel like you can feel every little pebble through them. Probably nice for light workouts but I wouldn't recommend for running."
  },
  {
    "user": "Emily Burke",
    "rating": 5.0,
    "message": "I was looking for a cute but comfortable tennis shoe to workout in and I LOVE these! They are re so easy to slip on when you’re running late. They are cute to just wear for errands. And they give the support I need when working out."
  },
  {
    "user": "Janet Perry",
    "rating": 4.0,
    "message": "I couldn’t pull this super cute shoe on over my high arch. Boo! I really liked it."
  },
  {
    "user": "Luiza Menezes",
    "rating": 4.0,
    "message": "I'd say the front part of the insole of the shoe isn't very well made, it feels like it cuts off immediately and leaves toes in an awkward position. It's difficult to describe, not a deal breaker but definitely not signs of a well-manufactured shoe either. Getting stains off it is nice and easy if you use Shout and throw it in the wash but then you risk removing the glue from the shoe."
  },
  {
    "user": "K. KOENIGSBERG",
    "rating": 5.0,
    "message": "I wore these to Disney on my Honeymoon and did about 25,000 steps a day starting at the parks at 8:30/9 am and walking till dark. My feet did not hurt they were so comfortable. The only down side is that white is hard to keep clean. They are SO pretty just choose wisely where you wear them."
  },
  {
    "user": "ana",
    "rating": 5.0,
    "message": "it fits very well. i have very narrow feet, a little tight to put on put very comfortable"
  },
  {
    "user": "Robert McAuley",
    "rating": 5.0,
    "message": "gave to my wife as a gift, she told me what to write. If she's happy i'm happy."
  },
  {
    "user": "Dawn Beatty",
    "rating": 4.0,
    "message": "Tight getting on"
  },
  {
    "user": "Michelle Dunaway",
    "rating": 5.0,
    "message": "These shoes are gorgeous and comfy. I love them and they are true to size!"
  },
  {
    "user": "Meg",
    "rating": 4.0,
    "message": "I like these a lot. They are very comfortable and I had a very important day to wear them and they held up well. I had to take state boards for cosmetology. I did not have to think about my feet at all. They are so light weight. However, I would not recommend them for walking or running. They won’t give you enough support. They probably would be fine for the gym."
  },
  {
    "user": "Jenn",
    "rating": 5.0,
    "message": "Not only are they super cute, but they’re super comfy! This is my 3rd pair of CloudFoam’s (yep, I realize I might have a problem) and they might be my comfiest pair! Bonus: They were delivered several days sooner than expected! I’m very happy with my purchase and I get a lot of compliments on them."
  },
  {
    "user": "NikkiDelRey",
    "rating": 5.0,
    "message": "Bought these for work & I’m so glad I did. Extremely comfortable for long periods and cute too. Definitely recommended."
  },
  {
    "user": "Cat Walton",
    "rating": 4.0,
    "message": "Not good for plantar fasciitis. Cute shoes tho, comfortable until they’re not"
  },
  {
    "user": "Emilie",
    "rating": 5.0,
    "message": "These are my daily work shoes. I’m a veterinarian on my feet alllll day everyday. These aren’t supportive enough for running and I probably wouldn’t workout in them, but they’re my favorite every workday shoes. Love catching these on a deal and getting several colors."
  },
  {
    "user": "Katarzyna Las",
    "rating": 4.0,
    "message": "In my experience not the best for long walks. Ended up with blisters on the soles of my feet.  Great for a quick run to the store but would not recommend for long sessions on the treadmill or long walks/runs. I highly recommend for all other types of activities they’re very light."
  },
  {
    "user": "LCuda",
    "rating": 4.0,
    "message": "Love these for comfort and ease. I walk daily about 90 minutes. This is the third time I have bought the. Which says how much I like them. I do feel the soles wear out quickly. But not sure with the amount of walking I do."
  },
  {
    "user": "Therese-Claire",
    "rating": 5.0,
    "message": "These shoes are perfect for running and walking, they have perfect arch and ankle support. The only issue I have is that the opening is so small that it takes so long to squeeze your foot into the shoe. I almost gave up because I assumed I got the wrong size (I know my size in EUR and USA for all Adidas products), once I got my foot in the shoe fit absolutely perfect."
  },
  {
    "user": "DaRielle Snider",
    "rating": 5.0,
    "message": "Perfect walking shoes ! The memory foam is super comfy, but they don’t provide a lot of support for running / working out."
  },
  {
    "user": "Jessie Turtle",
    "rating": 5.0,
    "message": "I was a little skeptical buying these but they are the most comfortable pair of walking shoes I have ever owned. I have not used them for running and don’t plan on it, I don’t think there is enough support for pounding the pavement but for powerwalking they’re phenomenal!"
  },
  {
    "user": "MommaFrye",
    "rating": 5.0,
    "message": "Received these and love them. Comfortable but supportive. Very clean look which received lots of compliments. True to size."
  },
  {
    "user": "Diane",
    "rating": 5.0,
    "message": "Love them, very stylish and comfortable too!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I found these for $42 and it is definitely worth jumping on a good price. These shoes are not as supportive as some other styles I have. I wouldn't wear them to run, do heavy exercise, or go to Disneyland all day but but they are very comfortable from day one for everyday wear, errands, work, etc. which is what I need. I have a previous pair and they have lost some of the cushion but I still love them. The slip on is great, and I think they look really cute. True to size, great price if on sale."
  },
  {
    "user": "Alan",
    "rating": 5.0,
    "message": "By far my favorite shoes !"
  },
  {
    "user": "Darkangel361",
    "rating": 3.0,
    "message": "I bought these shoes specifically for doing clinicals  at my school. It’s also my first time buying shoes on Amazon, so I was a bit iffy about purchasing items like these on here in regards to fit, etc. First- the shoes are very light, not heavy at all, the material is breathable, but due to them being so light they don’t offer much support. Bad things- they feel cheaply made, some of the areas on the front you can almost see a little leakage from the glue that was used to seal so not exactly esthetically pleasing but since they’re all black not super noticeable. Also, I thought these shoes were just a quick slip in and out, no they still have laces, which I didn’t like because I wanted a shoe without laces and the looks of it this looked like that style. Last- I’m a size 6, and even with a no show sock it’s a bit tight- like it leaves marks tight. Obviously I have worn it, so it’s past my return time and I wouldn’t return a worn item but maybe go up another half size if you’re concerned it may run small because it really does. I would buy it again if there weren’t any other options. Next time I’ll purchase shoes in store though, there’s nothing like actually trying it on and seeing how it fits to make a decision."
  },
  {
    "user": "madison",
    "rating": 5.0,
    "message": "Love them! I work in a clinic and always on my feet."
  },
  {
    "user": "Christy Mowery",
    "rating": 4.0,
    "message": "The only reason I give these shoes a 4-star rating is because they aren't as cushioned on the inside as I expected \"cloud foam\" to feel. The shoes look great but could use more support on the bottom."
  },
  {
    "user": "Megan",
    "rating": 4.0,
    "message": "Super cute and easy to slip on and off. I love that the tongue part is attached, if that makes sense. I wouldn’t work out in them but I didn’t buy them for workouts. They run slightly small. I’m a 10 and after a while my toes feels squished. Great for cute, daily errand shoes!"
  },
  {
    "user": "elizabeth anderson",
    "rating": 5.0,
    "message": "They are as comfortable as ballet slippers Stand up to me standing up and working 14 hrs in a row"
  },
  {
    "user": "Kathleen M. Winterfield",
    "rating": 4.0,
    "message": "This is a very lightweight shoe and has good support. The biggest defect is that you can't tighten the laces. So if your feet swell you can't loosen them."
  },
  {
    "user": "kidcare4u",
    "rating": 4.0,
    "message": "Love the look, light weight, price, and comfort of this shoe. 4 stars because they are a but difficult to put on. I'd still purchase them again."
  },
  {
    "user": "Ashlie thompson",
    "rating": 5.0,
    "message": "I wear these for work where I stand for long periods of time and they are hands down one of the most comfortable pair I have worn! Also the price is great!"
  },
  {
    "user": "Heather",
    "rating": 5.0,
    "message": "This is my second pair of adidas cloud foam sneakers. They are so comfortable and lightweight"
  },
  {
    "user": "E Duran",
    "rating": 5.0,
    "message": "As described"
  },
  {
    "user": "Justine Tsay Fan",
    "rating": 5.0,
    "message": "Sooo comfy. True to size. Feels like I'm walking on clouds. Very lightweight but super supportive."
  },
  {
    "user": "jennifer",
    "rating": 5.0,
    "message": "Size is perfect and for sure worth the money!"
  },
  {
    "user": "CoraJones",
    "rating": 5.0,
    "message": "I usually get scared purchasing “main” brands off Amazon because I would think they are different. I tried these on in famous footwear but was not about to pay for that price that was going on like $70!!!! It was much cheaper on here so I decided to go for it. I was an eight in store and it’s still the same sizing and brand. Thanks Amazon and Adidas! Happy to answer any questions."
  },
  {
    "user": "M. Begovich",
    "rating": 5.0,
    "message": "These shoes fit like a dream!  I ordered my normal size.  I can’t speak to how long they will last, but I love them!"
  },
  {
    "user": "hm2092",
    "rating": 5.0,
    "message": "They feel good and fit as expected.  The tongue is attached so you never have to tug or straighten it"
  },
  {
    "user": "lin2261",
    "rating": 5.0,
    "message": "Needs more cushion in the sole. But they are extremely comfortable and good for working and the gym"
  },
  {
    "user": "Kyle Knight",
    "rating": 4.0,
    "message": "Very comfortable shoes. Only giving 4 stars because there is no white stripes on the inside part of the shoe. Only 3 stripes on outside edge."
  },
  {
    "user": "Chaslyn",
    "rating": 4.0,
    "message": "First off, they do fit. I ordered a 7.5 according to their inches measurement on their size chart and to fit as expected. But, I have wide feet so it was a struggle to get them on because the tongue of the shoe doesn’t expand out like a regular tennis, after I got them on they do fit nicely and are stretchy. Hopefully as I wear them it will be easier to get my wide feet in."
  },
  {
    "user": "Dalton",
    "rating": 4.0,
    "message": "Bought these while pregnant. They are super comfortable, nothing too fancy, but definitely feel better than the pair of Walmart sneakers I was wearing before."
  },
  {
    "user": "You Gotta get the job done",
    "rating": 5.0,
    "message": "I have these in an earlier version and absolutely love them.  This shoe is very sturdy and well made.  I wear a size 7 and for the most part it fit true to size.  They have changed the type of insole to a more permanent, thicker insole more molded to the shoe.  It does not appear to come out easily.  However, it is a tad bit narrower than the inside of the shoe.  Although I don't ever need a wide width, the inside of the foot bed felt too narrow for my foot.  When I stand and walk, I feel the edge of the thick padding in the middle of my small and large toes....as if they are hanging off.  I love the shoe and don't know if the wide might be better. The outside of the shoe is a bit different material than the older version.  It is a little shiny looking and feels much smoother.  It's not like the cotton feel of the past pair.  I think this will be better allowing for the shoe to be surface cleaned more easily.  I had a lighter color and have had to wash it many times!"
  },
  {
    "user": "MAF",
    "rating": 4.0,
    "message": "La talla es precisa pero al colocar entra a presión , No necesita cordon , sea para calcetines delgada"
  },
  {
    "user": "Happy ol Snow",
    "rating": 5.0,
    "message": "These sneakers are super light, so if your looking for structure don’t buy. They feel more like slippers to me. I got the white, super sweet, but I’ll be using mine for house shoes. No break in time at all."
  },
  {
    "user": "MissNick",
    "rating": 5.0,
    "message": "I bought these cause I was going to be walking a college campus all day for 2 weeks.  They did not disappoint.  I got quite a few compliments on them with my outfit.  And after walking up and down hills on campus my feet were fine.  Willing buying more colors."
  },
  {
    "user": "Robyn Malone",
    "rating": 4.0,
    "message": "There pretty comfortable, need to be worn in."
  },
  {
    "user": "DBrady",
    "rating": 5.0,
    "message": "They fit perfectly 👌"
  },
  {
    "user": "Wichman",
    "rating": 5.0,
    "message": "These are the MOST comfortable pair of shoes I have owned in years! They fit perfectly and I love that they are slide ons but do not look like it with the faux strings."
  },
  {
    "user": "Cecelia Hagman",
    "rating": 4.0,
    "message": "I found it impossible to pull up back of shoe."
  },
  {
    "user": "Aubrey Seigla",
    "rating": 5.0,
    "message": "Ordered these for everyday use…as a mom of 3 littles I need comfort and ease and these Adidas are the answer! They are so light and feel like pillows for my feet. They are slip on for quick on and off- for just about $40 they’re very worth the price!"
  },
  {
    "user": "M",
    "rating": 5.0,
    "message": "Perfect. Very quiet while walking. First thing I noticed. Light on your feet, Move in silence. I ordered the all black ones. Fit was as expected. Forms to your feet.. I wear these all day, on my feet all day, walking, fast walking, sometimes an angry jog to the bathroom. I deff recommend."
  },
  {
    "user": "El Capitan",
    "rating": 5.0,
    "message": "It maybe a running shoe, but can be used for school too.  Soft, comfortable and sleek. Simple design and finish. Fits well on my God daughter, she loves it."
  },
  {
    "user": "Luna",
    "rating": 4.0,
    "message": "Good for running errands..not so much working out though."
  },
  {
    "user": "Kate",
    "rating": 4.0,
    "message": "These sneakers are nice - but run small."
  },
  {
    "user": "Jessica Sammis",
    "rating": 5.0,
    "message": "These shoes are a great product for the price. They are comfortable and offer great support for lifting and cardio. They are super cute too for everyday wear! I would highly reccommend."
  },
  {
    "user": "Mark in NC",
    "rating": 4.0,
    "message": "Got these for my 14yr old daughter. She loves the style and comfort for short walks. She said they don’t provide a lot of support on long walks. “Almost like you’re walking barefoot” was her quote."
  },
  {
    "user": "Emma D",
    "rating": 4.0,
    "message": "The black leopard color runs very small. I have the same ones in white/grey and are easier to put on and fit as expected. This one is also very tight as a material, foot can’t even slide in. Material feels harder/harsher/ less flexible compared to the white/grey one that I loved. I just re-ordered a whole size up, will update once received and tried on."
  },
  {
    "user": "maldennis329",
    "rating": 5.0,
    "message": "I am a licensed hairstylist and am on my feet majority of the day! These are the only tennis shoes I will wear to work in! They give the right amount of support I need, have several colors and styles to choose from and are very affordable!"
  },
  {
    "user": "alex a.",
    "rating": 5.0,
    "message": "My daughter is 9 and loves these shoes. Got them in 2 different colors. Wish they had black sole since white gets dirty faster in play grounds"
  },
  {
    "user": "Lo",
    "rating": 5.0,
    "message": "Weight training, running, Zumba, HIIT classes…. This shoe is super comfy !"
  },
  {
    "user": "Kim",
    "rating": 4.0,
    "message": "This is my third pair of adidas. I have loved the cloud foam in the past but these shoes aren’t quite the same. They’re still comfortable but not like walking on a cloud. It seems like they are lighter than other pairs and you can feel everything you step on though the shoes."
  },
  {
    "user": "Marlene Maffei",
    "rating": 5.0,
    "message": "These shoes are so comfortable and great for being on your feet long periods of time."
  },
  {
    "user": "Dawn M. Allen",
    "rating": 5.0,
    "message": "One of my favorite shoes to wear. Very light and comfortable."
  },
  {
    "user": "Miriam M. Socorro N",
    "rating": 5.0,
    "message": "Excelente calzado para caminar y para cualquier actividad deportiva"
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "I do have an old pair so I can say they are great for walking but this pair in particular I wasn't able to try. Someone stole the package from my porch after they were delivered"
  },
  {
    "user": "Neomi",
    "rating": 5.0,
    "message": "i just got them yesterday, i need new shoes  especially walking shoes and this are perfect ! my new everyday shoes !"
  },
  {
    "user": "Kacie Ostermiller",
    "rating": 5.0,
    "message": "These shoes are so light and so comfortable. I purchased the white with mint colored lines and I have gotten so many compliments! Thank you!"
  },
  {
    "user": "D. C.",
    "rating": 4.0,
    "message": "I searched long and hard for a good shoe for my work. I work at a Children’s Hospital, and I am constantly on my feet for very long hours. They fit well (snug, appropriate size) and look great!  However, the memory foam sole falls VERY short of what I expected. First of all, the sole doesn’t go all the way to the toe end of the shoe, which is just weird... You can feel where the sole stops by your toes instead of filling out the bottom of the shoe like they should. It is a suuuuper thin sole with minimal support. It’s a comfortable foam, but you need a few centimeters more in thickness for it to be any amount of support.  What I have found through lots of searching, is that isn’t uncommon. It’s extremely hard to find a good looking shoe with good support. I am buying a memory foam insole to make up for it, and I’m sure with that addition it will be perfect.  Great for working out, short shopping trips or walks around the neighborhood, but not the best support for long lengths of time. Overall an awesome shoe, but definitely found it needs more support."
  },
  {
    "user": "Penny M.",
    "rating": 4.0,
    "message": "Nice light fabric,  comfortable"
  },
  {
    "user": "EpilepsyWarrior28",
    "rating": 5.0,
    "message": "These shoes are without a doubt, the best $45 I've ever spent on shoes!! I work in a busy doctors office and am always on my feet five days a week. These are called \"Cloud foam\" for a reason. They fit perfectly for my wide feet and never do I have \"TIRED' feet! I barely notice Ive even got shoes on! True to size!! Fit perfectly!! Will be buying another pair!!"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Absolutely love these kicks. I'm not a runner,, but walk miles with them everyday and my feet don't ever hurt. Very happy with my purchase."
  },
  {
    "user": "Latasha Bennett",
    "rating": 5.0,
    "message": "For work"
  },
  {
    "user": "Thor209",
    "rating": 5.0,
    "message": ""
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great for walking or light running.  Super light weight on my feet and comfy"
  },
  {
    "user": "Rose",
    "rating": 3.0,
    "message": "I was expecting the memory foam cushiony feel of walking on air (like my previous pair of adidas. I read that these were supposed to have even more of that and I was so excited. Fell flat, cushion is there but not comparable. One one shoe the seam of the insole is right on my pinky toe causing it to feel unbalanced. Laces are totally pointless to me. This is a slip on shoe with the tongue being a part of the entire shoe itself. I would return, but they are fine for now and the ones I had previously are unavailable. Meh."
  },
  {
    "user": "Brittany Vazquez",
    "rating": 5.0,
    "message": "Love these shoes, great for running on the treadmill and stable for lifting weights. I highly recommend!"
  },
  {
    "user": "Ann Miller",
    "rating": 5.0,
    "message": "Fit and color--happy shoes"
  },
  {
    "user": "INES Ortiz",
    "rating": 5.0,
    "message": "Como talla exacta  y se ven hermosos"
  },
  {
    "user": "Sara",
    "rating": 5.0,
    "message": "I absolutely LOVE these shoes! I recently had an unknown foot issue that caused me extreme pain whenever I put any pressure on my heel. These feel like you are walking on clouds. The heel has extra soft cushion inside and I never once felt that heel pain while wearing these. They are easy to slip on and are super lightweight so you barely feel like you're wearing them at all. I will be purchasing more of these!"
  },
  {
    "user": "Creacrea",
    "rating": 5.0,
    "message": "I fell in love with this style of running shoe and now they're all I wear! I highly recommend for a light weight comfortable athletic shoe."
  },
  {
    "user": "Rosemary Alsworth",
    "rating": 3.0,
    "message": "I have trued for a while to get used to these shoes but I just can’t!  It looks like a tie sneaker but it’s really a slip-on.  It has laces but they are not functional and they are a very tight fit, like socks.  Very hard to get on even with a shoehorn.  They carry the Adidas name which is what attracted me to them.  Don’t be fooled if you are a fan of Adidas!  They are not the traditional Adidas quality nor do they have the side support regular Adidas offer.  Very disappointed!"
  },
  {
    "user": "Ginger",
    "rating": 5.0,
    "message": "Very comfortable for walking and very trendy. Love them!"
  },
  {
    "user": "Amber Bronder",
    "rating": 4.0,
    "message": "Love the style and color with the classic 3 stripes. Not super supportive but good enough for wearing on a regular day."
  },
  {
    "user": "cindycscoggins",
    "rating": 5.0,
    "message": "I bought these shoes when they were $42 and I'm so glad I did. They're a little narrow, but overall very comfortable."
  },
  {
    "user": "Brittany Green",
    "rating": 5.0,
    "message": "Love the product & price was cheaper here than buying them in store. Super comfortable shoes!"
  },
  {
    "user": "Katie Brosnan",
    "rating": 5.0,
    "message": "Shoes are great value for money. Nice quality!"
  },
  {
    "user": "Cutie249",
    "rating": 5.0,
    "message": "I needed a new pair of the cloud form shoes and I thought I would try these out. They are so comfortable and I can wear them for hours at Disneyland."
  },
  {
    "user": "Maria",
    "rating": 5.0,
    "message": "Nice! Very comfortable. Good Authentic material."
  },
  {
    "user": "Laura Mauritsen",
    "rating": 5.0,
    "message": "Love these sneakers, comfy, cute.. I just bought my second pair. Highly recommend and true to size Buy!"
  },
  {
    "user": "Anca Cojocaru",
    "rating": 5.0,
    "message": "Very light walking snickers, fit perfectly, delivered faster than I thought!"
  },
  {
    "user": "Ramon",
    "rating": 5.0,
    "message": "The item is the real thing and not a knock-off or B grade shoe. Exactly as pictured and described."
  },
  {
    "user": "MariaWurt",
    "rating": 4.0,
    "message": "The opening is too small. Its really hard to get the shoe on. Once its finally on they fit and feel good. I would suggest buying a half size bigger than you normally wear."
  },
  {
    "user": "CS",
    "rating": 5.0,
    "message": "Really like these sneakers"
  },
  {
    "user": "Sheryl Pasley",
    "rating": 5.0,
    "message": "Physical therapy"
  },
  {
    "user": "Elena Kirk",
    "rating": 5.0,
    "message": "I use these for walking and for various classes I take at my gym. They are so comfortable and I live the way they look. I should have gotten my size, they are a little big. My feet are a little wide so I tend to size up a half size, but you don’t need to in these! But the way they are designed, they don’t slip off the heel, so they work just fine! This is my second pair, I will keep purchasing because I have such a hard time finding comfortable gym shoes and these are perfect!"
  }
]