[
  {
    "user": "Jamie gray",
    "rating": 5.0,
    "message": "Fits exactly to the size I wear. It’s not a bigger shoe or a smaller shoe. The most comfortable shoe I’ve owned."
  },
  {
    "user": "Kendra Grant",
    "rating": 5.0,
    "message": "This was my first pair of Reeboks and I wasn’t disappointed ! The insides are soft and don’t hurt my feet."
  },
  {
    "user": "Oscar",
    "rating": 5.0,
    "message": "They look great, and they feel comfortable with very soft bottom. After several days, the inside has some small \"round balls\" forming, due to the friction with the cheap inner stuff, but still a very good pair of shoes considering the price."
  },
  {
    "user": "ordinary customer",
    "rating": 5.0,
    "message": "Used only for being cool. Really sets off an outfit with a nice clean touch. Classic."
  },
  {
    "user": "baseboard16",
    "rating": 4.0,
    "message": "Fits well. Pretty clean look"
  },
  {
    "user": "J. Cruz",
    "rating": 4.0,
    "message": "1. It’s a very comfortable shoe (this is a delightful, unexpected surprise). 2. I can fit a finger in the chasm between the shoe and the back if my foot; it’s sad when a size 10 isn’t a size 10… 3. Does Nike have the monopoly on what a consistent size 10 should measure? It sucks that My size 10 is a perfect 9.5 for Salomon, but at least REI had the decency to advise me (love REI). While it truly is a crapshoot on Amazon as to whether brand x is indeed “Brand x” and whether brand x’s 10 will consistently match other manufacturer’s interpretation of size 10, at least this pair of Reeboks (despite its slightly larger interpretation of size10) FEELS VERY COMFORTABLE TO WEAR AND WALK AROUND IN!!!  Additionally, its at a good price point…"
  },
  {
    "user": "Jerry alfred",
    "rating": 5.0,
    "message": "Very comfortable shoes perfect for working out"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "About what you would expect from these shoes. They are slightly narrow, so they may take a minute to break in"
  },
  {
    "user": "Average American",
    "rating": 3.0,
    "message": "I bought these Reebok shoes, thankfully, on a deep discount.  If I'd paid the full price I would have sent them back.  They are somewhat narrow, as other reviewers have mentioned, and I got them a half size up from my normal size.  While they look nice and are reasonably comfortable, the quality is just not worth a price tag of over $50.  I recommend getting Walmart's walking shoes for $16 and putting in some arch supports or foam insoles in them."
  },
  {
    "user": "Diana Lozano",
    "rating": 5.0,
    "message": "Just what I was searching for!"
  },
  {
    "user": "Lez",
    "rating": 5.0,
    "message": "Nice sneaker"
  },
  {
    "user": "Alee",
    "rating": 4.0,
    "message": "The media could not be loaded. Calidad y buen confort"
  },
  {
    "user": "Jelani Watkins",
    "rating": 5.0,
    "message": "Fits like a glove, VERY comfortable and stylish. Honestly worth the price. The perfect all-purpose shoe"
  },
  {
    "user": "Marlon G.",
    "rating": 5.0,
    "message": "Everything was great! It just as I expected."
  },
  {
    "user": "Armando Medina",
    "rating": 5.0,
    "message": "I loved this product and I used it for going out , since it’s a really nice shoe ."
  },
  {
    "user": "Cassie",
    "rating": 4.0,
    "message": "Ok i ordered size 9. I went up a size and had to return because ive always worn the classic gum bottoms and they run narrow but the Harman's run sneaker is what i needed because they are more of a M/Wide they look great but were way too large! Second pair i recived in my normal 8.5 had the supposed Ortholite insole was white not blue and thats what i was expecting to get bk when i reordered but they are not by any means supportive! When you go to the shoe store i have always got the actual comfort insole and this deff. is NOT IT! But over all Rebock has always been my #1 all time favorite and they look great and dont feel great as far as the insole. Id suggest if your more than 130/150lbs and want comfort and support because your wearing for that reason or just on your feet for many hours just go buy at the actual store but if you are a shoe junkkie and just wear here and there and dont care for insoles w/comfort and want to save 20$ then go for it! I cant speak for longevity since i just recived them. Go with you reg. Size in this shoe because it runs wide and you will have plenty room left with these Harman's. If your purchasing the classic gums then depending on the width you need you may want to go up a half size. Hope this helps anyone out there struggling with what size they should buy because i know i shure did and thats why i went with the Harmin's because i need a M/W and they look GREAT! And this Co. Was very swift with my exchange i requested exchange and had them 2days later still have to return the 1st pair come tomm. and im happy as long as they last.. i still have my classic gums from high school and their still kicking and have never fallen apart over many years of daily wear! I added in the pic. The sticker proving they are synthetic not real leather as claimed! I've seen sooo many ppl saying these were real and never took the time to actually look! I am highly upset about that and its where they just snap on the fake orthopedic foot for your. That little blue foot feels more orthopedic than my insole lol... again i hope this helps anyone!"
  },
  {
    "user": "CINDY M. LINDER",
    "rating": 5.0,
    "message": "Great ,comfortable!!"
  },
  {
    "user": "Richard Bruck",
    "rating": 4.0,
    "message": "Ok but expensive"
  },
  {
    "user": "Carol Baker",
    "rating": 5.0,
    "message": "Liked everything about the shoe"
  },
  {
    "user": "Dan Taylor III",
    "rating": 4.0,
    "message": "Still getting use to the shoes.  I have been wearing a hiking type shoe prior to the Reebok. The support is good."
  },
  {
    "user": "EARLAND REGIS",
    "rating": 3.0,
    "message": "The insoles does not support big people could not wear them all day but everything else was okay"
  },
  {
    "user": "King",
    "rating": 5.0,
    "message": "It's very comfortable"
  },
  {
    "user": "brian reeves",
    "rating": 5.0,
    "message": "Clean and comfortable"
  },
  {
    "user": "robert williams",
    "rating": 4.0,
    "message": "The front left portion has an extra know to it. It makes my foot hurt"
  },
  {
    "user": "Jamie Blankenship",
    "rating": 4.0,
    "message": "I bought my husband a pair and he said hun they are so comfortable the cushions in here is amazing so I had to see myself and bought a pair and he was telling the true I always loved reebok classics but the new soles make me feel like I'm a teenager wearing them again."
  },
  {
    "user": "raymundo reyes",
    "rating": 3.0,
    "message": "This sneakers are to narrow"
  },
  {
    "user": "Paul Gordon Carter",
    "rating": 5.0,
    "message": "I purchased the shoes for my son; who considers them to be awesome shoes and good quality.  My son is in prison and wanted no other shoes but these.  He said, they wear well and feel good on his feet.  Unfortunately, he could not keep the shoes for the facility stated that they have inner pockets.  I wanted to return them; but, by the time they were shipped back to me to send to you it was past the time of return. (I still have them)"
  },
  {
    "user": "Heather",
    "rating": 4.0,
    "message": "Shoes are great every day shoes they give good comfort and fit well."
  },
  {
    "user": "Dillon Jacobson",
    "rating": 5.0,
    "message": "I knew they were comfortable as I’ve had the classic nylons before. But these are even more comfortable with the new Reebok insoles in them. And they were on my doorstep in 2 days no shipping charge."
  },
  {
    "user": "Matthew Allen Gibson",
    "rating": 4.0,
    "message": "The media could not be loaded. I like the classic fit there nice and comfy for the walking nice shoe"
  },
  {
    "user": "K.S",
    "rating": 4.0,
    "message": "I love this shoes however there’s a little cut under the shoe bottom and I’m afraid because of it’s hardness it’ll cause the show to be more damage easily. Help here please. Pictures attached."
  },
  {
    "user": "shay",
    "rating": 4.0,
    "message": "They are good walking shoes"
  },
  {
    "user": "Keumgangyoksa",
    "rating": 5.0,
    "message": "These are the second pair of Reeboks that I have bought off of Amazon and they have been great purchases. Even though my foot is 12 wide, the size 12 fits my foot fine."
  },
  {
    "user": "Antonio Anza",
    "rating": 4.0,
    "message": "Photo shows a white sneaker, this is off white and white. Had I not needed them in an emergency I would have returned."
  },
  {
    "user": "David Vega",
    "rating": 5.0,
    "message": "Great price,fast shipping and they're exactly what I was looking for. These are going for more money at retail stores. They are pretty comfortable. Wish they had some arch support but most sneakers don't."
  },
  {
    "user": "Natalie Rodriguez",
    "rating": 4.0,
    "message": "My hubby normally wears 12 but these run a little big. I will need to exchange for an 11.5. Otherwise they look great and shipped quick"
  },
  {
    "user": "Monica Watson",
    "rating": 5.0,
    "message": "He said they are the most comfortable shoe he has."
  },
  {
    "user": "Will",
    "rating": 5.0,
    "message": "Great sneakers for working out and comfort."
  },
  {
    "user": "juan miguel",
    "rating": 4.0,
    "message": "Es muy cómodo y bonito calzado, lo único malo es que me quedo un poquito largo. Pero el ancho está bien por la flexibilidad del amarrado a cordones ."
  },
  {
    "user": "mach_v",
    "rating": 4.0,
    "message": "Fit well, comfy for the first hour or so. After wearing them for about 3 hours my feet start to hurt mostly in the ankle area. I do not recommend these for long day wear only for short time."
  },
  {
    "user": "D.",
    "rating": 4.0,
    "message": "Shoes are wonderful. Long delivery date slid forward to more reasonable date. But the Shoe laces are 12\" to 16\" too long. Obviously wont return the shoe, but have to go out a find shorter laces which is a bite and a waste of my time."
  },
  {
    "user": "Sonya Mozingo",
    "rating": 5.0,
    "message": "Very comfortable sneakers"
  },
  {
    "user": "Joshua M. Hasty",
    "rating": 4.0,
    "message": "Old school reboots.  Just good comfortable shoes that aren't made out of pants hose or whatever it is they make shoes out of now"
  },
  {
    "user": "Mrs Lynnessa H Joyner-Robinson",
    "rating": 4.0,
    "message": "I wanted at least a medium but the sneakers were too narrow for my husband!"
  },
  {
    "user": "Trotter",
    "rating": 5.0,
    "message": "nice shoe"
  },
  {
    "user": "Anthony W",
    "rating": 5.0,
    "message": "I work in an assembly plant, and these shoes give great support and comfort for walking on the hard floor all day. Now I am one of those people that had plantar fasciitis, Achilles issues, knee problem, and all. Not saying these shoes help with that because you simply have to fix your posture, ie weight management, muscle strengthening, and stretching in order to alleviate those issues, but because I have gone through that process; these shoes are ideal for lots of walking and a busy day when you have corrected your walking form. Very balanced shoe."
  },
  {
    "user": "Carolyn J.",
    "rating": 5.0,
    "message": "Liked. Walking."
  },
  {
    "user": "Jo's Rey",
    "rating": 5.0,
    "message": "Excelente."
  },
  {
    "user": "Maritza Bauza",
    "rating": 5.0,
    "message": "Purchased for my dad and mom they both love them, great to work,  walk"
  },
  {
    "user": "Reina Nunez",
    "rating": 5.0,
    "message": "Trabajo"
  },
  {
    "user": "Odalys perez",
    "rating": 5.0,
    "message": "Los zapatos son geniales comodidad100%"
  },
  {
    "user": "David K. JohnsonAmazon Customer",
    "rating": 4.0,
    "message": "Comfortable, all round work out shoe. Good middle of the road pick."
  },
  {
    "user": "L. Hughes",
    "rating": 3.0,
    "message": "They are just OK for the price. Not like the classics we are all used to, which go for $100 on Reebok. These are a cheaper quality, but affordable. They do run a bit bigger. My 9 feels like a 9 1/2. I wouldn’t call them fake, just more budget friendly. Do I recommend? Yes, if you just want some for less than normal wear. If you want the better quality, drop the $100 on the Reebok site."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Bought these for my hubby and he really likes them. Doesnt really use them for running but he walks for travel and his feet have been hurting a lot less. They have a nice cushion and arent too expensive. We also bought a pair for our son so they can match."
  },
  {
    "user": "Dennis",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Augustine",
    "rating": 4.0,
    "message": "Somehow I feel this is not an original Reebok Product. The fit and the comfort are OK. I have used for about 6 times or so. Looks kind if cheap materials for Reebok Product. May be there are better products for this price! I have had no damage or peeling off of the sole. Simple classic design though."
  },
  {
    "user": "Robert Hines",
    "rating": 5.0,
    "message": "I use these shoes for work and leisure time they fit my feet with total comfort and I am well pleased by my purchase."
  },
  {
    "user": "Anthony",
    "rating": 5.0,
    "message": "The shoes are what I expect it they are comfortable as well"
  },
  {
    "user": "Anthony L Campbell",
    "rating": 3.0,
    "message": "Just a little narrow."
  },
  {
    "user": "Leonid Shchigol",
    "rating": 4.0,
    "message": "I like it comfort and warmth. It's  also support ankle with movement, so foot is not in pain"
  },
  {
    "user": "John O.",
    "rating": 3.0,
    "message": "I shoulda ordered a half size down.."
  },
  {
    "user": "Nairoby gonzalez",
    "rating": 5.0,
    "message": "The media could not be loaded. Calidad, buen material, super comodos"
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "The shoe fits well and all buts it not great quality. The front of the shoe where the toe is  has started to crack and the mesh material on the inside is starting to show. If your foot should have room to wriggle around bend and crease ,why make this part with skimpy material?!?! You'll have holes on the top of your shoe before your soles start to wear out."
  },
  {
    "user": "Rodrigo Mogollón Hortúa",
    "rating": 5.0,
    "message": "Gracias me llego a tiempo bien producto."
  },
  {
    "user": "Ray",
    "rating": 5.0,
    "message": "Always liked product"
  },
  {
    "user": "Locomojo30",
    "rating": 3.0,
    "message": "Only had these shoes for a month before my toe began to break through the leather on top of shoe.  Have been using this brand for a few years now, which I had been buying in person at the department store but this pair bought online did not have the same durability."
  },
  {
    "user": "Damien Ramos",
    "rating": 5.0,
    "message": "Comfortable love them"
  },
  {
    "user": "Shankster72",
    "rating": 3.0,
    "message": "I bought these to work out in and they might be OK after a few times. They are tight and stiff out of the box."
  },
  {
    "user": "Miguel Guedez",
    "rating": 5.0,
    "message": "I bought this shoes in order to use for everyday purposes. I do not recommend it for any particularly  intensive training."
  },
  {
    "user": "Sandra Cade",
    "rating": 5.0,
    "message": "They are light weight comfortable and makes it easy on the knees"
  },
  {
    "user": "tami montoya",
    "rating": 5.0,
    "message": "My husband had same shoe and loved them so much I purchased him another pair. He loves them."
  },
  {
    "user": "E.T.A.C. logistics llc",
    "rating": 4.0,
    "message": "Excellent for comfort for days that you will have long days on your feet"
  },
  {
    "user": "Short1e",
    "rating": 5.0,
    "message": "Bought this for my eleven year old son, who loved his sneakers..it's soo comfortable.  His first Reebok sneaker ever...nice job!"
  },
  {
    "user": "Alexander Leija",
    "rating": 5.0,
    "message": "They're solid white shoes. No dislikes. No one that I know had or has Reeboks like these anymore. Very clean design and stylish. Love them."
  },
  {
    "user": "Josh",
    "rating": 5.0,
    "message": "Been wanting these shoes for a long time and I mean long. Saw them on here for half of what the retail stores wanted, so I scooped them up quick. There were only a couple left. Super clean and really comfortable."
  },
  {
    "user": "Amanda Bear",
    "rating": 5.0,
    "message": "I needed a good sneaker for work and just in general. I have always loved the Reebok classics and was excited to see these online for such a good price. I was a little skeptical of the ortholite in the shoes but it actually is the best ever. I have very little arch in my feet and generally have cramps or just sore feet from working all day, after wearing this for the last 20 days I am having little to no sore feet days. I am very happy with this shoes. Just a note, these are men's size shoes so I am a 9 wide to a 9.5 wide in women's and I got a 7 in mens in these shoes. They were a little tight the first couple days but have since relaxed and broken in and fit comfortably. :)"
  },
  {
    "user": "Carlos castillo",
    "rating": 5.0,
    "message": "Very comfortable sneakers to work in"
  },
  {
    "user": "C. Kaufmann",
    "rating": 5.0,
    "message": "I bought this athletic shoe to replace my 20 year-old pair of the same style that I use for exercising. (See photo) The one I had lasted much longer than I anticipated. The leather upper was scuffed but still intact. The soles started delaminating last summer and I re-glued them several times. The only problem with the new shoes are they run a half size small. Pictured is my 10.5 size old shoe next to my 11.5 size new shoe. The new one is 1/4” longer. I highly recommend them."
  },
  {
    "user": "Gabriela Gomez Campodonico",
    "rating": 5.0,
    "message": "Buen material. Super cómodo."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I like the shoes fit great and good comfort"
  },
  {
    "user": "Michael Alagna",
    "rating": 5.0,
    "message": "Walking mostly  they are nice fitting and narrow for me"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "True to size. Light and comfortable"
  },
  {
    "user": "joshua J Schroeder",
    "rating": 5.0,
    "message": "Very nice shoe, a classic look that last forever."
  },
  {
    "user": "Edward Patton",
    "rating": 4.0,
    "message": "Confort"
  },
  {
    "user": "Richard Ray",
    "rating": 5.0,
    "message": "very comfortable I enjoyed them"
  },
  {
    "user": "Jlo",
    "rating": 5.0,
    "message": "Shoe is very neat, fits as expected highly recommend"
  },
  {
    "user": "Robinson Rafael peña Diaz",
    "rating": 5.0,
    "message": "Lo que queria"
  },
  {
    "user": "Da Reviewer",
    "rating": 5.0,
    "message": "not leather, but they last long and very good"
  },
  {
    "user": "Bryon",
    "rating": 5.0,
    "message": "As you may guess, I'm flat-footed. Comfortable shoes that last a descent time is tough and are hard for me to find. These are my everyday shoes. These work great, have lasted a good bit of time, and look good. I've never gotten so many compliments about my shoes before. Only 4 stars because the inner counter gets demolished. I don't know if its me or for being flat-footed, but the counter never lasts. I'll give any shoe a 5 star rating if they have a counter that lasts as long as the rest of the shoe."
  },
  {
    "user": "Jamel Brown",
    "rating": 5.0,
    "message": "They arrived fast. Very comfortable."
  },
  {
    "user": "Aminul islam",
    "rating": 5.0,
    "message": "Perfect size"
  },
  {
    "user": "Mark",
    "rating": 4.0,
    "message": "are shoes"
  },
  {
    "user": "deane",
    "rating": 2.0,
    "message": "I live in a Rehabilitation home where I am learning to walk post stroke. I normally take 9 1/2 W but ordered a 10. The ad said it would accommodate wide size. It would not fit. Packaging was destroyed in opening. So I am stuck."
  },
  {
    "user": "Harold",
    "rating": 5.0,
    "message": "I bought these sneakers to wear for casual dress and they're perfect."
  },
  {
    "user": "Reinvented",
    "rating": 5.0,
    "message": "The classics are my favorite. Great price and comfort."
  },
  {
    "user": "brian",
    "rating": 3.0,
    "message": "Don’t fit snug against the heel"
  },
  {
    "user": "GABRIEL Anthony AGUILAR",
    "rating": 5.0,
    "message": "I like these shoes for the throwback look and for the price couldn't go wrong"
  },
  {
    "user": "Waylon whyte",
    "rating": 4.0,
    "message": "Fits prefect and very comfortable for a every day use and easy to clean so the colour remains"
  },
  {
    "user": "IVAN JUAREZ",
    "rating": 4.0,
    "message": "Not bad"
  },
  {
    "user": "Guy",
    "rating": 5.0,
    "message": "They were great until my puppies destroyed it Time to buy it again"
  }
]