[
  {
    "user": "Merilee Buster",
    "rating": 5.0,
    "message": "I have had a pair of Reebocks in this size and style and been wearing them daily for probably five years - I really can't remember when I bought them, maybe ten years. I replaced the inner sole with an arch support sole and absolutely love these, but they were finally wearing out and I wanted the exact same shoe. I bought a brand new pair and it seems the manufacturer has narrowed the toe box slightly (had to send the first shipment back because it was way too narrow, but Amazon sent a replacement immediately). I generally wear a 7.5 but in this shoe I need 8.5 and I usually need a Wide, but in this case the Regular was fine except the new ones are a little snug in the toe box. The uppers are leather and will stretch a bit and so will only get more comfortable as I wear them. I wish the new ones were a little bit roomier in the toe box, but I'm very happy with them and the price was exceptionally good at 35 dollars. They are comfortable on the first wearing and I expect they'll get better over time."
  },
  {
    "user": "Char",
    "rating": 5.0,
    "message": "I was so happy to find these again at a great price.  Next spring I hope the white will still be available.  have worn them off and on for over 20 years.  A friend wishes she could get them in a size 5 wide but not available."
  },
  {
    "user": "smileandwave",
    "rating": 4.0,
    "message": "I've always liked this sneaker.  My other pair is quite old but still wearable.  Decided to get a newer pair that doesn't look so worn. My older pair feels like it is made of a leather type material as opposed to this newer pair that feels more vinyl, but that's a sign of the times.  I still like them.  They cushion your feet very nicely.  No need to break them in and the heel is padded."
  },
  {
    "user": "L. Pacheco",
    "rating": 5.0,
    "message": "Been wearing reeboks since I was a teenager in high school especially these classic reeboks and they never disappoint I will never use any other kind of shoes in my life again they're just so comfortable."
  },
  {
    "user": "Curls that last",
    "rating": 5.0,
    "message": "Haven't had a pair for years and decides to try them again. so happy I did. perfect fit and comfort"
  },
  {
    "user": "Katnip in VA",
    "rating": 5.0,
    "message": "These are the ONLY shoes my 83 year old mom will wear.  Provide sturdy support without looking clunky, the tread is good, and they are durable.  Not easy to find in the stores but thanks to Amazon mom has happy feet."
  },
  {
    "user": "PghSandy",
    "rating": 5.0,
    "message": "I walk a lot, and this is one of my go-to sneakers.  It is well-constructed, looks nice, and is a good reliable athletic shoe.  I highly recommend this for anyone who needs a light support, comfortable sneaker to walk in."
  },
  {
    "user": "Adrienna Clarke",
    "rating": 4.0,
    "message": "I would get maybe a half size larger as the shoe fits a little snug. Snug, but wearable. I would get a half size larger for more comfortability."
  },
  {
    "user": "Mac",
    "rating": 4.0,
    "message": "Like the shoes, fit is nice.  For my habit of double knotting laces, they need to be longer."
  },
  {
    "user": "MA Smyth",
    "rating": 5.0,
    "message": "Best shoes for the price.  I don’t know how many pairs I’ve ordered but I’ll keep purchasing them.  Great shoes for a great price!"
  },
  {
    "user": "Kaelin elie",
    "rating": 5.0,
    "message": "This shoes is so comfortable and fits so good. best purchase"
  },
  {
    "user": "Tacy Bolen⁰",
    "rating": 5.0,
    "message": "Bought for my daughter she loves them. I want mea pair now."
  },
  {
    "user": "Shirley Jones",
    "rating": 5.0,
    "message": "They were exactly what I wanted"
  },
  {
    "user": "Fayanna Glasgow",
    "rating": 5.0,
    "message": "Fit just right"
  },
  {
    "user": "Antiwon brown",
    "rating": 5.0,
    "message": "My mom loves these shoes she’s been wearing em since the early 90’s same quality great price and she’d always say how comfy they are"
  },
  {
    "user": "Dioelis garriga",
    "rating": 5.0,
    "message": "Deben pedir un número menor al q usan pues llegan bien apretadizos y luego se estiran un chin ;pero muy cómodos…"
  },
  {
    "user": "hotsexypink 1987",
    "rating": 5.0,
    "message": "Mi baby love it"
  },
  {
    "user": "Sol M.",
    "rating": 5.0,
    "message": "Me encantan! Las tengo blancas y negras."
  },
  {
    "user": "Carolyn A. Conti",
    "rating": 5.0,
    "message": "Exercise the body for early am walks."
  },
  {
    "user": "Bri hen",
    "rating": 5.0,
    "message": "Bought it for my daughter she loved it ."
  },
  {
    "user": "Susan Moraless",
    "rating": 5.0,
    "message": "Perfect fit throughout"
  },
  {
    "user": "Jose Marquez",
    "rating": 5.0,
    "message": "Excelente"
  },
  {
    "user": "Karissa S.",
    "rating": 5.0,
    "message": "Don't think about it just buy it"
  },
  {
    "user": "Tod Herrick",
    "rating": 5.0,
    "message": "I have purchased Rebbok Princess sneakers for more than 20 years. They are the only sneakers I can wear. Very dependable brand that works for me."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Great fit"
  },
  {
    "user": "Tymra",
    "rating": 5.0,
    "message": "Loved them from the moment I put them on.  Used to wear Reebok all the time. I forgot how comfortable they are.  No break in time"
  },
  {
    "user": "Yalissa",
    "rating": 5.0,
    "message": "Estoy super conforme con la compra, estan perfectamente."
  },
  {
    "user": "Kathy Sweazy",
    "rating": 5.0,
    "message": "Ended up being tight. Need to return."
  },
  {
    "user": "K. Smitty",
    "rating": 3.0,
    "message": "The shoes are slightly big in width, makes my feet hurt after wearing them for about 6 hours of continuous standing. It also makes my socks slide down when I walk."
  },
  {
    "user": "Michelle L. Pacheco",
    "rating": 4.0,
    "message": "It's kind of tight on her foot."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "Years ago always bought this type sneaker and was always sadtisfied.  Although I didn’t mean to buy a wide width that’s what I received. A regular width would have been too tight but the heel moves up and down a little bit."
  },
  {
    "user": "Soulchild",
    "rating": 5.0,
    "message": "If a 75 yo woman wears these, that should tell you everything about these shoes"
  },
  {
    "user": "Juanita Lamson",
    "rating": 5.0,
    "message": "The comfort and fit are great. My orthodic insoles fit perfect."
  },
  {
    "user": "margarita rosario",
    "rating": 5.0,
    "message": "For work"
  },
  {
    "user": "Alysia M. Butler",
    "rating": 5.0,
    "message": "Gives me alot of support"
  },
  {
    "user": "Orly",
    "rating": 5.0,
    "message": "Un producto excelente, llego sin problemas en el plazo esperado, 100% recomendado, definitivamente compraría de nuevo, ¡gracias al vendedor!"
  },
  {
    "user": "E perez",
    "rating": 5.0,
    "message": "what I like is that they fix as expected and they we're fast to deliver"
  },
  {
    "user": "Arthur Graaf",
    "rating": 4.0,
    "message": "Litter  narrow,  but light wait make it easier to walk with.but had to add a support inside for back support."
  },
  {
    "user": "Edwina Taylor",
    "rating": 5.0,
    "message": "This is one of the products that has kept its quality over the years. It is nice that they still make this good product at a reasonable price. Keep up the good work. If you buy these pair of shoes you will not be disappointed."
  },
  {
    "user": "Mcorteshernandez",
    "rating": 4.0,
    "message": "Just the convenience of having a sneaker that are lite to walk in"
  },
  {
    "user": "cj",
    "rating": 5.0,
    "message": "Only shoe I can wear. Totally flat. Doesn't come up in the front/toes"
  },
  {
    "user": "doodles",
    "rating": 3.0,
    "message": "Creepy box., looks like a rodent of some kind chewed on it. I opened it very cautiously the shoes are fine, but the box has to go ASAP."
  },
  {
    "user": "Ramon simmonds",
    "rating": 5.0,
    "message": "I bought thsi for my niece and she loves it. its comfy and the quality seems good"
  },
  {
    "user": "ann s.",
    "rating": 4.0,
    "message": "Just ok"
  },
  {
    "user": "MARIA C.",
    "rating": 3.0,
    "message": "Okay. La puntera la medi.  Y. Trae talla de 71/2. Entonces queda muy ajustado el pie."
  },
  {
    "user": "Jameila Young",
    "rating": 5.0,
    "message": "Shoes is ver comfy"
  },
  {
    "user": "TERESITA PELAEZ",
    "rating": 3.0,
    "message": "Me lo enviaron 7 angosto y me aprieta del arco hasta los dedos."
  },
  {
    "user": "Grace Hurt",
    "rating": 5.0,
    "message": "Love my shoes fix’s good"
  },
  {
    "user": "gail grindley",
    "rating": 5.0,
    "message": "These shoes are perfect for my feet."
  },
  {
    "user": "Jchris",
    "rating": 5.0,
    "message": "Well worth what you pay for them !"
  },
  {
    "user": "Carla walstead",
    "rating": 5.0,
    "message": "I bought these shoes for work. They fit great and look great. Very comfortable"
  },
  {
    "user": "Scott Hughes",
    "rating": 4.0,
    "message": "Very nice shoe for the a even nicer price"
  },
  {
    "user": "Bobby",
    "rating": 3.0,
    "message": "The shoes fit very well but lack good insole cushioning in my opinion"
  },
  {
    "user": "Sharon D Porter",
    "rating": 5.0,
    "message": "The media could not be loaded. To wear"
  },
  {
    "user": "Ms. Love",
    "rating": 3.0,
    "message": "These are some cute shoes,but if you have a wide foot,They will not be good for you,They are very narrow,They don't have a very good arch support.They are not very comfortable to wear to work.It was definitely a waste of money."
  },
  {
    "user": "Novelete",
    "rating": 5.0,
    "message": "Very nice  better  than I expected  I love these shoes  they are awesome 👌"
  },
  {
    "user": "John Bridgers Jr.",
    "rating": 3.0,
    "message": "Fit okay"
  },
  {
    "user": "JCH of East Texas",
    "rating": 5.0,
    "message": "Great shoe, ordered wrong size.  Am ordering with different size."
  },
  {
    "user": "Kevin Brabham",
    "rating": 3.0,
    "message": "My wife loves them"
  },
  {
    "user": "Inday cel",
    "rating": 5.0,
    "message": "Exactly what I need for the kind of job I have. Been using it everyday since I got it. My job requires being on my feet for the whole shift and don't have any problem at all."
  },
  {
    "user": "Leidy abigail Barmettler Ramón",
    "rating": 5.0,
    "message": "Los tenis me gustan muchos súper lindos y cómodos"
  },
  {
    "user": "Brenda Moore",
    "rating": 5.0,
    "message": "Is very comfortable for walking! Will order again fits true to size"
  },
  {
    "user": "Genii",
    "rating": 5.0,
    "message": "After stretching the toe box they were perfect."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I work at an airline so I’m constantly on my feet for hours at a time. There is no arch support , but I am flat-footed so it worked. Very comfy."
  },
  {
    "user": "Dawna",
    "rating": 2.0,
    "message": "I purchased two pairs of these Reeboks around April 2022. It is now October and I had to throw away one pair because the sole of one shoe completed separated at the toe! Neither one \"felt right\". They felt squishy and did not seem to have a solid shoe form to them. I had bought Reeboks through the years because of the quality. These are not those! I just noticed another customer review that commented in essence that the new Princess isn't as good as the old Princess. I actually thought mine was possibly \"seconds\" or \"rejects\" , I don't know what they are calling them in todays market.,"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Just as remembered! It is a snug fit when new so I feel there is a break in period with leather that you don’t experience with fabric sneakers."
  },
  {
    "user": "Mickie Fone",
    "rating": 5.0,
    "message": "I have problems finding shoes that fit..my feet keep changing size. So I decided to try a size 10 wide instead of a 10 med. Or an 11 narrow..honestly I was frantic..I love Reebok tennis shoes and finally I found my shoes fit perfectly...I'm so happy because I have 4 pairs of tennis shoes that are new shoes and don't fit properly.. Ahhhhhh...😁😁😉😄"
  },
  {
    "user": "Jenxie",
    "rating": 5.0,
    "message": "I’m very pleased with this product. The quality, comfort and fit are excellent!"
  },
  {
    "user": "E.M",
    "rating": 5.0,
    "message": "It fit well and priced great"
  },
  {
    "user": "Cheryl K.",
    "rating": 4.0,
    "message": "These are no different than they were 25 years ago. That’s what I hoped they would be. Four stars instead of 5 because they do run small. Glad I paid attention to the reviews that pointed that out and got 8’s instead of my usual 7 1/2’s."
  },
  {
    "user": "Ms Luna",
    "rating": 4.0,
    "message": "Wanted wide width, ordered wide.... disappointed ... returned. Sizing is always the most important. And when ordering online.... can not forgive when description is inaccurate"
  },
  {
    "user": "Tunisia M Rider",
    "rating": 3.0,
    "message": "The media could not be loaded. Nothing"
  },
  {
    "user": "Beverly Blount",
    "rating": 5.0,
    "message": "All is well"
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "The media could not be loaded. Love it"
  },
  {
    "user": "Florida",
    "rating": 2.0,
    "message": "I had a pair of these back in the day and they were great, they were comfortable and well made and not tight or anything. The pair I just purchased I had to return they were so tight.  Ordinarily I wear a size 8.5 or 9 in shoes but for sneakers I go for a 9.5.  I decided to go for a size 10 as I wanted to wear thick socks with them.  I could barely get the size 10 on, they were snug and my toe was crushed at the top.  I want to get the size 11 but am worried that they will not feel good as the material is clearly not the same!!"
  },
  {
    "user": "LATEES LOFTON",
    "rating": 5.0,
    "message": "Like my shoes they fit and wear great!!"
  },
  {
    "user": "CZ",
    "rating": 5.0,
    "message": "Brought these for my mom as a birthday gift. Its her favorite kind of sneakers."
  },
  {
    "user": "marilyn",
    "rating": 4.0,
    "message": "I purchased this all black sneaker for work requirement and needed more sole between the shoe and the concrete floor I am standing and walking a lot on.  I wear 8.5 or 9 and I ordered a 9.  I removed the insoles and used Spenco sole and also added Spenco gel heel pads (cups).  This combination relieved a lot of pressure on me feet, kneew and back.  Of course, I have plenty of room in the toe box."
  },
  {
    "user": "Ercilia zepeda",
    "rating": 5.0,
    "message": "Me gustan mucho mis tennis Reebok"
  },
  {
    "user": "Veronica Ellerbee",
    "rating": 5.0,
    "message": "Perfect fit"
  },
  {
    "user": "Joan Holycross-Otto",
    "rating": 4.0,
    "message": "my only problem with these are they aren't leather anymore"
  },
  {
    "user": "SGSanctuary",
    "rating": 4.0,
    "message": "Hopefully they will loosen up a little."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I love this shoe. Wore these when so was in grade school. Clean and classic Reebok fit. Purchased all black so I can wear them to work. Comfortable enough to wear all day."
  },
  {
    "user": "Angela Cobbins",
    "rating": 4.0,
    "message": "Working is what I used this item for but they are to small they must run small"
  },
  {
    "user": "Javid roper",
    "rating": 5.0,
    "message": "It's great use it for school"
  },
  {
    "user": "Lys",
    "rating": 3.0,
    "message": "So sleek and comfortable but they don’t last. I love how soft they are and they don’t make my feet look huge. The craziest thing is this is my second pair that the shoe separates from sole. I was so disappointed it happened again.  Like the glue just separates. I wear them for work a lot I guess it’s not meant for a lot of walking."
  },
  {
    "user": "Erica Reichlin",
    "rating": 5.0,
    "message": "I wanted these for an old school feel. Haven't bought Reebok in forever. A bit snug on sides, but with light socks, all good."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "Super cute shoes I can’t wait to get the high tops next!!"
  },
  {
    "user": "Shari",
    "rating": 4.0,
    "message": "I've been buying this Reebok shoe style for decades and was always happy with it. The new shoe looks the same but doesn't feel the same as those I bought years ago. I have very wide feet and bought  8 1/2 W size. These simply don't have the roomy feel I expected. The laces are barely long enough to string through all the loops and leave enough to tie securely. I think the original shoes were leather, these are definitely synthetic. I doubt they'll hold up as long or as well. The features section asks about the toe box - it's too long and narrow though this is the same size I've always purchased. This brand has chosen a different manufacturer for their shoes and allowed significant changes, I guess for profit."
  },
  {
    "user": "Marian",
    "rating": 5.0,
    "message": "Fits as expected."
  },
  {
    "user": "S.G.",
    "rating": 5.0,
    "message": "I like everything  about my Reebok sneakers.  From ordering to receiving them, everything  worked perfect.  Thank you sellers fir the great team you have that made my purchasing experience a very positive one.  I recommend  your products and service, good prices, good products, good customer  service, Good deliveries. The sneakers feel awesome! Keep up the excellent job.  Blessings! SG"
  },
  {
    "user": "Esther H.",
    "rating": 5.0,
    "message": "La talla queda perfecta y muy comodos"
  },
  {
    "user": "Shopper",
    "rating": 5.0,
    "message": "The shoe was to help with my arch it kind of does. It'll work I put inserts in them."
  },
  {
    "user": "Lisa Baldwin",
    "rating": 5.0,
    "message": "My feet have less than 50% cartilage left - therefor any walking causes my feet to swell and lack of good cushion will cause bruising over the top of my foot. Because that is not going to stop me from well, anything... I am pretty harsh on my shoe reviews. These Reeboks are simply awesome. Being made of good leather, they hold the foot snugly while allowing expansion as you need it. The cushion is supportive with good arch support while not being too soft - think a person with a bad back sleeping on a too soft bed, it's the same with shoes. Anyway, I love them and have been wearing them for 30 years now."
  },
  {
    "user": "EllieMae Leal",
    "rating": 5.0,
    "message": "New , shiny & nice. Doesn’t fit like classics use to but I enjoy them anyway"
  },
  {
    "user": "Fernando David Gualotuña Guazumba",
    "rating": 5.0,
    "message": "Excelente producto, 100% original."
  },
  {
    "user": "tammy helms",
    "rating": 4.0,
    "message": "They were a gift for my Mom and they were just what she was looking for.  Fit great, light weight and comfortable"
  },
  {
    "user": "Mary de la Rosa",
    "rating": 5.0,
    "message": "Muy bueno"
  },
  {
    "user": "Lamb",
    "rating": 3.0,
    "message": "I've worn these shoes years ago, for business casual  attire comfort shoes. The difference between then and now, was that Reebox used real leather, therefore allowing the shoe to stretch. Now, it's more like a \"plastic\" feel material, that does not give, and I was not able to order the 10.5(through the try before you buy feature) because Amazon Prime does not allow debit cards to be used... although ordering directly, my debit card has always been accepted 🤷🏽‍♀️"
  },
  {
    "user": "Victoria Rodriguez",
    "rating": 5.0,
    "message": "They fit great never thought these shoes would be so comfortable great work shoe and they are cute"
  }
]