[
  {
    "user": "Sarah",
    "rating": 5.0,
    "message": "I do not own any walking shoes so I panic bought these last minute before a trip to Europe with lots of cobblestone and an insane amount of hills. One day we did the equivalent of like 46 flights of stairs. I did not wear them until I was literally leaving for the airport so I didn’t give myself any time to break them in. Somehow my feet didn’t hurt the entire trip. These shoes are great. They’re also pretty cute. I am not someone who casually spends $100 on shoes but I love these a lot and I’m going to buy more."
  },
  {
    "user": "Lori E",
    "rating": 5.0,
    "message": "I don't care for the \"big shoe\" look that is so popular these days.  These are comfortable, and have a slimmer, classic look."
  },
  {
    "user": "connie owens",
    "rating": 4.0,
    "message": "Arch was good !"
  },
  {
    "user": "Lauren",
    "rating": 5.0,
    "message": "Loved these sneakers so much that this is my second time buying the exact same pair. Great for a casual look or even can wear with dresses"
  },
  {
    "user": "CH",
    "rating": 4.0,
    "message": "Flirty floral looks just like the photo. The leather is a lightweight but stiff textile which explains the lower price for a Cole Haan shoe. Fit too large, I would need a whole size smaller."
  },
  {
    "user": "Barbra T.",
    "rating": 4.0,
    "message": "I live in Mexico and we have cobblestone streets and sidewalks, I was hoping this great looking shoe would have a good bottom cushion.  There is very little support, and the bottom thickness is ok not great for my location. I loved the shoe so much I am willing to use them on selected outings. For everyday walking other than Mexico they are fine. I do wish they had a better arch support."
  },
  {
    "user": "Jennifer R. Alvarez",
    "rating": 5.0,
    "message": "Fits great. True to size."
  },
  {
    "user": "Chloe",
    "rating": 5.0,
    "message": "I bought these shoes for a trip to Europe. They were perfect. Looked great with every outfit, I wore them almost everyday and never got blisters or felt uncomfortable. They don’t have out of this world support or cushion but they definitely got the job done on days where we did 20,000+ steps."
  },
  {
    "user": "Shari H.",
    "rating": 5.0,
    "message": "Extremely comfortable shoes—wear almost daily. I do also add thin orthotics to all shoes for slight arch support."
  },
  {
    "user": "WSS",
    "rating": 3.0,
    "message": "I liked the look of these so decided to keep them. Once I wore them for a extended period of time, I developed a blister from a rough seam on the heal. Now I can only wear them for short periods of time. This is disappointing as I had bought them to wear for a trip with extensive walking."
  },
  {
    "user": "D M Rochelle",
    "rating": 4.0,
    "message": "First, I have narrow heels and this shoe fits very well in the heel. It is a little too big in the toe, but it does not cause problems.  The shoe laces are stiff and the holes the laces go thru are tight. Not sure why.  But over all, this shoe met my expectations."
  },
  {
    "user": "Bre B",
    "rating": 3.0,
    "message": "This shoe seemed fine when I tried it on but did not seem like a shoe I could wear on my feet all day. They are extremely light weight, which felt almost weird to me. I couldn’t justify the price for the shoe, so I returned."
  },
  {
    "user": "G. C",
    "rating": 5.0,
    "message": "A diferencia de otros calzados que cuando lo usas por primera vez tienen a apretar o lastimar el pie estos son súper confortables. Justo el size y son elegantes"
  },
  {
    "user": "Leah Goodman",
    "rating": 5.0,
    "message": "Walked in these shoes nonstop for a week in France (approximately 8 miles a day) and they were perfect!  They liked great and felt great on those European cobblestone streets.  I didn’t even have time to break them in and yet, had no problems.  Just buy them!!"
  },
  {
    "user": "Luis Pascual",
    "rating": 4.0,
    "message": "It is a nice looking shoe. Not a great quality for the price."
  },
  {
    "user": "F Tarrant",
    "rating": 4.0,
    "message": "Ok, they’re not actual leather, which I knew beforehand from other reviews. I think that’s what keeps them so light weight. They’re seriously comfortable & perfect for all day wear. The look is perfect & fresh- not too chunky, not “unstructured” like a canvas Ked. Fit true to size. I have other sneakers where the side of the sole seems to attract dirt just by walking around on sidewalks. Not these- they’ve stayed pretty clean. Love them!"
  },
  {
    "user": "Victoria Childs",
    "rating": 3.0,
    "message": "When I noticed the shoes were starting to get a little dirty I tried to wash them. I put some dish soap on the dirty areas and rinsed it off with warm water. I didn’t scrub them with a brush or soak them in water, yet whatever they are coated with started peeling. When I first got them they seemed pretty versatile because they go with a lot of outfits, but if they can’t be cleaned to any extent I’m not sure they’re worth the money."
  },
  {
    "user": "Esperanza L.",
    "rating": 5.0,
    "message": "BUEN PRODUCTO Y DE CALIDAD"
  },
  {
    "user": "CA Moni",
    "rating": 5.0,
    "message": "These are light weight and true to size. I wear a 7.5 M and the fit was appropriate in all ways. I haven’t yet tried wearing them for an extended period to truly gauge the comfort level but they do not feel like they will need to be broken in."
  },
  {
    "user": "Michelle",
    "rating": 5.0,
    "message": "These aren’t for marathon walking but absolutely perfect for shopping and running errands in shorts, jeans or a cute sundress."
  },
  {
    "user": "Natasha",
    "rating": 3.0,
    "message": "The price is alluring but I soon understood why. The eyelets are gold colored in the photo used to show the shoes but they're really a silver metal color. That's not a big issue for me but I've only worn these shoes twice and the stitching is coming undone. The first picture I took when I just took the shoes out the box. The second is just after my second wear. The shoes are cute but there isn't much arch support. The leather is also artificial which for this price isn't surprising but if you're looking for a supple leather shoes these aren't a good choice."
  },
  {
    "user": "Valeria Bryant",
    "rating": 5.0,
    "message": "Best shoe ever.  I would recommend it to all my family and friends."
  },
  {
    "user": "Patricia Gonzales",
    "rating": 5.0,
    "message": "very comfortable as you can dress them up or down"
  },
  {
    "user": "Raccoon",
    "rating": 5.0,
    "message": "These sneakers are my favorite. Light, good quality, and beautiful colors. Love them!!"
  },
  {
    "user": "Waleska Ackerman",
    "rating": 5.0,
    "message": "Love these shoes. They are super comfy and super light weight. I bought them for my trip to Paris and were the only shoes I ended up wearing more than I planned. My feet didn’t hurt at the end of long walking days, kept my feet pretty dry when it rained and looked great with every outfit I took. Highly recommend them!"
  },
  {
    "user": "jordan",
    "rating": 5.0,
    "message": "These shoes are amazing. After one or two wears to break them in, they are incredibly comfortable. They are also miraculously stain resistant. I e been wearing them almost every day for 2 weeks and no stains! I wore them walking around NYC for three days, had multiple people step on them and the dirt just wipes off. 100% worth the money."
  },
  {
    "user": "Jo",
    "rating": 5.0,
    "message": "These shoes are cute and light weight"
  },
  {
    "user": "Catherine Melendez",
    "rating": 5.0,
    "message": "I have heal spurs so I have a mild tendency to blister, but anticipate shortly this will be good. On the whole, a nice shoe."
  },
  {
    "user": "CJ",
    "rating": 5.0,
    "message": "These are the most comfortable sneakers I’ve ever worn. Fit true to size. Not too narrow but not too wide. Also perfect if you can wear all white sneakers for work. They look and feel great."
  },
  {
    "user": "muffywan",
    "rating": 5.0,
    "message": "Very stylish.  Not a lot of padding but unbelievably light so very comfortable.  Fit tts , would purchase again"
  },
  {
    "user": "rachel martin",
    "rating": 5.0,
    "message": "I’m so picky and everything bothers me, but I love these shoes. They are light weight but really nice quality. Perfect to wear to work but also with casual outfits. Classic style"
  },
  {
    "user": "Phyllis M.",
    "rating": 2.0,
    "message": "I bought it trusting the brand that serves me for most of my footwear. A grave error that Amazon corrected promptly and credited me for my return. Please read all the comments about the poor construction and finish of this shoe. Soon enough it will injure your heel. No padding, just a sharp edge and the sole does not bend. This shoe does not permit exercise but a display only and not on one's precious feet ! Very seriously,  the cardboard box would have been more comfortable that it's expensive content."
  },
  {
    "user": "Lilblack bird",
    "rating": 5.0,
    "message": "I love these shoes! I would love to purchase another pair."
  },
  {
    "user": "M. Cranford",
    "rating": 5.0,
    "message": "I really like and enjoy wearing these cute, stylish & lightweight leather sneakers.  These shoes are made of soft, good quality leather that mold to your feet as you wear them.  I have had rheumatoid arthritis since I was 38 years old and I am now 75. The disease has caused so much damage to my feet that several surgeries were required to help relieve the pain and correct some of the deformities that it caused. As a result, I’m always looking for comfortable shoes that will give me good support and not cause additional discomfort. These Cole Haan sneakers fit the bill perfectly for me! I usually wear a size 8 to 8 1/2, so I ordered size 8. They fit me perfectly without pinching, rubbing or hurting anywhere. I got them in white, but I’m so pleased with them that I plan on ordering more in other colors. Thank you Cole Haan for making such comfortable sneakers that I can wear and still feel stylish in."
  },
  {
    "user": "mary f",
    "rating": 5.0,
    "message": "Nice for summer.  I bought a black pair as well"
  },
  {
    "user": "Krista Shaw",
    "rating": 5.0,
    "message": "These are super comfortable and really light weight. I usually wear 7.5 but had to go down to 7 on these! Can't wait wear them with jeans, skirts and dresses!!"
  },
  {
    "user": "KB",
    "rating": 5.0,
    "message": "Soft leather, sleek looking tennis shoe. May feel a bit firm at first but break in by slightly bending the base of the shoe. Very happy with these."
  },
  {
    "user": "Liz",
    "rating": 5.0,
    "message": "The media could not be loaded. Calzo 8.5 y lo pedí de ese mismo número y me quedó perfecto, me encantan porque son super livianos, cómodos y tienen mucha elegancia también"
  },
  {
    "user": "Amazon Customer",
    "rating": 2.0,
    "message": "Great style but I was left with a burn-like reaction on the top of my foot, even when wearing a thick running sock under them. I'm assuming the product is cheaply made and it's some type of reaction to a material / chemical. Bummed that I had to throw them away and go with another brand."
  },
  {
    "user": "Baby Monster",
    "rating": 4.0,
    "message": "It runs large. I’m normally a size 7, had to exchange and order size 6.5. It’s a bit too wide and loose still. I sometimes order wide size though. The material is not real leather so it’s lightweight but not very soft. I’m expecting more support and cushion on the foot bed since it’s a cole Haan. The quality is prob worth $30 on Amazon."
  },
  {
    "user": "Diane G",
    "rating": 5.0,
    "message": "Just a follow up to my previous review. Initially, I didn't think the sneakers were authentic, leather Cole Haan brand. I've since checked their website to compare the same sneaker and they are in fact authentic Cole Haan brand. If you look at the bottom of the sneakers, you'll see the Cole Haan name & shoe style Crosscourt imbeded on the bottom of the sole! I'm now confident they're authentic Cole Haan. I was glad to see the sneakers are a true white shade & not off white. They're very lightweight. I haven't worn them outside yet; but I tried them on in the house and they seem to be comfortable. I'm a little skeptical if they're genuine leather, because I own another pair of Cole Haan sneakers that are definitely leather. Overall, the sneakers are nice for casual summer wear!"
  },
  {
    "user": "RobAngel",
    "rating": 5.0,
    "message": "Lovely shoes. Cole Haan rarely disappoints and as expected, these are well made and super comfy. For my wife's petite tender fashionista feet, these required zero break in before bringing on vacation calling for a lot of walking, although these aren't explicitly purposeful to be 'walking shoes.'. That's extremely unusual, but the leather's as soft as glove leather--yet it looks to be durable too. Arch support's moderate. No signage--no 'designer' label on upper---it's on the sole. The look---well you can see--it's a clean, classic look that goes great with skirts, as is the fashion now, but looks great with jeans too. Just a great high quality pair of shoes that while they don't have some snob appealing designer label broadcasting 'look at me!'-- to the discerning shoe lover, they exude a subtle quality and class that's 'now'--but is also timeless. The way they feel/wear really make the much more widely seen brands w/ lesser quality keather, blaring their colorful labels on their sides seem cheap. Everybody should try a pair of Cole Haan's at least once."
  },
  {
    "user": "Tanya S",
    "rating": 2.0,
    "message": "I compared these to the exact same pair I had from Cole Haan and there's no way these are authentic. The logo inside the shoe doesn't look the same and the quality is just not the same. The stitching at the front is not right."
  },
  {
    "user": "Lisa B",
    "rating": 5.0,
    "message": "They fit amazing and very comfortable."
  },
  {
    "user": "Leslie S.",
    "rating": 5.0,
    "message": "I bought these sneakers in white leather and black leather.  Very comfortable.  I do wish there was more arch support.  But love them anyway"
  },
  {
    "user": "Amy B.",
    "rating": 4.0,
    "message": "My feet always feel trapped in sneakers but these were comfortable right out of the box. They are lightweight but provide good arch support. I am on my feet all day most days and these seem to be up for the challenge. This is my first pair of Cole Haan shoes and I’m pretty happy given the price. They look a tad older lady-ish but the comfort is worth it. I would caution that if you have a slightly narrow foot these might be too wide for you."
  },
  {
    "user": "Grasse",
    "rating": 5.0,
    "message": "Me encantaron, tengo el pie ancho y con empeine alto y lo dude pero asombrosamente me han quedado perfectos, la primera postura fue grave pero ya están adaptados a mi pie; me encantan los cordones"
  },
  {
    "user": "The Stark Family",
    "rating": 5.0,
    "message": "Ever since COVID19, office dress codes became more casual as old conventions have been proven not as important to the operation effectiveness of your organization. As such, we are all looking for clothes that both look put together and are comfortable - just because we are all dressing more casual doesn't mean it is kosher to wear shorts and hoodies to work people! These sneakers are fantastic! High quality leather, nice minimalist design and very comfortable soles! Looks great with dress slacks, a nice blazer or your Friday-Casual jeans! I have had many different sneakers of different brands, these are now my favourite! My husband wears Cole Haans for his office work because he has military service-connected injuries, now I see why!"
  },
  {
    "user": "Mark & Kim",
    "rating": 4.0,
    "message": "When I took them out of the box and put them side by side I noticed the left shoe looked a little bigger than the right so I checked the sizes on each shoe and they matched ..I put them on and I could tell the left is slightly bigger than the right ..I have decided to keep them I don't want to send them back cause right now I'm just starting a move to another town and I don't want to deal with the shoes so I'm keeping them ...Other than that they are light and comfortable ...."
  },
  {
    "user": "Kindle Customer",
    "rating": 5.0,
    "message": "I love them so much that I wear them every day. Even in the winter in MN. I just add zactrax to them."
  },
  {
    "user": "Brittany Johnson",
    "rating": 2.0,
    "message": "It seems as if these are a dupe. They look and feel like card board and the leather scratches super easy revealing some grey material?? Please do not waste your money on these I’m upset I didn’t return them."
  },
  {
    "user": "Tracy McBroom",
    "rating": 3.0,
    "message": "These are super cute shoes - they go with everything from casual dresses to shorts to joggers, but they KILLED my feet. I wore them to a concert with a small amount of walking from the parking lot to the seat and my heels were bleeding by the end of the night.  Total disappointment since I had such high hopes for them."
  },
  {
    "user": "Samantha R Birkenkamp",
    "rating": 2.0,
    "message": "These are not the same quality as other Cole Haan shoes I’ve purchased. I read other reviews that said the shoes are a nice soft leather. These are entirely man made materials and it’s very obvious when you put them on. They definitely lack support and cushioning. I was so excited to finally get these on sale, and I was so disappointed when they arrived. Not sure they are the real deal? Came in a plain brown box with no markings, etc. Sadly they’re going back!"
  },
  {
    "user": "John",
    "rating": 5.0,
    "message": "Good"
  },
  {
    "user": "Karolina",
    "rating": 4.0,
    "message": "Compré estas zapatillas no muy segura, porque había leído que era \"fake\" pero no, son reales. Si fueran fake me pondrían los pies de mal olor y nada de eso ha pasado. Son cómodas para caminar, sólo al principio me molestó un poco el contrafuerte atrás, pero con el uso a la semana ya estaban blandas. Quedé muy conforme con la compra."
  },
  {
    "user": "AD",
    "rating": 4.0,
    "message": "I wanted to like these but I had to return them because the back of the shoe was too tall and would rub on the back of my ankle unless I wore high socks."
  },
  {
    "user": "Tobster",
    "rating": 5.0,
    "message": "I wear this all the time at work, it can be dressed down or up. I literally wear it everyday. I will say, if you are a total clean freak about it being white all the time, overtime it will get dirty especially the shoe laces. This is my second pair, I've been a Cole haan fan for a long time and their leather sneakers are the best comfortable shoe you can buy. Even my husband has the same pair but for the mens one of course. Im gonna keep buying them!"
  },
  {
    "user": "Jessica C. Grace",
    "rating": 3.0,
    "message": "I love these basic white sneakers but was so disappointed when the laces broke apart within a month of having them."
  },
  {
    "user": "Zuk",
    "rating": 5.0,
    "message": "Nice shoes! I like them very much!"
  },
  {
    "user": "Fellow Reader",
    "rating": 4.0,
    "message": "Just what I was looking for! They’re a little rough to break in, so wear long socks the first few times you wear them, or prepare for painful blisters. Very soft interior, beautiful leather exterior, and perfect width. A lot of other “casual white sneakers” I came across were way too narrow, and these are perfect. I like to pair them with skinny slacks, but they honestly go with anything. I would rate them 5 stars, but opting in for 4 stars because they crease incredibly easily. Overall, well worth the money so far."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "This is the second pair of this shoe I've gotten. Love this simple sneaker, it goes with everything!"
  },
  {
    "user": "Jeffrey Cheng",
    "rating": 5.0,
    "message": "lightweight and comfy. recommended"
  },
  {
    "user": "Morgan & Milo",
    "rating": 5.0,
    "message": "It’s super cute and perfect for casual Friday at the office. I purchased a 9.5 and it’s a perfect fit with ample room for socks. I am happy with my purchase."
  },
  {
    "user": "Elisabeth Luff",
    "rating": 1.0,
    "message": "Bought in July, it’s October (3m) and the leather is ‘bubbling’. That is not dirt or watermarks but circles where the leather is separating and peeling off. What was my best shoes are no longer. Considering the price, I would have thought they would last longer."
  },
  {
    "user": "Madelyn Marrs",
    "rating": 2.0,
    "message": "Within two months of having these the shoelaces completely broke. Disappointed by the quality."
  },
  {
    "user": "Maria B. Cruz",
    "rating": 2.0,
    "message": "I thought it was an original product. These are fake, they do look nice but feel very cheap and not the quality that I was expecting from Cole Haan. This vendor should be reported."
  },
  {
    "user": "Amazon Customer",
    "rating": 3.0,
    "message": "I really like the comfort of this shoe but am disappointed that there's already a tear on the top of the shoe.  I work retail and started wearing this in December.  I would wear my boots to work and put the shoes on only when I was inside my workplace (so they weren't being worn outside) and today i noticed a tear on the shoe and I can no longer wear them at work.  For the price I didn't think this would be a problem already."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Very cute — however the heel is uncomfortable/stiff and rubs. Socks are definitely a must or you will blister."
  },
  {
    "user": "Andrea",
    "rating": 4.0,
    "message": "The shoe fit as expected. There isn’t really arch support but they are comfy and stylish. I wore these with little no show socks and loved them!"
  },
  {
    "user": "Alexandra",
    "rating": 3.0,
    "message": "I would definitely size up a 1/2 size in these. They look great but are so light weight the quality is questionable. If you just need nice looking sneakers with a brand name then these are great but I would not recommend any kind of vigorous activity in them, like not even walking around. I was planning on getting them in black as well but I think I’ll go With a different brand. I get a lot of compliments on the look. I feel conflicted about them."
  },
  {
    "user": "rachel welsh",
    "rating": 2.0,
    "message": "They are super cute to look at and comfortable. They are however, so light weight like they’re made of cardboard. It makes them feel a bit cheap. Disappointed for the brand. The soles aren’t glued down or connected to anything and it came out before I even put them on for the first time."
  },
  {
    "user": "Nutshellortwo",
    "rating": 5.0,
    "message": "I love these shoes! I got the white leather in a size 7 which is my usual size. I loosened the laces since I’m nearing the end of pregnancy and wanted some extra room, and I am able to wear these daily. I also appreciate that short socks seem to stay on my feet when I wear these shoes. They’re comfortable and great for casual outfits."
  },
  {
    "user": "miguel camacho",
    "rating": 5.0,
    "message": "I am an outside sales representative and I live in Florida.  I most me walking and on my feet a lot,  I feel this shows are very comfortable and they are very light, support the feet but you feel as if you are not wearing a cover shoes.  I was walking on the rain for a bid and my feet did not get wet.  I purchased on for my husband as well!  You might need t o purchase a size or 1/2 size smaller in my case at least for me but for my husband I had to buy him his true size!"
  },
  {
    "user": "Anick Deschamps",
    "rating": 2.0,
    "message": "Good to spend the time if you are not on your feet.  Worst shoe for long day walk.  Gave me blisters."
  },
  {
    "user": "kris nelson",
    "rating": 4.0,
    "message": "Love the look of this shoe , I feel it runs a bit big. The leather is so soft and they look great with leggings or jeans ."
  },
  {
    "user": "C. Behrends",
    "rating": 5.0,
    "message": "These shoes are fantastic and go with just about all of my outfits. It looks great with summer dresses too, so it's perfect for travel. The shoes are also lightweight. I love these shoes so much that I bought a second pair for backup."
  },
  {
    "user": "Amazon Customer",
    "rating": 5.0,
    "message": "I wanted a pair of more stylish sneakers for being out and about. These are surprisingly soft and comfortable--they are very lightweight. They do not offer a lot of support, but my feet felt fine after standing for hours."
  },
  {
    "user": "DinDenver",
    "rating": 3.0,
    "message": "Pros: Cute, simple white sneaker, super light weight Cons: Not the expected quality of a Cole Haan product, not the usual comfort/support of Cole Haan, seems wide, I'll keep them, but I'm not in love or blown away for around $60."
  },
  {
    "user": "Lily",
    "rating": 5.0,
    "message": "I bought these in an 8.5, I normally wear an 8 but have been having some bad luck buying off Amazon. These are true to size since they are a little larger than I would normally wear, but I decided to keep it anyway because it hasn't hindered me in any way. If I buy another pair, I'll stick with an 8. The shoe itself is very soft, comfortable. I have wide feet and these have enough room for me all around so that it's actually comfortable for me to wear for a long period of time."
  },
  {
    "user": "Matthew Leon",
    "rating": 5.0,
    "message": "These shoes are soooo comfortable and stylish! Aside from one of the shoes rubbing against my heel which is slightly annoying, I really love them. I feel like they should have more cushion for what you’re paying but they are so light and worth it."
  },
  {
    "user": "Sara Louise Girard",
    "rating": 5.0,
    "message": "not so much."
  },
  {
    "user": "Verna Sabal",
    "rating": 5.0,
    "message": "I like these shoes, they are extremely comfortable. I used them for work, and l have no issues with my feet."
  },
  {
    "user": "Lori",
    "rating": 5.0,
    "message": "Love these classic trainers. They go with everything and they are super easy to clean. Yes of course the toe box will bend after a while — what do you expect though? All other shoes will do the same unless they’re made with bad stuff plastic (which you don’t want btw)!"
  },
  {
    "user": "Natasha",
    "rating": 5.0,
    "message": "The perfect white sneaker! It should be noted though, they don’t “breathe” at all, so keep that in mind if you tend to get very warm. Otherwise, I love them and wear them as often as possible!"
  },
  {
    "user": "crystal",
    "rating": 5.0,
    "message": "Love the way it fits and its true to size. I got these to wear to work since i'm always on my feet. Cole haan is one of my favorite designers because every shoe/sneaker I own is very cotorable."
  },
  {
    "user": "Tamitou",
    "rating": 3.0,
    "message": "I’m a Cole Haan fan but this particular item is larger than my usual size. Very lightweight."
  },
  {
    "user": "DSloan",
    "rating": 5.0,
    "message": "Purchased for my wife to replace some similar non-Cole Haan branded shoes and she absolutely loves the lightweight comfort feel of the Cole Haans. She did have the same issue some others listed in their reviews and that was when the shoes were brand new and she wore with no socks, or very low socks, the upper part of her heal was rubbing and it caused a blister. She wore them for a few days with a sock that covered the area and broke the shoes in and now does not have any discomfort when wearing sockless."
  },
  {
    "user": "ek",
    "rating": 3.0,
    "message": "I usually love Cole Haan shoes because of the comfortable insoles and cushion they provide, but this shoe doesn't seem reflective of the brand. I don't know if it's a knockoff or cheaper version, but it's very thin and bigger than my normal size. There's no cushion. It's nice and white, but that's about it."
  },
  {
    "user": "Lisa P. White",
    "rating": 5.0,
    "message": "Love them!"
  },
  {
    "user": "Julia T.",
    "rating": 5.0,
    "message": "Calzado muy Cómodo"
  },
  {
    "user": "Ana G.",
    "rating": 2.0,
    "message": "These shoes were my favorite, very comfortable, cute, perfect. Leather….. I bought them in April and I’ve been taking care of them, today I noticed this and made me think, are these really leather? For the price, I am super sad. Yesterday I would have written an awesome review, today, so sad. Would I recommend them? If someone wants to pay a lot of money for shoes that will start showing aging at one month, sure, but for me, I would have loved a shoe that last me years for what I paid. By the way, at first I bought my original size, then I had to go 1/2 down, so they do run larger."
  },
  {
    "user": "Quinn Clayton",
    "rating": 4.0,
    "message": "Knocking off a star because you have to break these shoes in! Definitely had to wear bandaids on my heels along with no show socks for the first 3 or 4 times wearing them. I loved the look of them so much I was determined to make them work I just wish they weren’t so painful to break in."
  },
  {
    "user": "Amazon Customer",
    "rating": 4.0,
    "message": "Love the look and comfort of these leather sneaks! I have very sensitive ankles, so I did have some difficulty breaking them in, but they have a softer back than most similar pairs I’ve had or tried on."
  },
  {
    "user": "ILovePugs",
    "rating": 2.0,
    "message": "It is a good looking shoe but too expensive for the quality.  Leather was very thin, no arch support & too wide.  Consequently, I returned the shoes."
  },
  {
    "user": "Alexa",
    "rating": 4.0,
    "message": "love this shoe, very cute and lightweight. not the best-made sneaker, but it is exactly what i was looking for. I am usually a 7 1/2 but i ordered a 7 and they fit perfectly!"
  },
  {
    "user": "KH",
    "rating": 5.0,
    "message": "I expected uncomfortable stiff leather shoes...but these are really comfortable!  They have good padding and the laces are functional. The heel comes up a tiny bit too high for my step bit it loosened up after a few wears. LOVE THEM!"
  },
  {
    "user": "RP",
    "rating": 4.0,
    "message": "Great looking shoes. I'm usually a size ten and ordered a 9 1/2, and I debated sending them back for a 9. There was quite a bit of heel rubbing the first week or so, but now they're worn in and I love them. They do not make my feet look even larger than they already are, and they wipe off easily unlike white canvas shoes."
  },
  {
    "user": "MARIAVE",
    "rating": 5.0,
    "message": "Bonitos y cómodos,  recomendado"
  },
  {
    "user": "Eddie Ramos",
    "rating": 5.0,
    "message": "These shoes go with everything from shorts to dresses. Love the fit and they’re so comfortable."
  },
  {
    "user": "YY",
    "rating": 5.0,
    "message": "Very light weight and comfortable, fit just right. I wore them in Disney world and universal studios for a week straight, my feet never hurt from walking. It’s worth the money."
  }
]